<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Loggcentral</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Loggfiler</h2>
<p>P&aring; sidan <strong>Loggcentral</strong> &gt; <strong>Loggfiler</strong> kan du titta p&aring;, s&ouml;ka efter och exportera loggfiler. </p>

<h4>F&ouml;r att s&ouml;ka loggfiler:</h4>

<ol>
<li>I rullgardinsmenyn f&ouml;r s&ouml;kning kan du specificera f&ouml;ljande situationsbundna kriteria:
  <ul>
  <li><b>Nyckelord</b>: Ange nyckelord f&ouml;r att s&ouml;ka efter loggmeddelanden som inneh&aring;ller &ouml;verensst&auml;mmande nyckelord.
  	<div class="section">
    <h4>Obs:</h4>
    <p>Du kan anv&auml;nda f&ouml;ljande jokertecken och operatorer f&ouml;r avancerad s&ouml;kning:</p>
    <ul>
      <li>[<span class="note_head">*</span>]: Jokertecknet motsvarar inga eller flera tecken som inte &auml;r mellanslag. [a*n] kan exempelvis representera valfritt ord som b&ouml;rjar med [a] och slutar med [n], s&aring;som [<span class="note_head">a</span>ctio<span class="note_head">n</span>] [<span class="note_head">a</span>ttentio<span class="note_head">n</span>] eller [<span class="note_head">an</span>].</li>
      <li>[<span class="note_head">?</span>]: Jokertecknet motsvarar exakt ett tecken som inte &auml;r mellanslag. [ca?] kan exempelvis representera valfritt ord som b&ouml;rjar med [ca] och slutar med ett enda tecken, s&aring;som [<span class="note_head">ca</span>r], [<span class="note_head">ca</span>t] eller [<span class="note_head">ca</span>p].</li>
      <li>[<span class="note_head">AND</span>]: Operatorn visar resultat som tillsammans inneh&aring;ller s&ouml;kertermerna. Till exempel: [admin AND root] visar resultat i loggfilen som inneh&aring;ller b&aring;de [admin] och [root].</li>
      <li>[<span class="note_head">OR</span>]: Operatorn visar resultat som inneh&aring;ller en av s&ouml;kertermerna. Till exempel: [admin OR root] visar resultat i loggfilen som inneh&aring;ller antingen [admin] eller [root].</li>
      <li>[<span class="note_head">NOT</span>]: Operatorn utesluter ord fr&aring;n din s&ouml;kning. Till exempel: [NOT admin] visar resultat som inte inneh&aring;ller [admin].</li>
      <li>[<span class="note_head">()</span>]: Parenteser innesluter s&ouml;kord f&ouml;r att specificera ordningen i vilken de tolkas om b&aring;de AND och OR anv&auml;nds. Till exempel: [(admin OR root) AND NOT logged] visar resultat som inneh&aring;ller [admin] eller [root], och sedan utesluter [logged].  </li>
  </ul>
    </div>
  </li>
  <li><strong>Datumintervall: </strong>S&ouml;k efter loggfiler efter det specificerade datumintervallet.
  <li><b>Niv&aring;</b>: S&ouml;k efter loggfiler efter den specificerade niv&aring;n.</li>
  <li><b>V&auml;rdnamn</b>: S&ouml;k efter loggfiler efter det specificerade v&auml;rdnamnet.</li>
  <li><b>Program</b>: S&ouml;k efter loggfiler efter det specificerade programnamnet.</li>
  <li><b>Kategori</b>: S&ouml;k efter loggfiler efter den specificerade programkategorin.</li>
  </ul>
<li>Klicka p&aring; <strong>S&ouml;k</strong> f&ouml;r att s&ouml;ka efter loggfiler som &ouml;verensst&auml;mmer med specificerat kriteria.</li>
</ol>

<h4>F&ouml;r att exportera loggfiler:</h4>

<ol>
<li>Klicka p&aring; pilen bredvid knappen <strong>Exportera</strong>.</li>
<li>V&auml;lj <strong>HTML</strong> eller <strong>CSV</strong> f&ouml;r att ladda ned loggfilerna i ditt &ouml;nskade format.</li>
</ol>

<div class="section">
<h4>Obs:</h4>
<ul>
<li>Teckentabell f&ouml;r exporterade loggfiler i CSV &auml;r UTF-8. Du kommer att beh&ouml;va &ouml;ppna filen med ett program som har st&ouml;d f&ouml;r teckentabell UTF-8. </li>
</ul>
</div>

</body></html>
