<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Win/Mac/NFS</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>

<body>

<h2>SMB</h2>
<p>Protok&oacute;ł SMB (Server Message Block) umożliwia klientom z systemami Windows, Mac OS i Linux z obsługą protokoł&oacute;w SMB/CIFS dostęp do danych przechowywanych na serwerze Synology NAS. Aby przeglądać pliki na serwerze Synology NAS za pośrednictwem programu Eksplorator Windows lub montować foldery wsp&oacute;łdzielone jako dyski sieciowe, włącz tę opcję na stronie <strong>Panel sterowania</strong> &gt; <strong>Usługi plik&oacute;w</strong> &gt; <strong>SMB/AFP/NFS</strong>.</p>

<h4>Aby włączyć protok&oacute;ł SMB:</h4>
  <ol>
    <li>Zaznacz opcję <strong>Włącz usługę SMB</strong>.</li>
    <li>Kliknij <strong>Zastosuj</strong>.</li>
  </ol>

<div class="section"><h4>Uwaga:</h4>
  <ul>
    <li>Po włączeniu protokołu SMB można zamontować w pełni indeksowane foldery w komputerze Mac za pośrednictwem SMB i wyszukiwać zawartość plik&oacute;w w zamontowanych folderach przy użyciu aplikacji Finder (nie dotyczy NVR216 oraz VS360HD).</li>
  </ul>
</div>


<h3>Grupa robocza</h3>
<p>ta opcja umożliwia przypisanie systemu jako członka określonej grupy roboczej do cel&oacute;w zarządzania siecią.</p>

<div class="section"><h4>Uwaga:</h4>
  <ul>
    <li>Nazwa grupy roboczej może zawierać od 1 do 15 znak&oacute;w. Nie może zawierać następujących znak&oacute;w: [ ] ; : .< >* + = \ / | ? ,</li>
    <li>Jeżeli używany jest komputer Mac z systemem OS X 10.9, a Synology NAS dołączył do domeny Windows, można się zalogować, dodając <strong>localhost\</strong> przed nazwą użytkownika lokalnego Synology NAS, aby uzyskać dostęp do plik&oacute;w przechowywanych w urządzeniu Synology NAS za pośrednictwem protokołu SMB.</li>
  </ul>
</div>


<h3>Nie zezwalaj na dostęp do poprzednich wersji</h3>
<p>W&nbsp;programie Eksplorator Windows użytkownicy mogą uzyskiwać dostęp do migawek folder&oacute;w lub plik&oacute;w, klikając we właściwościach folderu wsp&oacute;łdzielonego kartę <strong>Poprzednie wersje</strong>, co pozwala na przywracanie lub kopiowanie danych bez udziału administratora. Jeżeli opcja <strong>Nie zezwalaj na dostęp do poprzednich wersji</strong> zostanie zaznaczona, na karcie Poprzednie wersje nie będzie żadnych informacji.</p>

<div class="section"><h4>Uwaga:</h4>
  <ul>
    <li>Ta funkcja jest obsługiwana wyłącznie przez VDSM i modele o następujących architekturach pakiet&oacute;w: Apollo Lake, Avoton, Braswell, Broadwell, Bromolow, Cedarview oraz Grantley. Aby sprawdzić, jaką architekturę pakiet&oacute;w obsługuje dany model, zapoznaj się z <a href="https://www.synology.com/en-us/knowledgebase/DSM/tutorial/General/What_kind_of_CPU_does_my_NAS_have" target="_blank">tym artykułem</a>.</li>
    <li>Użytkownicy mogą uzyskać dostęp do wcześniejszej wersji tylko wtedy, gdy w momencie tworzenia migawki odpowiadającej wcześniejszej wersji ich konta użytkownik&oacute;w były utworzone i miały uprawnienia do odczytu folderu wsp&oacute;łdzielonego, kt&oacute;rego migawka była tworzona.</li>
  </ul>
</div>


<h3>Włączanie rejestrowania transferu w logu</h3>
<p>Zaznacz pole wyboru <strong>Włącz log transferu</strong>, aby włączyć rejestrowanie operacji na plikach wykonywanych za pośrednictwem protokołu CIFS/SMB. Log transferu domyślnie monitoruje tylko usunięcie pliku lub folderu, jednak możesz r&oacute;wnież przejść do <strong>Ustawienia logu</strong>, aby wybrać inne zdarzenia operacji na plikach &ndash; tworzenie, przenoszenie, zmianę nazwy, odczyt, zapis &ndash; kt&oacute;re system ma rejestrować. Należy zwr&oacute;cić uwagę, że im więcej wybranych zdarzeń operacji na plikach, tym większe prawdopodobieństwo wpływu na wydajność systemu.</p>


<h3>Ustawienia zaawansowane</h3>
<p>Kliknij przycisk <strong>Ustawienia zaawansowane</strong>, aby wyświetlić poniższe opcje.</p>
  <ul>
    <li><strong>Serwer WINS</strong>: Microsoft Windows Internet Name Service (WINS) to nazwa usługi odwzorowywania nazw NetBIOS na adresy IP. Użytkownicy systemu Windows znajdą system w sieciach TCP/IP znacznie łatwiej, jeżeli zostanie on skonfigurowany tak, aby rejestrować się na serwerze WINS.</li>
    <li><strong>Maksymalny protok&oacute;ł SMB</strong>: w&nbsp;zależności od konfiguracji sieci określ najnowszy protok&oacute;ł SMB, kt&oacute;ry będzie obsługiwany przez urządzenie Synology NAS.<ul>
        <li><strong>SMB1</strong>: Protok&oacute;ł SMB1 (zwany także CIFS) jest obsługiwany od wersji Windows NT.</li>
        <li><strong>SMB2</strong>: Protok&oacute;ł SMB2 jest obsługiwany od wersji Windows Vista i jest udoskonaloną wersją protokołu SMB. SMB2 umożliwia łączenie wielu działań SMB w jedno żądanie w celu zmniejszenia liczby pakiet&oacute;w sieciowych i poprawienia wydajności.</li>
        <li><strong>SMB2 i Large MTU</strong>: Maksymalna jednostka transmisji (MTU, Maximum Transmission Unit) to największa jednostka danych, kt&oacute;rą można przesłać przy użyciu protokołu telekomunikacyjnego. Aby umożliwić wykorzystanie szybszych interfejs&oacute;w sieciowych, takich jak Ethernet 1 Gb lub 10 Gb, w funkcji Large MTU zwiększono MTU do 1 megabajta (MB). Włączenie funkcji Large MTU zwiększa szybkość i wydajność transfer&oacute;w dużych plik&oacute;w, zmniejszając jednocześnie liczbę pakiet&oacute;w do przetworzenia.</li>
        <li><strong>SMB3</strong>: protok&oacute;ł SMB3 jest obsługiwany od wersji Windows 8 i&nbsp;Windows Server 2012. Jest to rozszerzona wersja protokołu SMB2. Protok&oacute;ł SMB3 obsługuje transmisję plik&oacute;w szyfrowanych algorytmem AES, co pozwala poprawić bezpieczeństwo przesyłania plik&oacute;w między komputerami.</li>
      </ul>

      <div class="section"><h4>Uwaga:</h4>
        <ul>
          <li>Protok&oacute;ł SMB2 jest obsługiwany w systemach Windows Vista, Windows Server 2008 R2, Windows 7 i nowszych.</li>
          <li>Funkcja Large MTU jest obsługiwana w systemach Windows Server 2008 R2, Windows 7 i nowszych.</li>
          <li>W celu uzyskania efektywnej obsługi dużych MTU na komputerze z systemem Windows należy zmodyfikować ustawienia rejestru komputera. Więcej informacji można znaleźć w materiałach pomocy technicznej firmy Microsoft (takich jak ten <a href="http://technet.microsoft.com/en-us/library/ff625695(v=ws.10).aspx" target="_blank">artykuł</a>).</li>
        </ul>
      </div>

      <li><strong>Minimalny protok&oacute;ł SMB</strong>: w&nbsp;zależności od konfiguracji sieci określ najstarszy protok&oacute;ł SMB, kt&oacute;ry będzie obsługiwany przez urządzenie Synology NAS.</li>
      <li><strong>Tryb szyfrowania transferu</strong>: po włączeniu protokołu SMB3 protok&oacute;ł SMB doda szyfrowanie transferu, aby zwiększyć bezpieczeństwo transmisji plik&oacute;w.<ul>
          <li><strong>Wyłącz</strong>: wyłączenie szyfrowania transferu.</li>
          <li><strong>Auto</strong>: włączenie szyfrowania transferu na klientach obsługujących tę funkcję.</li>
          <li><strong>Wymuś</strong>: Wymuszenie szyfrowania transferu. Po wybraniu tej opcji klienci nieobsługujący szyfrowania transferu nie będą mogli korzystać z&nbsp;protokołu SMB.</li>
        </ul>
      </li>

      <div class="section"><h4>Uwaga:</h4>
        <ul>
          <li>Funkcja szyfrowania transferu jest obsługiwana przez system Windows 8, Windows Server 2012 i nowsze wersje.</li>
          <li>W&nbsp;przypadku włączenia szyfrowania transferu logowanie anonimowe w&nbsp;protokole SMB nie będzie obsługiwane.</li>
          <li>Po włączeniu szyfrowania należy pozostawić opcję <strong>Włącz Opportunistic Locking</strong> zaznaczoną, aby uniknąć przekraczania limit&oacute;w czasu oczekiwania aplikacji.</li>
        </ul>
      </div>

      <li><strong>Włącz Opportunistic Locking</strong>: zaznacz tę opcję, aby włączyć funkcję Opportunistic Locking CIFS, dzięki kt&oacute;rej klient będzie m&oacute;gł sprawniej dodawać do pamięci podręcznej zawartość plik&oacute;w i zapobiegać niewielkiemu wyprzedzeniu odczytu/zapisu. Jeżeli opcja ta nie zostanie zaznaczona, aplikacje bazy danych lepiej sprawdzą się w uzyskiwaniu dostępu do plik&oacute;w bazy danych przechowywanych na Synology NAS za pośrednictwem sieci.<ul>
          <li><strong>Włącz dzierżawę SMB2</strong>: włączenie tej opcji sprawi, że dostępnych będzie więcej ustawień powiązanych z SMB2 umożliwiających dostosowanie zapewnianego przez Opportunistic Locking mechanizmu zapisu danych w pamięci podręcznej klienta.</li>
        </ul>
      </li>
      <li><strong>Włącz Local Master Browser</strong>: kiedy w tej samej podsieci istnieje wiele komputer&oacute;w z systemem Windows, w wyniku negocjacji jeden z nich zostanie wybrany jako Local Master Browser (gł&oacute;wna przeglądarka lokalna). Komputer pełniący funkcję Local Master Browser przechowuje listy pozostałych komputer&oacute;w z&nbsp;podsieci oraz ich udostępnionych zasob&oacute;w i udostępnia im te listy. Ta opcja umożliwia urządzeniu Synology NAS objęcie roli Local Master Browser (gł&oacute;wnej przeglądarki lokalnej).</li>

      <div class="section"><h4>Uwaga:</h4>
        <ul>
          <li>Włączenie tej funkcji spowoduje wyłączenie funkcji hibernacji dysku twardego i aktywowanie konta użytkownika guest (gość) niezabezpieczonego hasłem.</li>
        </ul>
      </div>

      <li><strong>Włącz moduł DirSort VFS</strong>: Sortowanie nazw plik&oacute;w i wyświetlanie ich na liście w kolejności alfabetycznej. Włączenie tej opcji obciąża system.</li>
      <li><strong>Odrzuć pliki</strong>: Ukrywanie plik&oacute;w według określonych kryteri&oacute;w. Kryteria mogą obejmować symbole wieloznaczne (*), a większą liczbę kryteri&oacute;w należy rozdzielić ukośnikami (/). Na przykład: <i>/abc*/*.txt/*.conf/</i>. Włączenie tej opcji obciąża system.</li>
      <li><strong>Zezwalaj na łącza symboliczne w folderach wsp&oacute;łdzielonych</strong>: zaznacz tę opcję w celu zezwolenia na wskazywanie plik&oacute;w lub folder&oacute;w docelowych przez łącza symboliczne w tym samym folderze wsp&oacute;łdzielonym. Łącza symboliczne można tworzyć przy użyciu terminala systemu DSM.<ul>
          <li><strong>Zezwalaj na łącza symboliczne między folderami wsp&oacute;łdzielonymi</strong>: zaznacz tę opcję w celu zezwolenia na wskazywanie plik&oacute;w lub folder&oacute;w przez łącza symboliczne w r&oacute;żnych folderach wsp&oacute;łdzielonych. Łącza symboliczne można tworzyć przy użyciu terminala systemu DSM. Użytkownicy nieposiadający odpowiednich uprawnień będą mogli uzyskiwać dostęp do docelowych folder&oacute;w wsp&oacute;łdzielonych łączy symbolicznych.</li>
        </ul>
      </li>
      <li><strong>Włącz moduł VFS w celu konwersji znak&oacute;w specjalnych Mac</strong>: zaznacz, aby podczas tworzenia pliku znaki zarezerwowane dla SMB (np. &lt; &gt; &quot; * ?) były konwertowane na podstawowy alfabet łaciński. Pliki takie będą rozpoznawalne przez AFP.</li>
      <li><strong>Włącz moduł MSDFS VFS</strong>: Zezwolenie na wskazywanie przez łącza symboliczne plik&oacute;w lub folder&oacute;w znajdujących się na innych serwerach SMB. W przypadku starszych wersji systemu Windows, takich jak Windows XP, przed włączeniem tej opcji należy dołączyć klienta i Synology NAS do domeny Windows. Więcej informacji o tworzeniu łączy MSDFS można uzyskać <a href="http://www.samba.org/samba/docs/man/Samba-HOWTO-Collection/msdfs.html" target=_blank>tutaj</a>. Pamiętaj, że po wyłączeniu tej opcji trzeba wyczyścić pamięć podręczną urządzenia klienckiego (ponowne uruchomienie urządzenia klienckiego jest r&oacute;wnież zalecane). W przeciwnym razie wydajność może ulec pogorszeniu.</li>
      <li><strong>Wyłącz wiele połączeń z tego samego adresu IP</strong>: Kiedy ta opcja jest włączona, urządzenie Synology NAS zezwala na tylko jedno połączenie z każdego adresu IP w przypadku klient&oacute;w używających protokołu SMB. Jeżeli wiele klient&oacute;w z tego samego adresu IP używa protokołu SMB, Synology NAS utrzyma najnowsze połączenie i odrzuci wszystkie starsze. W środowisku NAT klient może używać jednego adresu IP. W takim przypadku włączenie tej opcji może wpływać negatywnie na normalne działanie.</li>
      <li><strong>Gromadź logi debugowania</strong>: Przechowywanie szczeg&oacute;łowych dziennik&oacute;w do cel&oacute;w debugowania. Włączenie tej opcji obciąża system.</li>
      <li><strong>Zastosuj domyślne uprawnienia UNIX</strong>: Włączenie tej opcji powoduje zastosowanie domyślnych uprawnień systemu UNIX podczas przesyłania lub tworzenia plik&oacute;w i folder&oacute;w. Uprawnienia systemu UNIX mają wartość 744 w przypadku plik&oacute;w i 755 w przypadku folder&oacute;w. Po wyłączeniu tej opcji uprawnienia systemu UNIX mają wartość 777 w przypadku plik&oacute;w i folder&oacute;w.</li>

      <div class="section"><h4>Uwaga:</h4>
        <ul>
          <li>W przypadku folder&oacute;w wsp&oacute;łdzielonych z obsługą listy kontroli dostępu systemu Windows (ACL) (wszystkie udostępnienia z wyłączeniem udostępnień &bdquo;photo&rdquo; i udostępnień na zewnętrznych dyskach) należy uruchomić polecenie <strong>chmod</strong> w kliencie Linux lub FTP, aby zmienić rodzaje uprawnień dotyczące folder&oacute;w i plik&oacute;w z listy kontroli dostępu systemu Windows (ACL) na UNIX (nie dotyczy EDS14).</li>
          <li>Włączenie tej opcji może spowodować problemy z niesp&oacute;jnością uprawnień między r&oacute;żnymi protokołami. Aby uniknąć niesp&oacute;jności, nie zaleca się włączania tej opcji.</li>
        </ul>
      </div>

      <li><strong>Nie rezerwuj przestrzeni na dysku podczas tworzenia plik&oacute;w</strong>: Włącz tę opcję, aby zapobiec rezerwowaniu przestrzeni na dysku podczas tworzenia plik&oacute;w na serwerze Synology NAS.</li>
      <li><strong>Włącz pamięć podręczną wyszukiwania z symbolami wieloznacznymi</strong>: włącz tę opcję, aby poprawić wydajność wyszukiwania, jeżeli klienci wysyłają wielokrotne żądania wyszukiwania z użyciem symboli maski.</li>
      <li><strong>Włącz trwałą obsługę protokołu SMB (międzyprotokołowe blokowanie plik&oacute;w zostanie wyłączone)</strong>: Włączenie tej opcji umożliwi użytkownikom przywr&oacute;cenie utraconego połączenia SMB2 z tym serwerem Synology NAS po tymczasowym rozłączeniu. Otwarte pliki pozostaną dostępne podczas przerwania połączenia. Międzyprotokołowe blokowanie plik&oacute;w między protokołami zostanie wyłączone, zatem użytkownicy będą mogli uzyskiwać dostęp do zablokowanego pliku lub modyfikować plik przy użyciu protokoł&oacute;w innych niż SMB2 (np. AFP).</li>
      <li><strong>Wyczyść pamięć podręczną SMB</strong>: kliknięcie tego przycisku pozwala usunąć następujące pliki pamięci podręcznej SMB w ramach rozwiązywania problem&oacute;w:<ul>
          <li>/var/cache/samba/netsamlogon_cache.tdb</li>
          <li>/var/lib/samba/winbindd_cache.tdb</li>
          <li>/var/lib/samba/share_info.tdb</li>
          <li>/var/lib/samba/registry.tdb</li>
          <li>/run/samba/connections.tdb</li>
          <li>/run/samba/gencacche.tdb</li>
          <li>/run/samba/gencache_notran.tdb</li>
        </ul>
      </li>
    </ul>

</body>
</html>