<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Valgmuligheder</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="leaf_user"></a>Konto</h2>

<p>Fanen Konto indeholder valgmuligheder til redigering af grundl&aelig;ggende kontoindstillinger, f.eks. beskrivelse, adgangskode, e-mail og 2-trins verificering. Klik p&aring; det personformerede ikon &oslash;verst til h&oslash;jre p&aring; skrivebordet for at se denne fane, og v&aelig;lg <strong>Personlig</strong>.</p>



<h3>&AElig;ndring af kontoindstillinger</h3>

<p>F&oslash;lgende kontoindstillinger kan redigeres:</p>
<ul>
<li><strong>Beskrivelse:</strong> Indtast en beskrivelse p&aring; kontoen Brugerbeskrivelser kan indeholde op til 64 synlige Unicode-tegn.</li>
<li><strong>Ny adgangskode:</strong> Hvis du vil &aelig;ndre din kontos adgangskode, skal du indtast en ny her og bekr&aelig;fte den i feltet <strong>Bekr&aelig;ft adgangskode</strong> nedenfor. Adgangskoder skelner mellem store og sm&aring; bogstaver og kan indeholder op til 127 synlige tegn herunder bogstaver, tal, symboler og mellemrum.</li>
<li><strong>E-mail:</strong> Indtast en e-mailadresse (kun for ikke-admin-brugere).</li>
<li><strong>Sk&aelig;rmsprog:</strong> Angiv visningssproget for din konto. Det visningssprog, du angav her, vil f&aring; h&oslash;jere prioritet end det angivet i <b>Kontrolpanel</b> &gt; <b>Regionale valgmuligheder</b> &gt; <b>Sprog</b>.</li>
</ul>
<p>Efter &aelig;ndring af kontoindstillinger skal du klikke p&aring; <b>OK</b> for at gemme &aelig;ndringerne.</p>


<h3>2-trins verificering</h3>

<p>2-trins verificering giver forbedret sikkerhed til din DSM-konto. Hvis 2-trins verificering er aktiveret, skal du indtaste din adgangskode ud over en engangs verificeringskode, n&aring;r du logger ind p&aring; DSM. Verificeringskoder hentes fra godkendelsesprogrammet, der er installeret p&aring; mobilenheden. Hvis derfor nogen &oslash;nsker at f&aring; adgang til kontoen, skal han ikke kun bruge dit brugernavn og din adgangskode, men ogs&aring; mobilenheden.</p>

<div class="section">
<h4>Krav:</h4>
<p>2-trins verificering kr&aelig;ver en mobilenhed og et godkendelsesprogram, der underst&oslash;tter den tidsbaserede engangsadgangskode (Time-based One-Time Password (TOTP))-protokol. Godkendelsesprogrammer omfatter Google Authenticator (Android/iPhone/BlackBerry) eller Authenticator (Windows Phone).</p>
</div>

<h4>S&aring;dan aktiverer du 2-trinsverificering:</h4>

<ol>
<li>G&aring; til <strong>Personlig</strong> &gt; fanen <strong>Konto</strong>, og marker feltet <strong>Aktiver 2-trins verificering</strong> for at starte guiden til konfiguration af 2-trins verificering.</li>
<li>P&aring; den f&oslash;rste sk&aelig;rm indtaster du en e-mailadresse. N&oslash;dverificeringskoder kan sendes til denne e-mailadresse i tilf&aelig;lde af, at du mister mobilenheden.</li>
<li>Download og installer et godkendelsesprogram, f.eks. Google Authenticator (Android/iPhone/BlackBerry) eller Authenticator (Windows Phone).</li>
<li>P&aring; f&oslash;lgende sk&aelig;rm &aring;bner du godkendelsesprogrammet og scanner QR-koden. Alternativt kan du klikke p&aring; linket for manuelt at indtaste en hemmelig n&oslash;gle.</li>
<li>S&aring; genererer dit godkendelsesprogram en 6-cifret verificeringskode. Indtast denne kode i guidens tekstfelt for at bekr&aelig;fte, at konfigurationerne er rigtige. Hvis der sker en fejl, skal du s&oslash;rge for, at systemtiden p&aring; mobilenheden er synkroniseret med systemtiden p&aring; DSM. Verificeringskoder opdateres ogs&aring; regelm&aelig;ssigt, s&aring; s&oslash;rg for, at den indtastede kode ikke er udl&oslash;bet.</li>
<li>N&aring;r konfigurationsguiden er f&aelig;rdig, skal du klikke p&aring; <strong>OK</strong> for at gemme indstillingerne.</li>
</ol>



<h4>S&aring;dan logger du ind p&aring; DSM med 2-trins verificering:</h4>

<p>N&aring;r 2-trins verificeringen er aktiveret, bliver du bedt om at indtaste en 6-cifret verificeringskode, n&aring;r du logger ind p&aring; DSM.</p>

<ol>
<li>P&aring; DSMs loginsk&aelig;rm indtaster du brugernavn og adgangskode som s&aelig;dvanligt.</li>
<li>N&aring;r du bedes om at indtaste en verificeringskode, skal du &aring;bne godkendelsesprogrammet p&aring; mobilenheden.</li>
<li>Find og indtast den 6-cifrede verificeringskode til kontoen. Hvis du mister mobilenheden, kan du klikke p&aring; linket <b>Telefon mistet?</b>, hvorefter en n&oslash;dkode bliver sendt til e-mailadressen.</li>
</ol>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li><strong>SMTP-indstillinger:</strong> For at modtage n&oslash;dkoder via e-mail, skal SMTP-serverindstillinger fundet i <b>Kontrolpanel</b> &gt; <b>Underretning</b> konfigureres korrekt.</li>
<li><strong>N&oslash;dkodegr&aelig;nse:</strong> Hver bruger er begr&aelig;nset til 5 n&oslash;dkoder. Hvis du overskrider denne gr&aelig;nse, skal du deaktivere og aktivere 2-trins verificeringen, f&oslash;r du kan modtage flere n&oslash;dkoder.</li>
<li>2-trins verificering kan gennemtvinges p&aring; DSM og aller relaterede Synology-mobilprogrammer (f.eks. DSM mobile og DS file).</li>
<li style="display: none;">2-trinsverificering g&aelig;lder ogs&aring; for alle SSH-relaterede tjenester, f.eks. SSH-terminal, SFTP og rsync med SSH-overf&oslash;rselskryptering. Da Hyper Backup og Synkronisering af delt mappe via rsync med SSH-overf&oslash;rselskryptering ikke underst&oslash;tter 2-trinsverificering, kan disse to tjenester ikke arbejde normalt, n&aring;r 2-trinsverificering er aktiveret.</li>

</ul>
</div>


<h4>S&aring;dan nulstiller brugeres indstillinger for 2-trins-verificering:</h4>

<p>Bruger, der h&oslash;rer til gruppen <strong>administrators</strong>, kan nulstille indstillingerne for 2-trins verificering for andre brugere. 
<ol>
<li>G&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Bruger</strong>.</li>
<li>Dobbeltklik p&aring; den bruger, hvis 2-trins verificering, du vil nulstille.</li>
<li>P&aring; fanen <strong>Brugeroplysninger</strong> klikker du p&aring; knappen <strong>Nulstil 2-trins verificering</strong>.</li>
</ol>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Hvis en bruger, der tilh&oslash;rer gruppen <strong>administrators</strong>, ikke er tilg&aelig;ngelig, kan du trykke p&aring; den fysiske Reset-knap p&aring; din Synology NAS for at nulstille DSM-indstillingerne og deaktivere 2-trins verificering.</li>
</ul>
</div>


<h3>Kontoaktivitet</h3>
<p>Kontoaktivitet viser login-aktivitet p&aring; din DSM-konto, herunder aktuelle forbindelser, huskede enheder og loginoversigt.</p>


<h4>S&aring;dan kontrollerer du din kontoaktivitet:</h4>
<p>Klik p&aring; knappen <strong>Kontoaktivitet</strong>. Der vises en pop op, som viser f&oslash;lgende faner:

<ul>
<li><strong>Tilsluttede brugere:</strong>  Denne fane viser f&oslash;lgende oplysninger:
  <ul>
<li><strong>Dato og tid:</strong> Hvorn&aring;r kontoen blev &aring;bnet.</li>
<li><strong>Klientnavn og IP:</strong> Navn og IP-adresse p&aring; den enhed, som &aring;bnede kontoen. Kun klientnavnet vises, n&aring;r kontoen &aring;bnes med CIFS-protokol.</li>
<li><strong>Tjeneste:</strong> Den protokol, der blev brugt til at &aring;bne kontoen.</li>
<li><strong>Ressource:</strong> Systemressourcer, der blev brugt af kontoen.</li>
</ul></li>

<li><strong>Huskede enheder:</strong> Denne fane viser styringssiden for den huskede enhed:
   <ul>
<li><strong>Aktuel enhed huskes ikke/huskes:</strong> Klik p&aring; <strong>Husk denne enhed</strong>, hvis du v&aelig;lger at huske den aktuelle enhed, hvorefter 2-trinsverificering ikke l&aelig;ngere kr&aelig;ves, n&aring;r du logger ind p&aring; DSM p&aring; denne enhed.</li>

<li><strong>Hold op med at huske andre enheder:</strong> Du kan holde op med at huske andre enheder (f.eks. computere eller mobilenheder), der er husket. Det betyder, at 2-trinsverificering kr&aelig;ves, n&aring;r du logger ind p&aring; DSM p&aring; disse enheder.</li>
</ul></li>


<li><strong>Loginoversigt:</strong> Denne fane viser seneste loginsessioner og f&oslash;lgende oplysninger:
<ul>
<li><strong>Dato og tid:</strong> Hvorn&aring;r kontoen blev &aring;bnet.</li>
<li><strong>Begivenhed:</strong> Viser brugernavn og IP-adresse.</li>
</ul>
</li>
</ul>


<div class="section">
<h4>Bem&aelig;rk:</h4>
<p>Den enhed, som du markerer som husket, bliver kun husket, n&aring;r du logger ind med den samme konto og fra den samme browser. Du bliver stadig bedt om at indtaste en OTP (engangsadgangskode) til 2-trinsverificering i f&oslash;lgende scenarier, hvis du har markeret en enhed som husket tidligere:</p>
<ul>
<li>Du logger ind med den samme konto, men p&aring; en anden browser.</li>
<li>Dine cookies er blevet fjernet fra browseren.</li>
<li>Du markerer en enhed som husket, n&aring;r du logger ind som bruger A, og markerer den samme enhed som husket, n&aring;r du logger ind som bruger B. N&aring;r du logger ind som bruger A igen, skal du stadig indtaste en adgangskode til 2-trinsverificering.</li>
</ul>

</div>


</body>
</html>