<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Alternativer</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="leaf_user"></a>Konto</h2>

<p>Fanen Konto gir deg alternativer for &aring; redigere grunnleggende kontoinnstillinger, som beskrivelse, passord, e-post og 2-trinnsverifikasjon. For &aring; vise denne fanen, klikker du p&aring; det personformede ikonet &oslash;verst til h&oslash;yre p&aring; skrivebordet og velger <strong>Personlig</strong>.</p>



<h3>Endre kontoinnstillinger</h3>

<p>F&oslash;lgende kontoinnstillinger kan redigeres:</p>
<ul>
<li><strong>Beskrivelse:</strong> Skriv inn en beskrivelse av kontoen din. Brukerbeskrivelser kan inneholde opptil 64 visbare Unicode-tegn.</li>
<li><strong>Nytt passord:</strong> Hvis du vil endre kontopassordet ditt, angir du et nytt her og bekrefter det i feltet <strong>Bekreft passord</strong> nedenfor. Passordet skiller mellom store og sm&aring; bokstaver og kan best&aring; av opptil 127 synlige tegn, inkludert bokstaver, tall, symboler og mellomrom.</li>
<li><strong>E-post:</strong> Angi en e-postadresse (kun for brukere som ikke er admin).</li>
<li><strong>Displayspr&aring;k:</strong> Angi visningsspr&aring;k for kontoen. Visningsspr&aring;kinnstillingene du angir her vil ha h&oslash;yere prioritet enn de du angir i <b>Kontrollpanel</b> &gt; <b>Regionale alternativer</b> &gt; <b>Spr&aring;k</b>.</li>
</ul>
<p>N&aring;r du har endret kontoinnstillingene, klikker du p&aring; <b>OK</b> for &aring; lagre endringene.</p>


<h3>2-trinnsverifikasjon</h3>

<p>2-trinnsverifikasjon gir deg forbedret sikkerhet for din DSM-konto. Hvis 2-trinnsverifikasjon er aktivert, m&aring; du angi passordet ditt i tillegg til en verifikasjonskode til engangsbruk n&aring;r du logger inn p&aring; DSM. Verifikasjonskoder f&aring;r du fra autentiseringsprogrammet som er installert p&aring; din mobile enhet. S&aring; hvis noen vil oppn&aring; tilgang til din konto, vil han ikke bare trenge brukernavnet og passordet ditt, men ogs&aring; din mobile enhet.</p>

<div class="section">
<h4>Krav:</h4>
<p>2-trinnsverifikasjon krever en mobil enhet og et autentiseringsprogram som st&oslash;tter TOTP-protokollen (tidsbasert engangspassord). Autentiseringsprogrammer inkluderer Google Authenticator (Android/iPhone/BlackBerry) eller Authenticator (Windows Phone).</p>
</div>

<h4>Slik aktiverer du 2-trinnsverifikasjon:</h4>

<ol>
<li>G&aring; til fanen <strong>Personlig</strong> &gt; <strong>Konto</strong> og merk av for <strong>Aktiver 2-trinnsverifikasjon</strong> for &aring; starte installasjonsveiviseren for 2-trinnsverifikasjon.</li>
<li>P&aring; den f&oslash;rste skjermen angir du en e-postadresse. N&oslash;dverifikasjonskoder kan sendes til denne e-postadressen i tilfelle du mister din mobile enhet.</li>
<li>Last ned og installer et autentiseringsprogramm, som Google Authenticator (Android/iPhone/BlackBerry) eller Authenticator (Windows Phone).</li>
<li>P&aring; den neste skjermen &aring;pner du autentiseringsprogrammet og skanner QR-koden. Alternativt kan du klikke p&aring; koblingen for &aring; angi en hemmelig n&oslash;kkel manuelt.</li>
<li>Deretter genererer autentiseringsprogrammet en verifikasjonskode p&aring; 6 tegn. Skriv inn denne koden i tekstfeltet i veiviseren for &aring; bekrefte at konfigurasjonene er korrekte. Hvis det oppst&aring;r en feil, m&aring; du kontrollere at systemtiden p&aring; din mobile enhet er synkronisert med systemtiden p&aring; DSM. Dessuten blir verifikasjonskodene oppdatert regelmessig, s&aring; forsikre deg om at koden du angir ikke er utl&oslash;pt.</li>
<li>N&aring;r installasjonsveiviseren er fullf&oslash;rt, klikker du p&aring; <strong>OK</strong> for &aring; lagre innstillingene.</li>
</ol>



<h4>Slik logger du inn p&aring; DSM med 2-trinnsverifikasjon:</h4>

<p>N&aring;r 2-trinnsverifikasjon er aktivert, vil du bli bedt om &aring; angi en verifikasjonskode p&aring; 6 tegn n&aring;r du logger inn p&aring; DSM.</p>

<ol>
<li>P&aring; innloggingsskjermen til DSM angir du brukernavn og passord som vanlig.</li>
<li>N&aring;r du blir bedt om &aring; angi en verifikasjonskode, &aring;pner du autentiseringsprogrammet p&aring; din mobile enhet.</li>
<li>Finn og angi verifikasjonskoden p&aring; 6 tegn for din konto. Hvis du har mistet din mobile enhet, kan du klikke p&aring; koblingen <b>Mistet telefon?</b>, s&aring; blir en n&oslash;dkode sendt til e-postadressen din.</li>
</ol>

<div class="section">
<h4>Merk:</h4>
<ul>
<li><strong>SMTP-innstillinger:</strong> For &aring; motta n&oslash;dkoder via e-post, m&aring; SMTP-serverinnstillingene som du finner p&aring; <b>Kontrollpanel</b> &gt; <b>Varsling</b> v&aelig;re satt opp.</li>
<li><strong>N&oslash;dkodegrense:</strong> Hver bruker har en grense p&aring; 5 n&oslash;dkoder. Hvis du overskrider grensen, blir du n&oslash;dt til &aring; deaktivere og aktivere 2-trinnsverifikasjon f&oslash;r du kan motta flere n&oslash;dkoder.</li>
<li>2-trinnsverifikasjon kan tas i bruk i DSM og alle relaterte Synology-mobilprogrammer (f.eks. DSM mobile og DS file).</li>
<li style="display: none;">2-trinnsverifikasjon blir ogs&aring; brukt p&aring; alle SSH-relaterte tjenester, som SSH-terminal, SFTP og rsync med SSH-overf&oslash;ringskryptering. Men siden Hyper Backup og Synkronisering av delt mappe via rsync med SSH-overf&oslash;ringskryptering ikke st&oslash;tter 2-trinnsverifikasjon, vil ikke disse to tjenestene fungere som normalt n&aring;r 2-trinnsverifikasjon er aktivert.</li>

</ul>
</div>


<h4>Slik tilbakestiller du brukeres innstillinger for 2-trinnsverifikasjon:</h4>

<p>Brukere som tilh&oslash;rer <strong>administrators</strong>-gruppen kan tilbakestille innstillingene for 2-trinnsverifikasjon for andre brukere. 
<ol>
<li>G&aring; til <strong>Kontrollpanel</strong> &gt; <strong>Bruker</strong>.</li>
<li>Dobbeltklikk p&aring; brukeren du &oslash;nsker &aring; tilbakestille 2-trinnsverifikasjon for.</li>
<li>P&aring; fanen <strong>Brukerinformasjon</strong> klikker du p&aring; knappen <strong>Tilbakestill 2-trinnsverifikasjon</strong>.</li>
</ol>

<div class="section">
<h4>Merk:</h4>
<ul>
<li>Hvis en bruker som tilh&oslash;rer <strong>administrators</strong>-gruppen ikke er tilgjengelig, kan du trykke p&aring; den fysiske tilbakestillingsknappen p&aring; din Synology NAS for &aring; tilbakestille DSM-innstillinger og deaktivere 2-trinnsverifikasjon.</li>
</ul>
</div>


<h3>Kontoaktivitet</h3>
<p>Kontoaktivitet viser innloggingsaktiviteten p&aring; din DSM-konto, inkludert gjeldende tilkoblinger, huskede enheter og innloggingshistorikk.</p>


<h4>Slik kontrollerer du kontoaktiviteten din:</h4>
<p>Klikk p&aring; <strong>Kontoaktivitet</strong>-knappen. Et vindu &aring;pnes med f&oslash;lgende faner:

<ul>
<li><strong>Tilkoblede brukere:</strong> Denne fanen viser f&oslash;lgende informasjon:
  <ul>
<li><strong>Dato og tid:</strong> N&aring;r kontoen ble aksessert.</li>
<li><strong>Klientnavn og IP:</strong> Navn og IP-adresse for enheten som aksesserte kontoen. Klientnavnet vises kun n&aring;r kontoen blir aksessert med CIFS-protokoll.</li>
<li><strong>Tjeneste:</strong> Protokollen som ble brukt til &aring; aksessere kontoen.</li>
<li><strong>Ressurs:</strong> Systemressursene som ble brukt av kontoen.</li>
</ul></li>

<li><strong>Huskede enheter:</strong> Denne fanen viser siden for administrasjon av huskede enheter:
   <ul>
<li><strong>Gjeldende enhet huskes ikke/huskes:</strong> Klikk p&aring; <strong>Husk denne enheten</strong> hvis du velger &aring; huske den gjeldende enheten og unng&aring; 2-trinnsverifikasjon ved innlogging til DSM p&aring; denne enheten.</li>

<li><strong>Glem andre enheter:</strong> Du kan glemme andre enheter (f.eks. andre datamaskiner eller mobilenheter) som for tiden huskes. Dette betyr at du m&aring; bruke 2-trinnsverifikasjon ved innlogging til DSM p&aring; disse enhetene. </li>
</ul></li>


<li><strong>Innloggingshistorikk:</strong> Denne fanen viser nylige innloggings&oslash;kter og f&oslash;lgende informasjon:
<ul>
<li><strong>Dato og tid:</strong> N&aring;r kontoen ble aksessert.</li>
<li><strong>Hendelse:</strong> Viser brukernavn og IP-adresse.</li>
</ul>
</li>
</ul>


<div class="section">
<h4>Merk:</h4>
<p>Enheten du merker som husket vil kun bli husket n&aring;r du logger inn med samme konto og fra samme nettleser. Du vil fortsatt bli bedt om &aring; angi et engangspassord for 2-trinnsverifikasjon ved f&oslash;lgende omstendigheter, selv om du har merket en enhet som husket tidligere:</p>
<ul>
<li>N&aring;r du logger inn med samme konto, men med en annen nettleser.</li>
<li>N&aring;r informasjonskapsler er fjernet fra nettleseren.</li>
<li>N&aring;r du merker en enhet som husket ved innlogging som Bruker A, for s&aring; &aring; merke den samme enheten som husket ved innlogging som Bruker B. N&aring;r du deretter logger inn som Bruker A, m&aring; du igjen angi et passord for 2-trinnsverifikasjon.</li>
</ul>

</div>


</body>
</html>