<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>DSM-mobil</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>DSM-mobil</h1>

<p>DSM mobile gir DSM <strong>admin</strong> (eller en bruker som tilh&oslash;rer gruppen <strong>administrators</strong>) muligheten til &aring; administrere DSM-innstillinger og sjekke DSM-informasjon med en iOS<sup>&reg;</sup> (iPhone<sup>&reg;</sup>, iPad<sup>&reg;</sup> eller iPod touch<sup>&reg;</sup>) eller Android<sup>&reg;</sup>-enhet. Denne DSM mobile-hjelpen inneholder f&oslash;lgende emner og ressurser som vil hjelpe deg med &aring; komme i gang.</p>

<h2>Logge inn og logge ut</h2>

<div name="contents" id="login">
<p>N&aring;r du har koblet deg til DSM med nettleseren p&aring; din iOS- eller Android-enhet, vil du se innloggingssiden hvor du kan angi din DSM-kontoinformasjon.</p>

<h4>Slik logger du deg p&aring; DSM mobile:</h4>
<p>Skriv inn dine DSM-brukeriakkreditiver og trykk p&aring; <strong>Logg inn</strong>. Hvis du vil lagre din innloggingsinformasjon og logge inn automatisk neste gang, sl&aring;r du p&aring; bryteren <strong>Husk meg</strong> f&oslash;r du logger inn.</p>

<h4>Slik logger du ut av DSM mobile:</h4>
<ol>
  <li>Trykk p&aring; alternativknappen &oslash;verst til h&oslash;yre p&aring; startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet).</li>
  <li>Trykk p&aring; <strong>Innstillinger</strong> og deretter p&aring; <strong>Logg ut</strong>.</li>
</ol>
</div>

<h2>Administrere DSM-brukere</h2>

<div name="contents" id="user">
<p>Trykk p&aring; <strong>Bruker og gruppe</strong> p&aring; startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet) for &aring; se brukerlisten.</p>

<h4>Slik oppretter du en bruker:</h4>
<ol>
  <li>Trykk p&aring; <strong>+</strong> og skriv inn brukernavn, passord og e-postadresse til den nye brukeren.</li>
  <li>Aktiver <strong>Send varsling</strong> for &aring; sende en varslings-e-post til brukerens e-postadresse n&aring;r hans eller hennes DSM-brukerkonto er opprettet.<br><span class="note_head">Merk: </span>F&oslash;r du sender varsling, m&aring; du kontrollere at varslingsinnstillingene er konfigurert p&aring; din Synology NAS. Logg inn p&aring; DSM-utgaven for stasjon&aelig;r med datamaskinens nettleser, og g&aring; til <strong>Hovedmeny</strong> &gt; <strong>Kontrollpanel</strong> &gt; <strong>Varsling</strong> &gt; <strong>E-post</strong> for &aring; endre innstillingene.</li>
  <li>Trykk p&aring; <strong>Ferdig</strong> for &aring; bekrefte, eller trykk p&aring; pil til venstre for &aring; avbryte.</li>
</ol>

<h4>Slik finner du raskt en bruker:</h4>
<p>Skriv inn brukernavnet i s&oslash;kefeltet.</p>

<h4>Slik endrer du en brukers informasjon:</h4>
<ol>
  <li>Trykk p&aring; navnet p&aring; brukeren og gj&oslash;r ett av f&oslash;lgende:
    <ul>
      <li>Endre brukerens navn eller passord i feltene <strong>Navn</strong> eller <strong>Passord</strong>.</li>
    <li>Sl&aring; p&aring; <strong>Deaktiver</strong> for &aring; deaktivere brukeren. Du kan velge &aring; aktivere brukeren senere uten &aring; miste innstillingene hans/hennes.</li>
    <li>Sl&aring; p&aring; <strong>Administrator</strong> for &aring; legge til brukeren i <strong>admin</strong>-gruppen. Alle brukere som tilh&oslash;rer <strong>admin</strong>-gruppen, vil f&aring; administrative rettigheter til &aring; endre DSM-innstillinger med DSM mobile eller datamaskinens nettleser.</li>
    </ul>
  </li>
  <li>Under <strong>Rettigheter</strong> gj&oslash;r du ett av f&oslash;lgende og trykker deretter p&aring; <strong>Tilbake</strong>:
    <ul>
      <li>Trykk p&aring; <strong>Delt mappe</strong> og trykk p&aring; navnet p&aring; en delt mappe for &aring; endre brukerens tilgangsrettighet: <strong>Lese/skrive</strong>: Brukeren kan gj&oslash;re endringer p&aring; filene og undermappene i den delte mappen; <strong>Skrivebeskyttet</strong>: Brukeren f&aring;r tilgang til filene og undermappene i den delte mappen, men kan ikke gj&oslash;re endringer p&aring; dem.<strong>Ingen tilgang</strong>: Brukeren f&aring;r ikke tilgang til filene og undermappene i den delte mappen.<br><span class="note_head">Merk: </span>Hvis det oppst&aring;r rettighetskonflikter, vil rettighetsprioriteten v&aelig;re: <span class="note_content">Ingen tilgang &gt; Lese/skrive &gt; Skrivebeskyttet</span>.</li>
      <li>Trykk p&aring; <strong>Program</strong> for &aring; endre brukerens tilgangsrettighet til DSM-programmer.</li>
    </ul>
  </li>
  <li>Trykk p&aring; <strong>Ferdig</strong> for &aring; bekrefte, eller trykk p&aring; pil til venstre for &aring; avbryte.</li>
</ol>
</div>

<h2>Administrere delte mapper</h2>

<div name="contents" id="shared">
<p>Trykk p&aring; <strong>Delt mappe</strong> p&aring; startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet) for &aring; se listen over delte mapper p&aring; din Synology NAS.</p>

<h4>Slik oppretter du en delt mappe:</h4>
<ol>
  <li>Trykk p&aring; <strong>+</strong>, og skriv deretter inn navnet p&aring; den nye mappen.</li>
  <li>Trykk p&aring; <strong>Ferdig</strong> for &aring; bekrefte, eller trykk p&aring; pil til venstre for &aring; avbryte.</li>
</ol>

<h4>Slik endrer du en delt mappe:</h4>
<p>Trykk p&aring; navnet p&aring; den delte mappen og gj&oslash;r ett av f&oslash;lgende:</p>
<ul>
  <li>Endre navnet p&aring; den delte mappen i feltet <strong>Navn</strong>.</li>
  <li>Trykk p&aring; <strong>Brukertillatelser</strong> og deretter p&aring; en bruker for &aring; endre hans eller hennes tilgangsrettighet til den delte mappen: <strong>Lese/skrive</strong>: Brukeren kan gj&oslash;re endringer p&aring; filene og undermappene i den delte mappen; <strong>Skrivebeskyttet</strong>: Brukeren f&aring;r tilgang til filene og undermappene i den delte mappen, men kan ikke gj&oslash;re endringer p&aring; dem.<strong>Ingen tilgang</strong>: Brukeren f&aring;r ikke tilgang til filene og undermappene i den delte mappen.<br><span class="note_head">Merk: </span>Hvis det oppst&aring;r rettighetskonflikter, vil rettighetsprioriteten v&aelig;re: <span class="note_content">Ingen tilgang &gt; Lese/skrive &gt; Skrivebeskyttet</span>.</li>
  <li>Du kan ogs&aring; trykke p&aring; <strong>Gruppetillatelser</strong> for &aring; konfigurere rettigheter for grupper.<br><span class="note_head">Merk: </span>Gruppetillatelser har h&oslash;yere prioritet enn brukertillatelser.</li>
</ul>
</div>

<h2>Aktivere tjenester</h2>

<div name="contents" id="services">
<p>Trykk p&aring; <strong>Tjeneste</strong> p&aring; startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet) for &aring; aktivere eller deaktivere Synology NAS-tjenester.</p>

<h4>Slik administrerer du Synology NAS' LAN-tjenester:</h4>
<ul>
  <li>Aktiver eller deaktiver ett av f&oslash;lgende:
    <ul>
      <li><strong>Windows-filtjeneste</strong> gir din Synology NAS muligheten til &aring; bli en Windows-filserver (CIFS) i LAN.</li>
      <li><strong>Mac-filtjeneste</strong> gir din Synology NAS muligheten til &aring; bli en Mac-filserver (AFP) i LAN.</li>
      <li><strong>NFS-tjeneste</strong> gir Linux-klienter i LAN muligheten for &aring; f&aring; tilgang til Synology NAS-data.</li>
      <li><strong>Bonjour-skriver</strong> gir Mac-klienter muligheten til &aring; skrive til USB-skriver(e) som er koblet til din Synology NAS.</li>
      <li><strong>Mediaserver</strong> gj&oslash;r det mulig for DLNA/UPnP-enheter i LAN &aring; bla gjennom og spille av multimedieinnhold p&aring; din Synology NAS.</li>
      <li><strong>iTunes</strong> gj&oslash;r det mulig for iTunes-klienter i LAN til &aring; bla gjennom og spille av musikk eller videoer p&aring; din Synology NAS.</li>
    </ul>
  </li>
</ul>

<h4>Slik administrerer du Synology NAS' Internett-tjenester:</h4>
<ul>
  <li>Aktiver eller deaktiver ett av f&oslash;lgende:
    <ul>
      <li><strong>FTP</strong> gir din Synology NAS muligheten til &aring; bli en FTP-server.</li>
      <li><strong>Webtjenester</strong> gir deg muligheten til &aring; v&aelig;re vert for nettsteder (med PHP+MySQL-st&oslash;tte) p&aring; din Synology NAS.</li>
      <li><strong>WebDAV</strong> gir klientprogrammer muligheten til &aring; administrere og redigere Synology NAS-filer via HTTP-protokollen.</li>
      <li><strong>WebDAV (HTTPS)</strong> gir klientprogrammer muligheten til &aring; administrere og redigere Synology NAS-filer via HTTPS-protokollen.</li>
      <li><strong><a name="filestationservice"></a>File Station</strong> er et nettbasert program som gir deg muligheten til &aring; administrere Synology NAS-filer gjennom en egendefinert port uten &aring; logge p&aring; DSM.</li>
      <li><strong>File Station (HTTPS)</strong> gir deg muligheten til &aring; koble deg til File Station via HTTPS-protokollen.</li>
      <li><strong>Surveillance&nbsp;Station</strong> er et nettbasert program som kan administrere IP-kameraer for &aring; beskytte ditt hjem eller kontor.</li>
      <li><strong>Audio Station</strong> er et nettbasert program som gir deg muligheten til &aring; f&aring; tilgang til musikkbiblioteket p&aring; din Synology NAS.</li>
      <li><strong>Photo&nbsp;Station</strong> er et fotoalbum med integrert blogg p&aring; Internett, som er lagret p&aring; din Synology NAS.</li>
      <li><strong><a name="downloadsationservice"></a>Download Station</strong> (BT/HTTP/FTP/NZB/RSS) er et nettbasert program som hjelper deg med &aring; laste ned filer fra Internett til din Synology NAS.</li>
      <li><strong>eMule</strong> aktiverer Download Stations eMule-st&oslash;tte.</li>
    </ul>
  </li>
</ul>

<div class="section">
<h4>Merk:</h4>
<p>Hvis du vil ha mer informasjon om tjenestene ovenfor, kan du se f&oslash;lgende:</p>
	<ul>
		<li><strong>DSM Hjelp</strong> (tilgjengelig hvis du logger deg p&aring; skrivebordsversjonen av DSM med nettleseren p&aring; datamaskinen og g&aring;r til <strong>Hovedmeny</strong> &gt; <strong>DSM Hjelp</strong>)</li>
		<li><strong>Brukerveiledning for Synology DSM</strong> (tilgjengelig p&aring; Synologys <a href="http://www.synology.com/support/download.php" target="_blank">Nedlastingssenter</a>)</li>
	</ul>
</div>

<h2>Overv&aring;ke systemressurser</h2>

<div name="contents" id="resourcemonitor">
<p>Trykk p&aring; <strong>Ressursoverv&aring;ker</strong> p&aring; startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet) for &aring; overv&aring;ke Synology NAS' CPU- og minnebruk.</p>
</div>

<h2>Vise systeminfo</h2>

<div name="contents" id="sysinfo">
<p>Trykk p&aring; <strong>Systeminfo</strong> p&aring; startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet) for &aring; f&aring; en statusoversikt over din Synology NAS.</p>

<h4>Slik viser du Synology NAS' systeminfo:</h4>
<ol>
  <li>Gj&oslash;r ett av f&oslash;lgende:
    <ul>
      <li>Trykk p&aring; <strong>Generelt</strong> for &aring; vise grunnleggende informasjon om din Synology NAS, inkludert serienummer, modellnavn, mengden fysisk minne, DSM-versjon i tillegg til informasjon om tid og termisk status.</li>
      <li>Trykk p&aring; <strong>Nettverk</strong> for &aring; vise Synology NAS' nettverkskonfigurasjon og status for hvert nettverksgrensesnitt.</li>
      <li>Trykk p&aring; <strong>Lagring</strong> for &aring; vise Synology NAS' volumbruk.</li>
    </ul>
  </li>
  <li>Trykk p&aring; <strong>Oppdater</strong>-knappen &oslash;verst til h&oslash;yre for &aring; holde systeminformasjonen oppdatert.</li>
</ol>
</div>

<h2>Fastvare</h2>

<div name="contents" id="firmware">
<p>Trykk p&aring; <strong>Fastvare</strong> for &aring; vise og oppdatere DSM-versjonen din.</p>

<h4>Slik konfigurerer du innstillinger for DSM-oppgradering:</h4>
<ol>
  <li>Trykk p&aring; <strong>DSM-oppgradering</strong>.</li>
  <li>Velg et av f&oslash;lgende alternativer:
    <ul>
      <li>Kun viktige oppdateringer</li>
      <li>Nyeste DSM og alle oppdateringer</li>
    </ul>
  </li>
  <li>Trykk p&aring; <strong>Ferdig</strong>.</li>
</ol>

<h4>Slik laster du ned tilgjengelige oppdateringer:</h4>
<ol>
  <li>Kontroller DSM-versjonen din i <strong>Status</strong>.</li>
  <li>Hvis DSM-versjonen din er utdatert, trykker du p&aring; <strong>Last ned</strong>-knappen som dukker opp under <strong>Status</strong>-seksjonen for &aring; oppgradere DSM.</li>
</ol>
</div>

<h2>Administrer IP-blokkering</h2>

<div name="contents" id="block">
<p>Trykk p&aring; <strong>IP-blokkering</strong> p&aring; startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet) for &aring; forhindre uautorisert innlogging.</p>

<h4>Slik administrerer du IP-blokkering:</h4>
<ol>
  <li>Trykk p&aring; konfigurasjonsknappen &oslash;verst til h&oslash;yre.</li>
  <li>Sl&aring; p&aring; <strong>Aktiver automatisk blokkering</strong> for &aring; aktivere IP-blokkering.</li>
  <li>Angi et antall for <strong>Innloggingsfors&oslash;k</strong> og <strong>Innenfor (minutter)</strong> for &aring; blokkere en IP-adress etter et angitt antall mislykte innloggingsfors&oslash;k innenfor angitt antall minutter.</li>
  <li>Du kan sl&aring; p&aring; <strong>Aktiver utl&oslash;psdato for blokkering</strong> og spesifisere <strong>Opphev blokkering etter (dager)</strong> for &aring; oppheve blokkeringen av en IP-adresse etter det spesifiserte antallet dager. Hvis du angir 0 her, vil blokkerte IP-adresser forbli blokkert p&aring; ubestemt tid til du fjerner den fra blokkeringslisten.</li>
  <li>Trykk p&aring; <strong>Ferdig</strong>.</li>
</ol>

<h4>Slik legger du til IP-adresser i liste over tillatte/blokkerte:</h4>
<ol>
  <li>Hvis du vil legge til den tillatte/blokkerte IP-adressen i listen, trykker du p&aring; legg til-knappen &oslash;verst til h&oslash;yre og deretter p&aring; <strong>Liste over tillatte</strong> eller <strong>Blokkeringsliste</strong>.</li>
  <li>N&aring;r du har angitt IP-adressen, trykker du p&aring; <strong>Ferdig</strong>.</li>
</ol>
</div>

<h2>Administrere Pakkesenter</h2>

<div name="contents" id="package">

<p>Synology har integrert tredjeparters eller Synology-utviklede programmer i pakker som kan installeres og aktiveres p&aring; en enkel m&aring;te p&aring; Synology NAS.</p>

<h4>Slik administrerer du Pakkesenter:</h4>
<p>Trykk p&aring; <strong>Pakkesenter</strong> p&aring; startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet) for &aring; vise pakkeinformasjon, kj&oslash;re eller stoppe pakker eller oppdatere til nyeste versjoner.</p>


<h4>Slik kj&oslash;rer eller stopper du installerte pakker:</h4>
<p>Trykk p&aring; bryteren ved siden av en pakke for &aring; kj&oslash;re eller stanse den.</p>

<h4>Slik viser du pakker: </h4>
<p>Trykk p&aring; en pakke for &aring; vise informasjon.</p>
     
<h4>Slik oppdaterer du pakker:</h4>
<ol>
	<li>Trykk p&aring; <strong>Oppdater</strong>-fanen for &aring; vise tilgjengelige oppdateringsversjoner.</li>
    <li>Trykk p&aring; knappen til h&oslash;yre for pakken for &aring; oppdatere til nyeste versjon.</li>   
</ol>
</div>    

<h2>Vise logger eller gjeldende tilkoblinger</h2>

<div name="contents" id="log">
<p>Trykk p&aring; <strong>Logg</strong> p&aring; startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet) for &aring; overv&aring;ke gjeldende tilkoblinger eller vise loggene til Synology NAS-tjenester.</p>

<h4>Slik overv&aring;ker du gjeldende tilkoblinger:</h4>
<ul>
  <li>Trykk p&aring; <strong>Siste [antall] logger</strong> i <strong>Oversikt</strong> for &aring; vise listen over brukere som nylig har aksessert Synology NAS-tjenester.</li>
</ul>

<h4>For &aring; se loggregistrene for bestemte tjenester:</h4>
<ul>
  <li>Trykk p&aring; et element i delen <strong>Hendelseslogger</strong> eller <strong>Filoverf&oslash;ringslogger</strong> for &aring; se listen over relevante logger.</li>
</ul>

</div>
<h2>Starte mobilprogrammer</h2>
<div name="contents" id="launch">

<p>DSM mobile s&oslash;rger for et praktisk sted der du kan starte mobilprogrammer fra Synology som er installert p&aring; din iOS- eller Android-enhet.</p>

<h4>Slik starter du mobilprogrammer fra Synology med DSM mobile:</h4>
<p>Trykk p&aring; ett av f&oslash;lgende programmer i den nedre delen av startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet):</p>
<ul>
  <li><strong>DS photo</strong> (tilgjengelig n&aring;r <strong>Photo Station</strong>-tjenesten er aktivert)</li>
  <li><strong>DS audio</strong> (tilgjengelig n&aring;r <strong>Audio Station</strong>-tjenesten er aktivert)</li>
  <li><strong>DS cam</strong> (tilgjengelig n&aring;r <strong>Surveillance Station</strong>-tjenesten er aktivert)</li>
  <li><strong>DS file</strong> (tilgjengelig n&aring;r <strong>WebDAV</strong>-tjenesten er aktivert)</li>
</ul>

<div class="section">
<h4>Merk:</h4>
	<ul>
		<li>For mer informasjon om disse programmene, se Hjelp-filene som fulgte med programmene.</li>
     </ul> 
</div>

<h2>F&aring; Synology NAS til &aring; utf&oslash;re handlinger<br><span style="font-size:80%;">(starte p&aring; nytt, sl&aring; av eller pipe)</span></h2>

<div name="contents" id="restart">
<p>DSM mobile gir deg muligheten til &aring; starte p&aring; nytt eller sl&aring; av Synology NAS med din iOS- eller Android-enhet. Hvis det er flere Synology NAS-enheter i n&aelig;rheten, kan du ogs&aring; raskt identifisere din Synology NAS ved &aring; be den spille av pipelyder.</p>

<h4>Slik f&aring;r du Synology NAS til &aring; utf&oslash;re handlinger:</h4>
<ol>
  <li>Trykk p&aring; alternativknappen &oslash;verst til h&oslash;yre p&aring; startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet).</li>
  <li>Gj&oslash;r ett av f&oslash;lgende:
    <ul>
      <li>Trykk p&aring; <strong>Start p&aring; nytt</strong> og deretter p&aring; <strong>Ja</strong> for &aring; starte din Synology NAS p&aring; nytt.</li>
      <li>Trykk p&aring; <strong>Avslutt</strong> og deretter p&aring; <strong>Ja</strong> for &aring; sl&aring; av din Synology NAS.</li>
      <li>Trykk p&aring; <strong>Finn meg</strong> for &aring; be Synology NAS om &aring; gi fra seg et lydsignal. Trykk p&aring; <strong>OK</strong> for &aring; stoppe pipingen.</li>
    </ul>
  </li>
</ol>
</div>

<h2>Bytte til skrivebordsmodus i DSM</h2>

<div name="contents" id="desktopedition">

<p>Trykk p&aring; ikonet for innstillinger og velg <strong>Skivebordsmodus</strong> for &aring; bytte til skrivebordsmodusen i DSM.</p>
</div>



<h2>Bruke Lagringsh&aring;ndtering</h2>
<div name="contents" id="contents12">
<p><strong>Lagringsh&aring;ndtering</strong> gir deg en rask oversikt over forbruket og tilstanden til systemvolum og disker.</p>

<h4>Slik viser du voluminformasjon:</h4>
	<ol>
		<li>Trykk p&aring; <strong>Lagringsh&aring;ndtering</strong> p&aring; startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet).</li>
		<li>Trykk p&aring; <strong>Volum</strong>-fanen.</li> 
		<li>Trykk p&aring; et volum p&aring; listen for vise detaljert informasjon.</li>
	</ol>

<h4>Slik viser du diskinformasjon:</h4>
	<ol>
		<li>Trykk p&aring; <strong>Lagringsh&aring;ndtering</strong> p&aring; startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet).</li>
		<li>Trykk p&aring; <strong>HDD/SDD</strong>-fanen.</li>
		<li>Trykk p&aring; en disk p&aring; listen for vise tilstand og S.M.A.R.T.-informasjon.</li>
	</ol>

<h4>Slik starter eller stanser du en S.M.A.R.T.-test:</h4>
	<ol>
		<li>Trykk p&aring; <strong>Lagringsh&aring;ndtering</strong> p&aring; startsiden (iPhone/iPod touch eller Android-telefon) eller venstre panel (iPad eller Android-tablet).</li>
		<li>Trykk p&aring; <strong>HDD/SDD</strong>-fanen.</li>
		<li>Trykk p&aring; en disk p&aring; listen for vise informasjonssiden.</li>
		<li>Trykk p&aring; <strong>S.M.A.R.T.-test</strong> for &aring; starte en S.M.A.R.T.-test eller <strong>Stopp</strong> for &aring; stoppe den.</li>
     </ol>
     
</div>




<h2>Mer informasjon</h2>

<div name="contents" id="contents11">
<p>Hvis du trenger informasjon om feils&oslash;king eller &oslash;nsker &aring; l&aelig;re mer om Synology, kan du trykke p&aring; f&oslash;lgende kkoblinger for Synologys elektroniske ressurser:</p>
<ul>
  <li><a href="https://www.synology.com/knowledgebase/faq" target="_blank">Vanlige sp&oslash;rsm&aring;l</a>
</li>
  <li><a href="http://forum.synology.com/wiki" target="_blank">Wiki</a></li>
  <li><a href="http://forum.synology.com" target="_blank">Forum</a></li>
  <li><a href="http://www.synology.com/support/download.php" target="_blank">Nedlastingssenter</a></li>
  <li><a href="https://account.synology.com/support/support_form.php" target="_blank">Teknisk st&oslash;tte</a></li>
</ul>
</div>

</body>
</html>
