
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Sledov&aacute;n&iacute; zdrojů</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>V&yacute;kon</h2>
<p>Kliknut&iacute;m na kartu <strong>V&yacute;kon</strong> je možn&eacute; zobrazit data o&nbsp;využit&iacute; zdrojů. Přesunut&iacute;m my&scaron;i nad graf se zobraz&iacute; podrobn&eacute; datum, čas a&nbsp;&uacute;daje.</p>
<p>Na kartě Přehled se nach&aacute;zej&iacute; grafy pro <strong>Procesor CPU</strong>, <strong>Procesor GPU</strong>, <strong>Paměť syst&eacute;mu</strong>, <strong>Paměť GPU</strong>, <strong>S&iacute;ť</strong>, <strong>Disk</strong>, <strong>Svazek</strong> a <strong>iSCSI</strong>.</p>

<h3>CPU</h3>
<p>Celkov&eacute; využit&iacute; procesoru zjist&iacute;te v&nbsp;č&aacute;sti <strong>Uživatel</strong>, <strong>Syst&eacute;m</strong> a&nbsp;<strong>Ček&aacute;n&iacute; I/O</strong>. Při prvn&iacute;m spu&scaron;těn&iacute; Sledov&aacute;n&iacute; zdrojů může b&yacute;t vyt&iacute;žen&iacute; procesoru CPU vysok&eacute;, protože syst&eacute;m mus&iacute; shrom&aacute;ždit data o zdroj&iacute;ch a současně nač&iacute;st str&aacute;nku uživatelsk&eacute;ho rozhran&iacute;.</p>
<ul><li>Kategorie <strong>Uživatel</strong> zobrazuje procentu&aacute;ln&iacute; hodnoty využit&iacute; procesoru CPU při spou&scaron;těn&iacute; uživatelsk&yacute;ch aplikac&iacute;.</li>
<li>Kategorie <strong>Syst&eacute;m</strong> zobrazuje procentu&aacute;ln&iacute; hodnoty využit&iacute; procesoru CPU v&nbsp;j&aacute;dru syst&eacute;mu, požadavky IRQ hardwaru/softwaru.</li>
<li>Kategorie <strong>Ček&aacute;n&iacute; I/O</strong> zobrazuje procentu&aacute;ln&iacute; hodnotu využit&iacute; procesoru CPU při ček&aacute;n&iacute; I/O.</li>
<li><strong>Využit&iacute;</strong> je součet využit&iacute; procesoru CPU v&nbsp;kategori&iacute;ch <strong>Uživatel</strong> a <strong>Syst&eacute;m</strong>.</li>
<li>Průměrn&aacute; hodnota zat&iacute;žen&iacute;, ukazuj&iacute;c&iacute; d&eacute;lku fronty spou&scaron;těn&iacute; (tj. součet aktu&aacute;lně spu&scaron;těn&yacute;ch procesů plus počet procesů čekaj&iacute;c&iacute;ch na spu&scaron;těn&iacute;), se zobrazuje v&nbsp;intervalu 1, 5 a&nbsp;15 minut.</li>
</ul>
<div class="section">
<h4>Vysvětlen&iacute; pojmů</h4>
<ul>
<li><b>Ček&aacute;n&iacute; I/O</b>: Ček&aacute;n&iacute; I/O znamen&aacute;, že je procesor CPU nečinn&yacute; a nevyuž&iacute;v&aacute; ho ž&aacute;dn&yacute; program.</li>
<p>Ček&aacute;n&iacute; I/O představuje norm&aacute;ln&iacute; chov&aacute;n&iacute;. Jelikož je rychlost procesoru CPU mnohem vy&scaron;&scaron;&iacute; než rychlost I/O, je běžn&eacute;, že procesor CPU na dokončen&iacute; přenosů na disc&iacute;ch nebo po s&iacute;ti ček&aacute;. Pokud je ale procentu&aacute;ln&iacute; hodnota ček&aacute;n&iacute; I/O mimoř&aacute;dně velk&aacute;, znamen&aacute; to, že procesor str&aacute;v&iacute; vět&scaron;inu doby ček&aacute;n&iacute;m na I/O a nen&iacute; tedy dobře využ&iacute;van&yacute;. Lep&scaron;&iacute;ho v&yacute;konu syst&eacute;mu dos&aacute;hnete efektivněj&scaron;&iacute; konfigurac&iacute; diskov&yacute;ch skupin (např. SHR nebo RAID 5) nebo konfigurac&iacute; s&iacute;tě (např. funkc&iacute; Bonding).</p> 
</ul>
</div>

<h3>GPU</h3>
<p>Zobraz&iacute; se celkov&eacute; využit&iacute; procesoru GPU. V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce můžete přep&iacute;nat mezi položkami <strong>GPU</strong> a <strong>Paměť GPU</strong></p>
<ul>
<li><strong>Využit&iacute;</strong> je součet využit&iacute; procesoru GPU v&nbsp;kategori&iacute;ch <strong>Uživatel</strong> a <strong>Syst&eacute;m</strong>.</li>
<li>V&nbsp;č&aacute;sti Paměť GPU si můžete prohl&eacute;dnout <strong>Sestaven&iacute; paměti</strong> s&nbsp;rozdělen&iacute;m na <strong>Využit&eacute;</strong> a <strong>Voln&eacute;</strong> m&iacute;sto.</li>
</ul>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Dostupn&eacute; pouze u&nbsp;modelů s&nbsp;podporou procesoru GPU.</li>
</ul>
</div>

<h3>Syst&eacute;mov&aacute; paměť</h3>
<p>Zobrazuje celkov&eacute; využit&iacute; fyzick&eacute; paměti a&nbsp;odkl&aacute;dac&iacute;ho prostoru. Využit&iacute; paměti zůst&aacute;v&aacute; vysok&eacute;, protože syst&eacute;m do mezipaměti ukl&aacute;d&aacute; data, ke kter&yacute;m se často přistupuje. Data jsou tak rychle k&nbsp;dispozici, aniž by byl nutn&yacute; př&iacute;stup k&nbsp;pevn&eacute;mu disku. V&nbsp;př&iacute;padě nedostatku paměti se data z&nbsp;mezipaměti uvoln&iacute;.</p>
<p>Vysok&aacute; m&iacute;ra využ&iacute;v&aacute;n&iacute; odkl&aacute;dac&iacute;ho prostoru znamen&aacute; nedostatek syst&eacute;mov&eacute; paměti a&nbsp;bude m&iacute;t vliv tak&eacute; na v&yacute;kon syst&eacute;mu. Frekvenci vstupu do odkl&aacute;dac&iacute;ho prostoru a v&yacute;stupu z&nbsp;něj zobraz&iacute;te volbou <strong>Přepnout</strong> v&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce nahoře.</p>

<h3>S&iacute;ť</h3>
<p>Graf s&iacute;ťov&eacute;ho provozu zobrazuje odeslan&aacute; a přijat&aacute; data v&nbsp;kB za sekundu. Pokud je aktivn&iacute; připojen&iacute; PPPoE, je v&nbsp;grafu uvedena tak&eacute; přenosov&aacute; rychlost připojen&iacute;.</p>

<h3 class="disable-dockerx64">Disk</h3>
<p class="disable-dockerx64">Kliknut&iacute;m na rozev&iacute;rac&iacute; nab&iacute;dku v&nbsp;horn&iacute; č&aacute;sti grafu je možn&eacute; zobrazit celkov&eacute; využit&iacute; disku, přenosovou rychlost nebo hodnoty IOPS. Kliknut&iacute;m na možnost <strong>Zobrazit v&scaron;e</strong> dole vyberete za&scaron;krtnut&iacute;m pol&iacute;ček v&iacute;ce disků a přid&aacute;te tak do grafu jejich data.</p>


<h3 class="disable-eds14 disable-dockerx64">Svazek</h3>
<p class="disable-eds14 disable-dockerx64">Na t&eacute;to str&aacute;nce se zobrazuje celkov&yacute; stav přenosu u svazků. Kliknut&iacute;m na rozev&iacute;rac&iacute; nab&iacute;dku nad grafem si můžete prohl&eacute;dnout využit&iacute; přenosů, přenosovou rychlost a IOPS. Kliknut&iacute;m na tlač&iacute;tko <strong>Zobrazit v&scaron;e</strong> je možn&eacute; vybrat jednotliv&eacute; svazky a přidat je do grafu.</p>

<h3 class="disable-eds14 disable-dockerx64">iSCSI</h3>
<p class="disable-eds14 dixable-dockerx64">Na t&eacute;to str&aacute;nce se zobrazuje celkov&yacute; stav aktu&aacute;lně spu&scaron;těn&yacute;ch jednotek iSCSI LUN. Kliknut&iacute;m na rozev&iacute;rac&iacute; nab&iacute;dku nad grafem vyberete jednotku LUN a zobraz&iacute;te jej&iacute; stav. Podle v&yacute;choz&iacute;ho nastaven&iacute; se zobrazuj&iacute; tři grafy, a to <strong>Propustnost</strong>, <strong>IOPS</strong> a <strong>Latence</strong>. Podrobněj&scaron;&iacute; informace z&iacute;sk&aacute;te po kliknut&iacute; na tlač&iacute;tko <strong>Vybrat grafy</strong> a v&yacute;běru dal&scaron;&iacute;ch grafů, kter&eacute; chcete zobrazit.</p>

</body>
</html>
