
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Sledov&aacute;n&iacute; zdrojů</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Nastaven&iacute;</h2>
<h3>Nastaven&iacute;</h3>

<p>Kliknut&iacute;m na možnost <strong>Nastaven&iacute;</strong> je možn&eacute; nastavit n&aacute;sleduj&iacute;c&iacute; možnosti:</p>
<ul>
<li>Vyberte v&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce hodnotu <strong>Trv&aacute;n&iacute; re&aacute;ln&eacute;ho času</strong> (v&nbsp;minut&aacute;ch).</li>
<li>Chcete-li zobrazit data z&nbsp;minulosti, za&scaron;krtněte možnost <strong>Povolit historii využit&iacute;</strong>. Při prohl&iacute;žen&iacute; grafů v&yacute;konu můžete přep&iacute;nat v&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce v&nbsp;prav&eacute;m horn&iacute;m rohu mezi možnostmi <strong>Re&aacute;ln&yacute; čas</strong>, <strong>1 den</strong>, <strong>1 t&yacute;den</strong>, <strong>1 měs&iacute;c</strong> a&nbsp;<strong>1 rok</strong>.</li> 
<li>Chcete-li nastavit pravidla alarmu v&yacute;konu, za&scaron;krtněte možnost <strong>Povolit alarm v&yacute;konu</strong>.</li></ul>
</ul>

<p>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <strong>Použ&iacute;t</strong>.</p>

<h3>Pravidla alarmu v&yacute;konu</h3>

<h4>Vytvořen&iacute; pravidla alarmu v&yacute;konu:</h4>
<ol>
<li>Přejděte do č&aacute;sti <strong>Nastaven&iacute;</strong> &gt; <strong>Nastaven&iacute;</strong> a zkontrolujte, jestli je za&scaron;krtnut&aacute; možnost <strong>Povolit alarm v&yacute;konu</strong>.</li>
<li>Přejděte do č&aacute;sti <strong>Nastaven&iacute;</strong> &gt; <strong>Pravidla alarmu v&yacute;konu</strong>.</li>
<li>Klikněte na tlač&iacute;tko <b>Vytvořit</b>.</li>
<li>K&nbsp;dispozici jsou n&aacute;sleduj&iacute;c&iacute; nastaven&iacute; pravidel:</li>
<ul>
<li><strong>Zdroj</strong>: Vyberte zdroj, na kter&yacute; chcete pravidlo použ&iacute;t.</li>
<li><strong>Typ</strong>: Vyberte typ pravidla, kter&eacute; chcete vytvořit.</li>
<li><strong>&Uacute;roveň</strong>: Vyberte &uacute;roveň alarmu.</li>
<li><strong>Vět&scaron;&iacute; než</strong>: Nastavte maxim&aacute;ln&iacute; procento typu pravidla, kdy v&aacute;s syst&eacute;m upozorn&iacute; na jeho překročen&iacute;.</li>
</ul>
<li>Chcete-li toto pravidlo okamžitě povolit, za&scaron;krtněte pol&iacute;čko <strong>Povolit</strong>.</li>
<li>Pravidlo přid&aacute;te kliknut&iacute;m na možnost <strong>OK</strong>.</li>
</ol>


<div class="section">
<h4>Mechanizmus alarmů v&yacute;konu:</h4>
<p>Pomoc&iacute; n&aacute;sleduj&iacute;c&iacute;ho mechanizmu minimalizuj&iacute; alarmy v&yacute;konu fale&scaron;n&eacute; alarmy a předch&aacute;zej&iacute; nadměrn&eacute; spotřebě syst&eacute;mov&yacute;ch zdrojů v&nbsp;kr&aacute;tk&eacute;m časov&eacute;m obdob&iacute;.</p>
<ol>
	<li>Služba alarmů v&yacute;konu bude v&scaron;echna pravidla kontrolovat každ&yacute;ch pět minut. Pokud jsou v&scaron;echny sledovan&eacute; hodnoty niž&scaron;&iacute; než nastaven&eacute; prahov&eacute; hodnoty, neaktivuje se ž&aacute;dn&aacute; akce.</li>
	<li>Pokud sledovan&aacute; hodnota překroč&iacute; prahovou hodnotu, neaktivuje se alarm okamžitě. M&iacute;sto toho syst&eacute;m toto pravidlo zkontroluje pětkr&aacute;t po sobě v&nbsp;30sekundov&yacute;ch intervalech.</li>
	<li>Pokud po změně d&eacute;lky intervalu sledovan&aacute; hodnota překroč&iacute; prahovou hodnotu pětkr&aacute;t po sobě, aktivuje se alarm. Pokud ale sledovan&aacute; hodnota alespoň při jedn&eacute; z&nbsp;t&eacute;to pěti kontrol poklesne pod prahovou hodnotu, vr&aacute;t&iacute; se d&eacute;lka intervalu zpět na pět minut.</li>
</ol>
<p>Proto se u jedn&eacute; ud&aacute;losti alarm aktivuje nejpozději 450 sekund po prvn&iacute;m zji&scaron;těn&iacute; ud&aacute;losti.</p>

<h4>&Uacute;rovně alarmů:</h4>
<p>Alarmy v&yacute;konu aktivuj&iacute; podle &uacute;rovn&iacute; alarmů různ&eacute; akce.</p>
<ul>
	<li><strong>Upozorněn&iacute;</strong>: Vygeneruje zpr&aacute;vu upozorněn&iacute; v&nbsp;syst&eacute;mov&eacute;m protokolu, ale neaktivuje upozorněn&iacute; syst&eacute;mu.</li>
	<li><strong>Nal&eacute;hav&eacute;</strong>: Vygeneruje zpr&aacute;vu upozorněn&iacute; v&nbsp;syst&eacute;mov&eacute;m protokolu a nav&iacute;c aktivuje upozorněn&iacute; syst&eacute;mu.</li>
</ul>
<p>Protokoly alarmů v&yacute;konu můžete zobrazit na kartě <strong>Alarm v&yacute;konu</strong> nebo v&nbsp;<strong>Centru protokolů</strong> syst&eacute;mu DSM.</p>
</div>

</body>
</html>
