<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Instalace nebo zakoupen&iacute; bal&iacute;čků&nbsp;&ndash; N&aacute;pověda Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Package Center lets you download, install, and launch packages on your Synology NAS with a few simple clicks.">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Instalace nebo zakoupen&iacute; bal&iacute;čků</h2>

<p>Centrum bal&iacute;čků nab&iacute;z&iacute; bohat&yacute; v&yacute;běr webov&yacute;ch aplikac&iacute; roz&scaron;iřuj&iacute;c&iacute;ch funkce va&scaron;eho zař&iacute;zen&iacute; Synology NAS. Pomoc&iacute; Centra bal&iacute;čků můžete bal&iacute;čky stahovat, instalovat a spou&scaron;tět několika prost&yacute;mi kliknut&iacute;mi.</p>
<p>V&nbsp;n&aacute;sleduj&iacute;c&iacute;m čl&aacute;nku naleznete informace o&nbsp;instalaci bal&iacute;čků do zař&iacute;zen&iacute; Synology NAS pomoc&iacute; Centra bal&iacute;čků. Informace t&yacute;kaj&iacute;c&iacute; se jednotliv&yacute;ch bal&iacute;čků najdete <a href="http://www.synology.com/en-global/dsm/app_packages" target="_blank">zde</a>.</p>

<h4>Postup instalace nebo zakoupen&iacute; bal&iacute;čků:</h4>

<ol>

<li>Otevřete <strong>Centrum bal&iacute;čků</strong>.</li><img src="about:blank" class="help_image"/><li>Přejděte na str&aacute;nku <strong>V&scaron;echny bal&iacute;čky</strong>, na kter&eacute; naleznete v&scaron;echny dostupn&eacute; bal&iacute;čky.</li><img src="about:blank" class="help_image"/><div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Pokud se v&aacute;m nedař&iacute; naj&iacute;t bal&iacute;ček, kter&yacute; hled&aacute;te, může tento bal&iacute;ček vyžadovat nověj&scaron;&iacute; verzi syst&eacute;mu DSM nebo může b&yacute;t dostupn&yacute; pouze pro modely se specifick&yacute;mi požadavky na hardware. Dal&scaron;&iacute; informace v&aacute;m poskytne v&yacute;voj&aacute;ř tohoto bal&iacute;čku.</li>

</ul>
</div>
<li>Vyhledejte bal&iacute;ček, kter&yacute; chcete nainstalovat a klikněte na možnost <strong>Instalovat</strong>. (V&nbsp;př&iacute;padě placen&yacute;ch bal&iacute;čků se kliknut&iacute;m na možnost <strong>Koupit</strong> nebo <strong>Vyzkou&scaron;et</strong> připojte do &uacute;čtu Synology, kde můžete bal&iacute;ček zakoupit pomoc&iacute; kreditn&iacute; karty nebo si můžete vyzkou&scaron;et zku&scaron;ebn&iacute; verzi.)</li><img src="about:blank" class="help_image"/><li>Po &uacute;spě&scaron;n&eacute; instalaci by se bal&iacute;ček měl zobrazit v&nbsp;<strong>hlavn&iacute; nab&iacute;dce</strong>.</li><img src="about:blank" class="help_image"/></ol>

<div class="section">
<h4>Zakoupen&iacute; bal&iacute;čků:</h4>
<p>Před zakoupen&iacute;m bal&iacute;čku si přečtěte n&aacute;sleduj&iacute;c&iacute; pozn&aacute;mky.</p>

<ul>
	<li>Zaregistrov&aacute;n&iacute;m <a href="https://account.synology.com/register" target="_blank">&uacute;čtu Synology</a> z&iacute;sk&aacute;te př&iacute;stup k&nbsp;dal&scaron;&iacute;m funkc&iacute;m, jako je např&iacute;klad zobrazen&iacute; předchoz&iacute;ch &uacute;čtů a historie n&aacute;kupů. V&aacute;mi sd&iacute;len&eacute; informace slouž&iacute; pouze k&nbsp;poskytov&aacute;n&iacute; lep&scaron;&iacute;ch služeb.</li>
<li>Ceny bal&iacute;čků jsou ve v&yacute;choz&iacute;m nastaven&iacute; uvedeny v&nbsp;americk&yacute;ch dolarech. Po přihl&aacute;&scaron;en&iacute; k&nbsp;&uacute;čtu Synology se ceny zobraz&iacute; v&nbsp;měně uveden&eacute; ve va&scaron;ich nastaven&iacute;ch.</li>
</ul>
</div>

<div class="section">
<h4>Prohl&aacute;&scaron;en&iacute; o&nbsp;převodu měny:</h4>
<p>Za transakce zahrnuj&iacute;c&iacute; převod měny může v&aacute;&scaron; vydavatel kreditn&iacute; či debetn&iacute; karty &uacute;čtovat dal&scaron;&iacute; poplatky, kter&eacute; nejsou souč&aacute;st&iacute; zobrazen&eacute; ceny. Na v&scaron;echny n&aacute;kupy se mohou vztahovat poplatky za v&yacute;měnu ciz&iacute; měny nebo za zahraničn&iacute; platbu &uacute;čtovan&eacute; vydavatelem karty. Ve&scaron;ker&eacute; platn&eacute; poplatky vyhodnocuje vydavatel va&scaron;&iacute; karty a společnost Synology nemůže poskytovat n&aacute;hradu. Dal&scaron;&iacute; informace v&aacute;m poskytne vydavatel va&scaron;&iacute; kreditn&iacute; či debetn&iacute; karty.</p></div>


<h4>Postup ručn&iacute; instalace bal&iacute;čků:</h4>
<ol>
<li>Pokud chcete nainstalovat bal&iacute;ček odesl&aacute;n&iacute;m souboru .spk (dostupn&yacute; v&nbsp;<a href="http://www.synology.com/support/download.php" target="_blank">Centru pro stahov&aacute;n&iacute;</a> společnosti Synology nebo na webov&yacute;ch str&aacute;nk&aacute;ch třet&iacute;ch stran), klikněte na možnost <b>Ručn&iacute; instalace</b> a nainstalujte nov&yacute; bal&iacute;ček pomoc&iacute; průvodce.</li><img src="about:blank" class="help_image"/></ol>


<h4>Vyhled&aacute;n&iacute; bal&iacute;čku:</h4>
<ol>
<li>Do pole hled&aacute;n&iacute; v&nbsp;lev&eacute;m horn&iacute;m rohu zadejte kl&iacute;čov&eacute; slovo a zahajte hled&aacute;n&iacute; stisknut&iacute;m kl&aacute;vesy Enter na kl&aacute;vesnici.</li>
</ol>


<h4>Způsob řazen&iacute; bal&iacute;čků:</h4>
<p>Pořad&iacute; zobrazen&iacute; bal&iacute;čků v&nbsp;Centru bal&iacute;čků můžete změnit. Klikněte na rozev&iacute;rac&iacute; nab&iacute;dku pod bannerem a vyberte jeden z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch způsobů řazen&iacute; bal&iacute;čků:</p>
<ul>
<li><strong>Seřadit podle n&aacute;zvu</strong>: Kliknut&iacute;m seřad&iacute;te bal&iacute;čky v&nbsp;abecedn&iacute;m pořad&iacute;.</li>
<li><strong>Seřadit podle ned&aacute;vn&eacute; obl&iacute;benosti</strong>: Kliknut&iacute;m seřad&iacute;te bal&iacute;čky podle počtu ned&aacute;vn&yacute;ch instalac&iacute; s&nbsp;t&iacute;m, že nejobl&iacute;beněj&scaron;&iacute; bal&iacute;čky se zobraz&iacute; jako prvn&iacute;.</li>
</ul>


<h4>Skryt&iacute; nainstalovan&yacute;ch bal&iacute;čků:</h4>
<p>Vyberte libovolnou kategorii, klikněte na rozev&iacute;rac&iacute; nab&iacute;dku pod bannerem a&nbsp;vyberte možnost <strong>Skr&yacute;t nainstalovan&eacute; bal&iacute;čky</strong>. Skryjete tak bal&iacute;čky, kter&eacute; již byly nainstalov&aacute;ny a ponech&aacute;te zobrazen&eacute; ty, kter&eacute; jsou určen&eacute; pro instalaci, upgrade nebo opravu.</p>

</body>
</html>
