
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Ressourcenmonitor</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1><a name="leaf_update"></a>Ressourcenmonitor</h1>
<p class="disable-dockerx64">Mit dem Ressourcen-Monitor &uuml;berwachen Sie die Auslastung der CPU, des Speichers, der Datentr&auml;ger und des Netzwerkdurchflusses. Sie k&ouml;nnen die &Uuml;berwachung entweder in Echtzeit vornehmen oder die aufgezeichneten Daten anzeigen.</p>
<p class="enable-dockerx64">Mit dem Ressourcen-Monitor &uuml;berwachen Sie die Auslastung der CPU, des Speichers und des Netzwerkdurchflusses. Sie k&ouml;nnen die &Uuml;berwachung entweder in Echtzeit vornehmen oder die aufgezeichneten Daten anzeigen.</p>
<div class="section">
<h4>Anmerkung:</h4>
<ul>
<li>Die aufgezeichneten Daten werden nur angezeigt, wenn <strong>Nutzungsverlauf aktivieren</strong> auf der Registerkarte <strong>Einstellungen</strong> aktiviert ist.</li>
<li class="enable-dockerx64">Bei Docker DSM weisen <strong>CPU und Speicher</strong> auf Nutzungsinformationen &uuml;ber den <strong>Docker-Host</strong> hin.</li>
</ul>
</div>
<h2>Leistung</h2>
<p>Klicken Sie auf die Registerkarte <strong>Leistung</strong>, um die Ressourcennutzungsdaten anzuzeigen. Details zu Datum, Uhrzeit und Informationen zum Diagramm werden angezeigt, wenn Sie den Mauszeiger darauf richten.</p>

<h3>CPU</h3>
<p>Die gesamte CPU-Auslastung kann unter <strong>Benutzer</strong>, <strong>System</strong> und <strong>I/O Warten</strong> angezeigt werden. Die CPU-Auslastung sollte hoch sein, wenn der Ressourcenmonitor das erste Mal gestartet wird, denn das System muss die Ressourcendaten erst sammeln und gleichzeitig die UI-Seite laden.</p>
<p><strong>Benutzer</strong> zeigt den Prozentsatz der CPU an, der f&uuml;r die Ausf&uuml;hrung von Benutzeranwendungen verwendet wird. <strong>System</strong> zeigt den Prozentsatz der CPU an, der f&uuml;r den Systemkern verwendet wird, sowie Hardware-Software IRQs. <strong>I/O Warten</strong> zeigt den Prozentsatz der CPU an, der f&uuml;r I/O Warten genutzt wird.</p>
<p><strong>Auslastung</strong> ist die Summe der CPU-Auslastung durch <strong>Benutzer</strong> und <strong>System</strong>.</p>
<p>Die Durchschnittsleistung innerhalb von 1, 5 und 15 Minuten wird mit der Zahl der ausf&uuml;hrbaren Prozesse (Run-Queue Length) angezeigt (d.&nbsp;h. die Anzahl der Prozesse, die gegenw&auml;rtig ausgef&uuml;hrt werden, plus die Anzahl der wartenden Prozesse). </p>
<div class="section">
<h4>Erkl&auml;rung der Begriffe</h4>
<ul>
<li><b>I/O Warten</b>: I/O Warten zeigt an, dass sich die CPU im Leerlauf befindet und nicht von einem anderen Programm verwendet wird. </li>
<p>I/O Warten ist ein normales Verhalten. Da die Geschwindigkeit der CPU um ein Vielfaches h&ouml;her als die von I/O ist, ist es normal, dass die CPU h&auml;ufig auf die &Uuml;bertragungen von Festplatten oder aus dem Netzwerk warten muss. Wenn der Prozentsatz von &quot;I/O Warten&quot; allerdings extrem hoch ist, bedeutet dies, dass die CPU die meiste Zeit mit &quot;I/O Warten&quot; verbringt und wom&ouml;glich nicht gut ausgelastet sein ist. Sie k&ouml;nnen eine effizientere Festplattenkonfiguration (z.&nbsp;B. SHR oder RAID 5) oder Netzwerkkonfigurationen (z.&nbsp;B. Bonding) nutzen, um eine bessere Systemleistung zu erreichen.</p> 
</ul>
</div>
<h3>Arbeitsspeicher</h3>
<p>Die gesamte Nutzung des physikalischen Speichers und des Auslagerungsspeichers wird angezeigt. Die Speicherauslastung bleibt hoch, weil das System h&auml;ufig aufgerufene Daten im Zwischenspeicher beh&auml;lt, damit die Daten schnell aufgerufen werden k&ouml;nnen, ohne dass auf die Festplatte zugegriffen werden muss. Der Zwischenspeicher wird geleert, wenn der Gesamtspeicher nicht mehr ausreicht.</p>
<p>Eine hohe Auslastung des Auslagerungsspeichers weist auf zu wenig Systemspeicher hin und wirkt sich auf die Leistung des Systems aus. Sie k&ouml;nnen die Werte f&uuml;r Swap in und Swap out durch Auswahl von <strong>Swap</strong> oben aus dem Dropdown-Men&uuml; anzeigen. </p>

<h3>Netzwerk</h3>
<p>Das Netzwerk-Durchflussdiagramm zeigt die Daten, die in KB pro Sekunde gesendet und empfangen werden. Wenn PPPoE aktiviert ist, wird die &Uuml;bertragungsrate auch auf dem Diagramm angezeigt.</p>

<h3 class="disable-dockerx64">Datentr&auml;ger</h3>
<p class="disable-dockerx64">Sie k&ouml;nnen die gesamte Festplattennutzung, die &Uuml;bertragungsrate oder IOPS anzeigen, indem Sie oben im Diagramm auf das Dropdown-Men&uuml; klicken. Sie k&ouml;nnen unten auf <strong>Alle anzeigen</strong> klicken, um weitere Datentr&auml;ger durch Markieren der K&auml;stchen auszuw&auml;hlen und ihre Daten zur Darstellung hinzuzuf&uuml;gen.</p>


<h3 class="disable-eds14 disable-dockerx64">Volume</h3>
<p class="disable-eds14 disable-dockerx64">Diese Seite zeigt den Gesamt&uuml;bertragungsstatus von Volumes an. Klicken Sie auf das Dropdown-Men&uuml; &uuml;ber dem Diagramm, um die &Uuml;bertragungsauslastung, &Uuml;bertragungsrate oder IOPS anzuzeigen. Klicken Sie auf <strong>Alle anzeigen</strong>, um einzelne Volumes auszuw&auml;hlen und zur Grafik hinzuzuf&uuml;gen.</p>

<h3 class="disable-eds14 disable-dockerx64">iSCSI</h3>
<p class="disable-eds14 dixable-dockerx64">Diese Seite zeigt den Gesamtstatus der aktuell ausgef&uuml;hrten iSCSI-LUNs an. Klicken Sie auf das Dropdown-Men&uuml; &uuml;ber dem Diagramm, um eine LUN auszuw&auml;hlen und ihren Status anzuzeigen. Drei Diagramme werden standardm&auml;&szlig;ig angezeigt: <strong>Durchsatz</strong>, <strong>IOPS</strong> und <strong>Latenz</strong>.      F&uuml;r detailliertere Informationen klicken Sie auf <strong>Diagramme ausw&auml;hlen</strong>, um weitere Diagramme anzuzeigen. </p>


<h2>Prozess</h2>
<p>Klicken Sie auf die Registerkarte <strong>Prozesse</strong>, um die CPU- und Speicherauslastung jedes Prozesses in absteigender CPU-Auslastung anzuzeigen.</p>
<p>Der Prozess <strong>Status</strong> enth&auml;lt <strong>Ausgef&uuml;hrt</strong>, <strong>Ruhe</strong> und <strong>Angehalten</strong>. Die Linux-&Auml;quivalente des Prozessstatus sind <strong>L&auml;uft</strong>, <strong>Angehalten/&Uuml;berwacht</strong>, <strong>Schl&auml;ft</strong>. </p>
<p>Hinter <strong>Ruhe</strong> kann ein Buchstabe f&uuml;r weitere Informationen stehen, z. B. 'D' f&uuml;r Ruhezustand der Festplatte, 'Z' f&uuml;r Zombie, 'X' f&uuml;r tot.</p>

<h2>Verbundene Benutzer</h2>
<p> Auf dieser Registerkarte werden Clients angezeigt und verwaltet, die aktuell mit dem System verbunden sind und auf die Ressourcen zugreifen. Dieser Bereich zeigt Clients an, die &uuml;ber HTTP, TELNET, SSH, SMB/CIFS, AFP, FTP und NFS verbunden sind.</p>
<h4>Verwalten Sie die aktuellen Verbindungen mit einer der folgenden Methoden:</h4>
<ul>
<li>Klicken Sie auf <b>Speichern</b>, um die aktuelle Liste in eine HTML-Datei zu exportieren.</li>
<li>Klicken Sie auf <b>Aktualisieren</b>, um die Liste zu aktualisieren.</li>
<li>Klicken Sie auf <b>Verbindung trennen</b>, um den Benutzer am weiteren Zugriff auf die Ressource zu hindern. Der getrennte Benutzer ben&ouml;tigt eine erneute Autorisierung, bevor er wieder auf die Ressource zugreifen kann.</li>
<li>Klicken Sie auf <b>Benutzer deaktivieren</b>, um den Benutzer zu deaktivieren. Gehen Sie, wenn Sie den Benutzer wieder aktivieren m&ouml;chten, zu <b>Hauptmen&uuml;</b> &gt; <b>Systemsteuerung</b> &gt; <b>Benutzer</b>.</li>
</ul>
<div class="section">
<h4>Anmerkung:</h4>
<ul>
<li>Die Option <strong>Verbindung trennen</strong> funktioniert nicht bei NFS-Clients.</li>
<li>Falls NFS-Clients freigegebene Ordner nicht korrekt trennen, werden sie m&ouml;glicherweise immer noch in der Liste der verbundenen Benutzer angezeigt.</li>
<li>Wenn der Synology NAS neu gestartet wird, werden NFS-Clients, die vorher verbunden waren, nicht in der Liste der verbundenen Benutzer angezeigt.</li>
</ul>
</div>


<h2>Geschwindigkeitseinschr&auml;nkung</h2>
<p>Auf der Registerkarte <strong>Geschwindigkeitseinschr&auml;nkung</strong> k&ouml;nnen Sie die Liste der Dateitransfers, f&uuml;r welche die Geschwindigkeitseinschr&auml;nkung auf Synology NAS gilt, anzeigen und verwalten.</p>
<h4>Liste aktualisieren:</h4>
<p>Klicken Sie auf <strong>Aktualisieren</strong>, um die Seite neu zu laden, und Sie erhalten die neuesten Aufzeichnungen.</p>
<h4>Datei&uuml;bertragung stoppen:</h4>
<p>Klicken Sie auf <b>Verbindung trennen</b>, um den Dateitransfer zu stoppen. Sie m&uuml;ssen die Datei&uuml;bertragung erneut starten, um den Prozess erfolgreich abzuschlie&szlig;en.</p>


<h2>Einstellungen</h2>
<p>Klicken Sie auf <strong>Einstellungen</strong>, um die folgenden Optionen einzustellen:</p>
<ul>
<li>W&auml;hlen Sie die <strong>Echtzeitdauer</strong> in Minuten aus dem Dropdown-Men&uuml; aus.</li>
<li>Markieren Sie <strong>Nutzungsverlauf aktivieren</strong>, wenn Sie die aufgezeichneten Daten sehen m&ouml;chten. Bei Verbindung k&ouml;nnen Sie im Dropdown-Men&uuml; rechts bei Ansicht der Leistungs&uuml;bersichten zwischen <strong>Echtzeit</strong>, <strong>1 Tag</strong>, <strong>1 Woche</strong>, <strong>1 Monat</strong> und <strong>1 Jahr</strong> ausw&auml;hlen.</li> 
<li>Markieren Sie <strong> Leistungsereignis aktivieren</strong>, wenn Sie die Systemleistung &uuml;berwachen m&ouml;chten.</li>
</ul>

<p>Klicken Sie auf <strong>&Uuml;bernehmen</strong>, um die Einstellungen zu speichern.</p>

<h2>Leistungsalarm</h2>
<h4>Erstellen eines Leistungsalarms:</h4>
<ol>
<li>Gehen Sie zu <strong>Einstellungen</strong> &gt; <strong>Leisungsalarmregel</strong>.</li>
<li>Klicken Sie auf die Schaltfl&auml;che <b>Erstellen</b>.</li>
<li>Die folgenden Regeleinstellungen sind verf&uuml;gbar:</li>
<ul>
<li><strong>Ressource</strong>: W&auml;hlen Sie die Ressource, auf die Sie die Regel anwenden m&ouml;chten.</li>
<li><strong>Typ</strong>: W&auml;hlen Sie den Regeltyp aus, den Sie erstellen m&ouml;chten.</li>
<li><strong>Stufe</strong>: W&auml;hlen Sie die Alarmstufe.</li>
<li><strong>Gr&ouml;&szlig;er als</strong>: Legen Sie den maximalen Prozentsatz f&uuml;r Ihren Regeltyp fest, bei dem das System Sie bei einer &Uuml;berschreitung benachrichtigt.</li>
</ul>
<li>Markieren Sie <strong>Aktiviert</strong>, wenn Sie diese Regel sofort aktivieren m&ouml;chten.</li>
<li>Klicken Sie auf <strong>OK</strong>, um die Regel hinzuzuf&uuml;gen.</li>
</ol>


<div class="section">
<h4>Mechanismen f&uuml;r Leistungsalarme:</h4>
<p>Leistungsalarme werden durch die folgenden Mechanismen betrieben, um Fehlalarme zu minimieren und einen &uuml;berm&auml;&szlig;igen Verbrauch von Systemressourcen innerhalb eines kurzen Zeitraums zu verhindern.</p>
<ol>
	<li>Der Leistungalarmdienst &uuml;berpr&uuml;ft alle 5 Minuten alle Regeln. Es wird keine Aktion ausgel&ouml;st, wenn alle der &uuml;berwachten Werte unterhalb der festgelegten Schwellwerte liegen.</li>
	<li>Wenn ein &uuml;berwachter Wert seinen Schwellwert &uuml;berschreitet, wird nicht sofort ein Alarm ausgel&ouml;st. Stattdessen &uuml;berpr&uuml;ft das System die Regel f&uuml;nf weitere Male in 30-sek&uuml;ndigen Intervallen.</li>
	<li>Nach dieser &Auml;nderung der Intervalll&auml;nge wird, wenn der &uuml;berwachte Wert den Schwellwert f&uuml;nf aufeinanderfolgende Male &uuml;berschreitet, ein Alarm ausgel&ouml;st; wenn jedoch der &uuml;berwachte Wert bei einer dieser f&uuml;nf &Uuml;berpr&uuml;fungen unterhalb seines Schwellwertes liegt, wird die Intervalll&auml;nge wieder auf 5 Minuten ge&auml;ndert.</li>
</ol>
<p>Daher wird bei einem einzelnen Ereignis ein Alarm sp&auml;testens 450 Sekunden nach dem ersten Erkennen des Ereignisses ausgel&ouml;st.</p>

<h4>Alarmstufen:</h4>
<p>Leistungsalarme l&ouml;sen je nach Alarmstufe unterschiedliche Aktionen aus.</p>
<ul>
	<li><strong>Warnung</strong>: Erzeugt eine Warnmeldung im Systemprotokoll, l&ouml;st jedoch keine Systembenachrichtigung aus.</li>
	<li><strong>Kritisch</strong>: Erzeugt nicht nur eine Meldung im Systemprotokoll, sondern l&ouml;st auch eine Systembenachrichtigung aus.</li>
</ul>
<p>Protokolle der Leistungsalarme k&ouml;nnen unter der Registerkarte <strong>Leistungsalarm</strong> oder im <strong>Protokoll-Center</strong> von DSM aufgerufen werden.</p>
</div>


<h4>Anzeigen des Leistungsalarms:</h4>
<ul>
<li>Klicken Sie auf die Registerkarte <strong>Leistungsalarm</strong>, um alle ausgel&ouml;sten Alarme anzuzeigen.</li> 
<li>Klicken Sie auf <strong>Aktualisieren</strong>, um die aktuellsten Alarme anzuzeigen.</li>
</ul>

<h4>Exportieren des Leistungsalarms:</h4>
<ol>
<li>Klicken Sie auf den Pfeil neben der Schaltfl&auml;che<strong> Exportieren</strong>.</li>
<li>Sie k&ouml;nnen Ihren Alarm wahlweise als <strong>HTML</strong> oder <strong>CSV</strong> exportieren.</li>
</ol>
<div class="section"><h4>Anmerkung:</h4>
<ul>
<li>Die Unterst&uuml;tzung des <strong>Leistungsalarms</strong> variiert je nach Modell Ihrer Synology NAS. F&uuml;r zus&auml;tzliche Informationen, besuchen Sie bitte <a href="http://www.synology.com/" target="_b +lank">www.synology.com</a>.</li>
</ul>
</div>
</body>
</html>
