<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Otomatik Engelleme - Synology DSM Yardım</title> 
<meta name="author" content="Synology Inc.">
<meta name="description" content="The auto block feature helps improve the security of your Synology NAS by blocking the IP addresses of clients with too many failed login attempts.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Otomatik Engelleme</h2>

<p>Otomatik engelleme &ouml;zelliği &ccedil;ok fazla başarısız oturum a&ccedil;ma girişimine sahip istemcilerin IP adreslerini engelleyerek Synology NAS sunucunuzun g&uuml;venliğini arttırmaya yardımcı olur. Bu kaba-kuvvet saldırıları kullanılarak hesapların kırılması riskini azaltmaya yardımcı olur.</p>

<p>G&uuml;vendiğiniz IP adreslerini eklemek i&ccedil;in bir izin verme listesini ya da belirli IP adreslerinin oturum a&ccedil;masını daima engellemek i&ccedil;in bir engelleme listesini de oluşturup y&ouml;netebilirsiniz.</p>

<div class="section"><h4>Not:</h4>
<ul>
	<li>Aşağıdakiler gibi &ccedil;eşitli hizmetler ve paketler otomatik engellemeyi destekler: DSM, SSH, Telnet, rsync, ağ yedeklemesi, paylaşımlı klas&ouml;r senkronizasyonu, FTP, WebDAV, File Station, Photo Station, Audio Station, Video Station, Download Station, Mail Server, Mail Station, Time Backup, VPN Server, Cloud Station ve Synology mobil uygulamaları.</li>
</ul>
</div>

<h4>Otomatik engellemeyi etkinleştirmek i&ccedil;in:</h4>
<ol>
	<li><strong>Denetim Masası</strong> &ouml;ğesini a&ccedil;ın ve <strong>G&uuml;venlik</strong> &gt; <strong>Otomatik Engelleme</strong> &ouml;ğesine gidin.</li>
	<li><strong>Otomatik engellemeyi etkinleştir</strong>'i işaretleyin.</li>
	<li><strong>Oturum a&ccedil;ma girişimleri</strong> alanına başarısız oturum a&ccedil;ma girişimlerinin sayısını girin ve <strong>S&uuml;re i&ccedil;inde (dakika)</strong> alanına dakika sayısını girin. Bir IP adresi belirlenen dakika i&ccedil;erisinde başarısız oturum a&ccedil;ma girişimi sayısını aşarsa, bu IP adresi engellenir.</li>
	<li><strong>Engelleme s&uuml;re dolumunu etkinleştir</strong>'i işaretleyin ve belirlenen g&uuml;n sayısı sonunda engellenen IP adresini kaldırmak i&ccedil;in bir sayı girin.</li>
	<li>Ayarları kaydetmek i&ccedil;in <strong>Uygula</strong>'ya tıklayın.</li>
</ol>


<h3>Engelleme Listesi Y&ouml;netilmesi</h3>
<p><strong>İzin/Engelleme Listesi</strong>'ne tıklayın ve <strong>Engelleme Listesi</strong> sekmesine gidin. </p>

<h4>IP adresleri eklemek i&ccedil;in:</h4>
<p><strong>Oluştur</strong> a&ccedil;ılır men&uuml;s&uuml;nden aşağıdakilerden birini se&ccedil;in:</p>

<ul>
	<li><strong>IP adresi ekle</strong>: Bir IP adresi girin ve sona erme zamanını ayarlayın.</li>
	<li><strong>IP adres listesini al</strong>: Bir kerede birtakım IP adreslerini eklemek ve sona erme zamanı ayarlamak i&ccedil;in, IP adreslerinin listelendiği bir metin dosyasını i&ccedil;e aktarın. Var olan IP adreslerinin &uuml;zerine yazmak isterseniz onay kutusunu işaretleyin. Bu se&ccedil;enek tercih edilmezse, aynı IP adresleri atlanacaktır.<br />Se&ccedil;tiğiniz dosya doğru bi&ccedil;ime sahipse, &ouml;nizleme alanında t&uuml;m IP adreslerini g&ouml;receksiniz. İ&ccedil;e aktarmak i&ccedil;in <strong>Tamam</strong>'a tıklayın.</li>
</ul>

<div class="section"><h4>Not:</h4>
<p>Bir dosyayı i&ccedil;e aktarmak i&ccedil;in, dosyanın aşağıdaki kriterlere uyması gerekir:</p>
<ul>
	<li>Dosya d&uuml;z metin dosyası olmalıdır.</li>
	<li>Dosyanın her bir satırı yalnızca bir IP adresi i&ccedil;ermelidir.</li>
	<li>Yorum satırları # (diyez işareti) ile başlar.</li>
</ul>
</div>

<h4>Engellenen IP adreslerini kaldırmak i&ccedil;in:</h4>
<p>Listeden kaldırmak istediğiniz IP adreslerini se&ccedil;ip <strong>Kaldır</strong>'a tıklayın.</p>


<h3>İzin Listesinin Y&ouml;netilmesi</h3>

<p><strong>İzin/Engelleme Listesi</strong>'ne tıklayın ve <strong>İzin Listesi</strong> sekmesine gidin.</p>

<h4>IP adresleri eklemek i&ccedil;in:</h4>
<p><strong>Oluştur</strong> a&ccedil;ılır men&uuml;s&uuml;nden aşağıdakilerden birini se&ccedil;in:</p>
<ul>
	<li><strong>IP adresi ekle</strong>: Bir IP adresi, IP aralığı, alt ağ veya etki alanı adı girin.</li>
	<li><strong>IP adres listesini al</strong>: Bir kerede belirli sayıda IP adresini eklemek i&ccedil;in, IP adreslerinin listelendiği bir metin dosyasını i&ccedil;e aktarın. Var olan IP adreslerinin &uuml;zerine yazmak isterseniz onay kutusunu işaretleyin. Bu se&ccedil;enek tercih edilmezse, aynı IP adresleri atlanacaktır.<br />Se&ccedil;tiğiniz dosya doğru bi&ccedil;ime sahipse, &ouml;nizleme alanında t&uuml;m IP adreslerini g&ouml;receksiniz. İ&ccedil;e aktarmak i&ccedil;in <strong>Tamam</strong>'a tıklayın.</li>
</ul>

<div class="section"><h4>Not:</h4>
<p>Bir dosyayı i&ccedil;e aktarmak i&ccedil;in, dosyanın aşağıdaki kriterlere uyması gerekir:</p>
<ul>
<li>Dosya d&uuml;z metin dosyası olmalıdır.</li>
<li>Dosyanın her satırı sadece bir IP adresi ya da bir IP aralığı (<em>192.168.1.1 - 192.168.1.10</em>), bir alt ağ (<em>192.168.1.1/255.255.0.0</em>) ya da bir etki alanı adı (<em>www.synology.com</em>) i&ccedil;erebilir.</li>
<li>Yorum satırları # (diyez işareti) ile başlar.</li>
</ul>
</div>

<h4>IP adreslerini kaldırmak i&ccedil;in:</h4>
<p>Listeden kaldırmak istediğiniz IP adreslerini se&ccedil;ip <strong>Kaldır</strong>'a tıklayın.</p>

<div class="section"><h4>Not:</h4>
<ul>
	<li>Synology NAS cihazınız bir karşıt sunucunun arkasındaysa l&uuml;tfen bu karşıt sunucunun IP adresini izin listesine ekleyin.</li>
</ul>
</div>

</body>
</html>
