<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>DSM Ayarları</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="https"></a>DSM Ayarları</h2>

<p><strong>Denetim Masası</strong> &gt; <strong>Ağ</strong> &gt; <strong>DSM Ayarları</strong> se&ccedil;eneğinden istemcilerin Synology NAS sunucunuza erişmek i&ccedil;in kullandığı bağlantı noktası numarasını değiştirebilirsiniz.</p>

<h4>Varsayılan bağlantı noktası numarasını değiştirmek i&ccedil;in:</h4>
<p>Hem HTTP hem de HTTPS bağlantıları her zaman DSM'de etkindir. Varsayılan HTTP bağlantı noktası 5000 ve varsayılan HTTPS bağlantı noktası 5001'dir.</p>
<ol>
<li><b>HTTP</b> veya <b>HTTPS</b> alanına bağlantı noktası numarasını girin.</li>
<li><b>Uygula</b>'ya tıklayın.</li>
</ol>

<h4>HTTP ve HTTPS bağlantılarını yeniden y&ouml;nlendirmek i&ccedil;in:</h4>
<p>HTTP bağlantı noktası yoluyla Synology NAS sunucunuza erişmek istediklerinde istemcileri HTTPS bağlantı noktasına yeniden y&ouml;nlendirirler.</p>
<ol>
<li><b>HTTP bağlantılarını otomatik olarak HTTPS'e yeniden y&ouml;nlendir (Web Station ve Photo Station hari&ccedil;)</b> &ouml;ğesini se&ccedil;in.</li>
<li>
<b>Uygula</b>'ya tıklayın.
</li>
</ol>

<div class="section">
<h4>HTTPS bağlantısı i&ccedil;in kullanılan bağlantı noktaları:</h4>
<ul>
  <li><b>DSM</b>: Varsayılan bağlantı noktası numarası 5001 olduğundan, aşağıdaki adresi girerek DSM'ye g&uuml;venli bir şekilde erişebilirsiniz: https://server-hostname:5001/</li>
<li><b>Web Station ve Photo Station</b>: Varsayılan bağlantı noktası numarası 443 olduğundan, aşağıdaki adresi girerek Web Station ve Photo Station'a g&uuml;venli bir şekilde erişebilirsiniz: https://server-hostname/</li>
</ul>

</div>

<h4>HTTP/2'yi etkinleştirmek i&ccedil;in:</h4>
<p>HTTP/2'yi etkinleştirerek HTTPS bağlantılarının hızını artırabilirsiniz.</p>
<ol>
<li><b>HTTP/2'yi etkinleştir</b>'i işaretleyin.</li>
<li><b>Uygula</b>'ya tıklayın.</li>
</ol>

<div class="enable-x64 enable-bromolow enable-cedarview enable-avoton enable-grantley enable-broadwell enable-dockerx64 enable-braswell">

<h4>Maksimum eşzamanlı HTTP bağlantılarını &ouml;zelleştirmek i&ccedil;in:</h4>
<p><strong>Maksimum eşzamanlı HTTP bağlantılarını &ouml;zelleştir</strong> se&ccedil;eneğini etkinleştirerek Synology NAS sunucunuzdaki HTTP bağlantılarını artırabilirsiniz.</p>

<div class="section">
<h4>Not:</h4>
<ul>
<li>Maksimum eşzamanlı HTTP bağlantısı sayısı ne kadar y&uuml;ksekse, o kadar fazla sistem belleğine ihtiya&ccedil; duyar.</li>
</ul>
</div>
</div>

<h4>HTTP yanıtlarındaki &quot;Sunucu&quot; başlığını &ouml;zelleştirmek i&ccedil;in:</h4>
<ol>
<li><b>HTTP yanıtlarında &quot;Server&quot; başlığını etkinleştir</b>'i işaretleyin.</li>
<li>Wen sunucunuz (&ouml;r. nginx) i&ccedil;in bir başlık belirleyin.</li>
<li><b>Uygula</b>'ya tıklayın.</li>
</ol>
<p>Onay kutusundaki işareti kaldırarak &quot;Sunucu&quot; başlığını devre dışı bırakabilirsiniz.</p>

<h2>Etki Alanı</h2>
<p><strong>Etki alanı</strong> altında, Synology NAS sunucusuna erişmek i&ccedil;in &ouml;zelleştirilen bir etki alanı adını belirleyebilirsiniz.
</p>
<h4>&Ouml;zelleştirilen etki alanını etkinleştirmek i&ccedil;in:</h4>
<ol>
<li>
<b>&Ouml;zelleştirilen etki alanını etkinleştir</b>'i işaretleyin.
</li>
<li>
Synology NAS sunucunuz i&ccedil;in uygulanan bir etki alanı adını belirleyin.
</li>
<li>
Bu etki alanı &uuml;zerinde HTTPS şifreli bağlantılarını zorunlu tutmak i&ccedil;in <b>HSTS'yi etkinleştir</b> &ouml;ğesini de işaretleyebilirsiniz.
</li>
<li>
<b>Uygula</b>'ya tıklayın.
</li>
</ol>

<div class="section">
<h4>Not:</h4>
<ul>
<li>Her etki alanı adı Synology NAS sunucunuzda sadece bir farklı uygulama i&ccedil;in kullanılabilir.</li>
<li>Etki alanı adının uzunluğu 15 karakteri aşmıyorsa ve <a href="https://support.microsoft.com/kb/909264" target="_blank">NetBIOS adlandırma kuralları</a> ile uyumluysa, sistem etki alanı adını (&ouml;r. MyDSM) otomatik olarak kaydeder ve yayınlar. Windows kullanıcıları DSM masa&uuml;st&uuml;ne benzer bir URL ile aynı yerel ağ i&ccedil;inde erişebilirler: <code>http://MyDSM</code> veya <code>https://MyDSM</code></li>
<li>Etki alanı adlarını kullanan URL'ler yoluyla uygulamalara eriştiğinizde, standart HTTP bağlantı noktası (80) veya standart HTTPS bağlantı noktası (443) &uuml;zerinden gidersiniz.</li>
</ul>

</div>

</body>
</html>

