<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="wireless_ap"></a>Ortak Erişim Noktası*</h2>

<p>Synology NAS aygıtınız bir Wi-Fi USB adapt&ouml;r kurmuş olmanız ya da Synology NAS sunucunuzda dahili Wi-Fi olması halinde İnternet bağlantısını diğer aygıtlarla paylaşmak i&ccedil;in bir ortak erişim noktası oluşturulmasını destekler. İnterneti nasıl kullanmak istediğinize bağlı olarak Synology NAS sunucunuzu bir kablosuz erişim noktası (AP) veya kablosuz y&ouml;nlendirici olarak ayarlayabilirsiniz.</p>

<table>
	<tr>
		<th width="23%">Ortak Erişim Noktası Modu</th>
		<th width="77%">A&ccedil;ıklama</th>
	</tr>
	<tr>
		<th>Kablosuz erişim noktası</th>
		<td>
			<ul>
				<li>LAN ve Wi-Fi ağınızı birbirine bağlar.</li>
				<li>LAN ve kablosuz istemcileriniz aynı yerel ağ &uuml;zerinde olacaklardır.</li>
				<li>Bir y&ouml;nlendiriciniz olduğunda ve Synology NAS sunucunuzu mevcut ağa ilave bir erişim noktası olarak kullanmak istediğinizde ge&ccedil;erlidir.</li> 
				<li>DLNA aygıtları, <span class="disable-grantley">yazıcılar,</span> Synology Web Assistant veya ağ yayınlarına dayanan diğer hizmetler gibi ağ kaynaklarının paylaşımına olanak tanır.</li>
				<li>DHCP sunucusu kablosuz erişim noktaları olarak işlev g&ouml;ren Synology NAS aygıtlarında devre dışı bırakılacaktır. Synology NAS sunucunuz i&ccedil;in DHCP sunucusunu yeniden aktive etmek i&ccedil;in, Wi-Fi donanım aygıtlarını kaldırın ve Synology NAS sunucusunu yeniden başlayın.</li>
				<li>&Ccedil;ok sayıda LAN bağlantı noktasına sahip modeller i&ccedil;in, kablosuz erişim noktası ile k&ouml;pr&uuml; kurmak &uuml;zere sadece LAN 1 kullanılacaktır.</li>
			</ul>
		</td>
	</tr>
	<tr>
		<th>Kablosuz Y&ouml;nlendirici</th>
		<td>
			<ul>
				<li>Aygıtların &ouml;zel bir alt ağ &uuml;zerinde olduğu bir kablosuz ağ kurar.</li>
			</ul>
		</td>
	</tr>
</table>

<div class="section"><h4>Not:</h4>
<ol>
	<li>Bazı modeller, ortak erişim noktaları oluşturmak i&ccedil;in kablosuz donanım aygıtları bağlamayı gerektirir. Desteklenen kablosuz donanım aygıtlarının tam bir listesi i&ccedil;in <a href="https://www.synology.com/compatibility?search_by=category&category=usb_wifi_dongles&p=1&filter_ap_mode=yes&not_recommend_mode=false" target=_blank>www.synology.com</a> adresini ziyaret edin.</li>
	<li>DS213air dışı modeller i&ccedil;in, DSM 4.3'deki Kablosuz Erişim Noktası se&ccedil;eneği DSM 5.0'da &quot;Kablosuz Y&ouml;nlendirici&quot; olarak yeniden adlandırılır.</li>
</ol>
</div>

<h3>Ortak Erişim Noktası Ayarlarını Y&ouml;netme</h3>
<p>Bu kısım, Synology NAS sunucunuzun ortak erişim noktası ayarlarının nasıl etkinleştirilip y&ouml;netildiğini a&ccedil;ıklar.</p>

<h4>Synology NAS cihazını ortak erişim noktasına d&ouml;n&uuml;şt&uuml;rmek i&ccedil;in:</h4>
<ol>
	<li><strong>Denetim Masası</strong> &gt; <strong>Kablosuz</strong> &gt; <strong>Ağ Haritası</strong>'na gidin. <strong>Kablosuz Erişim Noktası</strong> veya <strong>Kablosuz Y&ouml;nlendirici</strong> &ouml;ğesini se&ccedil;in.</li>
	<li>Aşağıdaki ayarları y&ouml;netmek i&ccedil;in <strong>Wi-Fi</strong> sekmesine giderek <strong>D&uuml;zenle</strong>'yi tıklayın:
		<ul>
			<li><strong>Ad (SSID):</strong> Kablosuz ağ i&ccedil;in bir ad girin.</li>
			<li><strong>G&ouml;ster/Gizle:</strong> Kablosuz ağın diğer aygıtlar tarafından g&ouml;r&uuml;lebilir olup olmayacağını se&ccedil;in.</li>
			<li><strong>Kablosuz modu:</strong> Bir kablosuz standardı se&ccedil;in. Her standart, &ccedil;eşitli bant genişliklerini ve frekanslarını destekler.</li>
			<li><strong>Kanal genişliği:</strong> Bir kanal genişliği se&ccedil;in (yalnızca 802.11n kablosuz modu kullanılırken mevcuttur).</li>
			<li><strong>Kanal:</strong> Kablosuz ağ i&ccedil;in bir frekans se&ccedil;in. Daha iyi performans i&ccedil;in, yakın &ccedil;evredeki ağlar tarafından kullanılanlardan farklı bir frekans se&ccedil;in.</li>
			<li><strong>Aktarım g&uuml;c&uuml;:</strong> Kablosuz ağın bir sinyal g&uuml;c&uuml;n&uuml; se&ccedil;in.</li>
			<li><strong>Maks. bağlantı:</strong> Ağa ka&ccedil; tane istemci aygıtın bağlanabileceğini se&ccedil;in. En y&uuml;ksek bağlantı ayarı 256'dır.</li>
			<li><strong>WMM QoS etkinleştir:</strong> Wi-Fi &uuml;zerinden Wi-Fi Multimedia (WMM) QoS (Hizmet Kalitesi). Bu se&ccedil;enek, kablosuz ağın trafiği &ouml;nceliklendirmesine ve kaynakların uygulamalar arasında paylaştırılmasını en uygun hale getirmesine olanak tanır.</li>
		</ul>
	</li>
</ol>

<h4>Bir kablosuz programı ayarlamak i&ccedil;in:*</h4>
<p>Bir kablosuz ağ programını etkinleştirmek, Synology NAS &uuml;r&uuml;n&uuml;n&uuml;z&uuml;n kablosuz ağının ne zaman etkin ve erişilebilir olduğunu kontrol etmenize olanak tanır.</p>
<ol>
	<li><strong>Wi-Fi</strong> sekmesine giderek <strong>D&uuml;zenle</strong>'yi tıklayın.</li>
	<li><strong>Zaman &ccedil;izelgesini etkinleştir</strong> onay kutusunu işaretleyin.</li>
	<li><strong>Program ayarla</strong>'ya tıklayın.</li>
	<li>Program ekranında, kablosuz ağın ne zaman etkin olacağını se&ccedil;in.</li>
</ol>

<h3>G&uuml;venlik Ayarları</h3>
<p><strong>Denetim Masası</strong> &gt; <strong>Kablosuz</strong> &gt; <strong>Wi-Fi</strong> b&ouml;l&uuml;m&uuml;, kablosuz ağınızın g&uuml;venlik ayarlarını d&uuml;zenleyen se&ccedil;enekleri sunar.</p>

<h4>Kablosuz g&uuml;venliğini ayarlamak i&ccedil;in:</h4>
<ol>
	<li><strong>D&uuml;zenle</strong>'ye tıklayın.</li>
	<li><strong>G&uuml;venlik Ayarları</strong> a&ccedil;ılan men&uuml;s&uuml;nden aşağıda g&uuml;venlik protokollerinden birini se&ccedil;in:
		<ul>
			<li><strong>WEP:</strong> Kullanıcıların, kablosuz ağa erişmek i&ccedil;in bir şifre girmelerini gerektiren ama d&uuml;ş&uuml;k d&uuml;zey koruma sağlayan bir temel g&uuml;venlik protokol&uuml;.</li>
			<li><strong>WPA/WPA2 Kişisel:</strong>&Ouml;nerilir. Kullanıcıların, kablosuz ağa erişmek i&ccedil;in bir şifre girmelerini gerektirir ve WEP'den daha g&uuml;venlidir.</li>
			<li><strong>WPA/WPA2 Kurumsal:</strong>* Harici bir kimlik doğrulama sunucusuyla kullanıcıların kimliklerinin doğrulanmasını gerektiren, kurumlar i&ccedil;i tasarlanmış bir g&uuml;venlik protokol&uuml;.</li>
		</ul>
	</li>
</ol>

<h4>Wi-Fi Protected Setup &ouml;zelliğini etkinleştirmek i&ccedil;in:*</h4>
<p>Wi-Fi Protected Setup , Wi-Fi Alliance tarafından kullanıcılar i&ccedil;in kablosuz g&uuml;venlik ayarlarını basitleştirmek amacıyla sunulan bir standarttır. Wi-Fi ağınızı g&uuml;vende tutmak i&ccedil;in bir D&uuml;ğme veya PIN numarası kullanabilirsiniz. Wi-Fi Protected Setup &ouml;zelliğini etkinleştirmek i&ccedil;in <strong>WPS</strong>'e tıklayın.</p>

<h3>Misafir Ağ*</h3>
<p>Ana kablosuz ağ oluşturmaya ek olarak, Synology NAS &uuml;r&uuml;n&uuml;n&uuml;z, bir misafir kablosuz ağ oluşturmayı da destekler. Misafir ağın ayarları, kullanıcıların erişimini kısıtlamak i&ccedil;in sınırlandırılabilir. Bu, ziyaret&ccedil;iler i&ccedil;in bir kablosuz ağ sağlamak ama ana ağa erişmelerini engellemek isteyen kurumlar ya da diğer kuruluşlar i&ccedil;in yararlıdır.</p>

<h4>Misafir ağı etkinleştirmek i&ccedil;in:</h4>
<ol>
	<li><strong>Denetim Masası</strong> &gt; <strong>Kablosuz</strong> &gt; <strong>Wi-Fi</strong>'a gidin.</li>
	<li><strong>Misafir Ağı</strong> sekmesinde aşağıdaki ayarları y&ouml;netmek i&ccedil;in <strong>D&uuml;zenle</strong>'ye tıklayın:
		<ul>
			<li><strong>Ad (SSID):</strong> Kablosuz ağ i&ccedil;in bir ad girin.</li>
			<li><strong>G&ouml;ster/Gizle:</strong> Kablosuz ağın diğer aygıtlar tarafından g&ouml;r&uuml;lebilir olup olmayacağını se&ccedil;in.</li>
			<li><strong>Maks. bağlantı:</strong> Ağa ka&ccedil; tane istemci aygıtın bağlanabileceğini se&ccedil;in. En y&uuml;ksek bağlantı ayarı 256'dır.</li>
		</ul>
	</li>
</ol>

<h4>Misafir ağ g&uuml;venliğini ayarlamak i&ccedil;in:</h4>
<p><strong>G&uuml;venlik Ayarları</strong> a&ccedil;ılan men&uuml;s&uuml;nden aşağıda g&uuml;venlik protokollerinden birini se&ccedil;in:</p>
<ul>
	<li><strong>WEP:</strong> Kullanıcıların, kablosuz ağa erişmek i&ccedil;in bir şifre girmelerini gerektiren ama d&uuml;ş&uuml;k d&uuml;zey koruma sağlayan bir temel g&uuml;venlik protokol&uuml;.</li>
	<li><strong>WPA/WPA2 Kişisel:</strong>&Ouml;nerilir. Kullanıcıların, kablosuz ağa erişmek i&ccedil;in bir şifre girmelerini gerektirir ve WEP'den daha g&uuml;venlidir.</li>
</ul>

<h4>Bir misafir ağ programı ayarlamak i&ccedil;in:</h4>
<p>Bir misafir ağ programını etkinleştirmek, Synology NAS &uuml;r&uuml;n&uuml;n&uuml;z&uuml;n misafir kablosuz ağının ne zaman etkin ve erişilebilir olduğunu kontrol etmenize olanak tanır.</p>

<ol>
	<li><strong>Misafir ağ programını etkinleştir</strong> onay kutusunu işaretleyin.</li>
	<li><strong>Misafir programını ayarla</strong>'ya tıklayın.</li>
	<li>Program ekranında, misafir kablosuz ağın ne zaman etkin olacağını se&ccedil;in.</li>
</ol>

<div class="section"><h4>Not:</h4>
<ul>
<li>Bu &ouml;zellik yalnızca DS213air'de kullanılabilir.</li>
<li>Misafir kablosuz ağ, ana kablosuz ağın devre dışı olduğu zaman aralıklarında etkin olamaz.</li>
</ul>
</div>

<h3>MAC Filtre Ayarı*</h3>
<p>MAC filtresi, (<strong>Denetim Masası</strong> &gt; <strong>Kablosuz</strong> b&ouml;l&uuml;m&uuml;nde) belirli aygıtları engellemenize ya da aygıtlara erişim vermenize olanak tanıyacak şekilde, hangi MAC adreslerinin kablosuz ağa erişmesine izin verileceğini belirler. Bu &ouml;zellik, diğer şifreleme ayarlarını değil yalnızca ağ erişimini kontrol eder.</p>

<h4>MAC filtresi kuralları oluşturmak i&ccedil;in:</h4>
<ol>
	<li>Bir cihazın a&ccedil;ıklamasını ve MAC adresini girin.</li>
	<li>Bir erişim politikası se&ccedil;in:
		<ul>
			<li><strong>İzin verme:</strong> Belirtilen MAC adresinin kablosuz ağa erişmesini kısıtlar.</li>
			<li><strong>İzin ver:</strong> Belirtilen MAC adresinin kablosuz ağa erişmesine izin verir.</li>
		</ul> 
	</li>
</ol>

<h3>Ebeveyn Denetimi*</h3>
<p>Ebeveyn denetimi &ouml;zelliği Synology NAS'in yerel ağına bağlı olan her istemci cihazının internete ne zaman erişebileceğini kontrol etmenizi sağlar. &Ouml;rneğin, &ccedil;ocuklarınızın bilgisayarları veya mobil cihazları Synology NAS &uuml;zerinden internete bağlanıyorsa, belirli cihazlara ve zamanlara g&ouml;re internet kullanımlarını kısıtlayacak şekilde ebeveyn denetimi ayarlarını yapılandırabilirsiniz.</p>

<h4>Ebeveyn Denetimini etkinleştirmek i&ccedil;in:</h4>
<ol>
	<li><strong>Denetim Masası</strong> &gt; <strong>Kablosuz</strong> &gt; <strong>Ebeveyn Denetimi Ayarları</strong>'na gidin.</li>
	<li>Bir istemci cihazını eklemek i&ccedil;in <strong>Ekle</strong> d&uuml;ğmesine tıklayın.
		<ul>
			<li><strong>İstemci Adı:</strong> Synology NAS sunucusuna bağlı olan bir cihaz se&ccedil;in veya manuel olarak bir ad girin (&ouml;r. Louisa'nın diz&uuml;st&uuml; bilgisayarı).</li>
			<li><strong>MAC Adresi:</strong> İnternet kullanımını kontrol etmek istediğiniz cihazın MAC adresini girin.</li>
			<li><strong>Programı ayarla:</strong> Belirtilen cihazın ne zaman Synology NAS yoluyla internete erişmesine izin verileceğini se&ccedil;in.</li>
		</ul>
	</li>
</ol>

<h3>Bağlantı Listesi*</h3>
<p>Bağlantı listesi (<strong>Denetim Masası</strong> &gt; <strong>Kablosuz</strong> b&ouml;l&uuml;m&uuml;nde), Synology NAS ile bağlantıda olan cihazlara ilişkin bilgileri g&ouml;r&uuml;nt&uuml;ler. Aygıtlar, burada doğrudan MAC filtresi listesine eklenebilir.</p>

<h4>MAC filtresi listesine aygıtlar eklemek i&ccedil;in:</h4>
<ol>
	<li>MAC filtresine eklemek istediğiniz aygıtın yanındaki kutuyu işaretleyin.</li>
	<li><strong>MAC Filtresi Listesine Ekle</strong> &ouml;ğesine tıklayın.</li>
</ol>

<p>____<br />* Sadece belirli modellerde vardır.</p>

</body>
</html>