<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Gelişmiş Kullanıcı Ayarları</h2>

<p>Gelişmiş kullanıcı ayarlarını değiştirmek i&ccedil;in <strong>Denetim Masası</strong> &gt; <strong>Kullanıcı</strong> &gt; <strong>Gelişmiş</strong>'e gidebilirsiniz. Aşağıdaki se&ccedil;enekler bulunmaktadır. </p>

<h3>Parola Ayarları</h3>
<p>Synology NAS sunucunuz &uuml;zerinde parola g&uuml;venliği ve g&uuml;c&uuml; kurallarına ilişkin ayarları belirleyebilirsiniz.</p>

<h4>Kullanıcıların unutulan şifreleri e-posta ile sıfırlamasına izin vermek i&ccedil;in:</h4>
<ol>
	<li><strong>Y&ouml;netici dışındaki kullanıcıların unutulan şifreleri e-posta ile sıfırlamasına izin ver</strong> onay kutusunu işaretleyin.</li>
	<li>Ayarları kaydetmek i&ccedil;in <strong>Uygula</strong>'ya tıklayın.</li>
	<li>DSM oturum a&ccedil;ma sayfasında &quot;Parolanızı unuttunuz mu?&quot; işaretli bağlantı g&ouml;r&uuml;nt&uuml;lenecektir. Parola unutulduğunda, kullanıcı bu bağlantıya tıklayabilir ve kullanıcı adını girebilir. Bu durumda, sistem bu kullanıcıya unutulan şifreyi sıfırlamak i&ccedil;in bir bağlantı i&ccedil;eren bir e-posta g&ouml;nderecektir.</li>
</ol>

<div class="section"><h4>Not:</h4>
<ul>
	<li>Bu se&ccedil;eneği etkinleştirmeden &ouml;nce, SMTP e-posta bildirimlerini etkinleştirmiş olduğunuzdan emin olun. Bunu yapmak i&ccedil;in, <strong>Denetim Masası</strong> &gt; <strong>Bildirim</strong> &ouml;ğesine gidin.</li>
	<li>Sistemden mesajlar almak i&ccedil;in, kullanıcılar hesaplarının kullanıcı bilgileri kısmında bir e-posta adresi belirtmelidirler.</li>
	<li><strong>administrators</strong> grubu &uuml;yesi kullanıcılar bu se&ccedil;enekle şifreleri sıfırlayamazlar.</li>
	<li>Etki alanı kullanıcıları bu se&ccedil;enekle şifreleri sıfırlayamazlar.</li>
	<li>LDAP kullanıcıları, Synology NAS LDAP dizin sunucusu olarak işlev g&ouml;rd&uuml;ğ&uuml; ve aşağıdaki koşulları karşıladığı s&uuml;rece bu se&ccedil;enekle şifreleri sıfırlayabilirler:
		<ul>
			<li>Synology <strong>Dizin Sunucusu</strong> paket s&uuml;r&uuml;c&uuml; 2457 veya &uuml;zerinde olmalıdır.</li>
			<li>LDAP kullanıcısı y&ouml;neticilerin, Dizin Operat&ouml;rlerinin, Dizin T&uuml;keticilerinin veya Dizin İstemcilerinin bir &uuml;yesi olamaz.</li>
			<li>Synology Dizin Sunucusu bir <strong>Consumer</strong> ise, <strong>Sağlayıcısı</strong> yukarıda bahsedilen koşulları karşılamalıdır.</li>
			<li>Nihai Sağlayıcı kullanıcının web tarayıcısı ile erişilebilir olmalıdır ve e-posta bildirimleri etkinleştirilmelidir.</li>
			<li>Unutulan parolayı sıfırla bağlantısının başka birisi tarafından kullanılmasını &ouml;nlemek i&ccedil;in, bağlantı unutulan parola talebinin yapıldığı IP adresinden tıklanmalıdır.</li>
		</ul>
	</li>
</ul>
</div>

<h4>Kullanıcıları parola sıfırlama sonrasında parola değiştirmeye zorlamak i&ccedil;in:</h4>
<ol>
	<li><strong>Y&ouml;netici parolayı sıfırladıktan sonra kullanıcılar i&ccedil;in parola değişimini zorunlu tut</strong> onay kutusunu işaretleyin.</li>
	<li>Ayarları kaydetmek i&ccedil;in <strong>Uygula</strong>'ya tıklayın.</li>
	<li>Y&ouml;netici bir kullanıcı i&ccedil;in parolayı değiştirdiğinde, kullanıcıdan bir sonraki oturum a&ccedil;ma sonrasında parolasını değiştirmesi istenecektir.</li>
</ol>

<h4>Parola g&uuml;c&uuml; kurallarını etkinleştirmek i&ccedil;in:</h4>
<ol>
	<li><strong>Parola g&uuml;c&uuml; kurallarını uygula</strong> onay kutusunu işaretleyin.</li>
	<li>İhtiya&ccedil;larınıza g&ouml;re aşağıdaki se&ccedil;enekleri işaretleyin ve işaretini kaldırın:
		<ul>
			<li><strong>Kullanıcının adını ve a&ccedil;ıklamasını parolaya dahil etme</strong>: Şifre kullanıcı adını veya kullanıcı a&ccedil;ıklamasını i&ccedil;ermelidir. Ancak UTF-8 kodlu karakterler hari&ccedil;tir.</li>
			<li><strong>B&uuml;y&uuml;k/k&uuml;&ccedil;&uuml;k karma harfleri dahil et</strong>: Şifre b&uuml;y&uuml;k ve k&uuml;&ccedil;&uuml;k harfler i&ccedil;ermelidir.</li>
			<li><strong>Sayısal karakter dahil et</strong>: Parolada en az bir sayısal karakter (0~9) bulunmalıdır.</li>
			<li><strong>&Ouml;zel karakter dahil et</strong>: Parolada en az bir ASCII &ouml;zel karakter bulunmalıdır (&ouml;r., <span class="note_content">~ ` ! @ # $ % ^ &amp; * ( ) - _ = + [ { ] } \ | ; : ' &quot; &lt; &gt; / ?</span>).</li>
			<li><strong>Ortak parolayı hari&ccedil; tut</strong>: Kullanıcıların <em>123456</em>, <em>parola</em>, <em>qwerty</em>, vb. gibi yaygın parolalar belirlemesini &ouml;nleyin.</li>
			<li><strong>Minimum şifre uzunluğu</strong>: Şifre en az metin alanında belirtilen değerde olmalıdır. Uzunluk 6 ile 127 arasında olmalıdır.</li>
			<li><strong>Parola ge&ccedil;mişi</strong>: Parola, sayısı burada belirlenecek olan daha &ouml;nce belirlenen parolalardan farklı olmalıdır.</li>
		</ul>
	</li>
	<li>Ayarları kaydetmek i&ccedil;in <strong>Uygula</strong>'ya tıklayın.</li>
</ol>

<div class="section"><h4>Not:</h4>
<ul>
	<li>Parola g&uuml;c&uuml; kuralları sadece yeni parolalar i&ccedil;in ge&ccedil;erlidir. &Ouml;rneğin, yeni parola g&uuml;c&uuml; kuralları sadece yeni bir kullanıcı hesabı oluşturulurken veya mevcut bir kullanıcı parolasını değiştirdiğinde uygulanır. Mevcut parolalar ve i&ccedil;eri alınan kullanıcı hesaplarına ait olanlar yeni parola kurallarından hari&ccedil; tutulurlar.</li>
</ul>
</div>

<h3>Parola Bitimi</h3>
<p>Kullanıcıları belirlenen s&uuml;re sonrasında parola değiştirmeye zorlamak i&ccedil;in parola bitimi işlevi ile kullanıcı hesaplarının g&uuml;venliğini artırabilirsiniz.</p>

<h4>Parola bitim programını ayarlamak i&ccedil;in:</h4>
<ol>
	<li><strong>Parola s&uuml;resi bitimini etkinleştir</strong> onay kutusunu işaretleyin.</li>
	<li>Aşağıdaki se&ccedil;enekler yapılandırılabilir:
		<ul>
			<li><strong>Maksimum parola ge&ccedil;erlilik s&uuml;resi</strong>: Sonrasında parolaların ge&ccedil;ersiz hale geleceği g&uuml;nlerin sayısını belirleyin.</li>
			<li><strong>Minimum parola ge&ccedil;erlilik s&uuml;resi</strong>: Bu işlevi etkinleştirmek i&ccedil;in onay kutusunu işaretleyin ve kullanıcıların parolalarını değiştirmesine izin verilmemesi &ouml;ncesindeki g&uuml;n sayısını belirleyin.</li>
			<li><strong>S&uuml;re bitimi &ouml;ncesinde oturum a&ccedil;ma sonrasında kullanıcıların parolayı değiştirmesini iste</strong>: Bu işlevi etkinleştirmek i&ccedil;in onay kutusunu işaretleyin ve kullanıcıların oturum a&ccedil;ma sonrasında parolalarını değiştirmesinin hatırlatılması &ouml;ncesindeki g&uuml;n sayısını belirleyin.</li>
			<li><strong>Kullanıcıların s&uuml;re bitimi sonrasında parolayı değiştirmesine izin ver</strong>: Kullanıcıların s&uuml;resi bitmiş olan parolalarla oturum a&ccedil;malarına ve parolalarını değiştirmelerine olanak tanımak i&ccedil;in onay kutusunu işaretleyin.</li>
			<li><strong>S&uuml;re bitimi bildirim e-postaları g&ouml;nder</strong>: Kullanıcıları e-posta yoluyla parola bitimi konusunda uyarmak i&ccedil;in onay kutusunu işaretleyin.</li>
		</ul>
	</li>
	<li>Ayarları kaydetmek i&ccedil;in <strong>Uygula</strong>'ya tıklayın.</li>
</ol>

<h3>2 Adımlı Doğrulama</h3>
<p>2 adımlı doğrulama, DSM kullanıcı hesapları i&ccedil;in geliştirilmiş g&uuml;venlik sağlar. Hesaplarını daha iyi korumak i&ccedil;in DSM y&ouml;neticilerini ya da t&uuml;m DSM kullanıcılarını 2 adımlı doğrulamayı etkinleştirmek zorunda bırakabilirsiniz.</p>

<h4>DSM kullanıcılarına 2 adımlı doğrulamayı zorunlu kılmak i&ccedil;in:</h4>
<ol>
	<li><strong>Aşağıdaki kullanıcılar i&ccedil;in 2 adımlı doğrulamayı iste</strong> kutusunu işaretleyerek bunu uygulamak istediğiniz kullanıcıları se&ccedil;in.</li>
	<li>Ayarları kaydetmek i&ccedil;in <strong>Uygula</strong>'ya tıklayın.</li>
	<li>Bu zorunluluk uygulandığında 2 adımlı doğrulamayı etkinleştirmemiş kullanıcıların DSM'de oturum a&ccedil;madan &ouml;nce ayarları tamamlamaları istenir.</li>
</ol>

<div class="section"><h4>Not:</h4>
<ul>
	<li><strong>Kişisel</strong> &gt; <strong>Account</strong> b&ouml;l&uuml;m&uuml;nde hen&uuml;z 2 adımlı doğrulamayı yapılandırmadıysanız, bu zorunluluğu uygulamadan &ouml;nce gereken ayarları tamamlamanıza yardımcı olmak i&ccedil;in 2 adımlı doğrulama kurulum sihirbazı başlatılır.</li>
	<li>2 adımlı doğrulama zorunluluğunu burada devre dışı bırakmak, her bir kullanıcının 2 adımlı doğrulama ayarını etkilemez veya devre dışı bırakmaz. Kullanıcılar kendi 2 adımlı doğrulama ayarlarını muhafaza edebilir veya bu ayarları devre dışı bırakmak i&ccedil;in <strong>Kişisel</strong> &gt; <strong>Account</strong> b&ouml;l&uuml;m&uuml;ne gidebilirler.</li>
	<li style="display: none;">2 adımlı doğrulama ayrıca, SSH terminal, SFTP ve SSH aktarım şifrelemeli rsync gibi SSH ilişkili hizmetler i&ccedil;in de ge&ccedil;erlidir. Ancak, Hyper Backup ve SSH aktarım şifrelemeli rsync yoluyla Paylaşımlı Klas&ouml;r Senkronizasyonu 2 adımlı şifrelemeyi desteklemediği i&ccedil;in, bu iki hizmet 2 adımlı doğrulama etkinleştirildikten sonra normal şekilde &ccedil;alışmaz.</li>
</ul>
</div>


<h3>Kullanıcı Anasayfa</h3>

<p>Her kullanıcıya kişisel bir ana sayfa klas&ouml;r&uuml; oluşturmak i&ccedil;in kullanıcı <strong>home</strong> etkinleştirilmelidir, <strong>guest</strong> bunun dışındadır. T&uuml;m kullanıcılar kendi ana sayfa klas&ouml;rlerine CIFS, AFP, FTP veya File Station yoluyla erişebilirler.</p>

<p><strong>administrators</strong> grubuna ait kullanıcılar <strong>homes</strong> varsayılan paylaşımlı klas&ouml;r&uuml;n&uuml;n i&ccedil;indeki t&uuml;m kişisel klas&ouml;rlere erişebilirler. Home klas&ouml;r&uuml;n&uuml;n adı kullanıcı hesabı ile aynıdır.</p>

<h4>Kullanıcı ana sayfa hizmetini etkinleştirmek i&ccedil;in:</h4>
<ol>
	<li><strong>Kullanıcı ana sayfa hizmetini etkinleştir</strong> kutusunu işaretleyin.</li>
	<li>Birden fazla birim varsa, <strong>homes</strong> klas&ouml;r&uuml;n&uuml;n depolanacağı konumu se&ccedil;in.</li>
	<li><strong>Uygula</strong>'ya tıklayın.</li>
</ol>

<div class="section"><h4>Not:</h4>
<ul>
	<li>Yerel kullanıcı ana sayfa hizmeti devre dışı bırakıldığında, aynı zamanda etki alanı kullanıcı ana sayfa hizmeti de devre dışı bırakılacaktır.</li>
</ul>
</div>

<h4>Kullanıcı ana sayfa hizmetini devre dışı bırakmak i&ccedil;in:</h4>
<ol>
	<li><strong>Kullanıcı ana sayfa hizmetini etkinleştir</strong>'in işaretini kaldırın.</li>
	<li>Ayarları kaydetmek i&ccedil;in <strong>Uygula</strong>'ya tıklayın.</li>
</ol>

<p>Kullanıcı ana sayfa servisi engellendikten sonra, <strong>homes</strong> paylaşımlı klas&ouml;r&uuml; admin erişimi i&ccedil;in ayrılacaktır.  Kullanıcı ana sayfa servisi yeniden etkinleştirildiğinde kullanıcılar home klas&ouml;rlerine tekrar erişebileceklerdir.</p>

<div class="section"><h4>Not:</h4>
<ul>
	<li><strong>Homes</strong> paylaşımlı klas&ouml;r&uuml;n&uuml; silmek i&ccedil;in, &ouml;nce kullanıcı ana sayfa servisi devre dışı bırakılmalıdır.</li>
	<li>Yerel kullanıcı ana sayfa hizmeti devre dışı bırakılırsa etki alanı kullanıcı ana sayfa hizmeti devre dışı olacaktır.</li> 
</ul> 
</div>

</body>	
</html> 