<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Hizmet Bulma</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>




<h2>Hizmet Bulma</h2>

<p>Hizmet bulma kullanıcıların bu Synology NAS sunucusunu ağ &uuml;zerinde SSDP (Basit Hizmet Bulma Protokol&uuml;l) ve Bonjour hizmetleri yoluyla bulmasını sağlar.</p>


<h4>Synology NAS sunucunuzu SSDP yoluyla bulunabilir hale getirmek i&ccedil;in:</h4>

<p>SSDP hizmeti kullanıcıların Synology NAS sunucusunu Windows ağ bulucu yoluyla bulmalarını sağlar.</p>

<ol>
	<li><strong>Denetim Masası</strong> &gt; <strong>Dosya Hizmetleri</strong> &gt; <strong>Hizmet Bulucu</strong> &gt; <strong>SSDP</strong>'ye gidin.</li>
    <li><strong>Windows ağ bulucuyu etkinleştir</strong> &ouml;ğesini se&ccedil;in.</li>
    <li>Ayarları kaydetmek i&ccedil;in <strong>Uygula</strong>'ya tıklayın.</li>
</ol>



<h4>Synology NAS sunucunuzu Bonjour hizmeti yoluyla bulunabilir hale getirmek i&ccedil;in:</h4>

<p>Bonjour hizmeti kullanıcıların Synology NAS sunucusunu bulmasını ve Mac bilgisayardan yazdırma ve yedekleme g&ouml;revlerini yapmasını sağlar.</p>

<ol>
	<li><strong>Denetim Masası</strong> &gt; <strong>Dosya Hizmetleri</strong> &gt; <strong>Hizmet Bulucu</strong> &gt; <strong>Bonjour</strong>'a gidin.</li>
    <li><strong>Bonjour hizmet keşfini etkinleştir</strong>'i se&ccedil;in.</li>
    <li>İhtiya&ccedil;larınıza uyacak Bnjour ile ilişkili se&ccedil;enekleri se&ccedil;ebilirsiniz:
    	<ul>
        <li><strong>Bonjour Yazıcı Yayınını Etkinleştir</strong>: Mac bilgisayarların belge yazdırma i&ccedil;in Synology NAS sunucunuza bağlı USB yazıcıyı bulmalarını sağlamak i&ccedil;in se&ccedil;in.</li>
        <li><strong>SMB yoluyla Bonjour Time Machine yayınını etkinleştir</strong>: SMB yoluyla Mac Time Machine'in Synology NAS sunucunuzu bulmasını ve DSM paylaşımlı klas&ouml;rlerine dosyaları yedeklemesini sağlamak i&ccedil;in se&ccedil;in.</li>
        <li><strong>AFP yoluyla Bonjour Time Machine yayınını etkinleştir</strong>: AFP yoluyla Mac Time Machine'in Synology NAS sunucunuzu bulmasını ve DSM paylaşımlı klas&ouml;rlerine dosyaları yedeklemesini sağlamak i&ccedil;in se&ccedil;in.</li>
        </ul>
    
    </li>
    <li>Time Machine'e ilişkin herhangi bir se&ccedil;eneği se&ccedil;mişseniz, Time Machine yedeklemeleri i&ccedil;in hedef klas&ouml;rleri belirlemek &uuml;zere <strong>Time Machine Klas&ouml;rlerini belirle</strong> &uuml;zerine tıklayın.</li>

<li>Ayarları kaydetmek i&ccedil;in <strong>Uygula</strong>'ya tıklayın.</li>
</ol>


<div class="section">
<h4>Not:</h4>

<ul>
	<li>SMB/AFP hizmetini (<strong>Denetim Masası</strong> &gt; <strong>Dosya Hizmetleri</strong> &gt; <strong>SMB/AFP/NFS</strong> &ouml;ğesinde) devre dışı bırakırsanız, ilişkili Bonjour se&ccedil;eneği otomatik olarak devre dışı bırakılır.</li>
	<li><strong>SMB yoluyla Bonjour Time Machine yayınını etkinleştir</strong> se&ccedil;ildiğinde, aşağıdaki se&ccedil;enekler etkinleştirilecektir (<strong>Denetim Masası</strong> &gt; <strong>Dosya Hizmetleri</strong> &gt; <strong>SMB/AFP/NFS</strong> &gt; <strong>Gelişmiş Ayarlar</strong> &ouml;ğesinde):
    	<ul>
        <li><strong>SMB 3'&uuml; etkinleştir</strong> (<strong>Windows dosya hizmeti i&ccedil;in maksimum protokol</strong> i&ccedil;in)</li>
        <li><strong>Opportunistic Locking</strong></li>
        <li><strong>SMB2 kirasını etkinleştir</strong></li>
        <li><strong>SMB dayanıklı tutamakları etkinleştir (Protokoller arası dosya kilitleme devre dışı bırakılacak)</strong>)</li>
      </ul>
    
    </li>
</ul>
</div>

</body>
</html>