<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>AFP</h2>
<p><strong>Denetim Masası</strong> &gt; <strong>Dosya Hizmetleri</strong> &gt; <strong>SMB/AFP/NFS</strong> &ouml;ğesinden Synology NAS aygıtınızı bir Mac dosya sunucusu (AFP sunucusu) yapmak i&ccedil;in AFP hizmetini etkinleştirebilirsiniz.</p>

<h4>Mac dosya hizmetini etkinleştirmek i&ccedil;in:</h4>
<ol>
	<li>Synology NAS &uuml;r&uuml;n&uuml;n&uuml; bir Mac dosya sunucusu (AFP sunucusu) yapmak i&ccedil;in <strong>AFP hizmetini etkinleştir</strong>'i işaretleyin.</li>
	<li><strong>Uygula</strong>'ya tıklayın.</li>
</ol>


<h3>Aktarım G&uuml;nl&uuml;ğ&uuml;n&uuml; Etkinleştirme</h3>
<p>Bu se&ccedil;eneğin işaretlenmesi dosyaları veya klas&ouml;rleri, Apple Filing Protocol olarak ta bilinen AFP aracılığıyla oluşturma, silme, okuma, yazma, taşıma ve yeniden adlandırma dahil olmak &uuml;zere dosya erişim işlemlerine giriş yapmaya olanak sağlar.</p>

<h3>Gelişmiş Ayarlar</h3>

<h4>Varsayılan UNIX izinlerini uygula:</h4>
<p>Bu se&ccedil;eneğin etkinleştirilmesi dosyaları ve klas&ouml;rleri y&uuml;klerken veya oluştururken varsayılan UNIX izinlerini uygular. Uygulanan izinler UNIX komutu <strong>umask</strong> tarafından uygulanan izinlerin aynısıdır. Bu se&ccedil;enek etkinleştirildiğinde, UNIX izinleri dosyalar i&ccedil;in 644 ve klas&ouml;rler i&ccedil;in 755'dir. Bu se&ccedil;enek devre dışı bırakıldığında, UNIX izinleri dosyalar i&ccedil;in 666 ve klas&ouml;rler i&ccedil;in 777'dir. Varsayılan umask değeri 022'dir.</p>

<div class="section"><h4>Not:</h4>
<p>Bu se&ccedil;eneğin etkinleştirilmesi farklı protokoller arasında tutarsız izin sorunlarına neden olabilir. Tutarsızlıkları &ouml;nlemek i&ccedil;in, bu se&ccedil;eneği devre dışı bırakmanızı &ouml;neririz.</p>
</div>

<h4>Bağlantı kesme sonrasında kaynakları hemen bırak:</h4>
<p>Bu se&ccedil;eneğin etkinleştirilmesi AFP sunucu bağlantısı beklenmedik şekilde kesildiğinde kaynakları bırakır. Time Machine kullanırken &quot;Birim kullanımda&quot; hata mesajlarını alırsanız, l&uuml;tfen bu se&ccedil;eneği etkinleştirin.</p>



<h4 class="disable-hi3535">Finder yoluyla dosya i&ccedil;eriğini aramak i&ccedil;in:</h4>
<p class="disable-hi3535">Mac bilgisayarınıza klas&ouml;rler tam olarak indekslendikten ve ardından tanıtıldıktan sonra, mevcut dosyaların i&ccedil;eriklerini aramak i&ccedil;in Finder kullanabilirsiniz.</p>
<ol class="disable-hi3535">
	<li>Belirli klas&ouml;rleri ve mevcut dosyaları dosya t&uuml;r&uuml;ne g&ouml;re indekslemek i&ccedil;in <strong>Universal Search</strong> &gt; <strong>Tercihler</strong> &gt; <strong>Dosya İndeksleme</strong> &gt; <strong>İndeksli Klas&ouml;r Listesi</strong> &gt; <strong>Oluştur</strong>'a gidin.</li>
	<li>İndekslemeyi yapmak i&ccedil;in <strong>Tamam</strong>'a tıklayın.</li>
	<li>İndekslenen klas&ouml;rleri Mac bilgisayarınıza bağlayın.</li>
	<li>Mac bilgisayarınızda, Finder'ın sol panelinde istenilen bağlı klas&ouml;re tıklayın ve mevcut dosyaların i&ccedil;eriğini aramak i&ccedil;in Finder kullanın.</li>
</ol>

<div class="section disable-hi3535"><h4>Not:</h4>
<ul>
	<li>Tanıtılan klas&ouml;rler dahilinde arama yapmak i&ccedil;in Finder kullanın. Mac masa&uuml;st&uuml;nde Spotlight sadece yerel dosyaları aramak i&ccedil;in kullanılabilir.</li>
	<li>Mac OS X 10.9 ve sonraki s&uuml;r&uuml;mlerde, Finder etiket adı ve kategoriye g&ouml;re bağlı klas&ouml;rlerde arama yapmayı destekler.</li>
</ul>
</div>

</body>
</html>