<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Etki Alanı</h2>

<p>Synology NAS sunucunuz bir Windows etki alanına katılabilir. Etki alanına katıldıktan sonra, etki alanı kullanıcıları kendi etki alanı hesaplarını ve şifrelerini kullanarak Synology NAS sunucusunda oturum a&ccedil;abilirler ve bu da onlara başka bir kullanıcı adı ve şifre setini hatırlama zorunluluğu olmadan dosyalara erişmelerine ve DSM uygulamalarını kullanmalarına olanak tanır.</p>

<h4>Bir etki alanına katılmak i&ccedil;in:</h4>
<ol>
	<li><strong>Denetim Masası</strong> &gt; <strong>Dizin Hizmeti</strong> &gt; <strong>Etki Alanı</strong>'na gidin.</li>
	<li><strong>Etki alanına katıl</strong> kutusunu işaretleyin.</li>
	<li>Etki alanı adını girin ve uygun alanlara DNS server tanımlayın.</li>
	<li>Gerekirse <strong>Gelişmiş etki alanı se&ccedil;enekleri</strong> kutusunu işaretleyin. (Ayrıntılar i&ccedil;in aşağıya bakın.)</li>
	<li><strong>Uygula</strong>'ya tıklayın.</li>
	<li>Beliren pencerede, etki alanı sunucusunun y&ouml;neticinin kullanıcı adını ve parolasını girin.</li>
	<li><strong>Tamam</strong>'a tıklayın.</li>
</ol>

<div class="section"><h4>DNS Server</h4>
<p>Synology NAS sunucunuzun etki alanını aramasına yardımcı olmak i&ccedil;in bir DNS sunucusu belirlemeniz &ouml;nerilir. Ancak etki alanı DNS sunucusunda kayıtlı değilse, etki alanına katılma prosed&uuml;r&uuml; başarılı olmayabilir.</p>

<h4>Etki Alanı Sunucu T&uuml;r&uuml;</h4>
<p>Bu alan, Synology NAS sunucunuz bir etki alanına katıldığında etki alanı tipini g&ouml;sterir. Etki alanı t&uuml;r&uuml; &quot;AD etki alanı&quot; olacaktır.</p>

<h4>Y&ouml;netim Modu</h4>
<p>Bu se&ccedil;enek etki alanı kullanıcılarının ve grupların ayrıcalıklarını nasıl y&ouml;neteceğinizi saptar. </p>
<ul>
	<li><strong>G&uuml;venilir Etki Alanı</strong>: Birleştirilen etki alanı ile g&uuml;venilir etki alanlarındaki kullanıcıları ve grupları y&ouml;netebilirsiniz. Kullanıcılar ve gruplar etki alanı a&ccedil;ılır listesi ile filtrelenebilir.</li>
	<li><strong>OU ile Tek Etki Alanı</strong>: Sadece birleştirilen etki alanındaki kullanıcılar ve gruplar bu modda g&ouml;r&uuml;nt&uuml;lenir. Bu mod OU (Organizasyonel Birim) a&ccedil;ılır listesi ile etki alanı kullanıcılarını/etki alanı gruplarını filtrelemenizi sağlar.</li>
</ul>

<h4>Gelişmiş Etki Alanı Se&ccedil;enekleri</h4>
<p>&Ccedil;oğu durumda, gelişmiş etki alanı se&ccedil;eneklerinden hi&ccedil;birini doldurmanız gerekmez. Gelişmiş etki alanı se&ccedil;enekleri sadece belirli etki alanı ortamlarında gerekir. </p>
<ul>
	<li><strong>DC IP/FQDN</strong>: Bir DC (Etki Alan Denetleyici) IP adresi veya FQDN belirlediğinizde Synology NAS sunucunuz onunla iletişim kurmaya &ccedil;alışacaktır. Eğer birden fazla IP adresi veya FQDN varsa, her birinin arasına bir virg&uuml;l (,) koyun. Dilerseniz son DC IP adresinden veya FQDN'den sonra bir asteriks (*) koyun, belirlenenlerin hepsi başarısız olduğunda Synology NAS sunucunuz diğer DC ile iletişim kurmaya &ccedil;alışacaktır. Asteriks ile son IP adresi veya FQDN arasına bir virg&uuml;l koymanız gerecektir.</li>
	<li><strong>Etki Alanı NetBIOS adı</strong>: Etki alanının NetBIOS adını belirleyin.</li>
	<li><strong>Etki Alanı FQDN (DNS adı)</strong>: Etki alanı i&ccedil;in FQDN (DNS adını) belirleyin.</li>
	<li><strong>DNS aray&uuml;z&uuml;n&uuml; kaydet</strong>: Bir etki alanına katılırken, burada belirtilen NIC (Ağ Aray&uuml;z Kartı) DNS sunucusuna kaydedilir. Synology NAS sunucunuzun ana bilgisayar adı bir alt &ccedil;izgi (_) i&ccedil;erirse DNS ile alt &ccedil;izgi (_) kullanılamayacağı i&ccedil;in kaydın başarısız olacağını l&uuml;tfen unutmayınız.</li>
	<li><strong>Kullanıcı/grup listesini g&uuml;ncelle</strong>: Synology NAS sunucunuzun ne kadar sıklıkla otomatik olarak etki alanı kullanıcı/grup listesini g&uuml;ncelleyeceğini belirtin. G&uuml;ncellemeleri g&uuml;nl&uuml;k, haftalık veya aylık yapacak şekilde zaman periyodunu &ouml;zelleştirebilirsiniz. Ayrıca, etki alanı kullanıcı/grup listeleri de <strong>Etki alanı kullanıcısı</strong> sekmesine gidilerek ve <strong>T&uuml;m etki alanlarını g&uuml;ncelle</strong> &uuml;zerine tıklanarak manuel olarak g&uuml;ncellenebilir. Otomatik g&uuml;ncellemelerin sistem uykusunu etkileyeceğine dikkat edin.</li>
</ul>

<h4>Salt Okunur Etki Alanı Denetleyicisini Katma</h4>
<p>Synology NAS sunucunuzu salt okunur etki alanı denetleyicisine (RODC) katmak i&ccedil;in, <strong>DC IP/FQDN</strong> alanında okuma-yazma etki alanı denetleyicinizin (RWDC) &quot;tam bilgisayar adını&quot; (FQDN) belirtmeniz gerekir. Tam bilgisayar adının aşağıdaki formata g&ouml;re olması gerekir: <strong>ComputerName.Domain</strong>, &ouml;r. &quot;ad01.synology.com&quot;.</p>
</div>


<div class="section"><h4>Not:</h4>
<ul>
	<li>Etki alanı kullanıcı adınızda &ldquo;%&rdquo; veya &ldquo;$&rdquo; varsa, home klas&ouml;r&uuml;n&uuml;ze erişemeyebilirsiniz. L&uuml;tfen etki alanı y&ouml;neticinizden size yeni bir kullanıcı adı vermesini isteyin.</li>
	<li><strong>Domain Admins</strong> ve <strong>Enterprise Admins</strong> etki alanı grupları yerel <strong>Administrators</strong> grubuna otomatik olarak eklenecektir. Dolayısıyla, bu gruplardaki etki alanı kullanıcıları CIFS/FTP/AFP/WebDAV gibi dosya hizmetlerine ve diğer DSM uygulamalarına erişim dahil olmak &uuml;zere Synology NAS sunucunuz &uuml;zerinde y&ouml;netim ayrıcalıklarına sahip olacaklardır.</li>
	<li>Etki alanı kullanıcılarının Synology NAS sunucunuz &uuml;zerindeki paylaşımlı klas&ouml;rlere erişim ayrıcalıklarını da yapılandırabilirsiniz. Daha fazla bilgi i&ccedil;in <a href="file_directory_service_user_group.html">buraya</a> bakın.</li>
</ul>
</div>

<h3>Etki Alanı Se&ccedil;enekleri</h3>

<p>Bu b&ouml;l&uuml;m aşağıdaki ilave etki alanı se&ccedil;eneklerini i&ccedil;erir.</p>
<ul>
	<li><strong>Bir etki alanı kullanıcısı her oturum a&ccedil;ışında DiskStation bir NTP sunucusu ile senkronize olacaktır</strong>: Bu se&ccedil;eneğin etkinleştirilmesi Synology NAS ve NTP sunucusu arasında zamanı senkronize edecektir.</li>
	<li><strong>Sunucu imzalamasını etkinleştir</strong>: M&uuml;şteri, m&uuml;şteri imzalamasını etkinleştirmişse, kullanıcıların etki alanı hizmetlerini normal olarak kullanabilmesi i&ccedil;in sunucu imzalamasının Synology NAS sunucusunda da etkinleştirilmesi gerekir.</li>
	<li><strong>NT4-uyumlu modla kullanıcı/grup listelerini al</strong>: Bu se&ccedil;eneğin etkinleştirilmesi sistemin NT4 RPC modunu kullanarak kullanıcı/grup listelerini almasını sağlar. Bu se&ccedil;enek belirli kullanıcı/grup listeleri varsayılan ayarlar kullanılarak edinilemediğinde etkinleştirilebilir.</li>
	<li><strong> Etki Alanı Y&ouml;neticileri ve Şirket Y&ouml;neticileri i&ccedil;in y&ouml;netici izinlerini devre dışı bırak</strong>: Y&ouml;netici izinlerine sahip bir kullanıcı Synology NAS sunucunuzun ve dosyalarının t&uuml;m kontrol&uuml;ne sahip olabilir. Bu se&ccedil;eneğin etkinleştirilmesi Etki Alanı Y&ouml;neticilerinin ve Şirket Y&ouml;neticilerinin izinlerini normal bir kullanıcı ile aynı olacak şekilde sınırlandırmanızı sağlar, bu sayede t&uuml;m normal kullanıcı dosyası/klas&ouml;r izinlerini &uuml;stlenir.</li>
	<li><strong>G&ouml;m&uuml;l&uuml; grup seviyelerini numaralandır</strong>: Numaralandırılabilecek g&ouml;m&uuml;l&uuml;, etki grubu &uuml;yelerinin sayısını belirleyin.</li>
</ul>

<h3>Etki Alanı Durum Kontrol&uuml;</h3>

<p><strong>Etki Alanı Durum Kontrol&uuml;</strong> &uuml;zerine tıklayarak DSM'niz ve katıldığı etki alanı sunucusu arasındaki bağlantının durumunu kontrol edebilirsiniz. Sorun giderme hakkında daha fazla bilgi i&ccedil;in, l&uuml;tfen aşağıdaki kontrol &ouml;ğelerine bakınız:</p>
<ul>
	<li><strong>Synology NAS ve Active Directory server arasında bağlantının uygun şekilde &ccedil;alışıp &ccedil;alışmadığını kontrol edin</strong>: Synology NAS, Active Directory server ile iletişim kuramadı.
		<ul>
			<li>Bağlantı noktaları 389, 139 ve 445'in Active Directory server &uuml;zerinde uygun şekilde &ccedil;alıştığından emin olun.</li>
			<li>NTDS hizmetinin Active Directory server &uuml;zerinde uygun şekilde &ccedil;alıştığından emin olun.</li>
		</ul>
	</li>
	<li><strong>Alt ağda &ccedil;akışan ana bilgisayar adlarının bulunup bulunmadığını kontrol edin</strong>: Synology NAS'ınız alt ağda mevcut olan ana bilgisayar adına sahip.
		<ul>
			<li>Synology NAS'ınız birden &ccedil;ok ağ arabirimi ile alt ağa bağlandıysa, DSM'niz uygun şekilde &ccedil;alışacaktır.</li>
			<li>Synology NAS'ınız tek bir ağ arabirimi ile alt ağa bağlıysa, l&uuml;tfen Synology NAS'ınızın ana bilgisayar adını değiştirin ve tekrar etki alanına katın.</li>
		</ul>
	</li>
	<li><strong>Synology NAS ve Kerberos sunucusu arasında bağlantının uygun şekilde &ccedil;alışıp &ccedil;alışmadığını kontrol edin</strong>: Synology NAS, kerberos sunucusuyla iletişim kuramadı.
		<ul>
			<li>Kerberos DNS SRV kaydının doğru olduğundan ve ilişkili A kaydının DNS sunucusu &uuml;zerinde mevcut olduğundan emin olun.</li>
			<li>KDC sunucusu &uuml;zerinde bağlantı noktası 88'in mevcut olduğundan emin olun.</li>
		</ul>
	</li>
	<li><strong>Synology NAS ve LDAP sunucusu arasında bağlantının uygun şekilde &ccedil;alışıp &ccedil;alışmadığını kontrol edin</strong>: Synology NAS, LDAP sunucusuyla iletişim kuramadı.
		<ul>
			<li>LDAP DNS SRV kaydının doğru olduğundan ve ilişkili A kaydının DNS Sunucuları &uuml;zerinde mevcut olduğundan emin olun.</li>
			<li>LDAP sunucusu &uuml;zerinde bağlantı noktası 389'un uygun şekilde &ccedil;alıştığından emin olun.</li>
		</ul>
	</li>
	<li><strong>Synology NAS ve etki alanı kontrol&ouml;r&uuml; arasında bağlantının uygun şekilde &ccedil;alıştığından emin olmak i&ccedil;in MTU kontrol&ouml;r&uuml;n&uuml;n doğru yapılandırılıp yapılandırılmadığını kontrol edin</strong>: Bir veya daha fazla svi&ccedil;, paketlerin ge&ccedil;ersiz MTU boyutu nedeniyle Synology NAS ve Aktif Dizin Sunucusu arasında aktarılan paketleri d&uuml;ş&uuml;rd&uuml;.
		<ul>
			<li>Synology NAS ve Aktif Dizin Sunucusu arasında svi&ccedil;lerin arabirim ayarlarını l&uuml;tfen kontrol edin.</li>
		</ul>
	</li>
	<li><strong>Synology NAS ve etki alanı arasında zamanın senkronize edilip edilmediğini kontrol edin</strong>: Synology NAS'ınızdaki zaman etki alanı sunucusu ile g&uuml;ncel değil.
		<ul>
			<li>Zamanı etki alanı sunucusu ile senkronize etmek i&ccedil;in Synology NAS'da NTP hizmetini kurabilir veya <strong>Bir etki alanı kullanıcısı her oturum a&ccedil;ışında Synology NAS bir NTP sunucusu ile senkronize olacaktır</strong> se&ccedil;eneğini <strong>Etki Alanı Se&ccedil;enekleri</strong> &ouml;ğesinde etkinleştirebilirsiniz.</li>
		</ul>
	</li>
</ul>

</body>
</html>