<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Paylaşımlı Klas&ouml;r Oluşturma - Synology DSM Yardım</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Shared folders are the basic directories where you can store and manage files and folders on your Synology NAS. This article shows you how to create a shared folder.">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Paylaşımlı Klas&ouml;r Oluşturma</h2>
<p>Paylaşımlı klas&ouml;rler, Synology NAS &uuml;r&uuml;n&uuml;n&uuml;zdeki dosyaları ve klas&ouml;rleri depolayıp y&ouml;netebileceğiniz temel dizinlerdir. Herhangi bir dosyayı depolamadan &ouml;nce DSM'de en az bir paylaşımlı klas&ouml;r oluşturmanız gerekecektir. </p>

<h4>Bir paylaşımlı klas&ouml;r oluşturmak i&ccedil;in:</h4>
<ol>
	<li><strong>Denetim Masası</strong> &gt; <strong>Paylaşımlı Klas&ouml;r</strong> &ouml;ğesine gidin ve <strong>Oluştur</strong>'a tıklayın.<br /><img src="about:blank" class="help_image"/></li>
	<li>Paylaşımlı klas&ouml;r i&ccedil;in bir ad ve a&ccedil;ıklama tanımlayın.<br /><img src="about:blank" class="help_image disable-bromolow disable-grantley disable-avoton disable-braswell disable-broadwell disable-kvmx64 disable-cedarview disable-apollolake disable-denverton"/><img src="about:blank" class="help_image enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"/></li>
	<li>Paylaşımlı klas&ouml;r&uuml; oluşturmak i&ccedil;in bir depolama alanı se&ccedil;in (zaten bir depolama alanı mevcutsa bu adımı atlayın).<br /><img src="about:blank" class="help_image disable-bromolow disable-grantley disable-avoton disable-braswell disable-broadwell disable-kvmx64 disable-cedarview disable-apollolake disable-denverton"/><img src="about:blank" class="help_image enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"/></li>
	<li>Gerekirse aşağıdaki se&ccedil;enekleri değiştirin:<br /><img src="about:blank" class="help_image disable-bromolow disable-grantley disable-avoton disable-braswell disable-broadwell disable-kvmx64 disable-cedarview disable-apollolake disable-denverton"/><img src="about:blank" class="help_image enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"/>
		<ul>
			<li><strong>&quot;Ağ Bağlantılarım&quot; i&ccedil;inde bu paylaşımlı klas&ouml;r&uuml; gizle:</strong> Paylaşımlı klas&ouml;r&uuml;n Windows File Explorer'da &quot;Ağ&quot; altında g&ouml;r&uuml;nmesine engel olur. Bu se&ccedil;enek, paylaşımlı klas&ouml;r&uuml;n erişim ayrıcalıklarını etkilemez.
				<div class="section"><h4>Not:</h4>
				<ul>
				<li>Bir paylaştırılmış klas&ouml;r&uuml;n &quot;Ağ Bağlantılarım&quot; i&ccedil;inde gizli yapılması erişim hakkını etkilemez. Gizli paylaşımlı klas&ouml;r&uuml;n erişim hakkı değişmeden kalacaktır. Paylaşımlı klas&ouml;r i&ccedil;in doğru erişim hakkına sahip kullanıcılar &quot;\\sunucu adı\paylaşımlı klas&ouml;r adı&quot; girerek bu klas&ouml;re erişebilirler.</li>
				</ul>
				</div>
			</li>
			<li><strong>İzinlere sahip olmayan kullanıcılardan alt klas&ouml;rleri ve dosyaları gizle:</strong> <strong>İzinlere sahip olmayan kullanıcılardan alt klas&ouml;rleri ve dosyaları gizle</strong> etkinleştirildiğinde, okuma ayrıcalıkları olmayan bir kullanıcı, Windows Dosya Paylaşımı protokol&uuml; aracılığıyla paylaşımlı bir klas&ouml;re erişmeye &ccedil;alışırsa, paylaşımlı klas&ouml;rdeki alt klas&ouml;rleri ya da dosyaları g&ouml;r&uuml;nt&uuml;leyemeyecektir. Bu, kullanıcıların Synology &uuml;r&uuml;nlerine bağlandıklarında ve a&ccedil;amadıkları &ccedil;ok sayıda dosya ve alt klas&ouml;rle karşılaştıklarında akıllarının karışmasını &ouml;nler.
				<div class="section"><h4>Not:</h4>
				<ul>
					<li>Bu &ouml;zellik yalnızca Windows Dosya Paylaşımı protokol&uuml;yle desteklenir.</li>
					<li>File Station'da her klas&ouml;r ve dosyanın ayrıcalık ayarlarını &uuml;zerine sağ tıklayarak değiştirebilirsiniz. A&ccedil;ılır men&uuml;den <strong>&Ouml;zellikler</strong>'i se&ccedil;in ve <strong>İzin</strong> sekmesi &uuml;zerine tıklayın.</li>
					<li><strong>İzinlere sahip olmayan kullanıcılardan alt klas&ouml;rleri ve dosyaları gizle</strong> se&ccedil;eneği etkinleştirilerek paylaşımlı klas&ouml;r&uuml;n kendisi izinlere sahip olmayan kullanıcılardan gizlenmez. Sadece bu paylaşımlı klas&ouml;r dahilindeki alt klas&ouml;rler ve dosyalar gizlenecektir.</li>
				</ul>
				</div>
			</li>
		</ul>
	</li>
	<li><strong>Geri D&ouml;n&uuml;ş&uuml;m Kutusunu Etkinleştir:</strong> Paylaşımlı klas&ouml;rdeki dosyalar silindiğinde bunlar <strong>#recycle</strong> isimli bir klas&ouml;re taşınacaktır. Geri d&ouml;n&uuml;ş&uuml;m kutusuna erişim, <strong>administrators</strong> grubundaki kullanıcılarla sınırlandırılabilir.</li>
	<a name="sharequota"></a><li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><strong>Paylaşılan klas&ouml;r kotasını etkinleştir:</strong> Her paylaşımlı klas&ouml;r i&ccedil;in maksimum kapasiteyi belirlemek i&ccedil;in, <strong>Paylaşımlı klas&ouml;r kotasını etkinleştir</strong> onay kutusunu işaretleyin ve takip eden alana maksimum kapasiteyi (&ouml;r. 10 GB) girin.
		<div class="section"><h4>Not:</h4>
		<ul>
			<li>Sadece depolama Btrfs dosya sistemini kullanırken, <strong>Paylaşımlı klas&ouml;r kotasını etkinleştir</strong> se&ccedil;eneği paylaşımlı klas&ouml;rler i&ccedil;in mevcut olacaktır.</li>
			<li>T&uuml;m kullanıcıların <strong>home</strong> dizinlerinin kombine depolama kullanımı &ldquo;<strong>homes</strong>&rdquo; kotasını aşamaz.</li>
		</ul>
		</div>
	</li>
	<a name="integrity_protection"></a><li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><strong>Gelişmiş veri b&uuml;t&uuml;nl&uuml;ğ&uuml; korumasını etkinleştir:</strong> <strong>CRC32 checksum</strong> ve <strong>yazma sırasında kopyala</strong> stratejilerine sahip bir paylaşımlı klas&ouml;r&uuml; korumak i&ccedil;in, paylaşımlı klas&ouml;r&uuml;n oluşturulması sırasında <strong>gelişmiş veri b&uuml;t&uuml;nl&uuml;ğ&uuml; koruması</strong> &ouml;zelliğini etkinleştirebilirsiniz. CRC32 checksum verilerin asıl yazıldıklarına benzer olup olmadığını kontrol etmek i&ccedil;in uygulanır ve herhangi bir bozulma tespit edildiğinde kullanıcıyı uyarır. Yazma sırasında kopyalama anormal sistem kapanması sırasında veri tutarlılığını iyileştirmeye yardımcı olur.
		<div class="section"><h4>Not:</h4>
		<ul>
			<li>Bu se&ccedil;enek sadece Btrfs dosya sistemini kullanan birimler i&ccedil;in mevcuttur.</li>
			<li>Oluşturulması sırasında her paylaşımlı klas&ouml;r i&ccedil;in bu se&ccedil;eneği etkinleştirebilir/devre dışı bırakabilirsiniz. Bu se&ccedil;enek paylaşımlı klas&ouml;r oluşturulduktan sonra değiştirilemez.</li>
			<li>Veritabanları gibi dosyalar d&uuml;zekli olarak d&uuml;zenleniyor veya g&uuml;ncelleniyorsa, yazma sırasında kopyala nedeniyle b&ouml;l&uuml;nm&uuml;ş dosyaların miktarı artabilir. Performansı artırmak i&ccedil;in bu se&ccedil;eneği devre dışı bırakmanız &ouml;nerilir.</li>
		</ul>
		</div>
	</li>
    <a name="btrfs_compression"></a><li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><strong>Dosya sıkıştırmasını etkinleştir</strong>: Oluşturulan paylaşımlı klas&ouml;rdeki veriler depolama alanından tasarruf etmek i&ccedil;in Btrf dosya sistemi tarafından otomatik olarak sıkıştırılacaktır. Kullanım i&ccedil;in alındığında, veriler otomatik olarak &ccedil;ıkartılacaktır.
		<div class="section"><h4>Not:</h4>
		<ul>
			<li>Bu se&ccedil;enek sadece bir Btrfs biriminde bir paylaşımlı klas&ouml;r oluşturduğunuzda veya <strong>Gelişmiş veri b&uuml;t&uuml;nl&uuml;ğ&uuml; koruması</strong> etkinleştirildiğinde kullanılabilir.</li>
			<li>Bu se&ccedil;enek paylaşımlı klas&ouml;r oluşturulduğunda değiştirilemez.</li>
			<li>Sıkıştırma oranı veri t&uuml;rleriyle farklılık g&ouml;sterir: Metin dosyaları en y&uuml;ksek sıkıştırma oranına sahipken, multimedya dosyaları (&ouml;r. g&ouml;r&uuml;nt&uuml;ler, m&uuml;zik veya videolar) iyi sıkıştırılmamış olabilir zira &ccedil;ıkış i&ccedil;in zaten sıkıştırılmışlardır.</li>
            <li>Paylaşımlı klas&ouml;r şifrelemesi etkinleştirilirse bu se&ccedil;enek etkinleştirilemez.</li>
		</ul>
		</div>
	</li>
	<li><strong>Bu paylaşımlı klas&ouml;r&uuml; şifrele:</strong> Paylaşımlı klas&ouml;r&uuml; şifrelemek isterseniz, aşağıdakini yapın:
		<ol>
			<li>Yeni bir şifreleme anahtarı belirleyip onaylayın. Şifreleme anahtarı virg&uuml;l (,) veya eşit (=) işareti i&ccedil;eremez. </li>
			<li>Gerekirse sistem başladığında şifrelenmiş klas&ouml;r&uuml; otomatik olarak tanıtmak amacıyla <strong>Anahtar Y&ouml;neticisine şifreleme anahtarını ekle</strong> kutusunu işaretleyin. Bu se&ccedil;enek devre dışı bırakılırsa Synology NAS bir sonraki kez yeniden başladığında şifrelenmiş paylaşımlı klas&ouml;r tanıtılmayacaktır. Tanıtılmamış paylaşımlı bir klas&ouml;r&uuml; g&ouml;r&uuml;nt&uuml;lemek veya ona erişmek i&ccedil;in şifreleme anahtarını alarak veya girerek klas&ouml;r&uuml; manuel olarak tanıtmanız gerekecektir.</li>
		</ol>
	</li>
	<li>Bitirmek i&ccedil;in <strong>Tamam</strong>'a tıklayın.</li>
</ol>

<div class="section"><h4>Paylaşımlı Klas&ouml;r Adlandırma Kuralları:</h4>
<ul>
	<li>Paylaşımlı klas&ouml;r adları b&uuml;y&uuml;k/k&uuml;&ccedil;&uuml;k harfe duyarlı değildir ve 1 ila -32 karakter i&ccedil;erebilir. Adlar, aşağıdaki karakterleri i&ccedil;eremez: <strong>! &quot; # $ % &amp; ' ( ) * + , / : ; &lt;= &gt; ? @ [ ] \ ^ ` { } | ~</strong></li>
	<li>Aşağıdaki adlar sistem kullanımı i&ccedil;in ayrılmıştır: <strong>.</strong>, <strong>..</strong>, <strong>global</strong>, <strong>home</strong>, <strong>homes</strong>, <strong>printers</strong>, <strong>public</strong>, <strong>satashare</strong>, <strong>surveillance</strong>, <strong>usbbackup</strong>, <strong>usbshare</strong>. </li>
	<li>Paylaşımlı klas&ouml;r adının ilk karakteri eksi işareti veya boşluk olamaz ve son karakter de boşluk karakteri olamaz.</li>
	<li>Paylaşımlı klas&ouml;r <strong>description</strong> b&uuml;y&uuml;k/k&uuml;&ccedil;&uuml;k harfe duyarlıdır ve en fazla 64 tane g&ouml;r&uuml;nt&uuml;lenebilir Unicode karakterle sınırlıdır.</li>
</ul>
</div>


<div class="section"><h4>Paylaşımlı Klas&ouml;rlerin Şifrelenmesi:</h4>
<p>AES 256 bit şifreleme, t&uuml;m yetkisiz erişim girişimlerini engelleyerek verileri korur. Bir paylaşımlı klas&ouml;r şifrelendiğinde, şifreleme anahtarına sahip olmayanlar, sabit s&uuml;r&uuml;c&uuml;lerinden Synology NAS &uuml;r&uuml;n&uuml;n&uuml; kaldırıp başka bir cihaza tanıtsalar bile şifrelenmiş verilere erişemez veya bunları değiştiremezler.</p>
</div>

<div class="section"><h4>Not:</h4>
<ul>
	<li>Şifrelenmiş bir paylaşımlı klas&ouml;r dahilindeki bir dosya veya klas&ouml;r&uuml;n adı 143 İngilizce karakteri veya 47 Asya (CJK) karakteri aşamaz; Mac OS dahilindeki paylaşımlı klas&ouml;rlerinize erişirseniz, şifrelenmiş bir paylaşımlı klas&ouml;r dahilindeki bir dosya veya klas&ouml;r&uuml;n adı 130 İngilizce karakteri veya 43 Asya (CJK) karakterini aşamaz.</li>
	<li>Şifrelenmiş paylaşımlı klas&ouml;rlere NFS yoluyla erişilemez.</li>
	<li>Synology NAS &uuml;zerinde yer alan reset d&uuml;ğmesini kullanarak varsayılan şifreleri geri y&uuml;klerseniz, şifrelenmiş paylaşımlı klas&ouml;rler kaldırılır ve şifrelenmiş paylaşımlı klas&ouml;rleri otomatik olarak tanıtma se&ccedil;eneği devre dışı bırakılır.</li>
	<li class="enable-dockerx64">Şifrelenmiş paylaşımlı klas&ouml;rler sadece y&uuml;ksek ayrıcalık modunda desteklenir. Bu &ouml;zelliği kullanmak i&ccedil;in, ana DSM'nizdeki Docker paketine gidin, şifrelenmiş paylaşımlı klas&ouml;rleri etkinleştirmek istediğiniz <strong>Docker DSM</strong>'yi se&ccedil;in, <strong>D&uuml;zenle</strong>'ye tıklayın ve <strong>Y&uuml;ksek ayrıcalıklar kullanarak konteyneri y&uuml;r&uuml;t</strong> yanındaki kutuyu işaretleyin.</li>
</ul>
</div>

</body>
</html>