<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Win/Mac/NFS</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SMB</h2>

<p>SMB (Server Message Block) protokol&uuml; SMB/CIFS desteğine sahip Windows, Mac ve Linux istemcilerinin Synology NAS &uuml;zerinde saklanan verilere erişmesini sağlar. Synology NAS i&ccedil;inde yer alan dosyaları Windows Explorer aracılığıyla aramak veya paylaşımlı dosyaları ağ s&uuml;r&uuml;c&uuml;leri olarak tanıtmak istiyorsanız, l&uuml;tfen <strong>Denetim Masası</strong> &gt; <strong>Dosya Hizmetleri</strong> &gt; <strong>SMB/AFP/NFS</strong> b&ouml;l&uuml;m&uuml;nde bu se&ccedil;eneği etkinleştirin.</p>


<h4>SMB protokol&uuml;n&uuml; etkinleştirmek i&ccedil;in:</h4>
<ol>
<li>
<b>SMB hizmetini etkinleştir</b>'i işaretleyin.
</li>
<li>
<b>Uygula</b>'ya tıklayın.
</li>
</ol>

<div class="section disable-hi3535">
<h4>Not:</h4>
<p>SMB protokol&uuml;n&uuml; etkinleştirdikten sonra, SMB yoluyla tam indekslenen klas&ouml;rleri Mac bilgisayarınıza tanıtabilirsiniz ve tanıtılan klas&ouml;rler i&ccedil;indeki dosyaları aramak i&ccedil;in Finder kullanabilirsiniz.</p>
</div>


<h3>&Ccedil;alışma grubu</h3>
<p>Bu se&ccedil;enek ağ y&ouml;netimi amacıyla sistemi belirli bir &ccedil;alışma grubunun &uuml;yesi olarak atamanızı sağlar.</p>

<div class="section">

<h4>Not:</h4>
<ul>
<li>&Ccedil;alışma grubunun adı 1'den 15'e kadar karakter i&ccedil;erebilir. Ad aşağıdaki karakterleri i&ccedil;eremez: [ ] ; : &quot; &lt; &gt; * + = \ / | ? ,</li>
<li>OS X 10.9 &ccedil;alıştıran bir Mac kullanıyorsanız ve Synology NAS cihazınız bir Windows etki alanına katılmışsa, SMB protokol&uuml; yoluyla Synology NAS &uuml;zerinde saklanan dosyalara erişmek i&ccedil;in Synology NAS kullanıcı adınızın &ouml;ncesinde <strong>localhost\</strong> ekleyerek oturum a&ccedil;abilirsiniz.</li>
</ul>
</div>

<h3 class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">&Ouml;nceki S&uuml;r&uuml;mlere erişime izin verme</h3>
<p class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Windows Explorer'da, kullanıcılar bir paylaşımlı klas&ouml;r dahilinde <strong>&Ouml;nceki S&uuml;r&uuml;mler</strong> sekmesine tıklayarak klas&ouml;rlerin veya dosyaların anlık g&ouml;r&uuml;nt&uuml;lerine erişebilirler ve bu sayede bir y&ouml;neticiden yardım almadan verileri geri y&uuml;kleyebilir veya kopyalayabilirler. <strong>&Ouml;nceki S&uuml;r&uuml;mlere erişime izin verme</strong> &ouml;ğesini se&ccedil;erseniz, &quot;&Ouml;nceki S&uuml;r&uuml;mler&quot; Sayfası herhangi bir bilgi g&ouml;r&uuml;nt&uuml;lemez.</p>

<div class="section enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><h4>Not :</h4>
<ul>
	<li>Kullanıcıların, ancak &ouml;nceki versiyon alındığında anlık g&ouml;r&uuml;nt&uuml; eşlendiğinde, kendi kullanıcı hesapları oluşturulduğunda ve kendilerine eşlenen anlık g&ouml;r&uuml;nt&uuml;n&uuml;n alındığı paylaşımlı klas&ouml;r&uuml;n okuma izni verildiğinde &ouml;nceki bir versiyona erişmelerine izin verilir.</li>
</ul>
</div>

<h3>Aktarım G&uuml;nl&uuml;ğ&uuml;n&uuml; Etkinleştirme</h3>
<p>Bu se&ccedil;eneğin işaretlenmesi dosyaları veya klas&ouml;rleri, SMB protokol&uuml; olarak ta bilinen CIFS/SMB protokol&uuml; aracılığıyla oluşturma, silme, okuma, yazma, taşıma ve yeniden adlandırma dahil olmak &uuml;zere dosya erişim işlemlerine giriş yapmaya olanak sağlar.</p>

<h3>Gelişmiş Ayarlar</h3>
<p>Aşağıdaki se&ccedil;enekleri g&ouml;rmek i&ccedil;in <strong>Gelişmiş Ayarlar</strong> d&uuml;ğmesine tıklayın.</p>
<ul>
<li><strong>WINS Sunucusu</strong>: Microsoft Windows Internet Name Service (WINS) bir NetBIOS addan-IP-adresine haritalama servisidir. Eğer sistem WINS sunucuya kaydedilecek şekilde yapılandırılmışsa Windows kullanıcıları sistemi TCP/IP ağlarına daha kolay yerleştirecektir.</li>
<li><strong>Maksimum SMB protokol&uuml;</strong>: Ağ yapılandırmanıza bağlı olarak, Synology NAS sunucunuz tarafından desteklenecek en yeni SMB protokol&uuml;n&uuml; belirleyin.
  <ul>
  <li><strong>SMB1</strong>: SMB1 (CIFS olarak da adlandırılır) Windows NT'den itibaren desteklenmektedir.</li>
    <li><strong>SMB2</strong>: SMB2, Windows Vista'dan bu yana desteklenmektedir ve SMB'nin geliştirilmiş s&uuml;r&uuml;m&uuml;d&uuml;r. SMB2, ağ paketlerinin sayısını azaltmak ve performansı artırmak i&ccedil;in bir&ccedil;ok SMB eylemini tek bir talep halinde birleştirme becerisi katar.</li>
    <li><strong>SMB2 ve B&uuml;y&uuml;k MTU</strong>: Maximum transmission unit (MTU) (Maksimum iletim birimi) bir iletişim protokol&uuml;nden ge&ccedil;irilebilen en b&uuml;y&uuml;k veri birimini tanımlar. 1- veya 10-gigabit Ethernet gibi daha hızlı ağ arabirimlerinin avantajından faydalanmak i&ccedil;in, B&uuml;y&uuml;k MTU maximum transmission unit'i 1 megabayta (MB) y&uuml;kseltir. B&uuml;y&uuml;k MTU'nun etkinleştirilmesi b&uuml;y&uuml;k dosya transferlerinin hızını ve verimini arttırırken, işlenmesi gereken paketlerin sayısını da azaltır.</li>
    <li><strong>SMB3</strong>: SMB3, Windows 8 ve Windows Server 2012'den bu yana desteklenmektedir. SMB2'nin geliştirilmiş s&uuml;r&uuml;m&uuml;d&uuml;r. SMB3, AES tabanlı dosya şifreleme iletimini destekler ve bu sayede eşler arası dosya aktarımlarının g&uuml;venliğini artırır.</li>
</ul>
<div class="section">
  <h4>Not:</h4>
  <ul>
    <li>SMB 2, Windows Vista, Windows Server 2008 R2, Windows 7 ve sonrasında desteklenir.</li>
    <li>B&uuml;y&uuml;k MTU, Windows Server 2008 R2, Windows 7 veya sonrasında desteklenir.</li>
    <li>Windows bilgisayarınızla b&uuml;y&uuml;k MTU'yu etkin hale getirmek i&ccedil;in, bilgisayarınızın kayıt defteri ayarlarını değiştirmeniz gerekir. Daha fazla bilgi i&ccedil;in, l&uuml;tfen Microsoft teknik desteğe başvurun (bu <a href="http://technet.microsoft.com/en-us/library/ff625695(v=ws.10).aspx" target="_blank">yazı</a> gibi).</li>
    </ul>
</div>
<li><strong>Minimum SMB protokol&uuml;</strong>: Ağ yapılandırmanıza bağlı olarak, Synology NAS sunucunuz tarafından desteklenecek en eski SMB protokol&uuml;n&uuml; belirleyin.</li>
<li><strong>Taşıma şifreleme modu</strong>: SMB3 etkinleştirildiğinde, SMB protokol&uuml; dosya iletim g&uuml;venliğini g&uuml;&ccedil;lendirmek i&ccedil;in taşıma şifrelemesi ekler.
  <ul>
    <li><b>Etkisizleştir</b>: Hi&ccedil;bir taşıma şifrelemesi uygulanmayacaktır.</li>
    <li><b>Otomatik</b>: Taşıma şifrelemesi sadece bu &ouml;zelliği destekleyen istemcilere uygulanacaktır.</li>
    <li><b>Zorla</b>: Taşıma şifrelemesi her zaman uygulanacaktır. Bu, taşıma şifrelemesini desteklemeyen istemcilerin SMB protokol&uuml; kullanamamasına neden olur.</li>
  </ul>
</li>
<div class="section">
  <h4>Not:</h4>
  <ul>
    <li>Taşıma şifrelemesi Windows 8, Windows Server 2012 ve sonrasında desteklenir.</li>
    <li>SMB protokol&uuml; i&ccedil;in anonim oturum a&ccedil;ma taşıma şifrelemesi etkinleştirildiğinde desteklenmez.</li>
    <li>Taşıma şifrelemesi etkinleştirildiğinde, uygulama zaman aşımlarına engel olmak i&ccedil;in <b>Opportunistic Locking'i Devre Dışı Bırak</b> &ouml;ğesini işaretlemeden bırakın.</li>
    </ul>
</div>
<li><strong>Opportunistic Locking'i Etkinleştir</strong>: CIFS'ın &quot;Opportunistic Locking&quot; &ouml;zelliğini etkinleştirmeyi se&ccedil;in ve b&ouml;ylece istemci dosya i&ccedil;eriğini daha iyi &ouml;nbelleğe alabilir ve k&uuml;&ccedil;&uuml;k okuma/yazma ek y&uuml;k&uuml;nden ka&ccedil;ınılır. Bu opsiyon se&ccedil;imi kaldırıldığında, veritabanı uygulamaları ağ yoluyla Synology NAS sunucusunda saklanan veritabanı dosyalarına erişmede daha iyi performans g&ouml;sterir.
	<ul>
    <li><strong>SMB2 kirasını etkinleştir</strong>: Bu se&ccedil;eneğin etkinleştirilmesi diğer SMB2 ilişkili ayarların Opportunistic Locking tarafından sunulan istemci &ouml;nbelleğe alma mekanizmasını hassas ayarlamasını sağlar.</li>
    </ul>

</li>



<li>
  <strong>Local Master Browser'ı Etkinleştir</strong>: Birden fazla Windows bilgisayarı aynı ağ dahilinde mevcut olduğunda, m&uuml;zakere ederler ve bir bilgisayarı &quot;local master browser&quot; olarak se&ccedil;erler. Local master browser alt ağ dahilindeki diğer bilgisayarların ve paylaşılan kaynaklarının listelerini muhafaza eder ve bu listeleri diğer bilgisayarlarla paylaşır. Bu se&ccedil;enek Synology NAS'in local master browser'ın g&ouml;revini &uuml;stlenmesini sağlar.
</li>

<div class="section">
<h4>Not:</h4>
<p>Bu işlevin etkinleştirilmesi sabit disk uykusunu devre dışı bırakır ve parolasız misafir hesabını etkin kılar.</p>
</div>


<li><strong>DirSort VFS mod&uuml;l&uuml;n&uuml; etkinleştir</strong>: Klas&ouml;r adlarını sıralar ve alfabetik olarak listeler. Bu se&ccedil;eneğin etkinleştirilmesi sistem performansını etkiler.</li>

<li><strong>Dosyaları veto et</strong>: Belirlenen kritere g&ouml;re dosyaları gizler. Kriter joker karakterler (*) i&ccedil;erebilir ve &ccedil;ok sayıda giriş bir b&ouml;lme işareti (/) ile ayrılır. &Ouml;rnek: <i>/abc*/*.txt/*.conf/</i>. Bu se&ccedil;eneğin etkinleştirilmesi sistem performansını etkiler.</li>

<li><strong>Paylaşımlı klas&ouml;rler dahilinde sembolik bağlantılara izin ver</strong>: Sembolik bağlantıların aynı paylaşımlı klas&ouml;r dahilinde dosyalara veya klas&ouml;rlere y&ouml;nelmesini sağlamak i&ccedil;in se&ccedil;in. Sembolik bağlantılar DSM terminali kullanılarak oluşturulabilir.
<ul>
	<li><strong>Paylaşımlı klas&ouml;rler boyunca sembolik bağlantılara izin ver</strong>: Sembolik bağlantıların farklı paylaşımlı klas&ouml;rlerde bulunan dosyalara veya klas&ouml;rlere y&ouml;nlendirilmesini sağlamak i&ccedil;in se&ccedil;in. Sembolik bağlantılar DSM terminali kullanılarak oluşturulabilir. Ancak, ayrıcalıksız kullanıcılar sembolik bağlantıların hedef paylaşımlı klas&ouml;rlerine erişebilirler.</li>
</ul>
</li>


<li><strong>Mac &ouml;zel karakterlerini d&ouml;n&uuml;şt&uuml;rmek i&ccedil;in VFS mod&uuml;l&uuml;n&uuml; etkinleştir</strong>: Dosya oluşturma sırasında dosya adlarındaki SMB'ye ayrılmış karakterleri (&ouml;r. &lt;   &gt;  &quot; * ?) Temel Latinceye d&ouml;n&uuml;şt&uuml;rmek i&ccedil;in se&ccedil;in. B&ouml;yle dosyalar AFP yoluyla tanınabilir olacaktır.</li>
<li><strong>MSDFS VFS mod&uuml;l&uuml;n&uuml; etkinleştir</strong>: Sembolik bağlantıların diğer SMB sunucularında bulunan dosyalara veya klas&ouml;rlere y&ouml;nlendirilmesini sağlar. Windows XP gibi eski Windows s&uuml;r&uuml;mlerinde, istemci ve Synology NAS bu se&ccedil;eneğin etkinleştirilmesi &ouml;ncesinde bir Windows etki alanına katılmalıdır. MSDFS bağlantılarının oluşturulması hakkında daha fazla bilgi almak i&ccedil;in, l&uuml;tfen <a href="http://www.samba.org/samba/docs/man/Samba-HOWTO-Collection/msdfs.html" target=_blank>buraya</a> bakın. Bu se&ccedil;eneğin devre dışı bırakılması sonrasında, istemci aygıtının &ouml;nbelleği temizlenmelidir, aksi halde normal performans bundan etkilenebilir.</li>

<li><strong>Aynı IP adresinden &ccedil;ok sayıda bağlantıyı devre dışı bırak</strong>: Bu se&ccedil;enek etkinleştirildiğinde, Synology NAS, SMB protokol&uuml;n&uuml; kullanan istemcilerden IP adresi başına sadece bir bağlantıya izin verir. Aynı IP adresine sahip &ccedil;ok sayıda istemci SMB protokol&uuml;n&uuml; kullanırken, Synology NAS en sonuncuyu korur ve daha eski bağlantıları bırakır. Bir NAT ortamında, istemci tek bir IP adresini kullanabilir, bu durumda bu se&ccedil;eneğin etkinleştirilmesi normal performansı etkileyebilir.</li>

<li><strong>Hata ayıklama g&uuml;nl&uuml;klerini topla</strong>: Bu se&ccedil;enek etkinleştirildiğinde, hata ayıklama amacıyla ayrıntılı g&uuml;nl&uuml;kler kaydedilir. Bu se&ccedil;eneğin etkinleştirilmesi sistem performansını etkiler.</li>
<li><strong>Varsayılan UNIX izinlerini uygula</strong>: Dosyaları ve klas&ouml;rleri y&uuml;klerken veya oluştururken varsayılan UNIX izinlerini uygulamak i&ccedil;in bu se&ccedil;eneği etkinleştirin. UNIX izni dosyalar i&ccedil;in 744 ve klas&ouml;rler i&ccedil;in 755 olacaktır. Bu se&ccedil;enek devre dışı bırakıldığında, UNIX izni dosyalar ve klas&ouml;rler i&ccedil;in 777'dir.</li>
<div class="section enable-eds14">
<h4>Not:</h4>
<ul>
<li>Bu se&ccedil;eneğin etkinleştirilmesi farklı protokoller arasında tutarsız izin sorunlarına neden olabilir. Tutarsızlıkları &ouml;nlemek i&ccedil;in, bu se&ccedil;eneği devre dışı bırakmanızı &ouml;neririz.</li>
</ul>
</div>
<div class="section disable-eds14">
<h4>Not:</h4>
<ul>
  <li>Windows ACL etkin paylaşımlı klas&ouml;rler (harici s&uuml;r&uuml;c&uuml;lerde bulunan &quot;photo&quot; ve paylaşımlar hari&ccedil; t&uuml;m paylaşımlar) i&ccedil;in, klas&ouml;r ve dosya izni tiplerini Windows ACL'den UNIX'e değiştirmek amacıyla <strong>chmod</strong> komutunu Linux veya FTP istemcinizde &ccedil;alıştırın.</li>
  <li>Bu se&ccedil;eneğin etkinleştirilmesi farklı protokoller arasında tutarsız izin sorunlarına neden olabilir. Tutarsızlıkları &ouml;nlemek i&ccedil;in, bu se&ccedil;eneği devre dışı bırakmanızı &ouml;neririz.</li>
</ul>
</div>
<li><b>Dosyaları oluştururken disk alanını rezerve etme</b>: Synology NAS sunucunuzda dosyalar oluştururken disk alanının ayrılmasına izin vermemek i&ccedil;in bu se&ccedil;eneği etkinleştirin.</li>
<li><strong>SMB dayanıklı tutamakları etkinleştir (Protokoller arası dosya kilitleme devre dışı bırakılacak)</strong>: Bu se&ccedil;eneğin etkinleştirilmesi kullanıcıların ge&ccedil;ici bağlantı kesilmesi sonrasında bu Synology NAS sunucusuna kayıp SMB2 bağlantısını tekrar sağlamalarına olanak tanır; a&ccedil;ılan dosyalar ağ kesintisi sırasında ulaşılabilir kalacaktır. Yine de, protokoller arası dosya kilitleme devre dışı bırakılacaktır b&ouml;ylece kullanıcılar SMB2 olmayan protokoller (&ouml;r. AFP) yoluyla kilitli bir dosyaya erişip modifiye edebilirler.</li>
<li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><b>Btrfs hızlı klonunu etkinleştir</b>: Bu se&ccedil;eneğin etkinleştirilmesi, hem kaynak hem de hedef aynı Btrfs birimi dahilinde iken kullanıcıların dosyaları daha y&uuml;ksek hızlarla koplamalarına olanak tanır.</li>
<li><strong>SMB &ouml;nbelleğini temizle</strong>: Sorun giderme amacıyla aşağıdaki SMB &ouml;nbellek dosyalarını silmek i&ccedil;in bu d&uuml;ğmeye tıklayın:
  <ul>

<li>/var/cache/samba/netsamlogon_cache.tdb</li>
<li>/var/lib/samba/winbindd_cache.tdb</li>
<li>/var/lib/samba/share_info.tdb</li>
<li>/var/lib/samba/registry.tdb</li>
<li>/run/samba/connections.tdb</li>
<li>/run/samba/gencacche.tdb</li>
<li>/run/samba/gencache_notran.tdb</li>
</ul>
</li>

</ul>

</body>
</html>
