<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>G&uuml;&ccedil;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Genel</h2>

<p>
<strong>Denetim Masası</strong> &gt; <strong>Donanım ve G&uuml;&ccedil;</strong> &gt; <strong>Genel</strong> &ouml;ğesi, g&uuml;&ccedil; toparlanması, Wake on LAN (WOL) veya Bellek Sıkıştırmayı etkinleştirmeye y&ouml;nelik se&ccedil;enekler sağlar. Burada aynı zamanda bip kontrol&uuml;n&uuml; ve fan hızı modunu da değiştirebilirsiniz.
</p>

<h3>Bellek D&uuml;zeni*</h3>
<p>Aşağıdaki bellek d&uuml;zeni se&ccedil;enekleri video kod d&ouml;n&uuml;şt&uuml;rme performansını etkiler:</p>
<ul>
<li><strong>Tek 1080p kod d&ouml;n&uuml;şt&uuml;rmeye izin ver:</strong> 4K video kod d&ouml;n&uuml;şt&uuml;rme asla kullanılmazsa daha iyi genel sistem performansı i&ccedil;in &ouml;nerilir.</li>
<li><strong>Tek 4K kod d&ouml;n&uuml;şt&uuml;rmeye izin ver:</strong> Video kod d&ouml;n&uuml;şt&uuml;rme i&ccedil;in daha fazla bellek ayırır, 4K kod d&ouml;n&uuml;şt&uuml;rme kullanılırken &ouml;nerilir.</li>
</ul> 

<h3>
G&uuml;&ccedil; Toparlanması
</h3>
<p>Sistem beklenmeyen g&uuml;&ccedil; kesilmesinden dolayı kapanırsa, g&uuml;&ccedil; geri geldikten sonra g&uuml;&ccedil; toparlanması işlevi sayesinde sistem otomatik olarak &ouml;ny&uuml;kleme yapar.</p>
<h3>Yerel Ağda Uyandırma*</h3>
<p>Wake on LAN (WOL) &ouml;ğesinin etkinleştirilmesi, Synology Assistant, DS finder veya diğer WOL uygulamaları gibi bir WOL uygulamasını kullanarak Synology NAS &uuml;r&uuml;n&uuml;n&uuml;z&uuml;n IP adresi (veya&nbsp;DDNS&nbsp;ana makine adı) ile MAC adresini girerek yerel alan ağı veya İnternet &uuml;zerinden Synology NAS &uuml;r&uuml;n&uuml;n&uuml;z&uuml; a&ccedil;manıza olanak tanır.</p>
<p>Wake on LAN yalnızca <b>G&uuml;&ccedil;</b> d&uuml;ğmesine basarak veya DSM aray&uuml;z&uuml;nde <b>Kapanış</b>'ı se&ccedil;erek Synology NAS &uuml;r&uuml;n&uuml;n&uuml;n d&uuml;zg&uuml;n bir şekilde kapatılmasından sonra &ccedil;alışır. Kapanıştan sonra elektrik kablosunu &ccedil;alışan bir prize takılı şekilde tutun.</p>
<div class="section">
	<h4>Not:</h4>
	<p class="disable-rc18015xsp">WOL &ouml;zelliği 10GbE LAN bağlantı noktalarında desteklenmez (Synology NAS sunucunuzda mevcutsa).</p>
	<ul class="enable-rc18015xsp">
		<li>WOL &ouml;zelliği 10GbE LAN bağlantı noktalarında desteklenmez (Synology NAS sunucunuzda mevcutsa).</li>
		<li>WOL &ouml;zelliği varsayılan olarak Synology NAS i&ccedil;in olan 1 GbE LAN portlarında etkindir ve devre dışı bırakılamaz.</li>
	</ul>
</div>
<h3>Fan Hızı Modu*</h3>
<p>Aşağıdaki fan hızı se&ccedil;enekleri bulunmaktadır:</p>
<ul>
<li><strong>Tam Hız Modu:</strong> Fan, tam hızda &ccedil;alışarak Synology NAS &uuml;r&uuml;n&uuml;n&uuml; soğutur ama daha fazla ses &ccedil;ıkarır.</li>
<li><strong>Soğutma Modu:</strong> Fan, daha y&uuml;ksek hızda &ccedil;alışarak Synology NAS &uuml;r&uuml;n&uuml;n&uuml; soğutur ama daha fazla ses &ccedil;ıkarır.</li>
<li><strong>Sessiz Modu:</strong> Fan, daha d&uuml;ş&uuml;k hızda &ccedil;alışarak az ses &ccedil;ıkarır ama Synology NAS ısınabilir.</li>
<li><strong>D&uuml;ş&uuml;k G&uuml;&ccedil; Modu:</strong> Fan, daha d&uuml;ş&uuml;k hızda &ccedil;alışarak az ses &ccedil;ıkarır ama Synology NAS ısınabilir. Bunun yanı sıra, Synology NAS soğukken, g&uuml;&ccedil; tasarrufu yapmak i&ccedil;in fan duracaktır. D&uuml;ş&uuml;k g&uuml;&ccedil; modu yalnızca belirli modellerde vardır.</li>
</ul>
<h3>Bip Denetimi</h3>
<p>Synology NAS sunucusu belirli olaylar veya hatalar olduğunda bir bipleme sesi yayabilir. Hatalar meydana geldiğinde Synology NAS &uuml;r&uuml;n&uuml;n&uuml;z&uuml;n sizi ikaz etmesine izin vermek i&ccedil;in listelenen onayların onay kutularına tıklayın.</p>

<h4>Bip sesini durdurmak i&ccedil;in:</h4>
<ul>
<li>Synology NAS bip sesi veriyorsa, devre dışı bırakmak i&ccedil;in <strong>Bip kapalı</strong> d&uuml;ğmesine tıklayın. </li>
</ul>



<h3>Bellek Sıkıştırma*</h3>
<p>En eski kullanılan verileri belleğe sıkıştırmak suretiyle genel sistem tepkiselliğini iyileştirmek &uuml;zere Bellek Sıkıştırmasını etkinleştirebilirsiniz.</p>
<p>Birden &ccedil;ok uygulamanız &ccedil;alışır ve bellek dolmaya başlarken dinamik Bellek Sıkıştırma, bellekte az kullanılan &ouml;ğelerin boyutunu k&uuml;&ccedil;&uuml;lterek bellek kullanımını asgari d&uuml;zeye indirir. &Ouml;ğelere tekrar gerek olduğunda bunlar hemen a&ccedil;ılabilir. Bu da diskteki bellek değişimli dosyaların okunması ve yazılması ihtiyacını azaltarak verimi ve tepkiselliği iyileştirir.</p>
<p>Bellek Sıkıştırmasını etkinleştirmek i&ccedil;in onay kutusunu işaretleyin.</p>

<h3>LED*</h3>

<p><strong>Denetim Masası</strong> &gt; <strong>Donanım ve G&uuml;&ccedil;</strong> &gt; <strong>Genel</strong> &gt; <strong>LED Parlaklık Kontrol&uuml;</strong> &ouml;ğesinde, Synology NAS sunucunuzda LED g&ouml;stergelerin parlaklığını ayarlayabilirsiniz.</p>

<div class="section">
<h4>Not:</h4>
<p>Parlaklık ayarları Synology NAS sunucunuzdaki t&uuml;m LED g&ouml;stergelere uygulanır (&ouml;r. Power, STATUS, LAN, s&uuml;r&uuml;c&uuml; durumu vb.).</p>
</div>


<h4>LED parlaklığını ayarlamak i&ccedil;in:</h4>
<p>Synology NAS sunucunuzdaki LED g&ouml;stergeler i&ccedil;in d&ouml;rt parlaklık seviyesi mevcuttur.</p>
<ol>
<li>Parlaklık &ouml;l&ccedil;eğindeki ibreyi herhangi bir y&ouml;nde tıklayıp s&uuml;r&uuml;kleyin:
  <ul>
<li>Sağa doğru: LED parlaklığını artırın.</li>
<li>Sola doğru: LED parlaklığını azaltın.</li>
</ul>
</li>
<li>Ayarı kaydetmek i&ccedil;in <strong>Uygula</strong>'ya tıklayın.</li>
</ol>



<h4>LED parlaklığını programa g&ouml;re ayarlamak i&ccedil;in:</h4>
<p>LED g&ouml;stergeler parlaklık seviyelerini programlanan s&uuml;rede değiştirebilirler.</p>

<ol>
<li><strong>Program Ayarla</strong>'ya tıklayın.</li>
<li>Aşağıdaki parlaklık t&uuml;r&uuml;nden birisine tıklayın:
<ul>
<li><strong>Varsayılan parlaklık</strong>: En tam parlaklık</li>
<li><strong>Ayarlanan parlaklık</strong>: Parlaklık &ouml;l&ccedil;eğinde belirtilen parlaklık seviyesi</li>
<li><strong>Kapalı</strong>: LED kapalı</li>
</ul>
</li>
<li>Parlaklık programını &ouml;zelleştirmek i&ccedil;in istenilen periyotlara tıklayın.</li>
<li>Ayarları kaydetmek i&ccedil;in <strong>Tamam</strong> ve <strong>Uygula</strong>'ya tıklayın.</li>
</ol>



<p>____<br> * Sadece belirli modellerde vardır. </p>
</body>
</html>
