<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Harici Aygıtlar</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="usbprinter"></a>Yazıcılar</h2>
<p>Synology NAS, istemci bilgisayarların ya da mobil aygıtların Synology NAS &uuml;r&uuml;n&uuml;ne bağlı yazıcılara erişmesine olanak tanıyan bir yazdırma sunucusu olabilir. Bunun yanı sıra, Apple Kablosuz Yazdırma ve Google Cloud Print desteği, iOS aygıtlarını ya da Google &uuml;r&uuml;nleri ve hizmetlerini kullanarak uzaktan yazdırmanıza olanak tanır.</p>
<p>Uyumlu yazıcılar i&ccedil;in <a href="http://www.synology.com" target="_blank">www.synology.com</a> adresini ziyaret edin.</p>

<h3>Yazıcıları Kurma</h3>
<p>Bir <span class="disable-rc18015xsp">USB ya da</span> ağ yazıcısını kurmak ve Synology NAS &uuml;r&uuml;n&uuml;n&uuml;ze bağlamak i&ccedil;in aşağıdaki talimatlara bakın.</p>


<h4 class="disable-rc18015xsp"><a id="t1"></a>Bir USB yazıcısı kurma:</h4>
<ol class="disable-rc18015xsp">
<li>Yazıcıyı a&ccedil;ıp, Synology NAS &uuml;zerindeki bir USB bağlantı noktasına bağlayın.</li>
<li><strong>Denetim Masası</strong> &gt; <strong>Harici Aygıtlar</strong> &gt; <strong>Yazıcı</strong>'ya gidin.</li>
<li>Kurmak istediğiniz yazıcıyı se&ccedil;in. L&uuml;tfen Synology NAS &uuml;r&uuml;n&uuml;n&uuml;n USB yıldız g&ouml;bekler aracılığıyla bağlı yazıcıları tanıyamadığına dikkat edin.</li>
<li><b>Yazıcı Y&ouml;neticisi</b>'ne tıklayıp <b>Yazıcı Kur</b>'u se&ccedil;in.</li>
<li>İletişim kutusunda aşağıdaki modlardan birini se&ccedil;in:
<ul>
<li><b>Ağ MFP:</b> Yerel ağ i&ccedil;indeki istemcilerin, &ccedil;ok işlevli yazıcınızın yazdırma, tarama ve faks işlevlerini kullanmasına olanak tanır. Tarama ve faks işlevleri yalnızca Windows bilgisayarları tarafından kullanılabilir.</li>
<li><b>Ağ Yazıcısı:</b> Yalnızca yazdırmayı destekleyen yazıcılar i&ccedil;in veya istemcilerin yalnızca yazdırma işlevini kullanmalarına izin vermek istediğinizde bu modu se&ccedil;in.</li>
</ul>
</li>
<li>Apple Kablosuz Yazdırma ya da Google Cloud Print ayarlarını yapılandırın (isteğe bağlı).</li>
<li><b>Kaydet</b>'e tıklayın.</li>
</ol>

<div class="section disable-rc18015xsp">
<h4>Not:</h4>
<ul>
<li>Bir ağ MFP'sine sadece bir istemci tarafından eş zamanlı olarak erişilebilir.</li>
</ul>
</div>

<h4>Bir ağ yazıcısı kurmak i&ccedil;in:</h4>
<ol>
<li>Ağ yazıcısını a&ccedil;ın ve Synology NAS &uuml;r&uuml;n&uuml;n&uuml;zle aynı yerel ağa bağlayın.</li>
<li><strong>Denetim Masası</strong> &gt; <strong>Harici Aygıtlar</strong> &gt; <strong>Yazıcı</strong>'ya gidin.</li>
<li><b>Ağ Yazıcısı Ekle</b>'ye tıklayıp, kurulum sihirbazının talimatlarını izleyin.</li>
</ol>

<div class="section">
<h4>Not:</h4>
<ul>
<li><strong>Yazıcı Adı:</strong> Kurulum sırasında bir yazıcı adı girilmelidir ve harfler, sayılar ve alt &ccedil;izgilerle birlikte en fazla 32 karakter i&ccedil;erebilir.</li>
	<li><strong>Protokol:</strong> Genelde, HP ağ yazıcıları Soket, Canon ağ yazıcıları BJNP ve diğerleri de &ccedil;oğunlukla LPR kullanır.</li>
<li><strong>Kuyruk Adı:</strong> LPR ve IPP ağ yazıcıları i&ccedil;in bir kuyruk adının girilmesi gereklidir ama Soket ya da BJNP yazıcılara uygulanmaz.</li>
<li><strong>Network MFP Yok:</strong> Synology NAS &uuml;r&uuml;n&uuml;ne bağlı ağ yazıcıları şu an i&ccedil;in Ağ MFP modunu kullanamaz.</li>
<li><strong>USB Yazıcılar Yok:</strong> Bir Synology &uuml;r&uuml;n&uuml; tarafından paylaşılan USB yazıcılar, ağ yazıcıları olarak ayarlanamaz.</li>
</ul>
</div>

<div class="disable-rc18015xsp">
<h4>Bir Mac kullanarak PostScript USB yazıcısı kurmak i&ccedil;in:</h4>
<p><strong>Mac OS 10.6.X i&ccedil;in:</strong></p>
<ol>
<li><a href="system_externaldevice_printer.html#t1">Bir USB yazıcısı kurma</a> adımlarını izleyin.</li>
<li>Mac'inizde, <b>Sistem Tercihleri</b> &gt; <b>Yazıcı ve Faks</b>'a gidin ve ardından yeni bir yazıcı eklemek i&ccedil;in <strong>+</strong> işaretine tıklayın.</li>
<li><strong>IP</strong> tercihini yapın.</li>
<ul>
	<li><strong>Protokol</strong> i&ccedil;in <strong>Satır Yazıcı Daemon - LPD</strong> se&ccedil;imi yapın.</li>
	<li>Yazıcının IP adresini girin.</li>
	<li>&quot;usbprinter&quot; değerini <strong>Kuyruk</strong> Alanına girin.</li>
	<li><strong>Kullanarak Yazdır</strong> i&ccedil;in <strong>Genel PostScript Yazıcı</strong> se&ccedil;imini yapın.</li>
	<li>Bitirmek i&ccedil;in <strong>Ekle</strong> &uuml;zerine tıklayın.</li>
</ul>
</ol>
<div class="section">
<h4>Not:</h4>
<ul>
<li>AppleTalk artık Mac OS 10.6.X tarafından desteklenmemektedir. Bir AppleTalk yazıcı kullanmanız gerekiyorsa, Mac bilgisayarınıza veya yerel ağınıza bağlamanın olası bir yolu i&ccedil;in belgelerini okuyun. Yazıcıyı bağlamanın hi&ccedil;bir yolu yoksa, Mac OS 10.5.X veya daha &ouml;nceki s&uuml;r&uuml;me sahip bir Mac'e bağlayın ve paylaşılacak şekilde kurun.</li>
</ul>
</div>

<p><strong>Mac OS 10.5.X i&ccedil;in:</strong></p>
<ol>
<li><a href="system_externaldevice_printer.html#t1">Bir USB yazıcısı kurma</a> adımlarını izleyin.</li>
<li>Mac'inizde, <b>Sistem Tercihleri</b> &gt; <b>Yazıcı ve Faks</b>'a gidin ve ardından yeni bir yazıcı eklemek i&ccedil;in <strong>+</strong> işaretine tıklayın.</li>
<li>Bir y&ouml;ntem se&ccedil;in.</li>
<ul>
	<li>Y&ouml;ntem 1: <strong>AppleTalk</strong></li>
	<ul>
		<li><strong>Kullanarak Yazdır</strong> i&ccedil;in <strong>Genel PostScript Yazıcı</strong> se&ccedil;imini yapın.</li>
		<li>Bitirmek i&ccedil;in <strong>Ekle</strong> &uuml;zerine tıklayın.</li>
	</ul>
	<li>Y&ouml;ntem 2: <strong>IP</strong></li>
	<ul>
		<li>Protokol i&ccedil;in <strong>Satır Yazıcı Daemon - LPD</strong> se&ccedil;imi yapın.</li>
		<li>Yazıcının IP adresini girin.</li>
		<li>&quot;usbprinter&quot; değerini <strong>Kuyruk</strong> Alanına girin.</li>
		<li><strong>Kullanarak Yazdır</strong> i&ccedil;in <strong>Genel PostScript Yazıcı</strong> se&ccedil;imini yapın.</li>
		<li>Bitirmek i&ccedil;in <strong>Ekle</strong> &uuml;zerine tıklayın.</li>
	</ul>
</ul>
</ol>
</div>

<h3>Yazıcıları Y&ouml;netme</h3>
<p>Yazıcı sekmesi, Synology NAS &uuml;r&uuml;n&uuml;ne bağlı <span class="disable-rc18015xsp">USB ya da</span> ağ yazıcılarını y&ouml;netmek i&ccedil;in aşağıdaki se&ccedil;enekleri i&ccedil;erir.</p>

<ul>
<li><b>Bilgi Al:</b> Se&ccedil;ilen yazıcıyla ilgili, aygıt adı, &uuml;retici, durum vb. bilgileri g&ouml;r&uuml;nt&uuml;ler.</li>
<li><strong>Kaldır:</strong> Bir yazıcıyı kaldırır ve Synology NAS &uuml;r&uuml;n&uuml;nden bağlantısını keser.</li>
<li><strong>Yazıcı Y&ouml;neticisi:</strong> Aşağıdaki se&ccedil;enekleri i&ccedil;erir:
<ul>
<li><strong>Yazıcı Kur</strong>: Apple Kablosuz Yazdırma ya da Google Cloud Print gibi yazıcı ayarlarını d&uuml;zenleyin (aşağıdaki talimatlara bakın).</li>
<li><strong>Kuyruk alanını temizle:</strong> T&uuml;m yazıcılardaki t&uuml;m yazdırma g&ouml;revlerini iptal eder.</li>
<li><strong>Test Sayfasını Yazdır:</strong> Yapılandırmaların doğru olduğundan emin olmak i&ccedil;in bir test sayfası yazdırın.</li>
<li><b>Yazıcıyı Serbest Bırak:</b> Yazıcı ve istemcinin bağlantısını kesin (yalnızca Network MFP modu i&ccedil;in). Bir istemci, faks almak ya da dosyaları taramak i&ccedil;in &ccedil;ok işlevli bir yazıcıya bağlandığında g&ouml;rev uzun zaman alabilir. Gerekirse, sıradaki diğer istemcinin yazıcıya erişmesine olanak tanımak i&ccedil;in bağlantı durdurulabilir.</li>
</ul></li>
</ul>


<h4>Apple Kablosuz Yazdırma'yı etkinleştirmek i&ccedil;in:</h4>
<ol>
<li><strong>Denetim Masası</strong> &gt; <strong>Harici Aygıtlar</strong> &gt; <strong>Yazıcı</strong>'ya gidin.</li>
<li>Aygıt listesinden bir yazıcı se&ccedil;in.</li>
<li><b>Yazıcı Y&ouml;neticisi</b> &gt; <b>Yazıcı Kur</b>'a tıklayın.</li>
<li><b>Apple Kablosuz Yazdırma'yı Etkinleştir</b> kutusunu işaretleyin.</li>
<li>Yazıcınızın markasını ve s&uuml;r&uuml;c&uuml;s&uuml;n&uuml; se&ccedil;in.</li>
<li><b>Kaydet</b>'e tıklayın.</li>
</ol>

<p>Kurulum tamamlandıktan sonra, <b>Yazıcı Y&ouml;neticisi</b> &gt; <b>Test Sayfasını Yazdır</b>'a tıklayarak bir test sayfası yazdırabilirsiniz.</li>

<div class="section">
<h4>Not:</h4>
<ul>
<li>Apple Kablosuz Yazdırma'yı etkinleştirmek, DSM i&ccedil;in Bonjour Yazıcı Yayınını da etkinleştirir.</li>
<li>Apple Kablosuz Yazdırma iOS 4.2 veya sonrası i&ccedil;in kullanılabilir.</li>
</ul>
</div>


<h4>Google Cloud Print'i etkinleştirmek i&ccedil;in:</h4>
<ol>
<li><strong>Denetim Masası</strong> &gt; <strong>Harici Aygıtlar</strong> &gt; <strong>Yazıcı</strong>'ya gidin.</li>
<li>Aygıt listesinden bir yazıcı se&ccedil;in.</li>
<li><b>Yazıcı Y&ouml;neticisi</b> &gt; <b>Yazıcı Kur</b>'a tıklayın.</li>
<li><b>Google Cloud Print&rsquo;i Etkinleştir</b> onay kutusunu işaretleyin.</li>
<li>Aşağıdaki ayrıntıları girin:
<ul>

<li>Google hesabı bilgileriniz.</li>
<li>Yazıcınızın markası ve s&uuml;r&uuml;c&uuml;s&uuml;.</li>
</ul>
<li><b>Kaydet</b>'e tıklayın.</li>
</ol>
<p>Kurulum tamamlandıktan sonra, <b>Yazıcı Y&ouml;neticisi</b> &gt; <b>Test Sayfasını Yazdır</b>'a tıklayarak bir test sayfası yazdırabilirsiniz.</li>
</p>
<p>Google Cloud Print g&ouml;revlerini y&ouml;netmek i&ccedil;in <a href="http://www.google.com/cloudprint/manage.html" target="_blank">Google Cloud Print</a> bağlantısına tıklayın.</p>


<h3>Yazıcılara Erişme</h3>
<p>PC veya Mac kullanarak yazıcılara erişmek i&ccedil;in aşağıdaki b&ouml;l&uuml;me g&ouml;z atın.</p>
<h4><a name="others"></a>Windows PC kullanarak yazıcılara erişme:</h4>
<p>
Synology NAS cihazının yazdırma hizmetlerine erişmenin en iyi yolu Synology Assistant ile yazıcıya bağlantı kurmaktır. Ayrıntılı talimatlar i&ccedil;in Yardım'a başvurun.
</p>

<p>Bilgisayarınıza Synology Assistant y&uuml;kl&uuml; değilse, Synology NAS cihazının yazdırma hizmetlerine erişmenin diğer yollarını g&ouml;rmek i&ccedil;in aşağıya bakın.</p>
<p><strong>Tip 1. Paylaşımlı Ağ Yazıcısı</strong></p>
<ol>
<li>Bilgisayarınızdaki Dosya Gezgini'nde <b>Ağ</b>'ı a&ccedil;ıp Synology NAS &ouml;ğesine &ccedil;ift tıklayın.</li>

<li><span class="disable-rc18015xsp"><b>usbprinter</b> ya da </span><b>network printer name</b> &ouml;ğesine &ccedil;ift tıklayın; sistem, doğru s&uuml;r&uuml;c&uuml;y&uuml; y&uuml;klemenizi istediğinde <b>Evet</b>'e tıklayın.</li>

<li>L&uuml;tfen yazıcı s&uuml;r&uuml;c&uuml;s&uuml;n&uuml; CD'den ya da &uuml;reticinin web sitesinden edinin. Yazıcının &uuml;reticisini ve modelini se&ccedil;in veya s&uuml;r&uuml;c&uuml;n&uuml;n konumunu se&ccedil;mek i&ccedil;in <strong>Disketi Var</strong>'a tıklayın. Ardından <b>Tamam</b> tuşuna tıklayın.</li>
<li>Sistem ağ yazıcısını kurmaya başlar. Kurulum tamamlandıktan sonra yazıcıyı kullanmaya başlayabilirsiniz. </li>
</ol>


<p><strong>Tip 2. LPR Bağlantı Noktası (&Ouml;nerilen)</strong></p>
<ol>
<li>Bilgisayarınızda <b>Başlat</b>'a tıklayın ve <b>Aygıtlar ve Yazıcılar</b>'a gidin.</li>
<li><b>Yazıcı Ekle</b>'ye tıklayın. </li>
	<li><strong>Bir ağ, kablosuz ya da Bluetooth yazıcı ekle</strong>'yi se&ccedil;in. </li>
	<li><strong>İstediğim yazıcı listelenmiyor</strong>'u se&ccedil;in.</li>
<li><b>TCP/IP adresi ya da ana bilgisayar adı kullanarak yazıcı ekle</b>'yi se&ccedil;in. Devam etmek i&ccedil;in <b>İleri</b>'ye tıklayın.</li>
<li>Aygıt t&uuml;r&uuml;n&uuml; be <b>TCP/IP Bağlantı Noktası Aygıtı</b> olacak şekilde se&ccedil;in.</li>
<li>Synology NAS IP adresini girin. Devam etmek i&ccedil;in <b>İleri</b>'ye tıklayın.</li>
<li><b>Aygıt T&uuml;r&uuml;</b> se&ccedil;imini yapın: <strong>&Ouml;zel</strong> &gt; <strong>Ayarlar</strong> &gt; …. Devam etmek i&ccedil;in <b>İleri</b>'ye tıklayın.</li>

<li>Protokol i&ccedil;in <b>LPR</b> se&ccedil;in; Kuyruk Adı olarak <span class="disable-rc18015xsp"><b>usbprinter</b> ya da </span><b>network printer name</b> girin ve <b>LPR Bayt Sayma Etkin</b> onay kutusunu işaretleyin. Devam etmek i&ccedil;in <b>Tamam</b> &uuml;zerine tıklayın.</li>

<li>L&uuml;tfen yazıcı s&uuml;r&uuml;c&uuml;s&uuml;n&uuml; CD'den ya da &uuml;reticinin web sitesinden edinin. Yazıcının &uuml;reticisini ve modelini se&ccedil;in veya s&uuml;r&uuml;c&uuml;n&uuml;n konumunu se&ccedil;mek i&ccedil;in <strong>Disketi Var</strong>'a tıklayın. Ardından <b>Tamam</b> tuşuna tıklayın.</li>
	<li>Sistem ağ yazıcısını kurmaya başlar. Kurulum tamamlandıktan sonra yazıcıyı kullanmaya başlayabilirsiniz.</li>
</ol>

<h4>Mac kullanarak yazıcılara erişmek i&ccedil;in:</h4>
<p>
Mac kullanıcıları DSM'in Bonjour yazıcı yayınını etkinleştirerek ve Sistem Tercihlerine yazıcı ekleyerek Synology NAS cihazının yazdırma hizmetlerine erişim sağlayabilir.</p>

<P>L&uuml;tfen devam etmeden &ouml;nce Synology NAS sunucunuzun Postscript yazıcı kullandığından emin olun.
</p>

<p><strong>Adım 1. DSM Bonjour yazıcı yayınını etkinleştirin</strong></p>
<ol>
<li>
DSM'de <b>admin</b> olarak veya <b>administrators</b> grubunun &uuml;yesi olarak oturum a&ccedil;ın.
</li>
<li>
<b>Denetim Masası</b> &gt; <strong>Dosya Hizmetleri</strong> &gt; <b>Win/Mac/NFS</b> b&ouml;l&uuml;m&uuml;ne gidin.
</li>
<li>
<b>Bonjour Yazıcı Yayınını Etkinleştir</b>'i işaretleyin.
</li>
</ol>

<p><strong>Adım 2. Mac kullanarak yazıcıya erişim</strong></p>
<ol>
<li>
Mac'inizde, <b>Sistem Tercihleri</b> &gt; <b>Yazdır ve Tara</b>'ya gidin ve ardından <b>+</b> işaretine tıklayın.
</li>

<li>
A&ccedil;ılan men&uuml;den <span class="disable-rc18015xsp"><b>usbprinter[number]</b> ya da </span><b>network printer name</b> se&ccedil;in. Mac'iniz yazıcıyı otomatik olarak ayarlayacaktır.
</li>

</ol>



</body>
</html>
