<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

	<h2>HDD/SSD</h2>
	<p>Denne avdelingen lar deg overv&aring;ke og f&aring; oversikt over statusen til de interne lagringsdiskene som er installert p&aring; Synology NAS-enheten din. G&aring; til <strong>Lagringsh&aring;ndtering</strong> &gt; <strong>HDD/SSD</strong> for &aring; administrere disse alternativene.</p>


	<h4>Slik kontrollerer du HDD/SSD-informasjonen:</h4>
	<ol>
		<li>G&aring; til fanen <b>HDD/SSD</b>.</li>
		<li>Velg en disk fra listen of utvid den. Her vil du se S.M.A.R.T.-statusen, informasjon om diskgruppe/RAID Group, modellnavn, serienummer, fastvareversjon og temperatur.</li>
	</ol>	
	
	<h4>Slik kontrollerer du tilstandsinformasjonen:</h4>
    <ol>
      <li>G&aring; til fanen <b>HDD/SSD</b>.</li>
	  <li>Velg en disk.</li>
      <li>Klikk p&aring; <b>Tilstandsinformasjon</b>.</li>
	  <li>G&aring; til <strong>Oversikt</strong>-fanen for &aring; finne ut hvor mange timer disken har v&aelig;rt aktiv og vise gjeldende temperatur, antall tilkoblinger/omidentifiseringer og antall skadede sektorer. Her kan du ogs&aring; vise generell tilstandsstatus, S.M.A.R.T.-status og IronWolf Health*-status. Se tabellen nedenfor for en oversikt over den generelle disktilstandsstatusen og assosierte driftstilstander.</li>
      <li>G&aring; til fanen <strong>S.M.A.R.T.-info</strong> for ytterligere diagnostisering av diskstatusen.</li>
    </ol>

<table>
	<tr>
		<th>Diskstatus</th>
		<th>Driftstilstand</th>
	</tr>
	<tr>
		<td>Normal</td>
		<td>
			<p>Disken er enten i god tilstand eller advarselen om disken er undertrykket eller deaktivert.</p>
		</td>
	</tr>
	<tr>
		<td>Advarsel</td>
		<td>
			<p>Det har oppst&aring;tt problemer med disken og/eller antall skadede sektorer har overskredet den angitte grensen. Selv om diskene med denne statusen fortsatt kan fungere, b&oslash;r de overv&aring;kes.</p>
		</td>
	</tr>
	<tr>
		<td>Kritisk</td>
		<td>
			<p>En kritisk feil eller flere feil har oppst&aring;tt p&aring; disken. Det anbefales p&aring; det sterkeste &aring; erstatte harddisken.</p>
		</td>
	</tr>
	<tr>
		<td>Sviktende</td>
		<td>
			<p>Flere kritiske feil har oppst&aring;tt p&aring; disken. Diskintegriteten kan ikke garanteres n&aring;r disken har denne driftsstatusen.</p>
		</td>
	</tr>
	<tr>
		<td>Tilgangsfeil</td>
		<td>
			<p>Diskkommunikasjonsfeil kan har f&oslash;rt til at disken ble koblet fra systemet eller resultert i alvorlig lese-skrivesvikt. Denne driftsstatusen indikerer vanligvis at det har oppst&aring;tt alvorlige feil.</p>
		</td>
	</tr>
</table>



<div class="section">
<h4>Merk:</h4>
<ul>
<li>Ikke alle S.M.A.R.T.-funksjoner er st&oslash;ttet p&aring; SAS-disker.</li>
</ul>
</div>

<h4>Slik endrer du diskens advarselstatus:</h4>
<P>DSM overv&aring;ker tilstandsstatusen til diskene dine konstant og varsler deg n&aring;r det blir funnet feil. Enkelte feil er mer alvorlige enn andre. For enkelte feil som f&oslash;rer til tilstandsstatusen <strong>Advarsel</strong> (i <strong>Tilstandsinformasjon</strong> &gt; <strong>Oversikt</strong>), kan advarselen endres ved &aring; gj&oslash;re f&oslash;lgende:</P>
<ol>
 <li>G&aring; til fanen <strong>HDD/SSD</strong>.</li>
 <li>Velg disken med advarselstatus og klikk p&aring; <strong>Tilstandsinformasjon</strong>.</li> 
 <li>Klikk p&aring; <strong>Endre diskadvarsel</strong>.</li>
 <li>Klikk p&aring; <strong>Undertrykk advarsel</strong> eller <strong>Deaktiver advarsel</strong> (disse to alternativene er tilgjengelige avhengig av feiltypen): 
  <ul>
   <li><strong>Undertrykk advarsel:</strong> Overv&aring;kingen av det degraderte feltet fortsetter; advarsler blir imidlertid kun utl&oslash;st hvis verdien fortsetter &aring; degraderes.</li> 
   <li><strong>Deaktiver advarsel:</strong> Overv&aring;kingen av S.M.A.R.T.-feltet blir deaktivert p&aring; permanent basis.</li>
  </ul>
 </li>
</ol>

<div class="section">
<h4>Merk:</h4>
<ul>
<li>Endring av diskens advarselstatus vil ikke reparere feilen som har oppst&aring;tt p&aring; disken, ei heller hindre at de oppst&aring;r; derfor m&aring; ikke denne handlingen anses som en langsiktig l&oslash;sning.</li>
<li>V&aelig;r oppmerksom p&aring; at en advarsel om S.M.A.R.T.-feil vanligvis indikerer at det har oppst&aring;tt et problem p&aring; disken. Ignorering av advarselen kan f&oslash;re til tap av data.</li>
<li>Enkelte S.M.A.R.T.-felt blit ansett som kritiske og kan derfor ikke undertrykkes eller deaktiveres.</li>
</div>


	<h4>Slik starter du en S.M.A.R.T.-test:</h4>
	<P>S.M.A.R.T.-test vil unders&oslash;ke og rapportere diskenes status for &aring; varsle deg om mulige diskfeil. Vi anbefaler &aring; bytte ut diskene dine umiddelbart om feil blir registrert. </P>
    <ol>
      <li>G&aring; til fanen <strong>HDD/SSD</strong>.</li>
      <li>Velg en disk.</li>
      <li>Klikk p&aring; <b>S.M.A.R.T.-test</b>.</li>
      <li>Velg en testtype og klikk p&aring; <strong>Start</strong> for &aring; starte testen.</li>
      <li>De siste testresultatene vises i delen <b>Testresultat</b>.</li>
      <li>G&aring; til <strong>Historikk</strong>-fanen for &aring; se tidligere testresultater.</li>
    </ol>
<div class="section">
<h4>Merk:</h4>
    <ul>
     <li>Tiden det tar &aring; utf&oslash;re en S.M.A.R.T.-test kan variere, avhengig av systemforbruk og diskkapasitet.</li> 
     <li>Testresultatet er enten <strong>Normal</strong> eller <strong>Sviktende</strong>.</li>
    </ul>
</div>

    <h4>Slik planlegger du S.M.A.R.T.-tester:</h4>
    <p>S.M.A.R.T.-tester kan planlegges &aring; kj&oslash;re automatisk p&aring; diskene.</p>
    <ol>
      <li>G&aring; til fanen <strong>Testplanlegger</strong>.</li>
      <li>Klikk p&aring; <strong>Opprett</strong> for &aring; sette opp nye oppgaver.</li>
      <li>Endre f&oslash;lgende innstillinger under fanen <strong>Generelt</strong>:</li>
      <ul>
        <li><strong>Oppgavenavn:</strong> Skriv inn et navn for oppgaven.</li>
        <li><strong>S.M.A.R.T.-testtype:</strong> Velg &aring; utf&oslash;re en hurtigtest eller en utvidet test.</li>
        <li><strong>S.M.A.R.T.-testomr&aring;de:</strong> Velg hvilke HDD-/SSD-disker som skal testes hver gang S.M.A.R.T.-testen utf&oslash;res.</li>
      </ul>
      <li>Under fanen <strong>Tidsplan</strong> endrer du f&oslash;lgende innstillinger:</li>
      <ul>
        <li><strong>Dato:</strong> Spesifiser dato for utf&oslash;ring av S.M.A.R.T.-test, som kan planlegges &aring; kj&oslash;re p&aring; bestemte dager i uken (f.eks. daglig, i helger eller hver s&oslash;ndag) eller p&aring; spesifikke datoer (f.eks. 2016/11/21).</li>
        <li><strong>Tidspunkt:</strong> Spesifiser hvor ofte S.M.A.R.T.-testen skal kj&oslash;res p&aring; diskene, samt tidspunkt for f&oslash;rste og siste kj&oslash;ring.</li>
      </ul>
      <li>Klikk p&aring; <strong>OK</strong> for &aring; fullf&oslash;re.</li>
    </ol>

<div class="section">
<h4>Merk:</h4>
   <ul>
    <li>Hvis S.M.A.R.T.-test ikke er planlagt &aring; kj&oslash;re p&aring; en spesifikk disk, blir knappen <strong>Planlegg S.M.A.R.T.-tester</strong> tilgjengelig i <strong>Tilstandsinformasjon</strong> &gt; <strong>Oversikt</strong> p&aring; denne disken.</li> 
   </ul>
</div>

<h4>Slik aktiverer du st&oslash;tte for advarsel om skadet sektor*:</h4>
<ol>
	<li>G&aring; til fanen <b>Generelt</b>.</li>
	<li>Merk av for <b>Aktiver advarsel om skadet sektor</b>. Denne funksjonen er aktivert som standard.</li>
	<li>Angi grense i <b>Antall skadede sektorer</b>-feltet. Statusen til harddisken vi bli endret til <b>Advarsel</b> n&aring;r antallet skadede sektorer n&aring;r verdien som spesifiseres her.</li>
	<li>Klikk p&aring; <b>Bruk</b>.</li>
</ol>

<h4>Slik aktiverer du st&oslash;tte for advarsel om diskens levetid*: </h4>
<ol>
	<li>G&aring; til fanen <b>Generelt</b>.</li>
	<li>Merk av for <b>Aktiver advarsel om diskens levetid</b>. Denne funksjonen er aktivert som standard.</li>
	<li>Angi grense i <b>Levetidprosent (%)</b>-feltet. Statusen til en SSD vi bli endret til <b>Advarsel</b> n&aring;r beregnet levetid n&aring;r verdien som spesifiseres her.</li>
	<li>Klikk p&aring; <b>Bruk</b>.</li>
</ol>

<div class="section">
<h4>Merk:</h4>
<ul>
<li>Advarsel om diskens levetid st&oslash;ttes kun p&aring; SSD-er.</li>
<li>Verdien for diskens levetid genereres direkte fra S.M.A.R.T.-informasjonen. Hvis disken ikke st&oslash;tter denne S.M.A.R.T.-attributten, er ikke denne funksjonen st&oslash;ttet.</li>
</ul>
</div>

<h4>Slik utf&oslash;rer du Ytelsestest*:</h4>
<ol>
	<li>G&aring; til fanen <b>HDD/SSD</b>.</li>
	<li>Velg en stasjon og klikk p&aring; <b>Ytelsestest</b>.</li>
	<li>I vinduet som &aring;pnes klikker du p&aring; <b>Kj&oslash;r test n&aring;</b> for &aring; starte ytelsestesten. Resultater blir vist her n&aring;r testen er fullf&oslash;rt.</li>
	<li>For &aring; sammenligne resultatene med tidligere tester, klikker du p&aring; <b>Velg</b> i <b>Sammenlignet test</b>-feltet for &aring; velge &oslash;nsket logg.</li>
</ol>

<div class="section">
<h4>Merk:</h4>
<ul>
	<li>Sekvensiell gjennomstr&oslash;mming, tilfeldig IOPS og ventetid er inkludert i ytelsestesten, som tar omtrent 18 minutter.</li>
	<li>Det finnes to testtyper: <b>grunnleggende</b> og <b>utvidet</b>.
	<ul>
		<li>P&aring; disker som brukes i RAID kan du kun utf&oslash;re grunnleggende tester, og dataene p&aring; diskene blir ikke ber&oslash;rt. Du kan imidlertid ikke teste skriveytelsen til HDD-er som brukes i RAID.</li>
		<li>I alle andre tillfeller blir det utf&oslash;rt utvidede tester for bedre presisjon. Ytelsestestene kan imidlertid ikke garantere dataintegriteten. Derfor b&oslash;r du kontrollere at det ikke finnes viktige data p&aring; diskene f&oslash;r du utf&oslash;rer Ytelsestest.</li>
	</ul>
    </li>
	<li>For &aring; sikre systemets tilgjengelighet, kan du ikke utf&oslash;re tester p&aring; mer enn tre disker samtidig, eller n&aring;r det kun finnes &eacute;n disk. I tillegg, hvis diskforbruket overskrider 5 %, vil systemet be deg om &aring; bekrefte p&aring; nytt f&oslash;r du fortsetter med ytelsestesten for &aring; sikre testens presisjon.</li>
	<li>Ytelsestest-resultater kan sammenlignes med tidligere tester. N&aring;r forskjellen er st&oslash;rre enn 5 %, blir du varslet.</li>
    <li>Ytelsestest kj&oslash;rer med lav prioritet i DSM slik at den ikke forstyrrer de andre tjenestene. Tallene som er presentert kan variere avhengig av systembelastning og konfigurasjoner. Disse tallene skal kun v&aelig;re til referanse for &aring; beregne diskfunksjonalitet, og er ikke sammenlignbare med andre modeller eller DSM-versjoner.</li>
</ul>
</div>


<h4>Slik utf&oslash;rer du Secure Erase:</h4>
<ol>
<li>G&aring; til fanen <b>HDD/SSD</b>.</li>
<li>Velg en stasjon og klikk p&aring; <b>Secure Erase</b>.</li>
</ol>


<div class="section">
<h4>Merk:</h4>
<ul>
<li>Secure Erase kan ikke utf&oslash;res p&aring; stasjoner i utvidelsesenheter</li>
<li>Secure Erase vil fjerne all data som er lagret p&aring; stasjonen din permanent. Kontroller at den valgte stasjonen ikke er i bruk eller at dataene er sikkerhetskopiert f&oslash;r du starter.</li>
<li>N&aring;r systemet utf&oslash;rer Secure Erase, vil den valgte stasjonen v&aelig;re midlertidig l&aring;st til operasjonen er fullf&oslash;rt.</li>
<li>Hvis Secure Erase stoppes ureglementert under operasjonen, kan du starte Secure Erase p&aring; nytt direkte i brukergrensesnittet. Hvis stasjonene fjernes eller blir brukt andre steder mens de fortsatt er l&aring;st, oppgir du passordet &quot;synology&quot; for &aring; l&aring;se opp stasjonene.</li>
</ul>
</div>

<h4>Slik oppdaterer du S.M.A.R.T.-databasen:</h4>
<p>S.M.A.R.T.-databasen inneholder informasjon om trygg driftstemperatur og S.M.A.R.T.-feltnavn p&aring; disken. Databasen oppdateres regelmessig og oppdateres automatisk etter at en disk er erstattet. Denne operasjonen b&oslash;r kun utf&oslash;res n&aring;r den regelmessige eller automatiske oppdateringen mislykkes.</p>

<ol>
<li>G&aring; til fanen <strong>Generelt</strong>.</li>
<li>Rull ned til avdelingen for <strong>S.M.A.R.T.-database</strong>.</li>
<li>Klikk p&aring; <strong>Oppdater n&aring;</strong>.</li>
</ol>

<div class="section">
<h4>Merk:</h4>
<ul>
<li>S.M.A.R.T.-databasen kan kun oppdateres &eacute;n gang per 24 timer.</li>
<li>S.M.A.R.T.-databasen blir oppdatert automatisk n&aring;r en ny disk settes inn i Synology NAS.</li>
<li>Oppdatering av S.M.A.R.T.-databasen vil ikke p&aring;virke eller forbedre diskkompatibiliteten eller ytelsen.</li>
<li>Du m&aring; kun utf&oslash;re denne operasjonen n&aring;r flere verdier i S.M.A.R.T.-info ikke kan identifiseres, eller n&aring;r Synology-st&oslash;tteteamet anbefaler deg &aring; gj&oslash;re dette.</li>
</ul>
</div>


	<h3>Aktivere st&oslash;tte for skrivebuffer for HDD</h3>
	<p>Aktivering av st&oslash;tte for skrivebuffer forbedrer ytelsen til Synology NAS. Kun visse HDD-modeller st&oslash;tter denne funksjonen. For &aring; sikre databeskyttelse mens du bruker st&oslash;tte for skrivebuffer, er det sterkt anbefalt &aring; bruke en UPS-enhet. Vi foresl&aring;r ogs&aring; at systemet blir sl&aring;tt av p&aring; korrekt m&aring;te etter bruk. Deaktivering av skrivebuffer vil redusere sjansene for datatap som f&oslash;lge av unormal driftsstans, men systemytelsen vil avta.</p>

	<h4>Slik aktiverer du st&oslash;tte for skrivebuffer: </h4>
	<ol>
		<li>G&aring; til fanen <b>Bufferadministrasjon</b>.</li>
		<li>Merk av for <b>Aktiver skrivebuffer</b>. Denne funksjonen er aktivert som standard.</li>
		<li>Klikk p&aring; <b>Bruk</b>.</li>
	</ol>


    
    
<p>____<br> * Kun tilgjengelig p&aring; visse modeller. </p>

</body>
</html>
