<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Legg til en disk for &aring; utvide lagringskapasiteten</h2>

<p>Hvis det finnes tomme diskluker p&aring; din Synology NAS, kan du installere ytterligere disker og legge dem til i et eksisterende volum eller diskgruppe. Denne artikkelen gir deg instruksjoner for &aring; utvide et eksisterende volum eller diskgruppe ved &aring; installere ytterligere disker.</p>

<h3>F&oslash;r du starter</h3>

<p>F&oslash;r du starter, m&aring; du kontrollere at diskene du vil legge til oppfyller f&oslash;lgende krav til st&oslash;rrelse:</p>
<ul>
	<li><strong>For SHR:</strong> Kapasiteten til disken du vil legge til m&aring; v&aelig;re lik eller st&oslash;rre enn den st&oslash;rste disken i volumet eller diskgruppen, eller v&aelig;re lik diskene i volumet eller diskgruppen. For eksempel, hvis SHR-volumet best&aring;r av tre disker &ndash; 2 TB, 1,5 TB, and 1 TB &ndash; m&aring; kapasiteten p&aring; den nye disken v&aelig;re minst 2 TB eller lik 1,5 TB eller 1 TB.</li>
	<li><strong>For RAID 5<span class="enable-grantley">,</span> <span class="disable-grantley"></span>RAID 6<span class="enable-grantley"> og RAID F1</span>:</strong> Kapasiteten p&aring; disken du &oslash;nsker &aring; legge til m&aring; v&aelig;re lik eller st&oslash;rre enn den minste disken p&aring; volumet eller diskgruppen. For eksempel, hvis volumet best&aring;r av tre disker &ndash; 2 TB, 1,5 TB, and 1 TB &ndash; m&aring; kapasiteten p&aring; den nye disken v&aelig;re minst 1 TB.</li>
</ul>

<div class="section"><h4>Kontroller volumstatus</h4>
<p>Kontroller at statusen til volumet eller diskgruppen er <strong>Normal</strong>. Hvis ikke, m&aring; du f&oslash;rst reparere det/den.</p>
</div>

<h3>Legg til en disk i et volum eller en diskgruppe</h3>
<p>Harddisker kan legges til i f&oslash;lgende RAID-typer: </p>
<ul>
	<li>Synology Hybrid RAID (SHR)</li>
	<li>JBOD</li>
	<li>RAID 5</li>
	<li>RAID 6</li>
</ul>

<div class="section"><h4>Merk:</h4>
<ul>
	<li>For SHR-volum blir lagringskapasiteten kun utvidet n&aring;r du legger til disker i et volum med to eller flere disker.</li>
</ul>
</div>

<h4>Slik legger du til en disk i et volum eller en diskgruppe:</h4>

<ol>
	<li>Skru av din Synology NAS. (Hopp over dette trinnet hvis din Synology NAS st&oslash;tter hot-swapping.)</li>
	<li>Sett inn en ny disk i en tom diskluke.</li>

<div class="section"><h4>Merk:</h4>
<ul>
	<li>For &aring; unng&aring; &aring; gj&oslash;re skade p&aring; deg selv eller din Synology NAS, m&aring; du f&oslash;lge instruksjonene for diskinstallering i <em>Installasjonsveiledning for maskinvare</em> for ditt Synology-produkt.</li>
</ul>
</div>

<li>Skru p&aring; din Synology NAS.</li>
	<li>Logg inn p&aring; DSM med en konto som tilh&oslash;rer <strong>administrators</strong>-gruppen.</li>
	<li>&Aring;pne <strong>Lagringsh&aring;ndtering</strong>.<br /><img src="about:blank" class="help_image" /></li>
	<li>Deretter gj&oslash;r du f&oslash;lgende:
		<ul>
			<li>Hvis du utvider et enkeltvolum, g&aring;r du til fanen <strong>Volum</strong>. Velg volumet du &oslash;nsker &aring; utvide. Klikk p&aring; <strong>Administrer</strong> og fortsett til neste trinn.<br /><img src="about:blank" class="help_image" /></li>
			<li>Hvis du utvider en diskgruppe, g&aring;r du til fanen <strong>Diskgruppe</strong>. Velg diskgruppen du vil utvide. Klikk p&aring; <strong>Administrer</strong> og fortsett til neste trinn.<br /><img src="about:blank" class="help_image" /></li>
		</ul>
	</li>
	<li>Velg <strong>Utvid volumet (eller diskgruppen) ved &aring; legge til harddisker</strong>. Deretter klikker du p&aring; <strong>Neste</strong>.<br /><img src="about:blank" class="help_image" /></li>
	<li>Velg diskene du vil utvide volumet eller diskgruppen med. Du kan legge til disker ved &aring; merke av i de korresponderende boksene. Deretter klikker du p&aring; <strong>Neste</strong>.<br /><img src="about:blank" class="help_image" /></li>
	<li>F&oslash;lg trinnene i veiviseren for &aring; fullf&oslash;re.</li>
</ol>

</body>
</html>