<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>RAID Group*</h2>

<p>Med Synology NAS kan du kombinere flere harddisker i &eacute;n enkelt lagringsenhet som kalles RAID Group. Volum eller iSCSI LUN-er (blokkniv&aring;) kan opprettes over RAID Group-er. Volum eller iSCSI LUN-er kan utvides hvis en RAID Group har omr&aring;der som kan tildeles. Forskjellige RAID-typer tilbyr varierende niv&aring;er av databeskyttelse. For en generell liste med RAID-typer som st&oslash;ttes av din Synology NAS, se <a href="general.html">Generelt</a>.</p>

<h4>Slik oppretter du en RAID Group:</h4>
<ol>
	<li>Klikk p&aring; knappen <strong>Opprett</strong>.</li>
	<li>Velg ett av f&oslash;lgende alternativer: 
		<ul>
			<li>RAID Group for ett enkelt volum eller iSCSI LUN (blokkniv&aring;): Gir bedre ytelse.</li>
			<li>RAID Group for flere volum eller iSCSI LUN-er (blokkniv&aring;): Gir bedre administrasjonsfleksibilitet.</li>
		</ul>
	</li>
	<li>F&oslash;lg veiviseren for &aring; fullf&oslash;re installasjonen.</li>
</ol>

<div class="section"><h4>Merk: </h4>
<ul>
	<li>En RAID Group m&aring; best&aring; av harddisker av samme harddisktype. Du kan ikkke bruke SATA- og SAS-harddisker samtidig, ei heller SSD-er og HDD-er samtidig, til &aring; opprette RAID.</li>
	<li>En RAID Group for flere volum eller iSCSI LUN-er (blokkniv&aring;) som bruker <strong>RAID 5</strong><span class="enable-grantley"></span>, <span class="disable-grantley"></span><strong>RAID 6</strong><span class="enable-grantley"> eller <strong>RAID F1</strong></span> kan inneholde flere <strong>RAID-matriser</strong>. Hver RAID-matrise som tilh&oslash;rer den samme RAID Group vil v&aelig;re av samme RAID-type (f.eks. RAID 5<span class="enable-grantley">,</span> <span class="disable-grantley"> </span>RAID 6<span class="enable-grantley"> eller RAID F1</span>). Maksimum antall disker for hver RAID-matrise kan v&aelig;re 6, 12 eller 24. Du kan angi maksimum antall disker n&aring;r du oppretter &oslash;nsket RAID Group, men antallet kan ikke endres i etterkant. N&aring;r en RAID-matrise har f&aring;tt tildelt maksimum antall disker, m&aring; den neste disken som skal legges til i RAID Group tildeles en ny RAID-matrise. Den nye RAID-matrisen m&aring; inneholde minimumsantallet disker som kreves for den spesifikke RAID-typen (det vil si tre disker for RAID 5<span class="enable-grantley"> og RAID F1</span>, og fire disker for RAID 6).</li>
	<li>Hvis du vil opprette en RAID Group med en bestemt harddisk, men den ikke vises i <strong>Veiviser for oppretting av RAID Group</strong>, m&aring; du unders&oslash;ke statusen til harddisken i <strong>HDD-administrasjon</strong>.</li>
</ul>
</div>

<h4>Slik fjerner du en RAID Group:</h4>
<ol>
	<li>Velg den RAID Group du &oslash;nsker &aring; fjerne.</li>
	<li>Klikk p&aring; <strong>Fjern</strong>-knappen og f&oslash;lg veiviseren for &aring; fullf&oslash;re prosessen.</li>
</ol>

<div class="section"><h4>Merk:</h4>
<ul>
	<li>Volum og iSCSI LUN-er i RAID Group vil slettes n&aring;r du fjerner RAID Group. Forsikre deg om at ingen viktig data vil bli slettet.</li>
</ul>
</div>

<h4>Slik reparerer du en RAID Group:</h4>
<p>En RAID Group med status <strong>Degradert</strong> kan repareres hvis RAID Group er en av f&oslash;lgende typer: RAID 1, RAID 5, RAID 6, <span class="disable-grantley"></span>RAID 10<span class="enable-grantley"> og RAID F1</span>. Eksisterende data p&aring; RAID Group-en blir ikke slettet.</p>

<p>F&oslash;lg trinnene nedenfor for &aring; reparere din RAID Group:</p>
<ol>
	<li>Skru av din Synology NAS. (Du kan hoppe over dette trinnet hvis modellen st&oslash;tter hot-swapping.)</li>
	<li>Erstatt den sviktende harddisken som indikert i Diskinfo, som du finner i RAID Group-statusen.</li>
	<li>Klikk p&aring; <strong>Administrer</strong>.</li>
	<li>Velg <strong>Reparer</strong>.</li>
	<li>F&oslash;lg veiviseren for &aring; fullf&oslash;re installasjonen.</li>
</ol>
        
<div class="section"><h4>Merk:</h4>
<ul>
	<li>Erstatningsharddisken m&aring; v&aelig;re st&oslash;rre eller like stor som den minste disken i RAID Group.</li>
	<li>Erstatningsharddiskens status m&aring; v&aelig;re &quot;Startet&quot; eller &quot;Ikke startet&quot;.</li>
</ul>
</div>

<h4>Slik endrer du RAID-typen til en RAID Group</h4>
<p>For &aring; endre RAID-typen til en RAID Group, m&aring; det v&aelig;re tilgjengelige harddisker installert p&aring; din Synology NAS. I &oslash;yeblikket st&oslash;ttes f&oslash;lgende typer RAID-endring:</p>
<ul>
	<li>Basic til RAID 1 eller RAID 5</li>
	<li>RAID 1 til RAID 5</li>
	<li>RAID 5 til RAID 6</li>
	<li>Legg til speildisk i RAID 1</li>
</ul>

<p>F&oslash;lg trinnene nedenfor for &aring; endre RAID-typen til din RAID Group:</p>
<ol>
	<li>Velg RAID Group som du vil endre.</li>
	<li>Klikk p&aring; <strong>Administrer</strong>.</li>
	<li>Velg <strong>Endre RAID-type</strong>.</li>
	<li>F&oslash;lg veiviseren for &aring; fullf&oslash;re installasjonen.</li>
</ol>

<div class="section"><h4>Merk: </h4>
<ul>
	<li>RAID Group-statusen m&aring; v&aelig;re <strong>Normal</strong> f&oslash;r RAID-typen kan endres. Ellers vil tap av data forekomme. Hvis RAID Group er i <strong>degradert</strong> status, m&aring; du reparere den f&oslash;rst.</li>
	<li>For &aring; endre RAID-typen til en RAID Group, m&aring; et tilstrekkelig antall harddisker v&aelig;re installert p&aring; din Synology NAS, og st&oslash;rrelsen p&aring; den nye disken m&aring; v&aelig;re st&oslash;rre enn den minste disken i RAID Group.</li>
	<li>Den nye diskens status m&aring; v&aelig;re &quot;Startet&quot; eller &quot;Ikke startet&quot;.</li>
	<li>RAID-typen til en RAID Group med flere RAID-matriser kan ikke endres.</li>
</ul>
</div>

<h4>Slik utvider du st&oslash;rrelsen til en RAID Group</h4>
<p>Du kan utvide st&oslash;rrelsen p&aring; en RAID Group ved &aring; erstatte eksisterende harddisker med tilsvarende av &oslash;kt st&oslash;rrelse eller ved &aring; legge til harddisker.</p>

<div class="section"><h4>Merk: </h4>
<ul>
	<li>For &aring; utvide en RAID Group med disker p&aring; 3 TB eller mer, m&aring; du s&oslash;rge for at din RAID Group ble opprettet med DSM 3.0 eller nyere.</li>
</ul>
</div>

<h4>Slik utvider du en RAID Group ved &aring; bytte ut eksisterende harddisker med st&oslash;rre disker:</h4>
<p>Du kan utvide en RAID Group ved &aring; erstatte eksisterende harddisker med st&oslash;rre harddisker i f&oslash;lgende RAID-typer: RAID 1, RAID 5, <span class="disable-grantley"></span>RAID 6<span class="enable-grantley"> og RAID F1</span>. Tilknyttede volum eller iSCSI LUN-er&nbsp;i RAID Group for ett enkelt volum eller iSCSI LUN&nbsp;vil bli utvidet automatisk. F&oslash;lg trinnene nedenfor:</p>
<ol>
	<li>Skru av din Synology NAS. Du kan hoppe over dette trinnet hvis modellen st&oslash;tter hot-swapping.</li>
	<li>Erstatt &eacute;n harddisk med en ny og st&oslash;rre harddisk.</li>
	<li>Skru p&aring; Synology NAS og reparer RAID Group.</li>
	<li>Gjenta trinn 1 til 3 inntil alle harddisker er erstattet med tilsvarende av &oslash;kt st&oslash;rrelse.</li>
	<li>Systemet vil utvide RAID Group automatisk.</li>
</ol>

<div class="section"><h4>Merk: </h4>
<ul>
	<li>Alle tjenester i forbindelse med Lagringsh&aring;ndtering vil stoppes midlertidig under utvidelsesprosessen.</li> 
	<li>Du kan kun utvide harddisken n&aring;r RAID Group har statusen <strong>Normal</strong>; ellers vil det for&aring;rsake tap av data. Hvis RAID Group er i <strong>degradert</strong> status, m&aring; du reparere den f&oslash;rst.</li>
</ul>
</div>

<h4>Slik utvider du en RAID Group ved &aring; legge til harddisker:</h4>
<p>Denne funksjonen er tilgjengelig for RAID-typene JBOD, RAID 5, <span class="disable-grantley"></span>RAID 6<span class="enable-grantley"> og RAID F1</span>. Slik gj&oslash;r du dette:</p>
<ol>
	<li>Velg RAID Group som du &oslash;nsker &aring; utvide.</li>
	<li>Klikk p&aring; <strong>Administrer</strong>.</li>
	<li>Velg <strong>Legg til disk</strong>.</li>
	<li>F&oslash;lg veiviseren for &aring; fullf&oslash;re installasjonen.</li>
</ol>

<div class="section"><h4>Merk: </h4>
<ul>
	<li>RAID Group-statusen m&aring; v&aelig;re <strong>Normal</strong>.</li>
	<li>For RAID Group-typene RAID 5<span class="enable-grantley">,</span> <span class="disable-grantley"></span>RAID 6<span class="enable-grantley"> og RAID F1</span> m&aring; harddisken v&aelig;re st&oslash;rre enn den minste disken i RAID Group-en.</li>
	<li>Den valgte harddiskens status m&aring; v&aelig;re &quot;Startet&quot; eller &quot;Ikke startet&quot;.</li>
</ul>
</div>

<h4>Slik redigerer du RAID Group-beskrivelsen:</h4>
<ol>
	<li>Velg RAID Group som du &oslash;nsker &aring; redigere</li>
	<li>Klikk p&aring; <strong>Administrer</strong>.</li>
	<li>Velg <strong>Rediger beskrivelse</strong>.</li>
	<li>Rediger beskrivelsen og klikk p&aring; <strong>OK</strong> for &aring; lagre endringene.</li>
</ol>

<h3>RAID-skrubbing</h3>
<p>RAID-skrubbing er en funksjon for datavedlikehold som inspiserer RAID Group-er og reparerer eventuelle oppdagede datainkonsistenser. Denne funksjonen kan brukes med RAID Group-er med RAID 5<span class="enable-grantley">,</span> <span class="disable-grantley"></span>RAID 6<span class="enable-grantley"> eller RAID F1</span>.</p>

<p>Vi anbefaler regelmessig RAID-skrubbing for &aring; vedlikeholde datakonsistens og unng&aring; tap av viktig data i tilfelle disken bryter sammen.</p>

<h4>Slik utf&oslash;rer du RAID-skrubbing:</h4>
<ol>
	<li>Velg den RAID Group som du vil utf&oslash;re RAID-skrubbing p&aring;.</li>
	<li>Klikk p&aring; <strong>Administrer</strong></li>
	<li>Velg <strong>RAID-skrubbing</strong>.</li>
</ol>

<div class="section"><h4>Merk:</h4>
<ul>
	<li>RAID-skrubbing kan kun utf&oslash;res n&aring;r statusen til RAID Group er <strong>Normal</strong>.</li>
	<li>Ikke sl&aring; av maskinen f&oslash;r RAID-skrubbingen er fullf&oslash;rt. Hvis maskinen sl&aring;s av f&oslash;r den er ferdig, m&aring; RAID-skrubbingen startes p&aring; nytt igjen fra begynnelsen.</li>
</ul>
</div>
    
<p>____<br />*Kun tilgjengelig p&aring; enkelte modeller.</p>

</body>
</html>