<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Opprette et volum - Synology DSM Hjelp</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article walks you through the steps to create a volume on Synology NAS using Storage Manager.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Opprette et Volum</h2>

<p>Denne artikkelen forklarer hvordan du oppretter et volum p&aring; din Synology NAS. N&aring;r du skal opprette et nytt volum, kan du velge en av f&oslash;lgende metoder:</p>

<ul>
  <li><b>Hurtig:</b> Dette er det beste alternativet for nybegynnere. Velg denne metoden hvis du vil optimalisere lagringskapasitet og ytelse automatisk, uten &aring; m&aring;tte tenke p&aring; tekniske aspekter, som RAID-niv&aring;er. </li>

<li><b>Tilpass:</b> For avanserte brukere som vil kontrollere de mer detaljerte aspektene ved volumoppretting, som RAID-typer og kapasitettilordning. Dette alternativet st&oslash;tter ulike RAID-typer, lar deg opprette et enkeltvolum eller flere volum, og gir deg alternativer for &aring; tilordne spesifikke mengder med kapasitet til hvert volum (kun ved oppretting av flere volum p&aring; RAID).
</li>
</ul>

<div class="section">
<h4>Enkeltvolum eller flere volum p&aring; RAID?</h4>
<p>Ved oppretting av et volum i tilpasningsmodus, kan du velge ett av f&oslash;lgende alternativ:</p>
<ul>
  <li><b>Enkeltvolum p&aring; RAID</b>
    <ul>
      <li>Oppretter et enkeltvolum med hele den tilgjengelige kapasiteten til de valgte harddiskene.</li>
      <li>Gir bedre hastighet og ytelse.</li>
      <li>St&oslash;tter forskjellige RAID-typer.</li>
    </ul>
  </li>
  <li><b>Flere volumer p&aring; RAID</b>
    <ul>
      <li>Lar deg opprette flere volum p&aring; en diskgruppe.</li>
      <li>St&oslash;tter tilordning av bestemte mengder med kapasitet til hvert volum.</li>
      <li>Gir bedre lagringsh&aring;ndteringsfleksibilitet.</li>
      <li>St&oslash;tter forskjellige RAID-typer.</li>
    </ul>
  </li>
</ul>
</div>


<div class="section">
<h4>F&oslash;r du starter:</h4>
<ul>
<li>F&oslash;r du starter, m&aring; du kontrollere at det ikke finnes viktig data p&aring; harddiskene. All eksisterende data vil bli slettet under opprettingsprosessen.</li>
<li>G&aring; til siden <b>HDD/SSD</b> og kontroller at statusen til hver harddisk er <b>Normal</b> eller <strong>Ikke startet</strong>.</li>
</ul>
</div>

<div class="section enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">
<h4>Merk:</h4>
<ul>
<li>Minimum st&oslash;rrelse for Btrfs-volum er 10 GB.</li>
<li>Btrfs-volum reserverer 4 % av plassen til metadata.</li>
</ul>
</div>

<h4>Slik oppretter du et volum:</h4>
<ol>
<li>&Aring;pne <b>Lagringsh&aring;ndtering</b>.</li>
<img src="about:blank" class="help_image"/>
<li>G&aring; til <b>Volum</b> og klikk p&aring; <b>Opprett</b>.</li>
<img src="about:blank" class="help_image"/>


<li>Veiviseren for volumoppretting vil &aring;pnes. Velg <strong>Hurtig</strong> eller <strong>Tilpass</strong> i henhold til dine behov.</li>
<li>Endre &oslash;nskede innstillinger.</li>
<li>Velg om du vil arkivere tidspunkt for filtilgang:</li>
	  <ul>
      <li>Aktivering av <strong>Arkiver tidspunkt for filtilgang</strong>-alternativet tilsvarer bruk av monteringsalternativet relatime i Linux-systemer. Tidspunktet for filtilgang blir kun oppdatert n&aring;r det siste tilgangstidspunktet (atime) er tidligere enn gjeldende modifiseringstidspunkt (mtime) eller endringstidspunkt (ctime). Tilgangstidspunktet blir ogs&aring; oppdatert hvis det siste tilgangstidspunktet er eldre enn &eacute;n dag.</li>
      <li>Deaktivering av <strong>Arkiver tidspunkt for filtilgang</strong>-alternativet tilsvarer bruk av monteringsalternativet noatime i Linux-systemer. Tilgangstidspunktet for filer og mapper blir ikke oppdatert, noe som f&oslash;rer til mindre filsystemforbruk. V&aelig;r oppmerksom p&aring; at enkelte programmer er avhengig av filtilgangstidspunkt for &aring; fungere som normalt.</li>
      </ul>
   <li>Klikk p&aring; knappen <strong>Bruk</strong> for &aring; bekrefte innstillingene.</li>


<img src="about:blank" class="help_image"/>
</ol>

</body>
</html>
