<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Options</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="leaf_user"></a>Compte</h2>

<p>L&apos;onglet Compte fournit les options permettant de modifier les param&egrave;tres de compte basiques tels que la description, le mot de passe, l&apos;email et la v&eacute;rification en 2&nbsp;&eacute;tapes. Pour acc&eacute;der &agrave; cet onglet, cliquez sur l&apos;ic&ocirc;ne en forme de personnage, affich&eacute;e en haut &agrave; droite du bureau et s&eacute;lectionnez <strong>Personnel</strong>.</p>



<h3>Modifier les param&egrave;tres de compte</h3>

<p>Les param&egrave;tres de compte suivants peuvent &ecirc;tre modifi&eacute;s&nbsp;:</p>
<ul>
<li><strong>Description&nbsp;:</strong> Entrez une description pour votre compte. Les descriptions de l&apos;utilisateur peuvent inclure jusqu&apos;&agrave; 64&nbsp;caract&egrave;res Unicode affichables.</li>
<li><strong>Nouveau mot de passe&nbsp;:</strong> Si vous souhaitez changer le mot de passe de votre compte, entrez un nouveau mot de passe ici et confirmez-le dans le champ <strong>Confirmer le mot de passe</strong> ci-dessous. Les mots de passe doivent respecter la casse et peuvent &ecirc;tre compos&eacute;s de caract&egrave;res affichables (127&nbsp;maximum), tels que lettres, nombres, symboles et espaces.</li>
<li><strong>Email&nbsp;:</strong> Entrez une adresse email (uniquement pour les utilisateurs non admin).</li>
<li><strong>Langue d&apos;affichage&nbsp;:</strong> Sp&eacute;cifiez la langue d&apos;affichage applicable &agrave; votre compte. Les param&egrave;tres de langue d&apos;affichage que vous d&eacute;finissez ici auront la priorit&eacute; sur ceux d&eacute;finis dans <b>Panneau de configuration</b> &gt; <b>Options r&eacute;gionales</b> &gt; <b>Langue</b>.</li>
<li><strong>Format de date</strong>&nbsp;: Sp&eacute;cifiez le format de date, en fonction de vos pr&eacute;f&eacute;rences et de votre situation g&eacute;ographique.</li>
<li><strong>Format de l&apos;heure</strong>&nbsp;: Sp&eacute;cifiez si l&apos;heure doit &ecirc;tre affich&eacute;e au format 12&nbsp;heures ou 24&nbsp;heures.</li>
</ul>
<p>Apr&egrave;s avoir modifi&eacute; les param&egrave;tres de compte, cliquez sur <b>OK</b> pour enregistrer les modifications.</p>


<h3>V&eacute;rification en 2&nbsp;&eacute;tapes</h3>

<p>La v&eacute;rification en 2&nbsp;&eacute;tapes offre une s&eacute;curit&eacute; optimis&eacute;e &agrave; votre compte DSM. Si la v&eacute;rification en 2&nbsp;&eacute;tapes est activ&eacute;e, vous devrez entrer votre mot de passe en plus d&apos;un code de v&eacute;rification unique lorsque vous vous connectez &agrave; DSM. Les codes de v&eacute;rification sont obtenus depuis une application d&apos;authentification install&eacute;e sur votre p&eacute;riph&eacute;rique mobile. Par cons&eacute;quent, si quelqu&apos;un veut acc&eacute;der &agrave; votre compte, il devra non seulement conna&icirc;tre votre nom d&apos;utilisateur et mot de passe, mais aussi &ecirc;tre en possession de votre p&eacute;riph&eacute;rique mobile.</p>

<div class="section">
<h4>Configuration requise&nbsp;:</h4>
<p>La v&eacute;rification en 2&nbsp;&eacute;tapes n&eacute;cessite un p&eacute;riph&eacute;rique mobile et une application d&apos;authentification qui prend en charge le protocole TOTP (Time-based One-Time Password). Les applications d&apos;authentification comprennent Google Authenticator (Android/iPhone/BlackBerry) ou Authenticator (Windows Phone).</p>
</div>

<h4>Pour activer la v&eacute;rification en 2 &eacute;tapes, proc&eacute;dez comme suit&nbsp;:</h4>

<ol>
<li>Acc&eacute;dez &agrave; <strong>Personnel</strong> &gt; onglet <strong>Compte</strong> et activez la case &agrave; cocher <strong>Activez la v&eacute;rification en 2&nbsp;&eacute;tapes</strong> pour lancer l&apos;assistant de configuration de la v&eacute;rification en 2&nbsp;&eacute;tapes.</li>
<li>Sur le premier &eacute;cran, entrez une adresse e-mail. Des codes de v&eacute;rification d&apos;urgence peuvent &ecirc;tre envoy&eacute;s &agrave; cette adresse email en cas de perte de votre p&eacute;riph&eacute;rique mobile.</li>
<li>T&eacute;l&eacute;chargez et installez une application d&apos;authentification telle que Google Authenticator (Android/iPhone/BlackBerry) ou Authenticator (Windows Phone).</li>
<li>Sur l&apos;&eacute;cran suivant, ouvrez votre application d&apos;authentification et num&eacute;risez le code QR. Vous pouvez &eacute;galement cliquer sur le lien manuel pour entrer une Secret Key.</li>
<li>Votre application d&apos;authentification g&eacute;n&egrave;rera ensuite un code de v&eacute;rification &agrave; 6&nbsp;chiffres. Entrez ce code dans le champ de texte de l&apos;assistant afin de confirmer que les configurations sont correctes. Si une erreur se produit, veuillez-vous assurer que l&apos;heure syst&egrave;me de votre p&eacute;riph&eacute;rique mobile est synchronis&eacute;e avec l&apos;heure syst&egrave;me de DSM. En outre, les codes de v&eacute;rification &eacute;tant mis &agrave; jour r&eacute;guli&egrave;rement, il convient de v&eacute;rifier que le code saisi n&apos;est pas expir&eacute;.</li>
<li>Une fois l&apos;assistant de configuration termin&eacute;, cliquez sur <strong>OK</strong> pour enregistrer les param&egrave;tres.</li>
</ol>



<h4>Pour vous connecter &agrave; DSM avec la v&eacute;rification en 2&nbsp;&eacute;tapes, proc&eacute;dez comme suit&nbsp;:</h4>

<p>Quand la v&eacute;rification en 2&nbsp;&eacute;tapes est activ&eacute;e, vous &ecirc;tes invit&eacute; &agrave; entrer un code de v&eacute;rification &agrave; 6&nbsp;chiffres lorsque vous vous connectez &agrave; DSM.</p>

<ol>
<li>Sur l&apos;&eacute;cran de connexion de DSM, entrez votre nom d&apos;utilisateur et le mot de passe, comme d&apos;habitude.</li>
<li>Quand vous &ecirc;tes invit&eacute; &agrave; entrer un code de v&eacute;rification, ouvrez l&apos;application d&apos;authentification sur votre p&eacute;riph&eacute;rique mobile.</li>
<li>Trouvez et entrez le code de v&eacute;rification &agrave; 6&nbsp;chiffres pour votre compte. Si votre p&eacute;riph&eacute;rique mobile est perdu, vous pouvez cliquer sur le lien <b>Vous avez perdu votre t&eacute;l&eacute;phone&nbsp;?</b> et un code de v&eacute;rification d&apos;urgence sera alors envoy&eacute; &agrave; votre adresse email.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li><strong>Param&egrave;tres SMTP&nbsp;:</strong> Pour recevoir des codes d&apos;urgence par e-mail, les param&egrave;tres du serveur SMTP doivent &ecirc;tre correctement configur&eacute;s. Vous pouvez acc&eacute;der &agrave; <b>Panneau de configuration</b> &gt; <b>Notification</b> ou <b>Personnel</b> &gt; <b>Compte email</b> pour v&eacute;rifier si vos param&egrave;tres sont corrects.</li>
<li><strong>Limite du code d&apos;urgence&nbsp;:</strong> Chaque utilisateur a une limite de 5&nbsp;codes d&apos;urgence. Si vous d&eacute;passez votre limite, vous devrez d&eacute;sactiver et activer la v&eacute;rification en 2&nbsp;&eacute;tapes avant de pouvoir recevoir d&apos;autres codes d&apos;urgence.</li>
<li>Il est possible de forcer la v&eacute;rification en 2&nbsp;&eacute;tapes sous DSM et toutes les applications mobiles Synology connexes (par ex., DSM mobile et DS file).</li>
<li style="display: none;">La v&eacute;rification en 2&nbsp;&eacute;tapes s&apos;applique &eacute;galement &agrave; tous les services en rapport avec SSH, tels que SSH terminal, SFTP et rsync avec le chiffrement du transfert SSH. Toutefois, comme Hyper Backup et Shared Folder Sync via rsync avec le chiffrement du transfert SSH ne prennent pas en charge la v&eacute;rification en 2&nbsp;&eacute;tapes, ces deux services ne peuvent pas fonctionner normalement apr&egrave;s l&apos;activation de cette v&eacute;rification.</li>

</ul>
</div>


<h4>Pour r&eacute;initialiser les param&egrave;tres de la v&eacute;rification en 2&nbsp;&eacute;tapes des utilisateurs&nbsp;:</h4>

<p>Les utilisateurs appartenant au groupe <strong>administrators</strong> peuvent r&eacute;initialiser les param&egrave;tres de la v&eacute;rification en 2&nbsp;&eacute;tapes des autres utilisateurs.<ol>
<li>Acc&eacute;dez &agrave; <strong>Panneau de configuration</strong> &gt; <strong>Utilisateur</strong>.</li>
<li>Double-cliquez sur l&apos;utilisateur dont vous voulez r&eacute;initialiser la v&eacute;rification en 2&nbsp;&eacute;tapes.</li>
<li>Sur l&apos;onglet <strong>Informations utilisateur</strong>, cliquez sur le bouton <strong>R&eacute;initialiser la v&eacute;rification en 2&nbsp;&eacute;tapes</strong>.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Si un utilisateur appartenant au groupe <strong>administrators</strong> n&apos;est pas disponible, vous pouvez appuyer sur le bouton de r&eacute;initialisation physique sur votre Synology NAS pour r&eacute;initialiser les param&egrave;tres DSM et d&eacute;sactiver la v&eacute;rification en 2&nbsp;&eacute;tapes.</li>
</ul>
</div>


<h3>Activit&eacute; du compte</h3>
<p>L&apos;activit&eacute; du compte indique l&apos;activit&eacute; de connexion de votre compte DSM, notamment les connexions actuelles, les p&eacute;riph&eacute;riques m&eacute;moris&eacute;s et l&apos;historique de connexion.</p>


<h4>Pour v&eacute;rifier l&apos;activit&eacute; de votre compte&nbsp;:</h4>
<p>Cliquez sur le bouton <strong>Activit&eacute; du compte</strong>. Une fen&ecirc;tre contextuelle s&apos;affiche et pr&eacute;sente les onglets suivants&nbsp;:<ul>
<li><strong>Utilisateurs connect&eacute;s&nbsp;:</strong> Cet onglet affiche les informations suivantes&nbsp;:<ul>
<li><strong>Date et heure&nbsp;:</strong> Date et heure du dernier acc&egrave;s au compte.</li>
<li><strong>Nom du client et IP&nbsp;:</strong> Nom et adresse IP du p&eacute;riph&eacute;rique qui a acc&eacute;d&eacute; au compte. Le nom du client appara&icirc;t uniquement lorsque le compte est acc&eacute;d&eacute; avec le protocole CIFS.</li>
<li><strong>Service&nbsp;:</strong> Protocole utilis&eacute; pour acc&eacute;der au compte.</li>
<li><strong>Ressources&nbsp;:</strong> Ressources syst&egrave;me utilis&eacute;es par le compte.</li>
</ul></li>

<li><strong>P&eacute;riph&eacute;riques m&eacute;moris&eacute;s&nbsp;:</strong> Cet onglet affiche la page de gestion des p&eacute;riph&eacute;riques m&eacute;moris&eacute;s&nbsp;:<ul>
<li><strong>Le p&eacute;riph&eacute;rique actuel n&apos;est pas m&eacute;moris&eacute; / est m&eacute;moris&eacute;&nbsp;:</strong> Cliquez sur <strong>M&eacute;moriser ce p&eacute;riph&eacute;rique</strong> si vous choisissez de m&eacute;moriser le p&eacute;riph&eacute;rique actuel. La v&eacute;rification en 2&nbsp;&eacute;tapes ne sera plus n&eacute;cessaire lorsque vous vous connecterez &agrave; DSM sur ce p&eacute;riph&eacute;rique.</li>

<li><strong>Cesser de m&eacute;moriser d&apos;autres p&eacute;riph&eacute;riques&nbsp;:</strong> Vous pouvez arr&ecirc;ter la m&eacute;morisation d&apos;autres p&eacute;riph&eacute;riques (par exemple d&apos;autres ordinateurs ou p&eacute;riph&eacute;riques mobiles) qui ont &eacute;t&eacute; pr&eacute;c&eacute;demment m&eacute;moris&eacute;s. Cela signifie que la v&eacute;rification en 2&nbsp;&eacute;tapes sera n&eacute;cessaire lorsque vous vous connecterez &agrave; DSM sur ces p&eacute;riph&eacute;riques.</li>
</ul></li>


<li><strong>Historique de connexion&nbsp;:</strong> Cet onglet affiche les sessions de connexion r&eacute;centes et les informations suivantes&nbsp;:<ul>
<li><strong>Date et heure&nbsp;:</strong> Date et heure du dernier acc&egrave;s au compte.</li>
<li><strong>&Eacute;v&eacute;nement&nbsp;:</strong> Indique le nom d&apos;utilisateur et l&apos;adresse IP.</li>
</ul>
</li>
</ul>


<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>Le p&eacute;riph&eacute;rique que vous avez marqu&eacute; comme m&eacute;moris&eacute; sera m&eacute;moris&eacute; uniquement lorsque vous vous connecterez avec le m&ecirc;me compte et &agrave; partir du m&ecirc;me navigateur. Vous serez invit&eacute; &agrave; saisir un OTP (mot de passe &agrave; usage unique) pour la v&eacute;rification en 2&nbsp;&eacute;tapes dans les sc&eacute;narios suivants, m&ecirc;me si vous avez pr&eacute;c&eacute;demment marqu&eacute; un p&eacute;riph&eacute;rique comme m&eacute;moris&eacute;&nbsp;:</p>
<ul>
<li>Vous vous connectez avec le m&ecirc;me compte, mais sur un navigateur diff&eacute;rent.</li>
<li>Vos cookies ont &eacute;t&eacute; supprim&eacute;s du navigateur.</li>
<li>Vous marquez un p&eacute;riph&eacute;rique comme m&eacute;moris&eacute; lors de la connexion en tant qu&apos;utilisateur A, puis vous marquez le m&ecirc;me p&eacute;riph&eacute;rique comme m&eacute;moris&eacute; lorsque vous vous connectez en tant qu&apos;utilisateur B. Lorsque vous vous connecterez &agrave; nouveau en tant qu&apos;utilisateur A, vous devrez encore saisir un mot de passe pour la v&eacute;rification en 2&nbsp;&eacute;tapes.</li>
</ul>

</div>


</body>
</html>