<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Compte email - Aide Synology DSM</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Compte email</h2>

<p>Vous pouvez ajouter vos comptes email dans <b>Personnel</b> &gt; <b>Compte email</b> et envoyer les fichiers stock&eacute;s dans File Station comme pi&egrave;ces jointes &agrave; partir des adresses email ajout&eacute;es ici. En outre, vous pouvez &eacute;galement ajouter votre compte email dans <b>Param&egrave;tres</b> &gt; <b>Compte email</b> dans Drive et Calendar. Une fois le compte ajout&eacute;, vous pouvez envoyer un message d&apos;invitation &agrave; un &eacute;v&eacute;nement via Calendar et une notification par email lorsque vous partagez des fichiers sur Drive avec d&apos;autres personnes.</p>
<p>Prend en charge les fournisseurs de service email Gmail, Outlook et le serveur SMTP personnalis&eacute;.</p>

<h4>Pour ajouter un compte e-mail&nbsp;:</h4>
<ol>
<li>Cliquez sur <b>Ajouter</b> et choisissez le fournisseur de service du compte email que vous souhaitez configurer.</li>
<li>Entrez votre adresse email, un mot de passe et le nom de l&apos;&eacute;metteur.</li>

<li>Activez la case &agrave; cocher <b>Utiliser ce compte email par d&eacute;faut</b> si vous pr&eacute;f&eacute;rez laisser File Station, Calendar et Drive utiliser ce compte email par d&eacute;faut lorsque vous avez de nombreux comptes &agrave; configurer.</li>

<li>Cliquez sur <b>Synchroniser les contacts</b> pour synchroniser vos contacts email vers Synology NAS si votre fournisseur de service email (Gmail ou Outlook) prend en charge cette propri&eacute;t&eacute;. Notez que les contacts synchronis&eacute;s proviendront du compte email que vous avez renseign&eacute; dans la fen&ecirc;tre d&apos;authentification qui appara&icirc;t et non de celui entr&eacute; &agrave; l&apos;&eacute;tape pr&eacute;c&eacute;dente. Par cons&eacute;quent, si vous trouvez un compte diff&eacute;rent ou inattendu affich&eacute; dans la fen&ecirc;tre d&apos;authentification, veuillez basculer manuellement vers le compte email souhait&eacute; ou vers celui que vous avez pr&eacute;c&eacute;demment renseign&eacute;.</li>
<li>Cliquez sur <b>Appliquer</b> pour enregistrer les param&egrave;tres.</li>
</ol>
	
<h4>Pour modifier un compte email&nbsp;:</h4>
<p>Choisissez le compte email souhait&eacute; dans la liste et cliquez sur <b>Modifier</b>.</p>

<h4>Pour supprimer un compte email&nbsp;:</h4>
<p>Choisissez le compte email souhait&eacute; dans la liste et cliquez sur <b>Supprimer</b>.</p>
<div class="section">
<h4>Remarque&nbsp;:</h4>	
<ul>
<li>Le compte par d&eacute;faut ne peut pas &ecirc;tre supprim&eacute;, &agrave; moins qu&apos;il n&apos;y ait aucun autre compte existant. Si vous voulez supprimer un compte email qui est actuellement d&eacute;fini comme compte email par d&eacute;faut, veuillez d&eacute;finir un autre compte par d&eacute;faut avant de continuer.</li>
</ul>
</div>

<h4>Pour modifier le compte par d&eacute;faut&nbsp;:</h4>
<p>Dans la liste d&eacute;roulante, s&eacute;lectionnez le compte email que vous voulez configurer par d&eacute;faut et cliquez sur <b>Configurer par d&eacute;faut</b>.</p>


<h4>Pour envoyer les fichiers en pi&egrave;ce jointe&nbsp;:</h4>
<ol>
<li>Cliquez avec le bouton droit sur les fichiers appropri&eacute;s dans File Station et choisissez <b>Envoyer en tant que pi&egrave;ces jointes de l&apos;email</b>.</li>
<li>Si vous avez ajout&eacute; plusieurs comptes email, vous pouvez choisir votre adresse email d&apos;exp&eacute;diteur dans la liste d&eacute;roulante pour envoyer les fichiers vers un destinataire sp&eacute;cifi&eacute;.</li>
</ol>
</body>
</html>
