<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>High Availability</title>


 </head>
 <body>
<h2>Lagerstatus</h2>
	<p>Denne side detaljerer status for lagerdiskenhederne og iSCSI LUN'er (blokniveau) p&aring; den aktive og passive server i High Availability-klyngen.</p>
    <p>Da kapaciteten og konfigurationerne p&aring; de tilsvarende diskenheder og iSCSI LUN'er (blokniveau) p&aring; den aktive og passive server skal v&aelig;re identiske, vises diskenhederne og iSCSI LUN (blokniveau) p&aring; de to servere samlet som enkelte enheder. Hvis du derfor vil se status for diskenheder og iSCSI LUN'er (blokniveau) for b&aring;de den aktive og passive server, skal du g&aring; til siden <b>Lagerstatus</b> [n&aring;r du &aring;bner High Availability-klyngen kan kun diskenheder og iSCSI LUN'er (blokniveau) p&aring; den aktive server ses i <b>Lagerstyring</b>].</p>

    <p>Denne side indeholder f&oslash;lgende oplysninger:</p>
		<ul>
			<li><b>Navn</b>: Viser navnene p&aring; diskenheder og iSCSI LUN'er (blokniveau).</li>
			<li><b>Brugt:</b> Viser anvendelsesprocent af kapaciteten p&aring; diskenheder og iSCSI LUN'er (blokniveau).</li>
			<li><b>Brugt/samlet st&oslash;rrelse:</b>  Viser den samlede og brugte kapacitet p&aring; diskenheder og iSCSI LUN'er (blokniveau).</li>
            <li><b>Status:</b> Viser status for diskenheder og iSCSI LUN'er (blokniveau) og SSD-caches.</li>
            <li><b>Beskrivelse:</b> Viser beskrivelse af fejl eller andre oplysninger vedr&oslash;rende diskenheden og iSCSI LUN (blokniveau) og SSD-caches.</li>
		</ul>
<h4>S&aring;dan reparerer du en fejlet diskenhed eller iSCSI LUN (blokniveau):</h4>
	<ul>
		<li>Hvis en harddisk p&aring; en af serverne er brudt ned, kan du g&aring; til siden <a href="disk.html">Diskstatus</a> for at fastl&aelig;gge den harddisk, der er brudt ned og skal udskiftes. I det tilf&aelig;lde skal du g&oslash;re f&oslash;lgende:
        	<ol>
            	<li>Udskift den nedbrudte harddisk (for trin vedr&oslash;rende harddiskinstallation, skal du g&aring; til <i>Hurtig installationsvejledning</i> for dit Synology-produkt).</li>
                <li>G&aring; til siden <b>Lagerstatus</b>, og klik p&aring; <b>Reparer</b>.</li>
            </ol>
        </li>
        <li>Hvis den passive server er offline, vil status for diskenheder og iSCSI LUN'er (blokniveau) angive, at der er sket en fejl, og ingen af diskene p&aring; den passive server bliver vist p&aring; siden Diskstatus. I det tilf&aelig;lde kan du fors&oslash;ge at l&oslash;se problemet ved at g&oslash;re f&oslash;lgende:
        	<ol>
            	<li>S&oslash;rg for, at den passive server er t&aelig;ndt.</li>
                <li>Kontroller alle str&oslash;mforsyninger.</li>
                <li>Unders&oslash;g alle forbindelser.</li>
            </ol>
        </li>
        <li>Hvis der sker en systemfejl p&aring; en diskenhed eller iSCSI LUN (blokniveau) p&aring; en a serverne, skal du g&oslash;re f&oslash;lgende:
        	<ul>
            	<li>G&aring; til siden <b>Lagerstatus</b>.</li>
                <li>Klik p&aring; <b>Reparer.</b></li>
            </ul>
        </li>
	</ul>

<p><span class="note_head">Bem&aelig;rk:</span>  Gr&aelig;nsen for diskenheder og iSCSI LUN'er (blokniveau) p&aring; en High Availability-klynge er 64.</p>



<h3>Quorum-server</h3>
<p>Quorum-servere kan hj&aelig;lpe med at reducere muligheden for fejl ved opdelt hjerne. I indstillinger med opdelt hjerne kan du tildele en anden server som quorum-server, n&aring;r blot den hele tiden har forbindelse til b&aring;de den aktive og den passive server. F.eks. er en gateway-server eller DNS-server et passende valg til quorum-server, da den kan oprette forbindelse to b&aring;de den aktive og passive server. Bem&aelig;rk, at quorum-server kun er til at yde ping-tjenester, og der kr&aelig;ves ingen programmer til installation. Her n&aelig;vnes omst&aelig;ndigheder, der opst&aring;r, n&aring;r quorum-server er aktiveret:</p>

<ul>
<li>Hvis den passive server ikke kan oprette forbindelse til b&aring;de den aktive og passive server, udf&oslash;res der ikke Failover for at forhindre fejl i opdelt hjerne.</li>
<li>Hvis den aktive server ikke kan oprette forbindelse til quorum-serveren, mens den passive server kan, udl&oslash;ses switchover for at sikre bedre tilg&aelig;ngelighed.</li>
</ul>

 </body>
</html>
