<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>HDD/SSD</h2>
<p>Cette section vous permet de surveiller et de comprendre l&apos;&eacute;tat des disques de stockage interne install&eacute;s sur votre Synology&nbsp;NAS. Acc&eacute;dez &agrave; <b>Gestionnaire de stockage</b>&nbsp;&gt; <b>HDD/SSD</b> pour g&eacute;rer ces options.</p>


<ul>
	<li><a href="#Statuses">Informations et &eacute;tats du disque</a></li>
	<li><a href="#Analytics">Tests et analyses du disque</a></li>
	<li><a href="#Tests">Planification et gestion des tests du disque</a></li>
	<li><a href="#Settings">Param&egrave;tres et &eacute;tat d&apos;avertissement du disque</a></li>
	<li><a href="#Erase">Secure&nbsp;Erase</a></li>
	<li><a href="#Drive">Activation ou d&eacute;sactivation du disque</a></li>
	<li><a href="#Status">&Eacute;tat du voyant&nbsp;LED du disque</a></li>
	<li><a href="#Cache">Cache en &eacute;criture</a></li>
	<li><a href="#Database">Base de donn&eacute;es du disque</a></li>
</ul>


<h3><a name="Statuses"></a>Informations et &eacute;tats du disque</h3>
<p>Pour en savoir plus sur les informations relatives &agrave; chaque disque et sur son &eacute;tat d&apos;int&eacute;grit&eacute;, acc&eacute;dez &agrave; <b>Gestionnaire de stockage</b>&nbsp;&gt; <b>HDD/SSD</b>.</p>

<h4>Pour v&eacute;rifier les informations HDD/SSD&nbsp;:</h4>
	<ol>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>HDD/SSD</b>.</li>
		<li>S&eacute;lectionnez un disque dans la liste et d&eacute;veloppez-le. Vous y trouverez l&apos;&eacute;tat d&apos;int&eacute;grit&eacute;, les informations sur le groupe de stockage, le nom du mod&egrave;le, le num&eacute;ro de s&eacute;rie, la version du micrologiciel, la temp&eacute;rature et d&apos;autres informations.</li>
	</ol>	
	
<div class="section"><h4>Remarque&nbsp;:</h4>
	<ul>
		<li>Nous vous recommandons vivement d&apos;utiliser les disques figurant dans la <a href="https://www.synology.com/compatibility?search_by=category&category=hdds&p=1" target=blank>Liste de compatibilit&eacute; des produits Synology</a> afin d&apos;&eacute;viter tout probl&egrave;me. L&apos;utilisation de disques non compatibles pourrait r&eacute;duire les performances syst&egrave;me et provoquer une perte de donn&eacute;es sur votre Synology NAS.</li>
	</ul>
</div>

<h4>Pour v&eacute;rifier les informations sur l&apos;int&eacute;grit&eacute;&nbsp;:</h4>
	<ol>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>HDD/SSD</b>.</li>
		<li>S&eacute;lectionnez un disque.</li>
		<li>Cliquez sur <b>Infos sur la sant&eacute;</b>.</li>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>Vue d&apos;ensemble</b> pour savoir pendant combien d&apos;heures le disque a &eacute;t&eacute; sous tension et afficher sa temp&eacute;rature actuelle, le nombre de reconnexions et/ou r&eacute;identifications ainsi que le nombre de secteurs d&eacute;fectueux.</li>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>S.M.A.R.T.</b> pour effectuer les tests de diagnostic sur le disque pris en charge et afficher les attributs S.M.A.R.T. Dans la section <b>Test S.M.A.R.T.</b>, vous pouvez ex&eacute;cuter un test S.M.A.R.T. imm&eacute;diatement et afficher les r&eacute;sultats et le programme du test&nbsp;; dans la section <b>Attributs S.M.A.R.T.</b>, vous pouvez afficher les d&eacute;tails des valeurs d&apos;attribut S.M.A.R.T.</li>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>Sant&eacute; IronWolf</b> pour effectuer les tests de diagnostic sur le disque pris en charge.</li>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>Historique</b> pour afficher et exporter les r&eacute;sultats du diagnostic d&apos;int&eacute;grit&eacute; et afficher l&apos;historique des principaux attributs S.M.A.R.T.</li>
	</ol>

	<table>
		<tr>
			<th>&Eacute;tat du disque</th>
			<th>Condition d&apos;int&eacute;grit&eacute;</th>
		</tr>
		<tr>
			<td>Sain</td>
			<td>Soit le disque est en bon &eacute;tat, soit l&apos;avertissement relatif au disque a &eacute;t&eacute; supprim&eacute; ou d&eacute;sactiv&eacute;.</td>
		</tr>
		<tr>
			<td>Avertissement</td>
			<td>Des probl&egrave;mes ont &eacute;t&eacute; d&eacute;tect&eacute;s ou le nombre de secteurs d&eacute;fectueux a augment&eacute; sur ce disque. Nous vous recommandons de surveiller le disque m&ecirc;me s&apos;il fonctionne toujours correctement.</td>
		</tr>
		<tr>
			<td>Critique</td>
			<td>Un probl&egrave;me critique ou plusieurs probl&egrave;mes ont &eacute;t&eacute; d&eacute;tect&eacute;s sur le disque. Il est vivement recommand&eacute; de remplacer le disque imm&eacute;diatement.</td>
		</tr>
		<tr>
			<td>Panne</td>
			<td>Plusieurs probl&egrave;mes critiques ont &eacute;t&eacute; d&eacute;tect&eacute;s sur le disque. L&apos;int&eacute;grit&eacute; du disque n&apos;est pas garantie lorsque des disques sont dans cet &eacute;tat.</td>
		</tr>
		<tr>
			<td>Erreur d&apos;acc&egrave;s</td>
			<td>Des erreurs de communication du disque peuvent avoir provoqu&eacute; sa d&eacute;connexion du syst&egrave;me ou entra&icirc;n&eacute; une panne grave de lecture/&eacute;criture. Cet &eacute;tat d&apos;int&eacute;grit&eacute; indique g&eacute;n&eacute;ralement que des probl&egrave;mes graves sont survenus.</td>
		</tr>
	</table>

<div class="section"><h4>Remarque&nbsp;:</h4>
	<ul>
		<li>Toutes les fonctions S.M.A.R.T. ne sont pas prises en charge sur les disques SAS ou les SSD NVMe.</li>
		<li>Le test d&apos;int&eacute;grit&eacute; IronWolf est uniquement pris en charge sur certains disques Seagate.</li>
	</ul>
</div>



<h3><a name="Analytics"></a>Tests et analyses du disque</h3>
<p>Les tests et analyses ci-dessous peuvent &ecirc;tre effectu&eacute;s sur les disques qui sont install&eacute;s si le mod&egrave;le du disque et le mod&egrave;le de Synology&nbsp;NAS prennent en charge ces fonctions.</p>

<h4>Pour d&eacute;marrer le test S.M.A.R.T.&nbsp;:</h4>
<p>La section Test S.M.A.R.T. examinera l&apos;&eacute;tat de vos disques et &eacute;tablira un rapport, vous avertissant d&apos;&eacute;ventuelles d&eacute;faillances des disques. Il est recommand&eacute; de changer rapidement vos disques en cas d&apos;&eacute;chec du test.</p>
	<ol>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>HDD/SSD</b>.</li>
		<li>S&eacute;lectionnez un disque.</li>
		<li>Cliquez sur <b>Infos sur la sant&eacute;</b>.</li>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>S.M.A.R.T.</b></li>
		<li>Choisissez un type de test et cliquez sur <b>D&eacute;marrer</b> pour lancer le test.</li>
		<li>Les r&eacute;sultats du test sont affich&eacute;s dans la section <b>R&eacute;sultat du test</b>.</li>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>Historique</b> pour afficher les r&eacute;sultats des tests pr&eacute;c&eacute;dents.</li>
	</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
	<ul>
		<li>Le temps n&eacute;cessaire &agrave; l&apos;ex&eacute;cution du test S.M.A.R.T. peut varier en fonction de l&apos;utilisation du syst&egrave;me et de la capacit&eacute; du disque.</li> 
		<li>Le r&eacute;sultat du test est <b>Normal</b> ou <b>Panne</b>.</li>
		<li>Les SSD&nbsp;NVMe disposent d&apos;un m&eacute;canisme de surveillance int&eacute;gr&eacute; et ne prennent donc pas en charge le test S.M.A.R.T. ni l&apos;avertissement relatif &agrave; des secteurs d&eacute;fectueux.</li>
	</ul>
</div>

<h4>Pour d&eacute;marrer le test d&apos;int&eacute;grit&eacute; IronWolf&nbsp;:</h4>
<p>Seagate&nbsp;IronWolf&nbsp;Health&nbsp;Management repose sur des donn&eacute;es t&eacute;l&eacute;m&eacute;triques de disque suppl&eacute;mentaires qui comportent plus d&apos;informations que le test S.M.A.R.T. Nous vous recommandons de suivre les suggestions indiqu&eacute;es dans chacun des &eacute;tats de r&eacute;sultat de test. Uniquement disponible sur certains mod&egrave;les.</p>
	<ol>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>HDD/SSD</b>.</li>
		<li>S&eacute;lectionnez un disque.</li>
		<li>Cliquez sur <b>Infos sur la sant&eacute;</b>.</li> 
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>IronWolf Health</b>.</li>
		<li>Cliquez sur <b>D&eacute;marrer</b> pour commencer le test. La section <b>R&eacute;sultat du test</b> affiche les r&eacute;sultats du dernier test.</li>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>Historique</b> pour afficher les r&eacute;sultats des tests pr&eacute;c&eacute;dents.</li>
	</ol>
	
<p>Consultez le tableau ci-dessous pour une pr&eacute;sentation des codes de sortie du test d&apos;int&eacute;grit&eacute; IronWolf.</p>
	<table>
		<tr>
			<th>Codes de sortie d&apos;IronWolf Health Management</th>
			<th>D&eacute;finition</th>
		</tr>
		<tr>
			<td>100</td>
			<td>Une temp&eacute;rature de fonctionnement anormalement &eacute;lev&eacute;e a &eacute;t&eacute; d&eacute;tect&eacute;e. Veuillez vous assurer que les ports de ventilation arri&egrave;re ne sont pas obstru&eacute;s et essayez de r&eacute;duire la temp&eacute;rature ambiante. Si la temp&eacute;rature est toujours &eacute;lev&eacute;e, acc&eacute;dez &agrave; <b>Panneau de configuration</b>&nbsp;&gt; <b>Mat&eacute;riel et alimentation</b>&nbsp;&gt; <b>Mode de vitesse du ventilateur</b> pour augmenter la vitesse de fonctionnement du ventilateur. Si le probl&egrave;me persiste, veuillez contacter l&apos;&eacute;quipe d&apos;assistance de Synology.</td>
		</tr>
		<tr>
			<td>101</td>
			<td>Un probl&egrave;me de connexion sur votre Synology NAS et l&apos;interface du disque dur a &eacute;t&eacute; d&eacute;tect&eacute;. Veuillez vous assurer que le disque est correctement install&eacute; dans le ch&acirc;ssis ou le tiroir de disque et que ce tiroir est correctement install&eacute; dans votre Synology NAS. Si le probl&egrave;me persiste, veuillez contacter l&apos;&eacute;quipe d&apos;assistance de Synology.</td>
		</tr>
		<tr>
			<td>102</td>
			<td>Un choc physique excessif sur le disque a &eacute;t&eacute; d&eacute;tect&eacute;. Veuillez vous assurer que votre disque dur et Synology NAS se trouvent sur une surface stable. Si le probl&egrave;me persiste, veuillez contacter l&apos;&eacute;quipe d&apos;assistance de Synology.</td>
		</tr>
		<tr>
			<td>105</td>
			<td>Des vibrations excessives ont &eacute;t&eacute; d&eacute;tect&eacute;es. Veuillez vous assurer que votre Synology NAS est plac&eacute; sur une surface stable. Si le probl&egrave;me persiste, veuillez contacter l&apos;&eacute;quipe d&apos;assistance de Synology.</td>
		</tr>
		<tr>
			<td>106</td>
			<td>Un nombre excessif de r&eacute;initialisations de l&apos;h&ocirc;te a &eacute;t&eacute; d&eacute;tect&eacute;. Veuillez vous assurer que le disque est correctement install&eacute; dans le ch&acirc;ssis ou le tiroir de disque. Nous vous recommandons d&apos;effectuer un cycle de mise hors/sous-tension. Si le probl&egrave;me persiste, veuillez contacter l&apos;&eacute;quipe d&apos;assistance de Synology.</td>
		</tr>
		<tr>
			<td>200, 201, 202 et 203</td>
			<td>Pour v&eacute;rifier l&apos;&eacute;tat d&apos;int&eacute;grit&eacute; de votre disque, il est recommand&eacute; d&apos;ex&eacute;cuter un test approfondi S.M.A.R.T. sur le disque. Si le probl&egrave;me persiste, contactez le revendeur ou le fabricant du disque.</td>
		</tr>
	</table>

<div class="section"><h4>Remarque&nbsp;:</h4>
	<ul>
		<li>Le temps n&eacute;cessaire &agrave; l&apos;ex&eacute;cution du test d&apos;int&eacute;grit&eacute; IronWolf peut varier en fonction de l&apos;utilisation du syst&egrave;me.</li>
		<li>Les performances du syst&egrave;me peuvent &ecirc;tre temporairement r&eacute;duites lors de l&apos;ex&eacute;cution d&apos;un test d&apos;int&eacute;grit&eacute; IronWolf.</li>
		<li>Les codes de sortie par le test IronWolf Health s&apos;affichent avec la liste des actions recommand&eacute;es. De nouveaux codes pourraient &ecirc;tre ajout&eacute;s dans les futures mises &agrave; jour de DSM.</li>
	</ul>
</div>


<h4>Pour effectuer un benchmark&nbsp;:</h4>
<p>Veuillez noter que ce test n&apos;est disponible que sur certains mod&egrave;les de Synology&nbsp;NAS appartenant aux s&eacute;ries&nbsp;<b>XS</b> et <b>XS+</b>. Suivez les &eacute;tapes ci-dessous pour effectuer un test sur un disque&nbsp;:</p>
<ol>
	<li>Acc&eacute;dez &agrave; l&apos;onglet <b>HDD/SSD</b>.</li>
	<li>S&eacute;lectionnez un lecteur et cliquez sur <b>Benchmark</b>.</li>
	<li>Dans la fen&ecirc;tre qui s&apos;affiche, cliquez sur <b>Ex&eacute;cuter le test maintenant</b> pour lancer le test de performances. Les r&eacute;sultats s&apos;affichent ici une fois le test termin&eacute;.</li>
	<li>Pour comparer le r&eacute;sultat aux tests pr&eacute;c&eacute;dents, cliquez sur <b>S&eacute;lectionner</b> dans le champ <b>Test compar&eacute;</b> pour choisir le journal souhait&eacute;.</li>
</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
	<ul>
		<li>D&eacute;bit s&eacute;quentiel, IOPS al&eacute;atoire et latence sont inclus dans le test de performances, qui prend environ 18&nbsp;minutes.</li>
		<li>Il existe deux types de tests&nbsp;: <b>basique</b> et <b>&eacute;tendu</b>.<ul>
				<li>Pour les disques utilis&eacute;s pour le RAID, vous ne pouvez effectuer que des tests basiques et les donn&eacute;es figurant sur le disque ne sont pas affect&eacute;es. Toutefois, vous ne pouvez pas tester les performances en &eacute;criture pour les HDD utilis&eacute;s pour le RAID.</li>
				<li>Dans les autres cas, des tests approfondis seront effectu&eacute;s pour am&eacute;liorer la pr&eacute;cision. Toutefois, les tests de performances ne garantissent pas l&apos;int&eacute;grit&eacute; des donn&eacute;es. Par cons&eacute;quent, assurez-vous qu&apos;aucune donn&eacute;e importante ne figure sur les disques avant de proc&eacute;der au Benchmark.</li>
			</ul>
		</li>
		<li>Afin de garantir la disponibilit&eacute; du syst&egrave;me, vous ne pouvez pas effectuer de tests sur plus de trois disques &agrave; la fois ou s&apos;il ne reste qu&apos;un seul disque dans les mod&egrave;les xs/xs+. En outre, lorsque l&apos;utilisation du disque d&eacute;passe 5&nbsp;%, une confirmation vous est &agrave; nouveau demand&eacute;e par le syst&egrave;me avant de proc&eacute;der au test de performances, afin d&apos;en assurer la pr&eacute;cision.</li>
		<li>Il est possible de comparer les r&eacute;sultats du Benchmark avec ceux des tests pr&eacute;c&eacute;dents. Lorsque la diff&eacute;rence est sup&eacute;rieure &agrave; 5&nbsp;%, vous recevez une alerte.</li>
		<li>Le Benchmark de disque fonctionne en faible priorit&eacute; sous DSM pour assurer un impact minimal sur les autres services lorsqu&apos;il est ouvert. Les chiffres pr&eacute;sent&eacute;s peuvent varier en fonction de la charge et de la configuration du syst&egrave;me. Ces chiffres ne doivent servir que de r&eacute;f&eacute;rence pour estimer la fonctionnalit&eacute; d&apos;un disque et ne sont pas comparables entre diff&eacute;rents mod&egrave;les ou versions de DSM.</li>
	</ul>
</div>



<h3><a name="Tests"></a>Planification et gestion des tests du disque</h3>
<p>Le test S.M.A.R.T. et le test IronWolf Health peuvent &ecirc;tre planifi&eacute;s pour s&apos;ex&eacute;cuter automatiquement sur les disques. Veuillez noter que ces tests ne sont pris en charge que sur certains mod&egrave;les. Vous pouvez consulter la section <a href="#Analytics">Tests et analyses du disque</a> pour obtenir les informations correspondantes, puis suivez les &eacute;tapes indiqu&eacute;es ci-dessous pour planifier et g&eacute;rer des tests.</p>

<h4>Pour planifier les tests S.M.A.R.T.&nbsp;:</h4>
<p>Les tests S.M.A.R.T. peuvent &ecirc;tre planifi&eacute;s pour s&apos;ex&eacute;cuter automatiquement sur des disques.</p>
	<ol>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>Planificateur de test</b>.</li>
		<li>Cliquez sur <b>Cr&eacute;er</b> pour configurer une nouvelle t&acirc;che.</li>
		<li>Modifiez les param&egrave;tres suivants sous l&apos;onglet <b>G&eacute;n&eacute;ral</b>&nbsp;:<ul>
				<li><b>Nom de la t&acirc;che&nbsp;:</b> saisissez un nom pour la t&acirc;che.</li>
				<li><b>Type de test S.M.A.R.T.&nbsp;:</b> choisissez entre un test rapide et un test approfondi.</li>
				<li><b>Plage de test S.M.A.R.T.&nbsp;:</b> choisissez les HDD/SSD &agrave; tester chaque fois que le test S.M.A.R.T. est effectu&eacute;.</li>
			</ul>
		</li>
		<li>Sous l&apos;onglet <b>Planification</b>, modifiez les param&egrave;tres suivants&nbsp;:<ul>
				<li><b>Date&nbsp;:</b> sp&eacute;cifiez la date d&apos;ex&eacute;cution du test S.M.A.R.T. qui peut &ecirc;tre planifi&eacute; pour s&apos;ex&eacute;cuter certains jours de la semaine (par exemple, tous les jours, tous les week-ends, tous les dimanches, etc.) ou &agrave; des dates sp&eacute;cifiques (par exemple, le 21/11/2016).</li>
				<li><b>Heure&nbsp;:</b> sp&eacute;cifiez la fr&eacute;quence d&apos;ex&eacute;cution du test S.M.A.R.T. sur les disques, ainsi que le moment de la premi&egrave;re et de la derni&egrave;re ex&eacute;cution.</li>
			</ul>
		</li>
		<li>Cliquez sur <b>OK</b> pour terminer.</li>
	</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
	<ul>
		<li>Si le test S.M.A.R.T. n&apos;est pas planifi&eacute; pour s&apos;ex&eacute;cuter sur un disque sp&eacute;cifique, le bouton <b>Planifier les tests S.M.A.R.T.</b> s&apos;affiche dans <b>Infos sur la sant&eacute;</b>&nbsp;&gt; <b>Vue d&apos;ensemble</b> de ce disque.</li> 
		<li>Si les tests d&apos;int&eacute;grit&eacute; IronWolf et S.M.A.R.T. ne sont pas planifi&eacute;s pour s&apos;ex&eacute;cuter sur un disque, le bouton <b>Planifier un test du disque</b> s&apos;affiche dans <b>Infos sur la sant&eacute;</b>&nbsp;&gt; <b>Vue d&apos;ensemble</b> de ce disque.</li>
		<li>Les SSD&nbsp;NVMe disposent d&apos;un m&eacute;canisme de surveillance int&eacute;gr&eacute; et ne prennent donc pas en charge le test S.M.A.R.T. ni l&apos;avertissement relatif &agrave; des secteurs d&eacute;fectueux.</li>
	</ul>
</div>

<h4>Pour planifier les tests d&apos;int&eacute;grit&eacute; IronWolf&nbsp;:</h4>
<p>Les tests d&apos;int&eacute;grit&eacute; IronWolf peuvent &ecirc;tre planifi&eacute;s pour s&apos;ex&eacute;cuter automatiquement sur les disques.</p>
	<ol>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>Planificateur de test</b>.</li>
		<li>Cliquez sur <b>Cr&eacute;er</b> pour configurer une nouvelle t&acirc;che.</li>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>G&eacute;n&eacute;ral</b> pour modifier les param&egrave;tres suivants&nbsp;:<ul>
				<li><b>Nom de la t&acirc;che&nbsp;:</b> saisissez un nom pour la t&acirc;che.</li>
				<li><b>Test d&apos;int&eacute;grit&eacute; IronWolf&nbsp;:</b> s&eacute;lectionnez le HDD/SSD sur lequel vous souhaitez ex&eacute;cuter le test ou s&eacute;lectionnez tous les disques pris en charge pour ex&eacute;cuter le test sur tous les disques pris en charge.</li>
			</ul>
		</li>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>Planification</b> pour modifier les param&egrave;tres suivants&nbsp;:<ul>
				<li><b>Date&nbsp;:</b> sp&eacute;cifiez la date d&apos;ex&eacute;cution du test d&apos;int&eacute;grit&eacute; IronWolf qui peut &ecirc;tre planifi&eacute; pour s&apos;ex&eacute;cuter certains jours de la semaine (par exemple, tous les jours, tous les week-ends, tous les dimanches, etc.) ou &agrave; des dates sp&eacute;cifiques (par exemple, 21/11/2016).</li>
				<li><b>Heure&nbsp;:</b> sp&eacute;cifiez la fr&eacute;quence d&apos;ex&eacute;cution du test d&apos;int&eacute;grit&eacute; IronWolf sur les disques, ainsi que le moment de la premi&egrave;re et de la derni&egrave;re ex&eacute;cution.</li>
			</ul>
		</li>
		<li>Cliquez sur <b>OK</b> pour terminer.</li>
	</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
	<ul>
		<li>Si le test d&apos;int&eacute;grit&eacute; IronWolf n&apos;est pas planifi&eacute; pour s&apos;ex&eacute;cuter sur un disque sp&eacute;cifique, le bouton <b>Planifier un test d&apos;int&eacute;grit&eacute; IronWolf</b> s&apos;affiche dans <b>Infos sur la sant&eacute;</b>&nbsp;&gt; <b>Vue d&apos;ensemble</b> de ce disque.</li>
		<li>Si les tests d&apos;int&eacute;grit&eacute; IronWolf et S.M.A.R.T. ne sont pas planifi&eacute;s pour s&apos;ex&eacute;cuter sur un disque, le bouton <b>Planifier un test du disque</b> s&apos;affiche dans <b>Infos sur la sant&eacute;</b>&nbsp;&gt; <b>Vue d&apos;ensemble</b> de ce disque.</li>
		<li>Le test d&apos;int&eacute;grit&eacute; IronWolf est disponible seulement sur certains disques durs de la s&eacute;rie IronWolf de Seagate.</li>
	</ul>
</div>



<h3><a name="Settings"></a>Param&egrave;tres et &eacute;tat d&apos;avertissement du disque</h3>
<p>Vous pouvez activer ou d&eacute;sactiver les param&egrave;tres d&apos;avertissement du disque concern&eacute;, si n&eacute;cessaire. Veuillez consulter les &eacute;tapes ci-dessous pour obtenir des instructions d&eacute;taill&eacute;es.</p>

<h4>Pour modifier l&apos;&eacute;tat d&apos;avertissement du disque&nbsp;:</h4>
<p>DSM surveille constamment l&apos;&eacute;tat d&apos;int&eacute;grit&eacute; de vos disques et vous alerte lorsque des probl&egrave;mes sont d&eacute;tect&eacute;s. Certains probl&egrave;mes sont plus graves que d&apos;autres. Pour certains probl&egrave;mes qui entra&icirc;nent un &eacute;tat d&apos;int&eacute;grit&eacute; de type <b>Avertissement</b> (dans <b>Infos sur la sant&eacute;</b>&nbsp;&gt; <b>Vue d&apos;ensemble</b>), il est possible de modifier l&apos;avertissement de la mani&egrave;re suivante&nbsp;:</p>
	<ol>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>HDD/SSD</b>.</li>
		<li>S&eacute;lectionnez le disque &agrave; l&apos;&eacute;tat d&apos;avertissement et cliquez sur <b>Infos sur la sant&eacute;</b>.</li> 
		<li>Cliquez sur <b>Modifier l&apos;avertissement relatif au disque</b>.</li>
		<li>Cliquez sur l&apos;option <b>Supprimer l&apos;avertissement</b> ou <b>D&eacute;sactiver l&apos;avertissement</b> (l&apos;accessibilit&eacute; &agrave; ces deux options d&eacute;pend du type de probl&egrave;me)&nbsp;:<ul>
				<li><b>Supprimer l&apos;avertissement&nbsp;:</b> la surveillance du champ d&eacute;grad&eacute; se poursuivra. Toutefois, les avertissements ne seront d&eacute;clench&eacute;s que lorsque sa valeur continuera &agrave; se d&eacute;grader.</li> 
				<li><b>D&eacute;sactiver l&apos;avertissement&nbsp;:</b> la surveillance du champ S.M.A.R.T. sera d&eacute;finitivement d&eacute;sactiv&eacute;e.</li>
			</ul>
		</li>
	</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
	<ul>
		<li>La modification de l&apos;&eacute;tat d&apos;avertissement du disque ne r&eacute;sout pas les probl&egrave;mes survenus sur le disque et n&apos;&eacute;vite pas leur apparition. Par cons&eacute;quent, cette action ne doit pas &ecirc;tre consid&eacute;r&eacute;e comme une solution &agrave; long terme.</li>
		<li>Notez qu&apos;un avertissement concernant des probl&egrave;mes S.M.A.R.T. indique g&eacute;n&eacute;ralement qu&apos;un probl&egrave;me est survenu sur le disque. Ignorer l&apos;avertissement peut entra&icirc;ner une perte de donn&eacute;es.</li>
		<li>Certains champs S.M.A.R.T. sont d&eacute;sign&eacute;s comme critiques et ne peuvent &ecirc;tre ni supprim&eacute;s, ni d&eacute;sactiv&eacute;s.</li>
	</ul>
</div>

<h4>Pour activer la prise en charge des avertissements relatifs aux secteurs d&eacute;fectueux&nbsp;:</h4>
<p>L&apos;activation de l&apos;avertissement relatif aux secteurs d&eacute;fectueux du disque vous permet d&apos;&ecirc;tre inform&eacute; lorsque des secteurs d&eacute;fectueux sont d&eacute;tect&eacute;s sur le disque et de prendre imm&eacute;diatement les mesures ad&eacute;quates. Cette option est activ&eacute;e par d&eacute;faut, mais n&apos;est disponible que sur certains mod&egrave;les.</p>
	<ol>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>Param&egrave;tres</b>.</li>
		<li>Cochez la case <b>Activer l&apos;avertissement relatif aux secteurs d&eacute;fectueux</b>. Par d&eacute;faut, cette fonction est activ&eacute;e.</li>
		<li>Cliquez sur <b>Appliquer</b>.</li>
	</ol>

<h4>Pour activer la notification relative &agrave; la dur&eacute;e de vie du SSD&nbsp;:</h4>
<p>La notification relative &agrave; la dur&eacute;e de vie du SSD peut vous avertir lorsque la dur&eacute;e de vie estim&eacute;e d&apos;un SSD atteint une valeur sp&eacute;cifi&eacute;e, vous permettant ainsi de prendre instantan&eacute;ment les mesures ad&eacute;quates. Cette option est activ&eacute;e par d&eacute;faut, mais elle n&apos;est prise en charge que sur certains SSD.</p>
	<ol>
		<li>Acc&eacute;dez &agrave; <b>HDD/SSD</b>&nbsp;&gt; <b>Param&egrave;tres</b>.</li>
		<li>Acc&eacute;dez &agrave; la section <b>Notification relative &agrave; la dur&eacute;e de vie estim&eacute;e du SSD</b> pour activer la notification relative &agrave; la dur&eacute;e de vie.<ul>
				<li>Cochez la case <b>Activer la notification relative &agrave; la dur&eacute;e de vie</b> et d&eacute;finissez une valeur dans le champ <b>Dur&eacute;e de vie (%)</b>. Le syst&egrave;me envoie une notification pour vous avertir lorsque la dur&eacute;e de vie estim&eacute;e du SSD atteint la valeur sp&eacute;cifi&eacute;e.</li>
				<li>Cochez la case <b>Activer la notification relative &agrave; la dur&eacute;e de vie estim&eacute;e (temporel) pour les SSD&nbsp;Synology</b> et d&eacute;finissez une valeur dans le champ <b>Dur&eacute;e de vie (mois)</b>. Le syst&egrave;me envoie une notification pour vous avertir lorsque la dur&eacute;e de vie estim&eacute;e du SSD atteint la valeur sp&eacute;cifi&eacute;e. Cette fonctionnalit&eacute; est r&eacute;serv&eacute;e aux SSD&nbsp;Synology.</li>
			</ul>
		</li>
		<li>Cliquez sur <b>Appliquer</b>.</li>
	</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
	<ul>
		<li>La valeur de la dur&eacute;e de vie du SSD est g&eacute;n&eacute;r&eacute;e directement &agrave; partir des informations S.M.A.R.T. Si le SSD ne prend pas en charge l&apos;attribut S.M.A.R.T. correspondant, cette fonctionnalit&eacute; ne sera pas prise en charge.</li>
		<li>La dur&eacute;e de vie d&apos;un SSD Synology est estim&eacute;e en fonction de sa charge de travail d&apos;E/S r&eacute;cente. Pour un SSD nouvellement mont&eacute;, le syst&egrave;me peut prendre jusqu&apos;&agrave; 24&nbsp;heures pour g&eacute;n&eacute;rer un r&eacute;sultat.</li>
		<li>La dur&eacute;e de vie d&apos;un SSD&nbsp;Synology ne s&apos;affiche dans l&apos;onglet <b>HDD/SSD</b> et dans <b>Infos sur la sant&eacute;</b> que lorsque la dur&eacute;e de vie estim&eacute;e du SSD (temporel) chute et atteint la valeur sp&eacute;cifi&eacute;e.</li>
	</ul>
</div>



<h3><a name="Erase"></a>Secure&nbsp;Erase</h3>
<p>Vous pouvez ex&eacute;cuter Secure Erase si vous souhaitez effacer toutes les donn&eacute;es d&apos;un disque sp&eacute;cifique. Cependant, veuillez noter que Secure Erase supprime les donn&eacute;es stock&eacute;es sur votre disque de mani&egrave;re permanente. Veuillez vous assurer que le disque s&eacute;lectionn&eacute; n&apos;est pas utilis&eacute; ou que les donn&eacute;es ont &eacute;t&eacute; sauvegard&eacute;es avant d&apos;ex&eacute;cuter Secure Erase.</p>

<h4>Pour ex&eacute;cuter Secure Erase&nbsp;:</h4>
	<ol>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>HDD/SSD</b>.</li>
		<li>S&eacute;lectionnez un disque et cliquez sur <b>Action</b>&nbsp;&gt; <b>Secure Erase</b>.</li>
	</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
	<ul>
		<li>Secure Erase ne peut pas &ecirc;tre utilis&eacute; sur les disques dans les unit&eacute;s d&apos;extension.</li>
		<li>Secure Erase supprimera d&eacute;finitivement les donn&eacute;es stock&eacute;es sur le disque. Veuillez vous assurer que le disque choisi n&apos;est pas utilis&eacute; ou que les donn&eacute;es ont &eacute;t&eacute; sauvegard&eacute;es avant de continuer.</li>
		<li>Lorsque le syst&egrave;me effectue Secure Erase, le disque choisi sera temporairement verrouill&eacute;, puis automatiquement d&eacute;verrouill&eacute; &agrave; la fin de l&apos;op&eacute;ration.</li>
		<li>Si Secure Erase est arr&ecirc;t&eacute; de mani&egrave;re incorrecte pendant l&apos;op&eacute;ration, vous pouvez r&eacute;ex&eacute;cuter Secure Erase directement sur l&apos;interface utilisateur. Si les disques sont supprim&eacute;s ou utilis&eacute;s &agrave; un autre endroit alors qu&apos;ils sont encore verrouill&eacute;s, veuillez saisir le mot de passe «&nbsp;synology&nbsp;» pour les d&eacute;verrouiller.</li>
	</ul>
</div>



<h3><a name="Drive"></a>Activation ou d&eacute;sactivation du disque</h3>
<p>Un disque affect&eacute; &agrave; un groupe de stockage peut &ecirc;tre d&eacute;sactiv&eacute; si n&eacute;cessaire, ce qui implique de retirer le disque du groupe de stockage, du volume et de la partition syst&egrave;me associ&eacute;s.</p>

<h4>Pour d&eacute;sactiver un disque&nbsp;:</h4>
	<ol>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>HDD/SSD</b>.</li>
		<li>S&eacute;lectionnez un disque et cliquez sur <b>Action</b>&nbsp;&gt; <b>D&eacute;sactiver</b>.</li>
	</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
	<ul>
		<li>Seuls les disques utilis&eacute;s dans des groupes de stockage peuvent &ecirc;tre d&eacute;sactiv&eacute;s. Une fois d&eacute;sactiv&eacute;s, les disques sont retir&eacute;s des groupes de stockage.</li>
		<li>Une fois qu&apos;un disque est d&eacute;sactiv&eacute;, l&apos;&eacute;tat du voyant LED du disque correspondant passe &agrave; «&nbsp;alerte&nbsp;».</li>
	</ul>
</div>

<h4>Pour activer un disque&nbsp;:</h4>
<p>L&apos;&eacute;tat d&apos;allocation d&apos;un disque d&eacute;sactiv&eacute; passe &agrave; <b>Non initialis&eacute;</b>, ce qui signifie que DSM n&apos;est pas install&eacute; sur ce disque et que le disque peut &ecirc;tre affect&eacute; &agrave; un groupe de stockage. Effectuez l&apos;une des op&eacute;rations suivantes pour activer le disque&nbsp;:</p>
	<ul>
		<li>Retirez le disque de son emplacement, puis r&eacute;ins&eacute;rez-le &agrave; nouveau dans son emplacement.</li>
		<li>Red&eacute;marrez le syst&egrave;me.</li>
	</ul>



<h3><a name="Status"></a>&Eacute;tat du voyant&nbsp;LED du disque</h3>
<p>Si vous souhaitez supprimer un disque de votre Synology NAS, vous pouvez temporairement passer l&apos;indicateur de disque de la couleur verte fixe &agrave; la couleur orange fixe. Cela vous permet d&apos;identifier instantan&eacute;ment l&apos;emplacement de disque dans lequel se trouve un disque et vous emp&ecirc;che de retirer le mauvais disque par erreur.</p>

<h4>Pour localiser l&apos;emplacement de disque dans lequel un disque est ins&eacute;r&eacute;&nbsp;:</h4>
	<ol>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>HDD/SSD</b>.</li>
		<li>S&eacute;lectionnez un disque et cliquez sur <b>Trouver le disque</b>.</li>
		<li>Cliquez sur le menu d&eacute;roulant et choisissez la dur&eacute;e pendant laquelle vous souhaitez que l&apos;indicateur de disque reste orange fixe.</li>
		<li>Cliquez sur <b>Trouver</b> pour passer l&apos;indicateur de disque o&ugrave; se trouve le disque &agrave; la couleur orange fixe. <br><span class="note_head">Remarque&nbsp;:</span> Vous pouvez cliquer sur <b>Restaurer</b> pour repasser l&apos;indicateur du disque &agrave; la couleur verte fixe.</li>
	</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
	<ul>
		<li>L&apos;&eacute;tat de l&apos;indicateur mentionn&eacute; ici ne s&apos;applique pas &agrave; l&apos;emplacement de la carte adaptateur sur les mod&egrave;les de Synology&nbsp;NAS qui prennent en charge l&apos;ajout de cartes adaptateurs (par exemple, DS1816+). Cela est d&ucirc; au fait qu&apos;un tel emplacement n&apos;est pas con&ccedil;u avec l&apos;&eacute;tat d&apos;indicateur correspondant.</li>
	</ul>
</div>



<h3><a name="Cache"></a>Cache en &eacute;criture</h3>
<p>L&apos;activation de la prise en charge du cache en &eacute;criture am&eacute;liore les performances du syst&egrave;me de votre Synology NAS. Seuls certains mod&egrave;les de HDD prennent en charge cette fonctionnalit&eacute;. Pour assurer la protection des donn&eacute;es avec la prise en charge du cache en &eacute;criture, l&apos;utilisation d&apos;un onduleur est fortement recommand&eacute;e. Il est &eacute;galement conseill&eacute; d&apos;arr&ecirc;ter correctement le syst&egrave;me apr&egrave;s chaque utilisation. La d&eacute;sactivation du cache en &eacute;criture permettra d&apos;&eacute;viter les pertes de donn&eacute;es caus&eacute;es par des pannes de courant anormales.</p>

<h4>Pour activer la prise en charge du cache en &eacute;criture&nbsp;:</h4>
<p>Veuillez suivre les &eacute;tapes ci-dessous pour activer le cache en &eacute;criture&nbsp;:</p>
	<ol>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>HDD/SSD</b>.</li>
		<li>S&eacute;lectionnez un disque et cliquez sur <b>Action</b>&nbsp;&gt; <b>Configurer</b>.</li>
		<li>Cochez la case <b>Activer le cache en &eacute;criture</b> et cliquez sur <b>Appliquer</b>. Par d&eacute;faut, cette fonction est activ&eacute;e.</li>
	</ol>



<h3><a name="Database"></a>Base de donn&eacute;es du disque</h3>
<p>La base de donn&eacute;es S.M.A.R.T. contient des informations relatives &agrave; la temp&eacute;rature de fonctionnement s&ucirc;re et aux noms de fichiers S.M.A.R.T. d&apos;un disque. La base de donn&eacute;es est p&eacute;riodiquement mise &agrave; jour et automatiquement actualis&eacute;e apr&egrave;s le remplacement d&apos;un disque. Cette op&eacute;ration doit &ecirc;tre ex&eacute;cut&eacute;e uniquement lorsque la mise &agrave; jour p&eacute;riodique ou automatique de la base de donn&eacute;es &eacute;choue.</p>

<h4>Pour mettre &agrave; jour la base de donn&eacute;es S.M.A.R.T.&nbsp;:</h4>
<p>Veuillez suivre les &eacute;tapes ci-dessous pour mettre &agrave; jour la base de donn&eacute;es du disque&nbsp;:</p>
	<ol>
		<li>Acc&eacute;dez &agrave; l&apos;onglet <b>Param&egrave;tres</b>.</li>
		<li>Faites d&eacute;filer jusqu&apos;&agrave; la section <b>Base de donn&eacute;es S.M.A.R.T.</b></li>
		<li>Cliquez sur <b>Mettre &agrave; jour maintenant</b>.</li>
	</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
	<ul>
		<li>La base de donn&eacute;es S.M.A.R.T. ne peut &ecirc;tre mise &agrave; jour qu&apos;une fois toutes les 24&nbsp;heures.</li>
		<li>La base de donn&eacute;es S.M.A.R.T. est automatiquement mise &agrave; jour lorsqu&apos;un nouveau disque est ins&eacute;r&eacute; dans votre Synology NAS.</li>
		<li>La mise &agrave; jour de la base de donn&eacute;es S.M.A.R.T. n&apos;a pas d&apos;incidence et n&apos;am&eacute;liore ni la compatibilit&eacute;, ni les performances du disque.</li>
		<li>Veuillez ex&eacute;cuter cette op&eacute;ration uniquement lorsque plusieurs valeurs sont inconnues dans Info S.M.A.R.T. ou lorsque l&apos;&eacute;quipe d&apos;assistance de Synology vous recommande de le faire.</li>
	</ul>
</div>



</body>
</html>