<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Hot Spare</h2>
<p>Les disques Hot Spare sont des disques de secours qui permettent de r&eacute;parer un groupe de stockage d&eacute;grad&eacute; en rempla&ccedil;ant automatiquement un disque d&eacute;faillant. Les disques Hot Spare peuvent &ecirc;tre affect&eacute;s globalement pour prot&eacute;ger tout groupe de stockage dans votre Synology NAS, &agrave; condition que le groupe de stockage corresponde aux crit&egrave;res suivants&nbsp;:</p>
<ul>
	<li>Le stockage doit &ecirc;tre un type de RAID avec protection des donn&eacute;es (c&apos;est-&agrave;-dire RAID&nbsp;1, RAID&nbsp;5, RAID&nbsp;6, RAID&nbsp;10, RAID&nbsp;F1</span>).</li>
	<li>La taille du disque Hot Spare doit &ecirc;tre &eacute;gale ou sup&eacute;rieure &agrave; la taille du plus petit disque du groupe de stockage.</li>
</ul>

<h4>Pour configurer les disques Hot Spare&nbsp;:</h4>
<ol>
<li>Cliquez sur <strong>G&eacute;rer</strong>.</li>
<li>Une bo&icirc;te de dialogue appara&icirc;t, affichant l&apos;&eacute;tat Hot Spare de chaque groupe de stockage ainsi que les disques disponibles. L&apos;&eacute;tat du groupe de stockage comprend les &eacute;l&eacute;ments suivants&nbsp;:</li>
<ul>
<li><strong>Affect&eacute;&nbsp;:</strong> le groupe de stockage est prot&eacute;g&eacute; par au moins un disque Hot Spare affect&eacute;.</li>
<li><strong>Disponible&nbsp;:</strong> des disques sont disponibles pour prot&eacute;ger le groupe de stockage mais aucun Hot Spare n&apos;a encore &eacute;t&eacute; affect&eacute;.</li>
<li><strong>Indisponible&nbsp;:</strong> aucun disque Hot Spare n&apos;est disponible pour prot&eacute;ger le groupe de stockage.</li>
</ul>
<li>La section <strong>disques disponibles</strong> affiche les disques qui peuvent &ecirc;tre affect&eacute;s comme disques Hot Spare. Pour affecter un disque Hot Spare, cochez la case &agrave; c&ocirc;t&eacute; du disque que vous souhaitez affecter comme Hot Spare.</li>
<li>Cliquez sur <strong>Appliquer</strong> pour enregistrer les param&egrave;tres.</li>
</ol>
<div class="section">
<h4>Remarque&nbsp;:</h4> 
<ul>
<li>Lorsqu&apos;un disque est attribu&eacute; en tant que disque Hot Spare, toutes les donn&eacute;es du disque sont effac&eacute;es. Avant d&apos;affecter un disque Hot Spare, assurez-vous que le disque ne contient pas de donn&eacute;es importantes.</li>
<li>Un RAID assembl&eacute; par des HDD ne sera pas automatiquement r&eacute;par&eacute; par des disques SSD Hot Spare et vice versa.</li>
<li>Nous vous recommandons de choisir des disques compatibles &agrave; utiliser comme Hot Spare pour &eacute;viter tout probl&egrave;me sur votre Synology NAS.</li>
</ul>
</div>

<h4>Pour configurer les param&egrave;tres Hot Spare pour un groupe de stockage&nbsp;:</h4>
<ol>
<li>Cliquez sur <strong>Configurer</strong>.</li>
<li>Les groupes de stockage qui peuvent &ecirc;tre prot&eacute;g&eacute;s par des disques Hot Spare sont r&eacute;pertori&eacute;s dans l&apos;onglet <strong>Groupe de stockage</strong>. Si vous d&eacute;cochez les cases, les groupes de stockage correspondants ne sont plus automatiquement r&eacute;par&eacute;s par ces disques Hot Spare en cas de d&eacute;gradation.</li>
<li>Dans l&apos;onglet <strong>Hot Spare inter-p&eacute;riph&eacute;riques</strong>, vous pouvez autoriser des disques Hot Spare sur un p&eacute;riph&eacute;rique pour r&eacute;parer un RAID d&eacute;grad&eacute; qui se trouve sur un p&eacute;riph&eacute;rique diff&eacute;rent.</li>
<li>Cliquez sur <strong>OK</strong> pour enregistrer les param&egrave;tres.</li>
</ol>

</body>
</html>
