<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
	<h2>Vue d&apos;ensemble</h2>
	<p>La vue d&apos;ensemble affiche le statut global de vos espaces de stockage, notamment la sant&eacute; globale de tous les espaces, l&apos;&eacute;tat des volumes, l&apos;&eacute;tat du groupe de stockage et les informations sur les disques.</p>

		<h4>Sant&eacute; du stockage</h4>
        <p>Il y a trois types de statut&nbsp;:</p>
	  	<ul>
				<li><b>Sain</b>&nbsp;: tous les espaces de stockage (volumes ou groupes de stockage) sont normaux.</li>
				<li><B>Attention</B>&nbsp;: un espace de stockage (volume ou groupe de stockage) est d&eacute;grad&eacute;, le cache SSD a plant&eacute; ou une partition syst&egrave;me a &eacute;chou&eacute;.</li>
				<li><b>Danger</b>&nbsp;: un espace de stockage (volume ou groupe de stockage) a plant&eacute;.</li>
			</ul>
			<p>Si plusieurs anomalies se produisent en m&ecirc;me temps, l&apos;&eacute;tat de sant&eacute; sera affich&eacute; dans l&apos;ordre suivant&nbsp;: 1) espace de stockage (volume ou groupe de stockage)&nbsp;; 2) cache SSD&nbsp;et 3) partition syst&egrave;me. En cas de probl&egrave;me, veuillez suivre les instructions sugg&eacute;r&eacute;es sous le statut.</p>
		
		<h4>S&eacute;lecteur de groupe de stockage</h4>
	<p>Le s&eacute;lecteur de groupe de stockage r&eacute;pertorie tous les groupes de stockage. S&eacute;lectionnez un groupe de stockage pour consulter les d&eacute;tails qui s&apos;y rapportent.</p>
		
		<h4>&Eacute;tat du volume</h4>
	<p>Cette section affiche la capacit&eacute; utilis&eacute;e des volumes figurant dans le groupe de stockage s&eacute;lectionn&eacute;. Si l&apos;utilisation totale atteint la valeur critique du volume, le graphique &agrave; secteurs devient rouge&nbsp;; au-del&agrave; de la valeur d&apos;avertissement, il devient orange&nbsp;;&nbsp;sinon, il reste bleu. Les valeurs critiques et d&apos;avertissement sont modifiables dans <strong>Panneau de configuration</strong> &gt; <strong>Notification</strong> &gt; <strong>Avanc&eacute;</strong> &gt; <strong>Stockage interne</strong> &gt; <strong>Volume plein</strong>.</p>
		
	<h4>Groupes de stockage / volumes</h4>
	<p>Lorsqu&apos;aucun groupe de stockage sp&eacute;cifique n&apos;est s&eacute;lectionn&eacute;, les d&eacute;tails de tous les groupes de stockage s&apos;affichent. Lorsqu&apos;un groupe de stockage sp&eacute;cifique est s&eacute;lectionn&eacute;, les d&eacute;tails et l&apos;attribution de l&apos;espace de ce groupe de stockage s&apos;affichent.</p>
		
		<h4>Informations du disque</h4>
        <p>Cette section affiche les informations du disque et du mat&eacute;riel. Vous pouvez v&eacute;rifier combien de disques sont utilis&eacute;s et par quels espaces de stockage, le nombre de disques de secours et le nombre d&apos;emplacements de disques disponibles.</p>
        
</body>
</html>
