<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Volume</h2>
<p>Les volumes sont des espaces de stockage de base sur lesquels l&apos;utilisateur peut cr&eacute;er des dossiers partag&eacute;s, des iSCSI LUN (fichier courant), enregistrer des donn&eacute;es, ou installer des paquets. Avant de cr&eacute;er des volumes, veuillez vous assurer que vous avez d&eacute;j&agrave; cr&eacute;&eacute; un RAID Group. Pour plus d&apos;informations sur les groupes RAID, veuillez consulter la page <a href="raid.html">RAID Group</a>.</p>

<h4>Pour cr&eacute;er un volume&nbsp;:</h4>
<ol>
	<li>Assurez-vous que votre Synology NAS dispose d&apos;un RAID Group existant avec de l&apos;espace pouvant &ecirc;tre allou&eacute;.</li>
	<li>Cliquez sur le bouton <strong>Cr&eacute;er</strong>.</li>
	<li>Choisissez un RAID Group sur lequel vous souhaitez cr&eacute;er le volume.</li>
	<li>Modifiez les param&egrave;tres d&eacute;sir&eacute;s.</li>
	<li>D&eacute;finissez l&apos;allocation de taille pour le volume. (La d&eacute;finition de l&apos;allocation de la taille n&apos;est pas disponible avec les volumes cr&eacute;&eacute;s sur un RAID Group pour un seul volume ou iSCSI LUN.)</li>
    <li>Cliquez sur le bouton <strong>Appliquer</strong> pour confirmer les param&egrave;tres.</li>


</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>La taille maximale du volume qui peut &ecirc;tre allou&eacute;e est de 200&nbsp;To.</li>
	<li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">La taille minimale allou&eacute;e &agrave; un volume Btrfs doit &ecirc;tre de 10&nbsp;Go.</li>
    <li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Les volumes Btrfs r&eacute;servent 4&nbsp;% de l&apos;espace pour les m&eacute;tadonn&eacute;es.</li>
</ul>
</div>

<h4>Pour supprimer un volume&nbsp;:</h4>
<ol>
	<li>S&eacute;lectionnez le volume que vous d&eacute;sirez supprimer.</li>
	<li>Cliquez sur le bouton <strong>Supprimer</strong> et suivez l&apos;assistant pour terminer le processus.</li>
</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>La suppression d&apos;un volume efface toutes les donn&eacute;es existantes sur ce volume.</li>
</ul>
</div>

<h4>Pour forcer un volume&nbsp;:</h4>
<p>Si le cache est manquant sur un volume, le syst&egrave;me ne montera pas le volume lors du d&eacute;marrage. Si le cache n&apos;est pas r&eacute;cup&eacute;rable, et que vous voulez acc&eacute;der au volume, vous pouvez cliquer sur <strong>Forcer le montage</strong>.</p>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>Cette fonction n&apos;est disponible que sur certains mod&egrave;les.</li>
</ul>
</div>

<h4>Pour r&eacute;parer un volume&nbsp;:</h4>
<p>Si le statut du volume indique <strong>D&eacute;grad&eacute;</strong>, veuillez aller sur l&apos;onglet <strong>RAID Group</strong> et trouvez le RAID Group appropri&eacute;. Suivez ensuite les instructions sugg&eacute;r&eacute;es pour le r&eacute;parer.</p>

<h4>Pour &eacute;tendre la taille d&apos;un volume</h4>
<ul>
	<li>Pour les volumes cr&eacute;&eacute;s sur un RAID Group &agrave; volumes multiples ou iSCSI LUN (niveau bloc).<ol>
			<li>S&eacute;lectionnez le volume sur lequel effectuer une extension.</li>
			<li>Cliquez sur <strong>Modifier</strong>.</li>
			<li>Saisissez la nouvelle taille et cliquez sur <strong>OK</strong> pour effectuer une extension.</li>
		</ol>
	</li>
	<li>Pour les volumes cr&eacute;&eacute;s sur un RAID Group pour un seul volume ou iSCSI LUN (niveau bloc), veuillez consulter la section <strong>Pour &eacute;tendre la taille d&apos;un RAID Group</strong> de <a href="raid.html">RAID Group</a>, la taille du volume sera &eacute;tendue apr&egrave;s que le RAID Group sous-jacent aura &eacute;t&eacute; &eacute;tendu.</li>
</ul>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>Si les volumes sont utilis&eacute;s comme des cibles r&eacute;pliqu&eacute;es de <strong>Snapshot Replication</strong>, il est possible d&apos;am&eacute;liorer les performances de r&eacute;plication en r&eacute;glant les param&egrave;tres de <strong>Fr&eacute;quence d&apos;enregistrement de l&apos;heure d&apos;acc&egrave;s aux fichiers</strong> dans la fen&ecirc;tre <strong>Modifier</strong> apr&egrave;s la cr&eacute;ation des volumes&nbsp;:</p>
<ul>
	<li><strong>Quotidiennement</strong>&nbsp;: l&apos;heure d&apos;acc&egrave;s au fichier est mise &agrave; jour quotidiennement ou lorsque le fichier est modifi&eacute;, tout comme sur la plupart des syst&egrave;mes d&apos;exploitation. Les fonctionnalit&eacute;s de certaines applications reposent sur la pr&eacute;cision de l&apos;heure d&apos;acc&egrave;s aux fichiers. Le fait de s&eacute;lectionner <strong>Quotidiennement</strong> aura une incidence sur les performances de r&eacute;plication si vous utilisez fr&eacute;quemment l&apos;une des fonctions ou des applications suivantes&nbsp;:<ul>
			<li><strong>Heure d&apos;acc&egrave;s la moins r&eacute;cente</strong> dans <strong>Analyseur de stockage</strong></li>
			<li><strong>Conseiller du cache SSD</strong> dans <strong>Gestionnaire de stockage</strong></li>
			<li>n&apos;importe quelle application tierce qui repose sur <strong>Enregistrer l&apos;heure d&apos;acc&egrave;s aux fichiers</strong>.</li>
		</ul>
	<li><strong>Mensuellement</strong>&nbsp;: l&apos;heure d&apos;acc&egrave;s au fichier est mise &agrave; jour mensuellement ou lorsque le fichier est modifi&eacute;. Cette option apporte une petite am&eacute;lioration au niveau des performances de r&eacute;plication alors que les applications qui reposent sur <strong>Enregistrer l&apos;heure d&apos;acc&egrave;s aux fichiers</strong> peuvent fonctionner avec une pr&eacute;cision plus faible.</li>
	<li><strong>Jamais</strong>&nbsp;: recommand&eacute; si vous recherchez les meilleures performances de r&eacute;plication et que vous n&apos;avez pas besoin d&apos;applications qui reposent sur <strong>Enregistrer l&apos;heure d&apos;acc&egrave;s aux fichiers</strong> dans le cadre de votre utilisation quotidienne.</li>
</ul>
</div>

<h3>SSD TRIM</h3>
<p>Si un volume est constitu&eacute; enti&egrave;rement de SSD (Solid State Drives), nous recommandons d&apos;activer SSD TRIM. Cette fonction am&eacute;liore la performance de lecture et &eacute;criture des volumes cr&eacute;&eacute;s sur des SSD en augmentant l&apos;efficacit&eacute; et en &eacute;tendant la dur&eacute;e de vie de vos SSD.</p>

<h4>Pour activer le SSD TRIM&nbsp;:</h4>
<ol>
	<li>Ouvrez <strong>Gestionnaire de stockage</strong> et allez &agrave; <strong>Volume</strong>.</li>
	<li>S&eacute;lectionnez un volume qui est enti&egrave;rement compos&eacute; de SSD et ensuite cliquez sur le bouton <strong>Configurer</strong>.</li>
	<li>Dans la fen&ecirc;tre qui s&rsquo;affiche, allez &agrave; l&apos;onglet <strong>SSD TRIM</strong>, et cochez la case <strong>Activer le TRIM</strong>.</li>
	<li>Cliquez sur le bouton <strong>D&eacute;finir le planning</strong> pour d&eacute;terminer le moment o&ugrave; le syst&egrave;me ex&eacute;cutera SSD TRIM.</li>
	<li>Cliquez sur <strong>OK</strong>.</li>
</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>SSD TRIM n&apos;est disponible que sur certains mod&egrave;les de Synology NAS et types RAID.</li>
	<li>Certains mod&egrave;les SSD ne sont pas capables d&apos;ex&eacute;cuter SSD TRIM sur les volumes RAID&nbsp;5<span class="enable-grantley">,</span> <span class="disable-grantley">et </span>RAID&nbsp;6<span class="enable-grantley"> et RAID&nbsp;F1</span>. Reportez-vous &agrave; la liste de compatibilit&eacute; sur le <a href="https://www.synology.com/" target="_blank">site Web officiel</a> de Synology.</li>
	<li>SSD TRIM ne peut &ecirc;tre activ&eacute; dans les situations suivantes&nbsp;:<ul>
			<li>Le volume est mont&eacute; avec un cache SSD.</li>
			<li>Le paquet <strong>Time Backup</strong> est install&eacute;.</li>
		</ul>
	</li>
	<li>SSD TRIM ne peut &ecirc;tre activ&eacute; sur les iSCSI LUN de niveau bloc.</li>
	<li>La performance du syst&egrave;me est affect&eacute;e lorsque SSD TRIM est ex&eacute;cut&eacute;. Le temps n&eacute;cessaire pour finir d&apos;ex&eacute;cuter TRIM varie selon la taille de volume et le mod&egrave;le SSD.</li>
	<li>Lorsque la fonction TRIM est activ&eacute;e sur un volume, elle est &eacute;galement activ&eacute;e sur d&apos;autres volumes cr&eacute;&eacute;s sur le m&ecirc;me groupe de disques ou RAID Group.</li>
</ul>
</div>


<h3>Nettoyage du syst&egrave;me de fichiers*</h3>
<p>Le nettoyage du syst&egrave;me de fichiers est un param&egrave;tre de maintenance des donn&eacute;es qui inspecte les volumes. Si des donn&eacute;es incoh&eacute;rentes sont d&eacute;tect&eacute;es par rapport &agrave; la somme de contr&ocirc;le, le chemin du fichier est enregistr&eacute; dans le centre des journaux et il est recommand&eacute; d&apos;utiliser une sauvegarde pour r&eacute;parer les donn&eacute;es.</p>

<p>Nous recommandons de proc&eacute;der r&eacute;guli&egrave;rement au nettoyage du syst&egrave;me de fichiers afin d&apos;assurer la coh&eacute;rence des donn&eacute;es.</p>

<h4>Pour proc&eacute;der au nettoyage du syst&egrave;me de fichiers&nbsp;:</h4>
<ol>
	<li>Ouvrez <strong>Gestionnaire de stockage</strong> et allez &agrave; <strong>Volume</strong>.</li>
	<li>S&eacute;lectionnez le volume sur lequel vous souhaitez effectuer le nettoyage du syst&egrave;me de fichiers.</li>
	<li>Cliquez sur <strong>G&eacute;rer.</strong></li>
	<li>S&eacute;lectionnez <strong>Nettoyage du syst&egrave;me de fichiers</strong>.</li>
</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>Le nettoyage du syst&egrave;me de fichiers ne peut &ecirc;tre effectu&eacute; que sur des volumes du syst&egrave;me de fichiers <strong>Btrfs</strong>.</li>
	<li>Le nettoyage du syst&egrave;me de fichiers ne peut &ecirc;tre effectu&eacute; que lorsque l&apos;&eacute;tat du volume est <strong>Normal</strong>.</li>
	<li>N&apos;&eacute;teignez pas le syst&egrave;me avant la fin du nettoyage du syst&egrave;me de fichiers. Si le syst&egrave;me est arr&ecirc;t&eacute; avant la fin, vous devrez red&eacute;marrer manuellement le nettoyage du syst&egrave;me de fichiers depuis le d&eacute;but.</li>
</ul>
</div>

<h3>D&eacute;fragmentation du syst&egrave;me de fichiers*</h3>
<p>Si vos donn&eacute;es sont constamment modifi&eacute;es, la quantit&eacute; de fichiers fragment&eacute;s augmente dans le syst&egrave;me de fichiers, ce qui entra&icirc;ne un ralentissement des performances d&apos;acc&egrave;s aux fichiers sur les disques. L&apos;ex&eacute;cution de la d&eacute;fragmentation du syst&egrave;me de fichiers peut am&eacute;liorer les performances.</p>

<h4>Pour proc&eacute;der &agrave; l&apos;ex&eacute;cution de la d&eacute;fragmentation du syst&egrave;me de fichiers&nbsp;:</h4>
<ol>
	<li>Ouvrez <strong>Gestionnaire de stockage</strong> et allez &agrave; <strong>Volume</strong>.</li>
	<li>S&eacute;lectionnez le volume sur lequel effectuer la d&eacute;fragmentation du syst&egrave;me de fichiers.</li>
	<li>Cliquez sur <strong>G&eacute;rer.</strong></li>
	<li>S&eacute;lectionnez <strong>D&eacute;fragmentation du syst&egrave;me de fichiers</strong>.</li>
</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>La d&eacute;fragmentation du syst&egrave;me de fichiers ne peut &ecirc;tre effectu&eacute;e que sur des volumes du syst&egrave;me de fichiers <strong>Btrfs</strong>.</li>
	<li>La d&eacute;fragmentation du syst&egrave;me de fichiers ne peut &ecirc;tre effectu&eacute;e que lorsque l&apos;&eacute;tat du volume est <strong>Normal</strong>.</li>
	<li>N&apos;&eacute;teignez pas le syst&egrave;me avant la fin de la d&eacute;fragmentation du syst&egrave;me de fichiers. Si le syst&egrave;me est arr&ecirc;t&eacute; avant la fin, vous devrez red&eacute;marrer manuellement la d&eacute;fragmentation du syst&egrave;me de fichiers depuis le d&eacute;but.</li>
	<li>L&apos;utilisation du volume peut augmenter s&apos;il contient des instantan&eacute;s de dossiers partag&eacute;s.</li>
</ul>
</div>

<p>____<br />*Uniquement pris en charge sur certains mod&egrave;les.</p>

</body>
</html>