<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Groupe de stockage</h2>

<p>Des disques peuvent &ecirc;tre agr&eacute;g&eacute;s en une seule unit&eacute; de stockage nomm&eacute;e groupe de stockage, qui peut &ecirc;tre prot&eacute;g&eacute;e par RAID. Diff&eacute;rents types de RAID offrent diff&eacute;rents niveaux de protection des donn&eacute;es. Pour acc&eacute;der &agrave; une liste g&eacute;n&eacute;rale des types de RAID pris en charge sur le Synology NAS, consultez la section <a href="general.html">G&eacute;n&eacute;ral</a>. Une fois qu&apos;un groupe de stockage a &eacute;t&eacute; cr&eacute;&eacute;, vous pouvez y cr&eacute;er un ou plusieurs volumes. Un volume est une unit&eacute; de stockage de donn&eacute;es et peut &ecirc;tre &eacute;tendu si le groupe de stockage associ&eacute; contient de l&apos;espace allou&eacute;. Vous devez cr&eacute;er au moins un volume pour pouvoir commencer &agrave; stocker des donn&eacute;es sur votre Synology NAS.</p>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>Nous vous recommandons d&apos;utiliser les disques figurant dans la <a href="https://www.synology.com/compatibility?search_by=category&category=hdds&p=1" target=blank>Liste de compatibilit&eacute; des produits Synology</a> afin d&apos;&eacute;viter tout probl&egrave;me de compatibilit&eacute;. L&apos;utilisation de disques non compatibles pourrait r&eacute;duire les performances syst&egrave;me, voire provoquer une perte de donn&eacute;es.</li>
	<li>Un groupe de stockage doit &ecirc;tre compos&eacute; de disques du m&ecirc;me type. En d&apos;autres termes, un groupe de stockage ne peut pas &ecirc;tre cr&eacute;&eacute; &agrave; partir d&apos;une combinaison de disques&nbsp;SATA et SAS.</li>
	<li>Pour les mod&egrave;les de Synology&nbsp;NAS prenant en charge RAID Group, un groupe de stockage <b>RAID&nbsp;5</b>, <b>RAID&nbsp;6</b> ou <b>RAID&nbsp;F1</b> avec prise en charge de plusieurs volumes peut contenir plusieurs <b>matrices&nbsp;RAID</b>. Chaque matrice&nbsp;RAID appartenant au m&ecirc;me groupe de stockage a le m&ecirc;me type de RAID (par exemple, RAID&nbsp;5, RAID&nbsp;6 ou RAID&nbsp;F1). Le nombre maximal de disques pour chaque matrice RAID peut s&apos;&eacute;lever &agrave; 6, 12 ou 24. Vous pouvez d&eacute;finir le nombre maximal de disques lors de la cr&eacute;ation du groupe de stockage. Ce nombre ne pourra pas &ecirc;tre modifi&eacute; ult&eacute;rieurement. Lorsque le nombre maximal de disques a &eacute;t&eacute; affect&eacute; &agrave; une matrice&nbsp;RAID, il est possible que le disque suivant ajout&eacute; au groupe de stockage soit affect&eacute; &agrave; une nouvelle matrice&nbsp;RAID. La nouvelle matrice&nbsp;RAID doit contenir le nombre minimum de disques requis pour ce type de RAID sp&eacute;cifique (c&apos;est-&agrave;-dire, trois disques pour RAID&nbsp;5 et RAID&nbsp;F1 et quatre disques pour RAID&nbsp;6).</li>
	<li>Si vous souhaitez utiliser un disque sp&eacute;cifique pour cr&eacute;er un groupe de stockage, mais que ce disque n&apos;appara&icirc;t pas dans l&apos;<strong>Assistant de cr&eacute;ation de groupes de stockage</strong>, acc&eacute;dez &agrave; la page <strong>HDD/SSD</strong> pour v&eacute;rifier l&apos;&eacute;tat du disque.</li>
</ul>
</div>

</body>
</html>


	