 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Cr&eacute;ation d&apos;un nouveau groupe de stockage - Aide de Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article walks you through the steps to create a Storage Pool on Synology NAS using Storage Manager.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Cr&eacute;er un nouveau groupe de stockage</h2>
<div class="section"><h4>Important&nbsp;:</h4>
<ul>
	<li>Avant de d&eacute;marrer, assurez-vous qu&apos;il n&apos;y a pas de donn&eacute;es importantes sur les disques sur lesquels le groupe de stockage va &ecirc;tre cr&eacute;&eacute;. Toutes les donn&eacute;es existantes seront effac&eacute;es au cours du processus de cr&eacute;ation.</li>
	<li>Acc&eacute;dez &agrave; la page <strong>HDD/SSD</strong> et assurez-vous que l&apos;&eacute;tat de chaque disque est <strong>Initialis&eacute;</strong> ou <strong>Non initialis&eacute;</strong>.</li>
	<li>Nous vous recommandons d&apos;utiliser des disques figurant dans la <a href="https://www.synology.com/compatibility" target=blank>Liste de compatibilit&eacute; des produits Synology</a> pour &eacute;viter tout probl&egrave;me. L&apos;utilisation de disques incompatibles pourrait r&eacute;duire les performances syst&egrave;me, voire provoquer une perte de donn&eacute;es sur votre Synology NAS.</li>
</ul>
</div>

<h4>Pour cr&eacute;er un groupe de stockage&nbsp;:</h4>
<ol>
	<li>Ouvrez le <strong>Gestionnaire de stockage</strong>.</li>
	<li>Acc&eacute;dez &agrave; <strong>Groupe de stockage</strong> et cliquez sur le bouton <strong>Cr&eacute;er</strong>.</li>
	<li>Choisissez le type de groupe de stockage&nbsp;:<ul>
			<li><strong>Meilleures performances</strong>&nbsp;: ce type de groupe de stockage ne prend en charge qu&apos;un volume unique, mais offre de meilleures performances.</li>
			<li><strong>Plus grande flexibilit&eacute;</strong>&nbsp;: ce type de groupe de stockage prend en charge plusieurs volumes, Synology Hybrid RAID (SHR), et la fonctionnalit&eacute; RAID Group.</li>
		</ul>
	</li>
	<li>Configurez les propri&eacute;t&eacute;s du groupe de stockage&nbsp;:<ul>
			<li>Description du groupe de stockage&nbsp;: une description de ce groupe de stockage.</li>
			<li>Type de RAID&nbsp;: diff&eacute;rents types de RAID offrent diff&eacute;rents niveaux de protection des donn&eacute;es. Pour plus d&apos;informations, reportez-vous &agrave; <a href="general.html">G&eacute;n&eacute;ralit&eacute;s</a>.</li>
			<li>Nombre minimum de disques par RAID&nbsp;: le nombre minimum de disques requis pour le type de RAID s&eacute;lectionn&eacute;.</li>
			<li>Nombre maximum de disques par RAID&nbsp;: un nombre plus important de disques par RAID augmente la probabilit&eacute; d&apos;une panne du RAID. Nous vous recommandons de r&eacute;gler la limite du nombre de disques sur un RAID unique et d&apos;utiliser RAID Group pour trouver un juste milieu entre la s&eacute;curit&eacute; des donn&eacute;es et la capacit&eacute; de stockage du groupe.</li>
			<li>Fonctionnalit&eacute; RAID Group&nbsp;: si la fonctionnalit&eacute; RAID Group est prise en charge par le type de RAID s&eacute;lectionn&eacute;. Alors qu&apos;un RAID unique est restreint au niveau du nombre de disques, la fonctionnalit&eacute; RAID Group vous permet de composer votre bloc de stockage de plusieurs RAID, ce qui augmente sa capacit&eacute; et la redondance des disques. RAID Group est pris en charge par RAID&nbsp;5, RAID&nbsp;6 et RAID&nbsp;F1.</li>
		</ul>
	</li>
	<li>Suivez les &eacute;tapes restantes de l&apos;assistant pour terminer la cr&eacute;ation du groupe de stockage.</li>
</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>SHR (Synology Hybrid RAID) n&apos;est disponible que sur certains mod&egrave;les. Pour plus d&apos;informations, acc&eacute;dez au <a href="https://www.synology.com/" target="_blank">site Web de Synology</a>.</li>
	<li>Le nombre maximum de disques par RAID et la fonctionnalit&eacute; RAID Group ne sont disponibles que sur certains mod&egrave;les. Pour plus d&apos;informations, acc&eacute;dez au <a href="https://www.synology.com/" target="_blank">site Web de Synology</a>.</li>
	<li>Le nombre maximum de disques par RAID ne peut &ecirc;tre modifi&eacute; que si le type de RAID s&eacute;lectionn&eacute; prend en charge la fonctionnalit&eacute; RAID Group.</li>
	<li>Si le type de RAID du groupe de stockage est RAID&nbsp;5, RAID&nbsp;6, RAID&nbsp;F1, SHR (plus de trois disques) ou SHR-2, le syst&egrave;me effectue une resynchronisation du RAID sur le groupe de stockage afin d&apos;am&eacute;liorer la vitesse d&apos;accessibilit&eacute; et la r&eacute;silience des donn&eacute;es.</li>
</ul>
</div>

</body>
</html>