<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Conversion d&apos;un groupe de stockage &agrave; volume unique en groupe de stockage &agrave; volumes multiples</h2>

<p>Vous pouvez ajouter des disques dans un groupe de stockage et le convertir d&apos;un groupe de stockage qui prend en charge un seul volume en un groupe de stockage qui en prend plusieurs en charge. Les donn&eacute;es originales figurant sur le volume unique ne sont pas affect&eacute;es.</p>

<h4>Pour convertir un groupe de stockage &agrave; volume unique en un groupe de stockage &agrave; volumes multiples&nbsp;:</h4>
<ol>
<li>Ouvrez le <b>Gestionnaire de stockage</b>.</li>
<li>Acc&eacute;dez &agrave; <b>Groupe de stockage</b>.</li>
<li>Cliquez sur <b>Action</b> &gt; <b>Convertir un groupe de stockage &agrave; volume unique en groupe de stockage &agrave; volumes multiples</b>.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Cette fonctionnalit&eacute; est uniquement prise en charge sur les groupes de stockage SHR. SHR (Synology Hybrid RAID) n&apos;est disponible que sur certains mod&egrave;les. Pour plus d&apos;informations, acc&eacute;dez au <a href="https://www.synology.com/" target="_blank">site Web de Synology</a>.</li>
<li>Le nombre de disques ajout&eacute;s doit augmenter la taille du groupe de stockage&nbsp;; sinon, vous ne serez pas en mesure de proc&eacute;der &agrave; la conversion.</li>
<li>Nous vous recommandons d&apos;utiliser des disques figurant dans la <a href="https://www.synology.com/compatibility" target=blank>Liste de compatibilit&eacute; des produits Synology</a> pour &eacute;viter tout probl&egrave;me. L&apos;utilisation de disques incompatibles pourrait r&eacute;duire les performances syst&egrave;me, voire provoquer une perte de donn&eacute;es sur votre Synology NAS.</li>
</ul>
</div>

</body>
</html>
