 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Augmenter la taille du volume - Aide de Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article walks you through the steps to create a volume on Synology NAS using Storage Manager.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Augmenter la taille du volume</h2>
	
<p>La taille d&apos;un volume peut &ecirc;tre modifi&eacute;e si le volume est cr&eacute;&eacute; sur un groupe de stockage prenant en charge plusieurs volumes. Toutefois, si un volume est cr&eacute;&eacute; sur un groupe de stockage ne prenant en charge qu&apos;un seul volume, vous pouvez tout de m&ecirc;me augmenter la taille du volume en ajoutant des disques au groupe de stockage afin d&apos;&eacute;tendre d&apos;abord la capacit&eacute; du groupe de stockage.</p>
	
<h4>Pour un groupe de stockage &agrave; plusieurs volumes&nbsp;:</h4>
<p>Suivez les &eacute;tapes ci-dessous pour augmenter la taille de votre volume&nbsp;:</p>
<ol>
<li>Acc&eacute;dez &agrave; la page <b>Volume</b> et s&eacute;lectionnez le volume que vous souhaitez &eacute;tendre. <br><span class="note_head">Remarque&nbsp;:</span> Vous pouvez ajouter des disques au groupe de stockage correspondant pour, le cas &eacute;ch&eacute;ant, &eacute;tendre au pr&eacute;alable la capacit&eacute; du groupe de stockage. Veuillez consulter l&apos;article <a href="storage_pool_expand_add_disk.html">Ajouter des disques pour &eacute;tendre la capacit&eacute; du groupe de stockage</a> pour plus d&apos;informations.</li>
<li>Cliquez sur <strong>Configurer</strong> dans le menu d&eacute;roulant <B>Action</B>.</li>
<li>Acc&eacute;dez &agrave; l&apos;onglet <b>G&eacute;n&eacute;ral</b> et saisissez la nouvelle taille de volume dans le champ <b>Modifier la taille allou&eacute;e (Go)</b> ou cliquez sur le bouton <b>Max</b> pour remplir automatiquement la taille maximale allou&eacute;e.</li>
<li>Cliquez sur <b>OK</b> pour terminer.</li>
</ol>
<h4>Pour un groupe de stockage &agrave; volume unique&nbsp;:</h4>
<p>Suivez les &eacute;tapes ci-dessous pour augmenter la taille de votre volume&nbsp;:</p>
<ol>
<li>Ajouter des disques &agrave; un groupe de stockage pour &eacute;tendre sa capacit&eacute;. <br><span class="note_head">Remarque&nbsp;:</span> Veuillez consulter l&apos;article <a href="storage_pool_expand_add_disk.html">Ajouter des disques pour &eacute;tendre la capacit&eacute; du groupe de stockage</a> pour plus d&apos;informations.</li>
<li>La taille du volume correspondant est automatiquement &eacute;tendue une fois la capacit&eacute; du groupe de stockage &eacute;tendue.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Cliquez <a href=https://www.synology.com/knowledgebase/DSM/tutorial/Storage/Why_does_my_Synology_NAS_have_a_single_volume_size_limitation target=_blank>ici</a> pour conna&icirc;tre la taille maximale d&apos;un volume unique sur votre mod&egrave;le Synology NAS.</li>
</ul>
</div>











</body>
</html>