<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>D&eacute;fragmentation du syst&egrave;me de fichiers</h2>
<p>Si vos donn&eacute;es sont constamment modifi&eacute;es, le nombre de fichiers fragment&eacute;s augmente dans le syst&egrave;me de fichiers, ce qui entra&icirc;ne un ralentissement des performances d&apos;acc&egrave;s aux fichiers sur les disques. L&apos;ex&eacute;cution de la d&eacute;fragmentation du syst&egrave;me de fichiers peut am&eacute;liorer les performances.</p>

<h4>Pour proc&eacute;der &agrave; l&apos;ex&eacute;cution de la d&eacute;fragmentation du syst&egrave;me de fichiers, proc&eacute;dez comme suit&nbsp;:</h4>

<ol>
<li>Lancez le <strong>Gestionnaire de stockage</strong>.</li>
<li>Acc&eacute;dez &agrave; <strong>Volume</strong>.</li>
<li>S&eacute;lectionnez le volume sur lequel effectuer la d&eacute;fragmentation du syst&egrave;me de fichiers.</li>
<li>S&eacute;lectionnez <strong>D&eacute;fragmentation du syst&egrave;me de fichiers</strong> dans le menu d&eacute;roulant <b>Action</b>.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>La d&eacute;fragmentation du syst&egrave;me de fichiers n&apos;est disponible que sur certains mod&egrave;les.</li>
<li>La d&eacute;fragmentation du syst&egrave;me de fichiers ne peut &ecirc;tre effectu&eacute;e que sur des volumes du syst&egrave;me de fichiers <b>Btrfs</b>.</li>
<li>La d&eacute;fragmentation du syst&egrave;me de fichiers ne peut &ecirc;tre effectu&eacute;e que lorsque l&apos;&eacute;tat du volume est <strong>Sain</strong>.</li>
<li>Veuillez ne pas &eacute;teindre le syst&egrave;me avant la fin de la d&eacute;fragmentation du syst&egrave;me de fichiers. Si le syst&egrave;me est arr&ecirc;t&eacute; avant la fin, la d&eacute;fragmentation du syst&egrave;me de fichiers doit &ecirc;tre red&eacute;marr&eacute;e depuis le d&eacute;but.</li>
<li>L&apos;utilisation du volume peut augmenter s&apos;il contient des instantan&eacute;s de dossiers partag&eacute;s.</li>
</ul>
</div>

</body>
</html>
