<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=utf-8" http-equiv="Content-Type" />
<title>Sauvegarder les donn&eacute;es de mon ordinateur &agrave; l&apos;aide de Synology&nbsp;Drive&nbsp;Client</title>
</head>

<body class="tutorial-content-box" >

<h1>Sauvegarder les donn&eacute;es de mon ordinateur &agrave; l&apos;aide de Synology&nbsp;Drive&nbsp;Client</h1>
<div class="tutorials_content"><img style="width: 720px; height: auto;" src="../../images/Backup/1x/backup_from_PC/07_1_back_up_your_data_from_pc.png" /><h2>Vue d&apos;ensemble</h2>
<p>Synology&nbsp;Drive&nbsp;Server est non seulement un logiciel sophistiqu&eacute; de synchronisation inter-plateformes, mais &eacute;galement un moyen intelligent de sauvegarder des donn&eacute;es &agrave; partir des ordinateurs personnels des utilisateurs.&nbsp;Son utilitaire de bureau, Synology&nbsp;Drive&nbsp;Client, est une solution de sauvegarde instantan&eacute;e et en temps r&eacute;el qui permet d&apos;&eacute;conomiser la bande passante et offre une excellente protection gr&acirc;ce &agrave; jusqu&apos;&agrave; 32&nbsp;anciennes versions d&apos;un seul fichier.</p>

<h3>Configurer Synology&nbsp;Drive&nbsp;Server sur Synology&nbsp;NAS et t&eacute;l&eacute;charger Synology&nbsp;Drive&nbsp;Client</h3>
<ol>
<li>Acc&eacute;dez &agrave; <b>Centre de paquets</b>, recherchez <b>Synology&nbsp;Drive&nbsp;Server</b>, puis cliquez sur <strong>Installer</strong>. Trois paquets seront t&eacute;l&eacute;charg&eacute;s&nbsp;: la console d&apos;administration de Synology&nbsp;Drive, Synology&nbsp;Drive ShareSync et Synology&nbsp;Drive.</li>
<li>Lancez <strong>Synology&nbsp;Drive</strong>. Dans le coin inf&eacute;rieur droit, un message vous invitant &agrave; t&eacute;l&eacute;charger <strong>Synology&nbsp;Drive&nbsp;Client</strong> s&apos;affiche.<br> <img style="width: 300px; height: auto;" src="../../images/Backup/3x/Backup/Image 5.png" /><br> Vous pouvez &eacute;galement cliquer sur l&apos;ic&ocirc;ne de l&apos;utilisateur dans le coin inf&eacute;rieur gauche et acc&eacute;der &agrave; <strong>Client</strong>&nbsp;&gt; <strong>T&eacute;l&eacute;charger le client</strong>.<br> <img style="width: 300px; height: auto;" src="../../images/Backup/3x/Backup/Image 4.png" /><br> Vous pouvez &eacute;galement t&eacute;l&eacute;charger Synology&nbsp;Drive&nbsp;Client &agrave; partir du <a href="https://www.synology.com/support/download" target="_blank">Centre de t&eacute;l&eacute;chargements de Synology</a>.</li>
<li>Lancez l&apos;installateur sur votre ordinateur et suivez les instructions pour installer Synology&nbsp;Drive&nbsp;Client. Apr&egrave;s l&apos;installation, ex&eacute;cutez <strong>Synology&nbsp;Drive&nbsp;Client</strong> en cliquant sur <strong>D&eacute;marrer maintenant</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/01.png" /></li>
<li>S&eacute;lectionnez <strong>T&acirc;che de sauvegarde</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/02.png" /></li>
<li>Saisissez l&apos;adresse ou le QuickConnect&nbsp;ID du Synology&nbsp;NAS qui ex&eacute;cute Synology&nbsp;Drive&nbsp;Server, le nom d&apos;utilisateur et le mot de passe. Vous pouvez &eacute;galement cliquer sur l&apos;ic&ocirc;ne de recherche situ&eacute;e &agrave; droite et Synology&nbsp;Drive&nbsp;Client recherchera automatiquement les Synology&nbsp;NAS disponibles sur votre r&eacute;seau local. Cliquez sur <strong>Suivant</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/03.png" /></li>
<li>S&eacute;lectionnez la source de sauvegarde et d&eacute;cochez tous les sous-dossiers que vous ne souhaitez pas synchroniser. Synology&nbsp;Drive&nbsp;Client cr&eacute;e un dossier de sauvegarde sur la destination s&eacute;lectionn&eacute;e avec le nom de votre ordinateur. Le dossier <strong>home</strong> est s&eacute;lectionn&eacute; comme dossier de destination par d&eacute;faut. Si vous souhaitez utiliser un dossier ne figurant pas dans la liste, contactez votre administrateur syst&egrave;me. Les administrateurs syst&egrave;me peuvent consulter la <a href="https://www.synology.com/knowledgebase/DSM/help/SynologyDrive/drive_admin_console" target="_blank">page d&apos;aide de la console d&apos;administration de Synology&nbsp;Drive</a>. Vous pouvez &eacute;galement cliquer sur <strong>R&egrave;gles de sauvegarde</strong> si vous souhaitez configurer des filtres ou des r&egrave;gles de synchronisation. Cliquez sur <b>Suivant</b>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/backup_source.png" /></li>
<li>S&eacute;lectionnez un mode de sauvegarde et cliquez sur <b>Suivant</b>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/backup_mode.png" /></li>
<li>V&eacute;rifiez le r&eacute;sum&eacute; de vos param&egrave;tres de sauvegarde. Cliquez sur <b>Pr&eacute;c&eacute;dent</b> pour apporter des modifications ou sur <strong>Termin&eacute;</strong> pour terminer la configuration.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/backup_summary.png" /></li>
<li>Vous pouvez consulter la progression de votre sauvegarde dans la fen&ecirc;tre principale.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/progress.png" /></li>
</ol>

<h3>T&eacute;l&eacute;charger ou restaurer la version pr&eacute;c&eacute;dente d&apos;un fichier synchronis&eacute; sur Synology&nbsp;Drive&nbsp;Client</h3>
<ol>
<li>Dans Synology&nbsp;Drive&nbsp;Client, acc&eacute;dez &agrave; <strong>T&acirc;ches de sauvegarde</strong>&nbsp;&gt; <strong>Restaurer</strong> et recherchez le fichier ou le dossier que vous souhaitez restaurer.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/restore.png" /></li>
<li>S&eacute;lectionnez le fichier que vous souhaitez r&eacute;cup&eacute;rer et cliquez sur <strong>Parcourir les versions pr&eacute;c&eacute;dentes</strong>. Si le fichier a &eacute;t&eacute; supprim&eacute; ou effac&eacute; par erreur de votre ordinateur, vous pouvez cliquer sur <strong>Restaurer</strong> pour le restaurer.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/previous_version.png" /></li>
<li>S&eacute;lectionnez la version du fichier que vous souhaitez t&eacute;l&eacute;charger et cliquez sur <strong>T&eacute;l&eacute;charger</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/download_restore.png" /></li>
</ol>

<h3>T&eacute;l&eacute;charger ou restaurer la version pr&eacute;c&eacute;dente d&apos;un fichier synchronis&eacute; sur la console d&apos;administration de Synology&nbsp;Drive</h3>
<ol>
<li>Dans DSM, acc&eacute;dez &agrave; <strong>Console d&apos;administration de Synology Drive</strong>&nbsp;&gt; <strong>Dossier d&apos;&eacute;quipe</strong>, cliquez sur le dossier dans lequel se trouve le fichier que vous souhaitez restaurer, puis cliquez sur <strong>Explorateur de versions</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/version_history.png" /></li>
<li>Dans la fen&ecirc;tre <strong>Explorateur de versions</strong>, cliquez sur le fichier que vous souhaitez r&eacute;cup&eacute;rer, puis cliquez sur <strong>Parcourir les versions pr&eacute;c&eacute;dentes</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/browse_previous versions_server.png" /></li>
<li>S&eacute;lectionnez la version du fichier que vous souhaitez t&eacute;l&eacute;charger et cliquez sur <strong>T&eacute;l&eacute;charger</strong>. Si vous &ecirc;tes s&ucirc;r de vouloir restaurer la version s&eacute;lectionn&eacute;e, vous pouvez &eacute;galement cliquer sur <strong>Restaurer</strong> et elle &eacute;crasera votre version actuelle.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/previous_versions.png" /></li>
</ol>

<h3>Davantage de protection de vos donn&eacute;es</h3>
<p>Pour d&eacute;couvrir d&apos;autres mani&egrave;res de prot&eacute;ger et de sauvegarder vos donn&eacute;es, veuillez cliquer <a href="https://www.synology.com/knowledgebase/tutorials#BackupRestore" target="_blank">ici</a> afin d&apos;acc&eacute;der &agrave; plus de tutoriels concernant les autres services de sauvegarde offerts sur DSM.</p>

</div>
<div class="section">
<ul>
<li>Suivant dans cette rubrique&nbsp;: <a href="backup_backup.html">Sauvegarder des donn&eacute;es depuis votre Synology&nbsp;NAS</a>.</li>
</ul>
</div>

</body>
</html>