<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=utf-8" http-equiv="Content-Type" />
<title>Cr&eacute;ation d&apos;albums pour g&eacute;rer et parcourir les photos avec Photo&nbsp;Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Cr&eacute;ation d&apos;albums pour g&eacute;rer et parcourir les photos avec Photo&nbsp;Station</h1>
<div class="tutorials_content"><img src="../../images/ManagePhotos/1x/manage_share_photos/Create_Albums_to_Manage_and_Browse_Photos_with_Photo_Station.jpg"/><h2>Vue d&apos;ensemble</h2>
<p>Photo&nbsp;Station est une application Web con&ccedil;ue pour vous aider &agrave; organiser et &agrave; afficher des photos stock&eacute;es sur votre serveur Synology&nbsp;NAS via Internet. Gr&acirc;ce &agrave; son interface soign&eacute;e et ergonomique, Photo&nbsp;Station vous permet de charger, parcourir, g&eacute;rer et partager vos albums photo en quelques clics seulement.</p>

<h3 class="list_head">1. Installation de Photo&nbsp;Station</h3>
<p>Pour installer Photo&nbsp;Station, acc&eacute;dez au <b>Centre de paquets</b>, recherchez <b>Photo&nbsp;Station</b>, puis cliquez sur <b>Installer</b>.</p><img src="../../images/ManagePhotos/1x/manage_share_photos/1.png" border="1"/><h3 class="list_head">2. Chargement des photos</h3>
<p>Avant de parcourir et g&eacute;rer les photos dans Photo&nbsp;Station, vous devez cr&eacute;er des albums et charger des photos. Pour ce faire, utilisez une des m&eacute;thodes ci-apr&egrave;s.</p>

<h4>2.1&nbsp;Chargement de photos via Synology Photo&nbsp;Station&nbsp;Uploader (pour Windows et Mac)</h4>
<p>Il est recommand&eacute; d&apos;utiliser Synology Photo&nbsp;Station&nbsp;Uploader, car la miniature de chaque photo &agrave; afficher sera cr&eacute;&eacute;e lors du processus de chargement. Le chargement de fichiers via Synology Photo&nbsp;Station&nbsp;Uploader exploite les capacit&eacute;s de calcul de votre ordinateur afin d&apos;acc&eacute;l&eacute;rer la conversion.</p>
<ol>
<li>T&eacute;l&eacute;chargez et installez <b>Synology Photo&nbsp;Station&nbsp;Uploader</b> (disponible dans le <a href="https://www.synology.com/support/download" target="_blank">Centre de t&eacute;l&eacute;chargements de Synology</a>).</li>
<li>Sur votre ordinateur, cliquez avec le bouton droit de la souris sur les photos que vous souhaitez charger. Ensuite, s&eacute;lectionnez les options <b>Charger vers Photo&nbsp;Station</b>&nbsp;&gt; <b>Cr&eacute;er un nouveau profil</b> pour ouvrir l&apos;assistant.</li>
<li>Saisissez le nom de votre choix, puis indiquez le nom/l&apos;adresse IP du serveur Synology&nbsp;NAS de destination pour le nouveau profil.</li><img src="../../images/ManagePhotos/1x/manage_share_photos/2.png" border="1"/><div class="code_div"><b>Remarque&nbsp;:</b><p>Les informations du serveur et les identifiants sont enregistr&eacute;s dans ce profil pour une utilisation ult&eacute;rieure. Vous pouvez configurer plusieurs profils qui correspondent &agrave; diff&eacute;rentes r&egrave;gles ou destinations. La prochaine fois que vous utiliserez Synology Photo&nbsp;Station&nbsp;Uploader, au lieu de saisir &agrave; nouveau les informations du serveur, vous pourrez s&eacute;lectionner un profil existant. Celui-ci vous permettra d&apos;utiliser les configurations pr&eacute;alablement d&eacute;finies et de charger les photos vers la destination &eacute;tablie.</p>
</div>

<li>Indiquez si vous souhaitez charger les fichiers sur l&apos;application Photo&nbsp;Station ou sur Personal&nbsp;Photo&nbsp;Station.</li>

<li>Saisissez les identifiants utilisateur du serveur Synology&nbsp;NAS de destination.</li>

<li>Cliquez sur <b>Parcourir</b> pour choisir un dossier de destination. Vous pouvez aussi cr&eacute;er un sous-dossier appartenant au dossier partag&eacute; <b>photo</b>.</li><img src="../../images/ManagePhotos/1x/manage_share_photos/3.png" border="1"/><li>Une fois le chargement termin&eacute;, vous pouvez lancer Photo&nbsp;Station sur votre serveur Synology&nbsp;NAS. Sur ce dernier, vous pouvez afficher les fichiers charg&eacute;s dans diff&eacute;rents modes, et modifier d&apos;autres informations comme les propri&eacute;t&eacute;s de l&apos;album et les droits d&apos;acc&egrave;s.</li>
</ol>


<h4>2.2&nbsp;Cr&eacute;ation d&apos;albums et chargement de photos via Photo&nbsp;Station</h4>
<p>Lancez <b>Photo&nbsp;Station</b>, puis cliquez sur <b>Ajouter</b> pour cr&eacute;er un nouvel album ou charger des photos depuis votre ordinateur ou votre serveur Synology&nbsp;NAS vers des albums existants.</p><img src="../../images/ManagePhotos/1x/manage_share_photos/4.png" border="1"/><div class="code_div"><b>Remarque&nbsp;:</b><p>Si vous pr&eacute;f&eacute;rez charger des photos via l&apos;interface de Photo&nbsp;Station, il est vivement recommand&eacute; d&apos;activer le service QuickConnect. Que vous soyez &agrave; la maison ou en d&eacute;placement, QuickConnect vous permet d&apos;acc&eacute;der &agrave; votre serveur Synology&nbsp;NAS et &agrave; Photo&nbsp;Station depuis n&apos;importe quel emplacement. Il vous suffit d&apos;une connexion Internet et de votre identifiant personnalis&eacute;. Plus besoin de d&eacute;finir des configurations r&eacute;seau complexes, telles que des r&egrave;gles de transmission de port. Pour obtenir de plus amples informations sur QuickConnect, consultez <a class="launch-app" href="cloud_set_up_quickconnect.html">ce tutoriel</a>.</p>
</div>

<h3 class="list_head">3. Partage de photos</h3>
<p>Gr&acirc;ce &agrave; la fonction de partage, vous pouvez facilement partager les photos stock&eacute;es sur Photo&nbsp;Station avec vos amis ou les charger sur les r&eacute;seaux sociaux les plus utilis&eacute;s, tels que Facebook, Picasa et Flickr.</p>

<h4>3.1&nbsp;Partage public de photos</h4>
<ol>
<li>Parcourez un album, et s&eacute;lectionnez les photos que vous souhaitez partager.</li>
<li>Cliquez sur les options <b>Partager</b>&nbsp;&gt; <b>Partager avec le public</b> pour obtenir le lien.</li>
<ul>
<li>Si vous avez s&eacute;lectionn&eacute; une seule photo &agrave; partager, celle-ci sera ajout&eacute;e &agrave; un album partag&eacute; par d&eacute;faut nomm&eacute; <b>Photos partag&eacute;es</b>. Dans cet album, vous pouvez g&eacute;rer toutes les photos que vous avez partag&eacute;es une par une.</li>
<li>Si vous avez s&eacute;lectionn&eacute; plusieurs photos &agrave; partager, celles-ci seront regroup&eacute;es dans un nouvel album partag&eacute;.</li>
</ul>
<li>Vous pouvez &eacute;galement cliquer sur les options <b>Partager</b>&nbsp;&gt; <b>Ajouter &agrave; un album partag&eacute;</b> pour ajouter les photos s&eacute;lectionn&eacute;es &agrave; un album partag&eacute; existant (le cas &eacute;ch&eacute;ant).</li><img src="../../images/ManagePhotos/1x/manage_share_photos/5.png" border="1"/><li>Saisissez un nom pour le nouvel album partag&eacute;, puis sp&eacute;cifiez sa p&eacute;riode de validit&eacute; si n&eacute;cessaire.</li>
<li>Copiez et collez le lien dans les e-mails, les messages instantan&eacute;s et les pages Web pour partager les photos s&eacute;lectionn&eacute;es avec tout le monde.</li>
</ol>

<div class="code_div"><b>Remarque&nbsp;:</b><ul>
<li>Toutes les photos partag&eacute;es sont accessibles au public, et peuvent &ecirc;tre consulter par toute personne disposant du lien.</li>
<li>Pour indiquer quels utilisateurs sont autoris&eacute;s &agrave; partager des &eacute;l&eacute;ments de Photo&nbsp;Station avec le public, acc&eacute;dez au menu <b>Param&egrave;tres</b>&nbsp;&gt; <b>Partage</b>.</li>
</ul>
</div>

<h4>3.2&nbsp;Partage de photos sur les r&eacute;seaux sociaux</h4>
<ol>
<li>S&eacute;lectionnez les photos que vous voulez publier, puis acc&eacute;dez au menu <b>Partager</b>&nbsp;&gt; <b>Charger vers [sites Web de r&eacute;seaux sociaux]</b>.</li><img src="../../images/ManagePhotos/1x/manage_share_photos/6.png" border="1"/><li>Dans la fen&ecirc;tre qui s&apos;affiche, cliquez sur <b>Se connecter &agrave; [sites Web de r&eacute;seaux sociaux]</b>, puis identifiez-vous avec votre compte de r&eacute;seau social. Vous pouvez choisir de charger les photos vers un nouvel album ou un album existant.</li>
</ol>

<h3 class="list_head">4. Organisation et affichage des photos sur des p&eacute;riph&eacute;riques mobiles</h3>
<p>Pour vous connecter &agrave; Photo&nbsp;Station ou charger des photos via des p&eacute;riph&eacute;riques mobiles, vous devez installer <b>DS&nbsp;photo</b> sur vos p&eacute;riph&eacute;riques mobiles en utilisant les codes QR ci-dessous.</p><img src="../../images/ManagePhotos/1x/manage_share_photos/7.png"/></div>

</body>
</html>