<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Z&aacute;lohov&aacute;n&iacute; a&nbsp;replikace</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head> 
<body>
<h2>Synchronizace sd&iacute;len&yacute;ch složek</h2>
<p>Služba Synchronizace sd&iacute;len&yacute;ch složek umožňuje uživatelům synchronizovat sd&iacute;len&eacute; složky z&nbsp;jednoho zař&iacute;zen&iacute; Synology NAS (zdroj) na jin&aacute; zař&iacute;zen&iacute; Synology NAS (c&iacute;l) v&nbsp;s&iacute;ti LAN nebo přes internet.</p>
<p>Synchronizace sd&iacute;len&yacute;ch složek provede nejprve &uacute;plnou synchronizaci vybran&yacute;ch sd&iacute;len&yacute;ch složek. Pot&eacute; se budou synchronizovat pouze změněn&eacute; soubory. Soubory, kter&eacute; byly odstraněny ze zdroje, se odstran&iacute; i z&nbsp;c&iacute;le.</p>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Služba Synchronizace sd&iacute;len&yacute;ch složek představuje jednosměrn&eacute; ře&scaron;en&iacute; synchronizace, kter&eacute; synchronizuje soubory ze zdroje na c&iacute;l. Pokud potřebujete obousměrn&eacute; ře&scaron;en&iacute; synchronizace, použijte službu <strong>Synology Drive ShareSync</strong>.</li>
<li>Pokud na c&iacute;li existuje sd&iacute;len&aacute; složka se stejn&yacute;m n&aacute;zvem (např. Sd&iacute;len&aacute;Složka), jako m&aacute; zdrojov&aacute; sd&iacute;len&aacute; složka, přejmenuje se c&iacute;lov&aacute; složka na &bdquo;Sd&iacute;len&aacute;Složka_1&ldquo;.</li>
<li>Pokud na c&iacute;li neexistuje ž&aacute;dn&aacute; sd&iacute;len&aacute; složka se stejn&yacute;m n&aacute;zvem, jako m&aacute; zdrojov&aacute; sd&iacute;len&aacute; složka, vytvoř&iacute; se v&nbsp;odpov&iacute;daj&iacute;c&iacute;m nebo v&nbsp;prvn&iacute;m dostupn&eacute;m svazku složka pomoc&iacute; tohoto n&aacute;zvu.</li>
<li>Podle v&yacute;choz&iacute;ho nastaven&iacute; nem&aacute; ž&aacute;dn&yacute; uživatel opr&aacute;vněn&iacute; k&nbsp;př&iacute;stupu do sd&iacute;len&eacute; složky v&nbsp;c&iacute;li. O opr&aacute;vněn&iacute; pož&aacute;dejte spr&aacute;vce <strong>admin</strong> c&iacute;le.</li>
</ul>
</p>
</div>

<h3>Povolen&iacute; služby</h3>
<h4>Povolen&iacute; Synchronizace sd&iacute;len&yacute;ch složek:</h4>
<p>Službu mus&iacute;te nejprve povolit na c&iacute;lov&eacute;m zař&iacute;zen&iacute; Synology NAS.</p>
<ol>
<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Souborov&aacute; služba</strong> &gt; <strong>rsync</strong></li>
<li>Volbou možnosti <strong>Povolit službu rsync</strong> povolte službu Synchronizace sd&iacute;len&yacute;ch složek.</li>
<li>Klikněte na možnost <strong>Použ&iacute;t</strong>.</li>
</ol>


<h4>Zru&scaron;en&iacute; propojen&iacute; sd&iacute;len&yacute;ch složek z&nbsp;c&iacute;lov&eacute;ho zař&iacute;zen&iacute; Synology NAS:</h4>

<p>Pokud různ&eacute; zdroje současně synchronizuj&iacute; totožn&eacute; sd&iacute;len&eacute; složky do jednoho c&iacute;le Synology NAS, dojde ke konfliktu. Než bude moci jin&yacute; zdroj na c&iacute;l synchronizovat svou složku, budete muset zru&scaron;it propojen&iacute; sd&iacute;len&eacute; složky na straně zdroje.<ol>
<li>Přihlaste se k&nbsp;c&iacute;lov&eacute;mu zař&iacute;zen&iacute; Synology NAS a přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Synchronizace sd&iacute;len&yacute;ch složek</strong> &gt; <strong>Seznam připojen&iacute;</strong>.</li>
<li>Ve zdrojov&eacute;m zař&iacute;zen&iacute; Synology NAS vyberte konfliktn&iacute; připojen&iacute; a kliknut&iacute;m na možnost <strong>Zru&scaron;it propojen&iacute;</strong> ho odeberte.</li>
</ol>

<p>Nyn&iacute; může sd&iacute;lenou složku do c&iacute;lov&eacute;ho zař&iacute;zen&iacute; Synology NAS synchronizovat dal&scaron;&iacute; zdroj.</p>

<h3>Spr&aacute;va &uacute;loh synchronizace</h3>

<h4>Vytvořen&iacute; &uacute;lohy synchronizace:</h4>
<ol>
<li>Přihlaste se ke zdrojov&eacute;mu zař&iacute;zen&iacute; Synology NAS a přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>Synchronizace sd&iacute;len&yacute;ch složek</b> &gt; <strong>Seznam &uacute;loh</strong>.</li>
<li>Klikněte na možnost <b>Vytvořit</b>.</li>
<li>Zadejte n&aacute;zev &uacute;lohy.</li>
<li>Vyberte sd&iacute;lenou složku, kterou chcete synchronizovat na c&iacute;l.</li>
<li>Určete c&iacute;lov&eacute; zař&iacute;zen&iacute; Synology NAS a n&aacute;sleduj&iacute;c&iacute; možnosti synchronizace:</li>
<ul>
<li><strong>Přizpůsobit port &scaron;ifrov&aacute;n&iacute; SSH pro službu Synchronizace sd&iacute;len&yacute;ch složek</strong>: Zadejte požadovan&yacute; port &scaron;ifrov&aacute;n&iacute; pro &scaron;ifrov&aacute;n&iacute; přenosu SSH.</li>
<li><strong>Povolit &scaron;ifrov&aacute;n&iacute; přenosu SSH</strong>: &Scaron;ifrov&aacute;n&iacute; dat během přenosu. Tato možnost nab&iacute;z&iacute; lep&scaron;&iacute; zabezpečen&iacute;, zat&iacute;mco ne&scaron;ifrovan&yacute; přenos nab&iacute;z&iacute; lep&scaron;&iacute; v&yacute;kon. Vyberte možnost podle sv&yacute;ch potřeb.</li> 
<li><strong>Povolit komprimaci přenosu</strong>: Komprimace dat během přenosu. &Scaron;etř&iacute; &scaron;&iacute;řku p&aacute;sma, ale zvy&scaron;uje z&aacute;těž procesoru.</li>
<li><strong>Povolit synchronizaci na &uacute;rovni bloku</strong>: Přen&aacute;&scaron;&iacute; se pouze rozd&iacute;ln&aacute; data nam&iacute;sto cel&yacute;ch souborů. &Scaron;etř&iacute; &scaron;&iacute;řku p&aacute;sma, ale zvy&scaron;uje z&aacute;těž procesoru.</li>
</ul>
<li>Po zobrazen&iacute; v&yacute;zvy vyberte někter&eacute; z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute; a určete, kdy m&aacute; proběhnout synchronizace ze zdroje na c&iacute;l:</li>
<ul>
<li><strong>Spustit synchronizaci při &uacute;pravě</strong>: Spu&scaron;těn&iacute; &uacute;lohy synchronizace okamžitě po proveden&iacute; nějak&eacute; změny ve zdrojov&eacute; sd&iacute;len&eacute; složce.</li>
<li><strong>Spustit synchronizaci ručně</strong>: Spu&scaron;těn&iacute; &uacute;lohy synchronizace ručně ze zdrojov&eacute; sd&iacute;len&eacute; složky.</li>
<li><strong>Roz&scaron;&iacute;řen&yacute; pl&aacute;n</strong>: Klikněte na možnost <strong>Pl&aacute;n</strong> a určete, kdy se m&aacute; &uacute;loha synchronizace prov&aacute;dět.</li>

</ul>
<li>Klikněte na možnost <strong>Použ&iacute;t</strong>. V&nbsp;seznamu &uacute;loh se zobraz&iacute; &uacute;loha synchronizace, kter&aacute; se bude prov&aacute;dět podle zadan&eacute;ho pl&aacute;nu.</li></ol>
<h4>Spr&aacute;va &uacute;lohy synchronizace:</h4>
<ol>
<li>Ve zdrojov&eacute;m zař&iacute;zen&iacute; Synology NAS přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Synchronizace sd&iacute;len&yacute;ch složek</strong>, klikněte na možnost <strong>Seznam &uacute;loh</strong> a vyberte požadovanou &uacute;lohu.</li>
<li>Proveďte někter&yacute; z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch &uacute;konů:</li>
<ul>
<li>Kliknut&iacute;m na možnost <b>Upravit</b> &uacute;lohu uprav&iacute;te.</li>
<li>Kliknut&iacute;m na možnost <b>Odstranit</b> &uacute;lohu odstran&iacute;te.</li> 
<li>Pokud &uacute;loha synchronizace pr&aacute;vě neprob&iacute;h&aacute;, kliknut&iacute;m na možnost <b>Synchronizovat</b> spust&iacute;te &uacute;lohu okamžitě.</li>
<li>Pokud &uacute;loha synchronizace pr&aacute;vě prob&iacute;h&aacute;, kliknut&iacute;m na možnost <b>Storno</b> prob&iacute;haj&iacute;c&iacute; &uacute;lohu zastav&iacute;te.</li>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Pokud je pl&aacute;n &uacute;lohy synchronizace nastaven na možnost <b>Spustit synchronizaci při &uacute;pravě</b>, kliknut&iacute;m na možnost <b>Storno</b> se prob&iacute;haj&iacute;c&iacute; &uacute;loha synchronizace zastav&iacute;. Pokud v&scaron;ak dojde k&nbsp;libovoln&yacute;m změn&aacute;m v&nbsp;obsahu libovoln&eacute; sd&iacute;len&eacute; složky (složek) monitorovan&eacute; &uacute;lohou synchronizace, Synchronizace sd&iacute;len&yacute;ch složek &uacute;lohu obnov&iacute;.</p>
</div>

<li>Kliknut&iacute;m na položku <b>&Uacute;pln&aacute; synchronizace</b> se synchronizuj&iacute; v&scaron;echna data. Synchronizace sd&iacute;len&yacute;ch složek spust&iacute; nejprve &uacute;plnou synchronizaci, později se již synchronizuj&iacute; pouze změněn&eacute; č&aacute;sti. Kliknut&iacute;m na toto tlač&iacute;tko lze ručně znovu synchronizovat v&scaron;echna data.</li>
</ul>
</ol>

<div class="section">
<h4>Dal&scaron;&iacute; informace</h4>
<ol>
<li>N&aacute;zev &uacute;lohy se mus&iacute; skl&aacute;dat z&nbsp;1 až 32&nbsp;znaků Unicode a&nbsp;nesm&iacute; obsahovat n&aacute;sleduj&iacute;c&iacute; znaky:<br> <span class="letterSpace5">! &quot; # $ % &amp; &apos; ( ) * + , / : ;<= >? @ [ ] \ ^ ` { } | ~</span></span></li>
<li>Pokud synchronizujete sd&iacute;len&eacute; složky ze souborov&eacute;ho syst&eacute;mu ext4 do ext3, mohou se vyskytnout chyby, pokud &uacute;loha obsahuje v&iacute;ce než 32&nbsp;000 složek.</li>
<li>Pokud byly sd&iacute;len&eacute; složky na c&iacute;lov&eacute;m zař&iacute;zen&iacute; Synology NAS dř&iacute;ve synchronizov&aacute;ny s&nbsp;jin&yacute;m zař&iacute;zen&iacute;m Synology NAS, provede Synchronizace sd&iacute;len&yacute;ch složek &uacute;plnou synchronizaci &uacute;lohy.</li>
<li>Při prov&aacute;děn&iacute; &uacute;loh Synchronizace sd&iacute;len&yacute;ch složek potřebujete opr&aacute;vněn&iacute; spr&aacute;vce admin c&iacute;lov&eacute;ho zař&iacute;zen&iacute; Synology NAS. Buď m&aacute;te heslo k&nbsp;jeho &uacute;čtu admin nebo jste členem skupiny administrators.</li>
<li>Při synchronizaci do c&iacute;lov&eacute;ho zař&iacute;zen&iacute; Synology NAS přes internet je možn&eacute; zadat n&aacute;zev serveru podle extern&iacute; IP adresy nebo n&aacute;zvu hostitele. Pokud se v&scaron;ak rozhodnete zadat n&aacute;zev hostitele, mus&iacute; b&yacute;t tento n&aacute;zev ve form&aacute;tu FQDN (Fully Qualified Domain Name), např&iacute;klad &bdquo;www.synology.com&ldquo;.</li>
<li>Při přesměrov&aacute;n&iacute; portů použ&iacute;v&aacute; služba Synchronizace sd&iacute;len&yacute;ch složek port&nbsp;22 při &scaron;ifrovan&eacute;m přenosu a&nbsp;port&nbsp;873 při ne&scaron;ifrovan&eacute;m přenosu.</li>
<li>Služba Synchronizace sd&iacute;len&yacute;ch složek nepodporuje extern&iacute; &uacute;loži&scaron;tě.</li>
<li>Když se spust&iacute; &uacute;loha Synchronizace sd&iacute;len&yacute;ch složek, automaticky se připoj&iacute; za&scaron;ifrovan&eacute; sd&iacute;len&eacute; složky v&nbsp;c&iacute;li; chcete-li v&scaron;ak přistupovat k&nbsp;datům obsažen&yacute;m v&nbsp;nich, mus&iacute;te za&scaron;ifrovan&eacute; sd&iacute;len&eacute; složky v&nbsp;c&iacute;li nejprve připojit.</li>
<li>Napl&aacute;novan&aacute; synchronizace sd&iacute;len&yacute;ch složek se v&nbsp;zadanou dobu nespust&iacute;, pokud nedo&scaron;lo k&nbsp;ž&aacute;dn&yacute;m změn&aacute;m vybran&eacute; sd&iacute;len&eacute; složky.</li>
<li>Nejlep&scaron;&iacute;ho v&yacute;konu dos&aacute;hnete, když budou jednotliv&eacute; &uacute;lohy synchronizace obsahovat m&eacute;ně než 200&nbsp;sd&iacute;len&yacute;ch složek.</li>
<li>Pokud se sd&iacute;len&aacute; složka <strong>homes</strong> ze zdrojov&eacute;ho zař&iacute;zen&iacute; Synology NAS synchronizuje do c&iacute;lov&eacute;ho zař&iacute;zen&iacute; Synology NAS, zak&aacute;že se na c&iacute;lov&eacute;m zař&iacute;zen&iacute; Synology NAS funkce <strong>Složka uživatele</strong>.</li>

<li>U modelů s&nbsp;jin&yacute;mi procesory CPU než Intel je možn&eacute; pomoc&iacute; služby Synchronizace sd&iacute;len&yacute;ch složek synchronizovat až 100&nbsp;000 sd&iacute;len&yacute;ch složek (včetně podsložek).</li>
 <li>Služba Synchronizace sd&iacute;len&yacute;ch složek dok&aacute;že z&aacute;lohovat nastaven&iacute; seznamu Windows ACL, pokud je souborov&yacute;m syst&eacute;mem c&iacute;le syst&eacute;m ext4 nebo Btrfs. <br><span class="note_head">Pozn&aacute;mka:</span> Data a nastaven&iacute; seznamu Windows ACL uložen&aacute; v&nbsp;zař&iacute;zen&iacute; Synology NAS nelze synchronizovat do zař&iacute;zen&iacute; EDS14.</li>
 
 <li>Pokud synchronizujete na c&iacute;lov&yacute; server, kter&yacute; m&aacute; stejn&yacute; n&aacute;zev jako va&scaron;e zař&iacute;zen&iacute; Synology NAS, synchronizace sd&iacute;len&yacute;ch složek se nezdař&iacute;.</li>
 
<li>Roz&scaron;&iacute;řen&aacute; opr&aacute;vněn&iacute; sd&iacute;len&eacute; složky ze zdroje se na c&iacute;l nesynchronizuj&iacute;. Kromě toho bude pro skupinu administrators v&nbsp;c&iacute;lov&eacute;m um&iacute;stěn&iacute; vytvořeno pravidlo pouze pro čten&iacute;.</li> 

  </ol>
</div>

</body></html>
