<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" charset="utf-8">
<title>Port&aacute;l aplikac&iacute;</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Port&aacute;l aplikac&iacute;</h1>
<p>Port&aacute;l aplikac&iacute; umožňuje konfigurovat nastaven&iacute; připojen&iacute; různ&yacute;ch aplikac&iacute; tak, abyste k&nbsp;těmto aplikac&iacute;m (např. File Station) měli př&iacute;m&yacute; př&iacute;stup a mohli je spou&scaron;tět v&nbsp;samostatn&yacute;ch kart&aacute;ch či oknech prohl&iacute;žeče.</p>


<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Možn&eacute; je upravovat př&iacute;stupov&aacute; opr&aacute;vněn&iacute; k&nbsp;aplikac&iacute;m jako Audio Station, Download Station, Surveillance Station, Video Station, File Station a mnoha dal&scaron;&iacute;m.</li>
</ul>
</div>


<h2><a name="session"></a>Nastaven&iacute; aliasů</h2>

<p>Každ&eacute; aplikaci vyvinut&eacute; společnost&iacute; Synology, např. File Station, je možn&eacute; přidělit alias. Pomoc&iacute; vlastn&iacute;ho aliasu je možn&eacute; aplikaci prostřednictv&iacute;m specializovan&eacute; adresy URL rychle otevř&iacute;t.</p>

<h4>Nastaven&iacute; aliasů aplikac&iacute;:</h4>
<ol>
<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Port&aacute;l aplikac&iacute;</strong> &gt; <strong>Aplikace</strong>.</li>
<li>Vyberte aplikaci.</li>
<li>Klikněte na možnost <b>Upravit</b> &gt; <strong>Obecn&eacute;</strong>.</li>
<li>V&nbsp;m&iacute;stn&iacute;m okně vyberte možnost <b>Povolit vlastn&iacute; alias</b> a stanovte alias.</li>
<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <strong>OK</strong>.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Někter&eacute; aplikace maj&iacute; vlastn&iacute; v&yacute;choz&iacute; aliasy: Audio Station (<strong>audio</strong>), Download Station (<strong>download</strong>), File Station (<strong>file</strong>), Surveillance Station (<strong>cam</strong>) a Video Station (<strong>video</strong>).</li>
<li>N&aacute;zvy aliasů nesm&iacute; b&yacute;t stejn&eacute; jako n&aacute;zvy rezervovan&eacute; pro syst&eacute;m, prohl&iacute;žeče nebo ostatn&iacute; aplikace a n&aacute;zev aliasu mus&iacute; obsahovat min. 2 a&nbsp;max. 20 znaků.</li>
<li>Alias se může skl&aacute;dat pouze z&nbsp;mal&yacute;ch a velk&yacute;ch p&iacute;smen, č&iacute;seln&yacute;ch znaků a dvou speci&aacute;ln&iacute;ch znaků (-) a (_).</li>
<li>Alias nemůže zač&iacute;nat nebo končit speci&aacute;ln&iacute;m znakem (-) ani (_).</li>
</ul>
</div>

<h4>Př&iacute;stup k&nbsp;aplikac&iacute;m pomoc&iacute; aliasů:</h4>
<p>Po nastaven&iacute; aliasu pro aplikaci (např. File Station) je možn&eacute; aplikaci rychle otevř&iacute;t zad&aacute;n&iacute;m adresy URL v&nbsp;n&aacute;sleduj&iacute;c&iacute;ch form&aacute;tech: <code>http://DS_IP_NEBO_N&Aacute;ZEV_SERVERU/ALIAS/</code> nebo <code>https://DS_IP_NEBO_N&Aacute;ZEV_SERVERU/ALIAS/</code></p>

<p>Např&iacute;klad ke službě File Station je možn&eacute; se rychle dostat pomoc&iacute; adres URL: <code>http://192.168.xx.xx/file/</code> nebo <code>https://MySynologyNAS/file/</code></p>


<h2><a name="session"></a>Přizpůsoben&iacute; portů HTTP/HTTPS</h2>

<p>Každ&eacute; aplikaci vyvinut&eacute; společnost&iacute; Synology, např. File Station, je možn&eacute; přidělit port HTTP/HTTPS. Pomoc&iacute; vlastn&iacute;ho portu je možn&eacute; aplikaci prostřednictv&iacute;m specializovan&eacute; adresy URL rychle otevř&iacute;t.</p>


<h4>Přizpůsoben&iacute; portů HTTP/HTTPS aplikac&iacute;:</h4>
<ol>
<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Port&aacute;l aplikac&iacute;</strong> &gt; <strong>Aplikace</strong>.</li>
<li>Vyberte aplikaci.</li>
<li>Klikněte na možnost <b>Upravit</b> &gt; <strong>Obecn&eacute;</strong>.</li>
<li>V&nbsp;m&iacute;stn&iacute;m okně vyberte možnost <b>Povolit vlastn&iacute; port (HTTP)</b> nebo <b>Povolit vlastn&iacute; port (HTTPS)</b>.</li>
<li>Určete vlastn&iacute; č&iacute;slo portu.</li></ol>
<div class="section">
  <h4>Pozn&aacute;mka:</h4>
  <ul>
  <li>Č&iacute;slo portu může b&yacute;t z&nbsp;rozsahu 1 až 65&nbsp;535.</li>
  <li>N&aacute;sleduj&iacute;c&iacute; porty nen&iacute; možn&eacute; použ&iacute;t, protože jsou vyhrazeny pro syst&eacute;mov&eacute; využit&iacute;:<ul>
  <li>20, 21, 22, 23, 25, 80, 110, 137, 138, 139, 143, 199, 443, 445, 515, 543, 548, 587, 873, 993, 995, 3306, 3689, 5000, 5001, 5005, 5006, 5335, 5432, 6881, 8080, 7000, 7001, 8081, 9997, 9998, 9999, 50001, 50002</li>
  <li>V&yacute;choz&iacute; porty eMule: 4662 (TCP), 4672 (UDP)</li>
  <li>V&yacute;choz&iacute; rozsah portů FTP: Skutečn&yacute; rozsah se může u&nbsp;různ&yacute;ch modelů li&scaron;it.</li>
  
  </ul>
  </li>
  </ul>
</div>


<h4>Př&iacute;stup k&nbsp;aplikac&iacute;m pomoc&iacute; portů HTTP/HTTPS:</h4>

<p>Po nastaven&iacute; portů HTTP nebo HTTPS pro aplikaci (např. File Station) je možn&eacute; aplikaci rychle otevř&iacute;t zad&aacute;n&iacute;m adres URL v&nbsp;n&aacute;sleduj&iacute;c&iacute;ch form&aacute;tech: <code>http://DS_IP_NEBO_N&Aacute;ZEV_SERVERU:PORT_HTTP</code> nebo <code>https://DS_IP_NEBO_N&Aacute;ZEV_SERVERU:PORT_HTTPS</code></p>

<p>Např&iacute;klad ke službě File Station je možn&eacute; se rychle dostat pomoc&iacute; adres URL: <code>http://192.168.xx.xx:7000</code> nebo <code>https://MySynologyNAS:7001</code></p>

<h4>Konfigurace certifik&aacute;tu a &uacute;rovně profilu TLS/SSL pro porty HTTPS:</h4>
<p>Po nastaven&iacute; portu HTTPS pro aplikaci (např. File Station) můžete přej&iacute;t do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Zabezpečen&iacute;</strong> &gt; <strong>Certifik&aacute;t</strong> a kliknout na možnost <strong>Konfigurovat</strong>. Pot&eacute; vyhledejte n&aacute;zev služby ve form&aacute;tu <strong>N&aacute;zev_aplikace - PORT_HTTPS</strong> a nakonfigurujte použ&iacute;van&yacute; certifik&aacute;t.</p>
<p>Můžete rovněž přej&iacute;t do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Zabezpečen&iacute;</strong> &gt; <strong>Roz&scaron;&iacute;řen&eacute;</strong> a kliknout na možnost <strong>Vlastn&iacute; nastaven&iacute;</strong>. Pot&eacute; vyhledejte n&aacute;zev služby ve form&aacute;tu <strong>N&aacute;zev_aplikace - PORT_HTTPS</strong> a nakonfigurujte použ&iacute;vanou &uacute;roveň profilu TLS/SSL.</p>
<p>Pokud je např&iacute;klad port HTTPS služby File Station 7001, můžete přej&iacute;t na v&yacute;&scaron;e uveden&eacute; dvě str&aacute;nky a vyhledat službu s&nbsp;n&aacute;zvem FileStation - 7001, ve kter&eacute; lze prov&aacute;dět dal&scaron;&iacute; konfiguraci.</p>

<h2><a name="session"></a>Přizpůsoben&iacute; dom&eacute;n</h2>

<p>Aplikaci vyvinut&eacute; společnost&iacute; Synology, např&iacute;klad File Station, je možn&eacute; přiřadit n&aacute;zev dom&eacute;ny. Pomoc&iacute; vlastn&iacute; dom&eacute;ny je možn&eacute; aplikaci rychle otevř&iacute;t prostřednictv&iacute;m specializovan&eacute; adresy URL.</p>

<h4>Nastaven&iacute; dom&eacute;n aplikac&iacute;:</h4>
<ol>
<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Port&aacute;l aplikac&iacute;</strong> &gt; <strong>Aplikace</strong>.</li>
<li>Vyberte aplikaci.</li>
<li>Klikněte na možnost <b>Upravit</b> &gt; <strong>Obecn&eacute;</strong>.</li>
<li>V&nbsp;m&iacute;stn&iacute;m okně vyberte možnost <b>Povolit vlastn&iacute; dom&eacute;nu</b>.</li>
<li>Stanovte vlastn&iacute; dom&eacute;nu.</li>
<li>Jako dal&scaron;&iacute; nastaven&iacute; je možn&eacute; použ&iacute;t volby <strong>Povolit HSTS</strong> nebo <strong>Povolit HTTP/2</strong> tak, aby vyhovovaly va&scaron;im potřeb&aacute;m.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Před nastaven&iacute;m t&eacute;to funkce je nutn&eacute; u poskytovatelů dom&eacute;n zaž&aacute;dat o n&aacute;zvy dom&eacute;n, aby uživatel&eacute; měli k&nbsp;dan&eacute; službě př&iacute;stup z&nbsp;internetu.</li>
<li>Každ&yacute; n&aacute;zev dom&eacute;ny je možn&eacute; na zař&iacute;zen&iacute; Synology NAS použ&iacute;t pouze pro jednu samostatnou aplikaci.</li>
<li>Jestliže n&aacute;zev dom&eacute;ny nepřekroč&iacute; d&eacute;lku 15&nbsp;znaků a splňuje <a href="https://support.microsoft.com/kb/909264" target="_blank">konvence pro n&aacute;zvy NetBIOS</a>, syst&eacute;m n&aacute;zev dom&eacute;ny zaregistruje a bude vys&iacute;lat automaticky.</li>
<li>Když k&nbsp;aplikac&iacute;m přistupujete prostřednictv&iacute;m adres URL, kter&eacute; použ&iacute;vaj&iacute; n&aacute;zvy dom&eacute;n, budete proch&aacute;zet přes standardn&iacute; port HTTP (80) nebo standardn&iacute; port HTTPS (443).</li>
<li>Pokud povol&iacute;te ř&iacute;zen&iacute; př&iacute;stupu pomoc&iacute; certifik&aacute;tu vydan&eacute;ho společnost&iacute; Let&apos;s Encrypt, nemus&iacute; se automatick&eacute; obnoven&iacute; certifik&aacute;tu podařit. Pokud k&nbsp;takov&eacute; situaci dojde, zakažte nejprve ř&iacute;zen&iacute; př&iacute;stupu. Pot&eacute; přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>Zabezpečen&iacute;</b> &gt; <b>Certifik&aacute;t</b>, klikněte prav&yacute;m tlač&iacute;tkem na certifik&aacute;t společnosti Let&apos;s Encrypt, kter&yacute; chcete obnovit, a vyberte možnost <b>Obnovit certifik&aacute;t</b>. Po obnoven&iacute; certifik&aacute;tu můžete ř&iacute;zen&iacute; př&iacute;stupu znovu povolit.</li>
</ul>

</div>


<h4>Př&iacute;stup k&nbsp;aplikac&iacute;m prostřednictv&iacute;m dom&eacute;n:</h4>
<p>Po nastaven&iacute; dom&eacute;ny pro aplikaci (např. file.example.com) je možn&eacute; aplikaci (např. File Station) rychle otevř&iacute;t zad&aacute;n&iacute;m adresy URL v&nbsp;n&aacute;sleduj&iacute;c&iacute;ch form&aacute;tech: <code>http://DOM&Eacute;NA_APLIKACE</code> nebo <code>https://DOM&Eacute;NA_APLIKACE</code></p>

<p>Např&iacute;klad ke službě File Station je možn&eacute; se rychle dostat pomoc&iacute; adres URL: <code>http://file.example.com</code> nebo <code>https://file.example.com</code></p>

<p>Jestliže n&aacute;zev dom&eacute;ny (např. FileFile) u&nbsp;aplikace (např. File Station) splňuje konvence pro n&aacute;zvy NetBIOS, uživatel&eacute; syst&eacute;mu Windows se k&nbsp;nim mohou na zař&iacute;zen&iacute; Synology NAS ve stejn&eacute; m&iacute;stn&iacute; s&iacute;ti dostat pomoc&iacute; podobn&eacute; adresy URL: <code>http://FileFile</code> nebo <code>https://FileFile</code></p>

<h4>Konfigurace certifik&aacute;tu a &uacute;rovně profilu TLS/SSL pro dom&eacute;ny:</h4>
<p>Po nastaven&iacute; dom&eacute;ny pro aplikaci (např. File Station) můžete přej&iacute;t do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Zabezpečen&iacute;</strong> &gt; <strong>Certifik&aacute;t</strong> a kliknout na možnost <strong>Konfigurovat</strong>. Pot&eacute; vyhledejte n&aacute;zev služby ve form&aacute;tu <strong>N&aacute;zev_aplikace - Dom&eacute;na</strong> a nakonfigurujte použ&iacute;van&yacute; certifik&aacute;t.</p>
<p>Můžete rovněž přej&iacute;t do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Zabezpečen&iacute;</strong> &gt; <strong>Roz&scaron;&iacute;řen&eacute;</strong> a kliknout na možnost <strong>Vlastn&iacute; nastaven&iacute;</strong>. Pot&eacute; vyhledejte n&aacute;zev služby ve form&aacute;tu <strong>N&aacute;zev_aplikace - Dom&eacute;na</strong> a nakonfigurujte použ&iacute;vanou &uacute;roveň profilu TLS/SSL.</p>
<p>Pokud je např&iacute;klad dom&eacute;na služby File Station file.example.com, můžete přej&iacute;t na v&yacute;&scaron;e uveden&eacute; dvě str&aacute;nky a vyhledat službu s&nbsp;n&aacute;zvem FileStation - file.example.com, ve kter&eacute; lze prov&aacute;dět dal&scaron;&iacute; konfiguraci.</p>

<h4>Zad&aacute;n&iacute; profilu ř&iacute;zen&iacute; př&iacute;stupu:</h4>
<p>Po nastaven&iacute; profilu ř&iacute;zen&iacute; př&iacute;stupu pro aplikaci (např. File Station) nebudou odm&iacute;tnut&iacute; uživatel&eacute; tuto aplikaci moci otevř&iacute;t zad&aacute;n&iacute;m adres URL uveden&yacute;ch v&nbsp;tomto čl&aacute;nku.</p>
<ol>
<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Port&aacute;l aplikac&iacute;</strong> &gt; <strong>Aplikace</strong>.</li>
<li>Vyberte aplikaci.</li>
<li>Klikněte na možnost <b>Upravit</b> &gt; <strong>Obecn&eacute;</strong>.</li>
<li>V&nbsp;m&iacute;stn&iacute;m okně klikněte na možnost <strong>Povolit ř&iacute;zen&iacute; př&iacute;stupu</strong> a vyberte profil ř&iacute;zen&iacute; př&iacute;stupu. Dal&scaron;&iacute; informace o&nbsp;vytvořen&iacute; profilu ř&iacute;zen&iacute; př&iacute;stupu se nach&aacute;zej&iacute; v&nbsp;n&aacute;sleduj&iacute;c&iacute; č&aacute;sti <a href="#acl">Přizpůsoben&iacute; profilů ř&iacute;zen&iacute; př&iacute;stupu</a>.</li>
<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <strong>OK</strong>.</li>
</ol>


<h2>Přizpůsoben&iacute; pravidel reverzn&iacute;ho serveru proxy</h2>
<p>Zař&iacute;zen&iacute; Synology NAS může sloužit jako reverzn&iacute; server proxy, kter&yacute; přen&aacute;&scaron;&iacute; požadavky z&nbsp;internetu do zař&iacute;zen&iacute; v&nbsp;m&iacute;stn&iacute; s&iacute;ti. Pravidla reverzn&iacute;ho serveru proxy mohou pomoci skr&yacute;t citliv&eacute; porty před potenci&aacute;ln&iacute;mi hrozbami, jako ve dvou n&iacute;že uveden&yacute;ch sc&eacute;n&aacute;ř&iacute;ch:</p>

<p>Sc&eacute;n&aacute;ř 1: Předpokl&aacute;dejme, že citliv&yacute; port je 80, ke kter&eacute;mu by podle pravidel br&aacute;ny firewall neměl b&yacute;t povolen extern&iacute; př&iacute;stup. Můžete nastavit pravidlo rezervn&iacute;ho serveru proxy, kter&eacute; povol&iacute; důvěryhodn&yacute;m uživatelům z&nbsp;internetu dostat se na citliv&yacute; port 80 prostřednictv&iacute;m jin&eacute;ho otevřen&eacute;ho portu (např. 81). T&iacute;mto způsobem mohou důvěryhodn&iacute; uživatel&eacute; obej&iacute;t br&aacute;nu firewall a m&iacute;t přesto př&iacute;stup k&nbsp;portu 80.</p>

<p>Sc&eacute;n&aacute;ř 2: Předpokl&aacute;dejme, že citliv&yacute; je port 80, ke kter&eacute;mu by neměl b&yacute;t povolen extern&iacute; př&iacute;stup s&nbsp;v&yacute;jimkou konkr&eacute;tn&iacute;ho zař&iacute;zen&iacute; (např. serveru s&nbsp;n&aacute;zvem &bdquo;MyTrustee&ldquo;). Pomoc&iacute; pravidel reverzn&iacute;ho serveru proxy je možn&eacute; povolit, aby se k&nbsp;portu 80 dostal pouze provoz ze serveru MyTrustee, ale ne od jin&yacute;ch zař&iacute;zen&iacute;.</p>

<h4>Nastaven&iacute; pravidel reverzn&iacute;ho serveru proxy:</h4>

<ol>
<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Port&aacute;l aplikac&iacute;</strong> &gt; <strong>Reverzn&iacute; proxy</strong>.</li>
<li>Na str&aacute;nce <b>Obecn&eacute;</b> klikněte na možnost <strong>Vytvořit</strong> a stanovte n&aacute;sleduj&iacute;c&iacute; nastaven&iacute;:<ul>
<li><strong>Popis</strong>: Zadejte n&aacute;zev, kter&yacute; pomůže rozpoznat funkci pravidla.</li>
<li>Stanovte pravidla pro <strong>Zdroj</strong> (zař&iacute;zen&iacute; odes&iacute;laj&iacute;c&iacute; požadavky z&nbsp;internetu) a <strong>C&iacute;l</strong> (zař&iacute;zen&iacute; v&nbsp;m&iacute;stn&iacute; s&iacute;ti):<ul>
<li><strong>Protokol</strong>: Protokoly <strong>HTTP</strong> nebo <strong>HTTPS</strong>, použ&iacute;van&eacute; zdrojem/c&iacute;lem</li>

<li><strong>N&aacute;zev hostitele</strong>: N&aacute;zev zdrojov&eacute;ho/c&iacute;lov&eacute;ho zař&iacute;zen&iacute;</li>
<li><strong>Port</strong>: Port použ&iacute;van&yacute; zdrojov&yacute;m/c&iacute;lov&yacute;m zař&iacute;zen&iacute;m</li>
<li><strong>Povolit HSTS</strong> a <strong>Povolit HTTP/2</strong> (pouze u zdroje)</li>
</ul>
</li>
</ul>
</li>
<li>Chcete-li zadat profil ř&iacute;zen&iacute; př&iacute;stupu, klikněte na možnost <strong>Povolit ř&iacute;zen&iacute; př&iacute;stupu</strong> a vyberte profil ř&iacute;zen&iacute; př&iacute;stupu. Dal&scaron;&iacute; informace o&nbsp;vytvořen&iacute; profilu ř&iacute;zen&iacute; př&iacute;stupu se nach&aacute;zej&iacute; v&nbsp;n&aacute;sleduj&iacute;c&iacute; č&aacute;sti <a href="#acl">Přizpůsoben&iacute; profilů ř&iacute;zen&iacute; př&iacute;stupu</a>.</li></li>
    
<div class="section">
    <h4>Pozn&aacute;mka:</h4>
    <ul>
      <li>Kliknut&iacute;m na možnost <strong>WebSocket</strong> v&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce <strong>Vytvořit</strong> můžete rychle vytvořit z&aacute;hlav&iacute; funkce WebSocket a umožnit tak podporu reverzn&iacute;ho serveru proxy pro funkci WebSocket.</li>
    </ul>
</div>
  

<li>Chcete-li upravit dal&scaron;&iacute; chov&aacute;n&iacute; reverzn&iacute;ho serveru proxy, přejděte na str&aacute;nku <b>Roz&scaron;&iacute;řen&aacute; nastaven&iacute;</b>.<ul>
    <li><b>Časov&yacute; limit připojen&iacute; serveru proxy (s)</b>: Nastav&iacute; časov&yacute; limit připojen&iacute; serveru proxy k&nbsp;c&iacute;lov&eacute;mu serveru.</li>
    <li><b>Časov&yacute; limit odes&iacute;l&aacute;n&iacute; serveru proxy (s)</b>: Nastav&iacute; časov&yacute; limit odes&iacute;lan&eacute;ho požadavku do c&iacute;lov&eacute;ho serveru.</li>    
    <li><b>Časov&yacute; limit čten&iacute; serveru proxy (s)</b>: Nastav&iacute; časov&yacute; limit ček&aacute;n&iacute; na odpověď c&iacute;lov&eacute;ho serveru.</li>  
    <li><b>Verze protokolu HTTP serveru proxy</b>: Vyberte verzi protokolu HTTP, kter&aacute; bude sloužit ke komunikaci mezi serverem proxy a c&iacute;lov&yacute;m serverem.</li>        
    <li><b>Použ&iacute;t chybovou str&aacute;nku odeslanou zpět c&iacute;lov&yacute;m serverem</b>: Pokud je tato možnost za&scaron;krtnut&aacute;, tak v&nbsp;př&iacute;padě, že c&iacute;lov&yacute; server ode&scaron;le zpět chybov&yacute; k&oacute;d protokolu HTTP, zobraz&iacute; webovou str&aacute;nku chyby c&iacute;lov&eacute;ho serveru. Jinak zobraz&iacute; str&aacute;nku chyby služby Synology NAS.</li>
    </ul>
       
    
<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <strong>OK</strong>.</li>
</ol>


<h2><a name="acl"></a>Přizpůsoben&iacute; profilů ř&iacute;zen&iacute; př&iacute;stupu</h2>

<p>Chcete-li omezit př&iacute;stup uživatelů do port&aacute;lu aplikac&iacute; nebo do reverzn&iacute;ch serverů proxy podle zdrojov&eacute; IP adresy uživatele, můžete vytvořit profil ř&iacute;zen&iacute; př&iacute;stupu. Zam&iacute;tnut&yacute;m uživatelům se zobraz&iacute; str&aacute;nka se zam&iacute;tnut&iacute;m př&iacute;stupu.</p>

<h4>Vytvořen&iacute; profilu ř&iacute;zen&iacute; př&iacute;stupu:</h4>
<ol>
 <li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Port&aacute;l aplikac&iacute;</strong> &gt; <strong>Profil ř&iacute;zen&iacute; př&iacute;stupu</strong>.</li>
 <li>Klikněte na možnost <strong>Vytvořit</strong>. V&nbsp;m&iacute;stn&iacute;m okně můžete přizpůsobit pravidla tohoto nov&eacute;ho profilu.</li>
 <li>Kliknut&iacute;m na možnost <strong>Vytvořit</strong> vytvoř&iacute;te nov&eacute; pravidlo. Pravidla se použij&iacute; na z&aacute;kladě priority shora dolů a budou určovat př&iacute;stupov&aacute; opr&aacute;vněn&iacute;.</li>
 <li>Dvojit&yacute;m kliknut&iacute;m na pravidlo ho můžete upravit. Chcete-li pravidla odstranit, vyberte ho a klikněte na možnost <strong>Odstranit</strong>.</li>
 <li>Kliknut&iacute;m na možnost <strong>OK</strong> je možn&eacute; seznam pravidel uložit jako nov&yacute; profil.</li>
 <li>Kliknut&iacute;m na pole n&aacute;zvu profilu můžete profil přejmenovat.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Pokud ponech&aacute;te n&aacute;zev hostitele zdroje pr&aacute;zdn&yacute;, bude se pravidlo uplatňovat na v&scaron;echny zdroje.</li>
	<li>Pokud povol&iacute;te ř&iacute;zen&iacute; př&iacute;stupu pomoc&iacute; certifik&aacute;tu vydan&eacute;ho společnost&iacute; Let&apos;s Encrypt, nemus&iacute; se automatick&eacute; obnoven&iacute; certifik&aacute;tu podařit. Pokud k&nbsp;takov&eacute; situaci dojde, zakažte nejprve ř&iacute;zen&iacute; př&iacute;stupu. Pot&eacute; přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>Zabezpečen&iacute;</b> &gt; <b>Certifik&aacute;t</b>, klikněte prav&yacute;m tlač&iacute;tkem na certifik&aacute;t společnosti Let&apos;s Encrypt, kter&yacute; chcete obnovit, a vyberte možnost <b>Obnovit certifik&aacute;t</b>. Po obnoven&iacute; certifik&aacute;tu můžete ř&iacute;zen&iacute; př&iacute;stupu znovu povolit.</li>
	<li>Chcete-li použ&iacute;vat seznam v&yacute;jimek, mus&iacute;te před aktivac&iacute; pravidel kromě vytvořen&iacute; pravidel pro povolen&eacute; zdroje nastavit i&nbsp;pravidla pro odepřen&eacute; zdroje. <br/>Pokud je povolen&aacute; např&iacute;klad pouze adresa <code>http://192.168.xx.xx</code>, mus&iacute;te<ol>
	<li>Přidat <code>http://192.168.xx.xx</code> jako povolen&yacute; zdroj.</li>
	<li>Přidat nov&eacute; pravidlo a nastavit ho jako Odepř&iacute;t.</li>
	</ol>
	
</ul>
</div>

</body> </html>
