
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" charset="utf-8">

<title>Mobiln&iacute;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>


<h2><a name="usbmodem"></a>Mobiln&iacute; př&iacute;stup*</h2>

<p>Pokud je zař&iacute;zen&iacute; Synology NAS vybaveno hardwarov&yacute;m kl&iacute;čem pro mobiln&iacute; &scaron;irokop&aacute;smov&eacute; připojen&iacute;, můžete ho připojit k&nbsp;internetu přes bezdr&aacute;tovou s&iacute;ť nebo s&iacute;tě 3G/LTE. Nastaven&iacute; v&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>S&iacute;ť</strong> &gt; <strong>S&iacute;ťov&eacute; rozhran&iacute;</strong> &gt; <strong>Mobiln&iacute; př&iacute;stup</strong> v&aacute;m pomohou s&nbsp;nav&aacute;z&aacute;n&iacute;m a&nbsp;&uacute;pravou bezdr&aacute;tov&eacute;ho připojen&iacute; k&nbsp;internetu prostřednictv&iacute;m hardwarov&eacute;ho kl&iacute;če pro mobiln&iacute; &scaron;irokop&aacute;smov&eacute;ho připojen&iacute;.</p>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul><li>Kompletn&iacute; seznam podporovan&yacute;ch hardwarov&yacute;ch kl&iacute;čů pro mobiln&iacute; &scaron;irokop&aacute;smov&eacute; připojen&iacute; najdete na str&aacute;nk&aacute;ch <a href="http://www.synology.com/" target=_blank>www.synology.com</a>.</li>
	<li>Pokud budete cht&iacute;t tuto funkci povolit po upgradov&aacute;n&iacute; na syst&eacute;m DSM 6.2.2, budete muset nejprve zasunout hardwarov&yacute; kl&iacute;č bezdr&aacute;tov&eacute;ho připojen&iacute; nebo adapt&eacute;r Bluetooth.</li></ul>
</div>

<h4>Nastaven&iacute; mobiln&iacute; s&iacute;tě:</h4>
<p>Pokud je hardwarov&yacute; kl&iacute;č pro mobiln&iacute; &scaron;irokop&aacute;smov&eacute; připojen&iacute; připojen k&nbsp;jednomu z&nbsp;portů USB na zař&iacute;zen&iacute; Synology NAS, zař&iacute;zen&iacute; Synology NAS se pokus&iacute; připojit automaticky. Pokud nelze připojen&iacute; nav&aacute;zat automaticky nebo chcete změnit nastaven&iacute; připojen&iacute;, proveďte některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch akc&iacute;:</p>

<ul>
<li><b>Odemknut&iacute;&nbsp;SIM/Nastaven&iacute; SIM:</b> Pokud je karta SIM chr&aacute;něna k&oacute;dem PIN, je potřeba ji odemknout, aby se zař&iacute;zen&iacute; Synology NAS k&nbsp;s&iacute;ti mohlo připojit. Po odemčen&iacute; je možn&eacute; v&nbsp;t&eacute;to č&aacute;sti nastaven&iacute; k&oacute;du PIN změnit.</li>

<li><b>Upravit:</b> Můžete prov&eacute;st ručn&iacute; &uacute;pravu připojen&iacute; nebo vybrat připojen&iacute; podle um&iacute;stěn&iacute; a&nbsp;oper&aacute;tora. Ručn&iacute; nastaven&iacute; vyžaduje zad&aacute;n&iacute; n&aacute;zvu va&scaron;eho př&iacute;stupov&eacute;ho bodu APN, telefonn&iacute;ho č&iacute;sla, uživatelsk&eacute;ho jm&eacute;na a&nbsp;hesla. Pokud tyto informace nem&aacute;te k&nbsp;dispozici, obraťte se na sv&eacute;ho mobiln&iacute;ho oper&aacute;tora.</li>

<li><b>Připojit/Odpojit:</b> Tato tlač&iacute;tka umožňuj&iacute; připojen&iacute; nebo odpojen&iacute; zař&iacute;zen&iacute; Synology NAS ze s&iacute;tě 3G/LTE.</li>
<li><b>Možnosti:</b> Tato č&aacute;st obsahuje možnost nastaven&iacute; rozhran&iacute; hardwarov&eacute;ho kl&iacute;če pro mobiln&iacute; &scaron;irokop&aacute;smov&eacute; připojen&iacute; jako v&yacute;choz&iacute; br&aacute;ny zař&iacute;zen&iacute; Synology NAS. Pokud nastav&iacute;te mobiln&iacute; s&iacute;ť jako v&yacute;choz&iacute; br&aacute;nu, internetov&yacute; provoz zař&iacute;zen&iacute; Synology NAS bude proch&aacute;zet přes mobiln&iacute;, ne přes pevnou s&iacute;ť.</li>
</ul>
<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ol>
<li>Pokud jste připojeni k&nbsp;internetu, někter&eacute; hardwarov&eacute; kl&iacute;če pro mobiln&iacute; &scaron;irokop&aacute;smov&eacute; připojen&iacute; nezobrazuj&iacute; s&iacute;lu sign&aacute;lu, pokud tuto funkci nepodporuj&iacute;.</li>
<li>V&nbsp;př&iacute;padě někter&yacute;ch hardwarov&yacute;ch kl&iacute;čů pro mobiln&iacute; připojen&iacute; nelze změnit nastaven&iacute; SIM, pokud jste připojen&iacute; k&nbsp;internetu.</li>
</ol>
</div>
<p>____<br> <strong>*</strong>K&nbsp;dispozici pouze u&nbsp;někter&yacute;ch modelů.</p>


</body>
</html>
