<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Připojen&iacute; k&nbsp;s&iacute;ti VPN&nbsp;&ndash; N&aacute;pověda Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Turn your Synology NAS into a VPN client and create profiles to connect your Synology NAS to a VPN server.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Připojen&iacute; k&nbsp;s&iacute;ti VPN</h1>
<p>Zař&iacute;zen&iacute; Synology NAS je možn&eacute; jednodu&scaron;e přeměnit na klienta VPN a&nbsp;připojit ho ke st&aacute;vaj&iacute;c&iacute;mu serveru VPN (Virtual Private Network) prostřednictv&iacute;m protokolů PPTP, OpenVPN nebo L2TP/IPSec. Pokud m&aacute;te v&iacute;ce serverů VPN, je možn&eacute; pro každ&yacute; server vytvořit specifick&yacute; profil VPN a&nbsp;tyto profily pak rychle přep&iacute;nat a&nbsp;připojovat se k&nbsp;různ&yacute;m serverům VPN jedn&iacute;m kliknut&iacute;m.</p>


<div class="section">
<h4>Co je to VPN?</h4>
<p>S&iacute;ť VPN (Virtual Private Network) umožňuje splnit požadavky bezpečn&eacute;ho př&iacute;stupu ke zdrojům um&iacute;stěn&yacute;m v&nbsp;soukrom&eacute; s&iacute;ti z&nbsp;internetu. Pro podniky i&nbsp;někter&eacute; uživatele, kteř&iacute; potřebuj&iacute; roz&scaron;&iacute;řit možnosti sv&eacute; s&iacute;tě, n&aacute;klady na syst&eacute;m fyzick&eacute; s&iacute;tě a&nbsp;technickou podporu exponenci&aacute;lně narostou. Když porovn&aacute;me hospod&aacute;rnost a&nbsp;dlouhodobou &uacute;držbu, je s&iacute;ť VPN chytr&yacute;m a&nbsp;st&aacute;le atraktivněj&scaron;&iacute;m ře&scaron;en&iacute;m. D&iacute;ky &scaron;ifrov&aacute;n&iacute; a&nbsp;dal&scaron;&iacute;m bezpečnostn&iacute;m mechanismům umožňuje technologie VPN členům podniku z&iacute;skat snadno př&iacute;stup do centr&aacute;ln&iacute; s&iacute;tě společnosti a&nbsp;využ&iacute;vat jej&iacute; zdroje stejně jako u&nbsp;s&iacute;tě LAN. Uživatel&eacute; tak&eacute; mohou z&iacute;skat př&iacute;stup ke zdrojům ve vlastn&iacute; dom&aacute;c&iacute; s&iacute;ti LAN, i&nbsp;když jsou daleko od domova.</p>
</div>


<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Zař&iacute;zen&iacute; Synology NAS lze připojit pouze k&nbsp;serverům OpenVPN, kter&eacute; podporuj&iacute; tunely typu TUN ve vrstvě 3.</li>
<li>Před instalac&iacute; bal&iacute;čku VPN se přesvědčte, že m&aacute;te k&nbsp;dispozici server VPN, ke kter&eacute;mu se připojit. Pokud chcete zajistit lep&scaron;&iacute; kompatibilitu, doporučujeme se připojit ke služb&aacute;m VPN hostovan&yacute;m na zař&iacute;zen&iacute; Synology NAS, na kter&eacute;m je spu&scaron;těn&yacute; bal&iacute;ček <strong>VPN Server</strong>. Pokud chcete nastavit jako server VPN dal&scaron;&iacute; zař&iacute;zen&iacute; Synology NAS, najdete pokyny v&nbsp;č&aacute;sti <b>N&aacute;pověda syst&eacute;mu DSM</b> &gt; <b>VPN Server</b> &gt; <b>Nastaven&iacute; služby VPN Server</b>.</li>
</ul>
</div>


<h4>Vytv&aacute;řen&iacute; profilů VPN:</h4>
<ol>
<li>Přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>S&iacute;ť</b>.</li><img src="about:blank" class="help_image"/><li>Na kartě <b>S&iacute;ťov&eacute; rozhran&iacute;</b> klikněte na možnost <b>Vytvořit</b> a vyberte položku <b>Vytvořit profil VPN</b>.</li><img src="about:blank" class="help_image"/><li>Při vytv&aacute;řen&iacute; nov&eacute;ho profilu VPN si můžete vybrat jeden z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch typů připojen&iacute;:<ul>
		<li><b>PPTP</b>: PPTP (Point-to-Point Tunneling Protocol) je běžně použ&iacute;van&eacute; ře&scaron;en&iacute; VPN podporovan&eacute; vět&scaron;inou klientů (včetně syst&eacute;mu Windows, Mac i Linux a&nbsp;mobiln&iacute;ch zař&iacute;zen&iacute;).</li>
		<li><b>OpenVPN</b>: OpenVPN je ře&scaron;en&iacute; typu open source pro službu&nbsp;VPN. Zabezpečuje připojen&iacute; VPN pomoc&iacute; &scaron;ifrovac&iacute;ho mechanismu SSL/TLS.</li>
		<li><b>L2TP/IPSec</b>: Protokol L2TP (Layer 2 Tunneling Protocol) over IPSec nab&iacute;z&iacute; virtu&aacute;ln&iacute;m priv&aacute;tn&iacute;m s&iacute;t&iacute;m vy&scaron;&scaron;&iacute; zabezpečen&iacute; a&nbsp;podporuje ho vět&scaron;ina klientů (včetně syst&eacute;mů Windows, Mac i Linux a&nbsp;mobiln&iacute;ch zař&iacute;zen&iacute;).</li>
	</ul>
</li><img src="about:blank" class="help_image"/><li>Při nastavov&aacute;n&iacute; kter&eacute;hokoli ze tř&iacute; typů připojen&iacute; VPN postupujte podle n&iacute;že uveden&yacute;ch pokynů.</li>
</ul>
</ol>

<h4>Vytvořen&iacute; profilu PPTP:</h4>

  <ol>
  <li>Po zobrazen&iacute; v&yacute;zvy k&nbsp;volbě metody připojen&iacute; k&nbsp;s&iacute;ti VPN vyberte možnost <b>PPTP</b> a&nbsp;pot&eacute; klikněte na možnost <b>Dal&scaron;&iacute;</b>.</li>
  <li>Pojmenujte nov&yacute; profil, upřesněte adresu serveru VPN, se kter&yacute;m chcete nav&aacute;zat připojen&iacute;, a&nbsp;zadejte uživatelsk&eacute; jm&eacute;no a&nbsp;heslo pro server. Pokračujte kliknut&iacute;m na možnost <b>Dal&scaron;&iacute;</b>.</li>

<div class="section">
<h4>Pozn&aacute;mka:</h4>

<ul>
<li>Uživatelsk&eacute; jm&eacute;no, heslo a&nbsp;adresu serveru VPN by v&aacute;m měl poskytnout spr&aacute;vce serveru VPN.</li>
</ul>
</div>

  <li>V&yacute;běrem jednoho z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch protokolů ověřen&iacute; v&nbsp;nab&iacute;dce <b>Ověřen&iacute;</b> je možn&eacute; stanovit zabezpečen&iacute; hesla VPN klienta během ověřen&iacute;:<ul>
		<li><b>PAP</b>: Heslo se nebude při ověřov&aacute;n&iacute; &scaron;ifrovat.</li>
		<li><b>CHAP</b>: Heslo se bude &scaron;ifrovat pomoc&iacute; protokolu CHAP (Challenge-Handshake Authentication Protocol).</li>
		<li><b>MS CHAP</b>: Heslo se bude &scaron;ifrovat pomoc&iacute; protokolu Microsoft CHAP verze&nbsp;1.</li>
		<li><b>MS CHAP v2</b>: Heslo se bude &scaron;ifrovat pomoc&iacute; protokolu Microsoft CHAP verze&nbsp;2.</li>
	</ul>
  </li>
  <li>Pokud jste vybrali protokol <b>MS CHAP</b> nebo <b>MS CHAP v2</b>, vyberte n&aacute;sledně v&nbsp;nab&iacute;dce <b>&Scaron;ifrov&aacute;n&iacute;</b> jednu z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute; &scaron;ifrov&aacute;n&iacute; připojen&iacute; k&nbsp;s&iacute;ti VPN:<ul>
		<li><b>Bez MPPE</b>: Připojen&iacute; k&nbsp;s&iacute;ti VPN nebude chr&aacute;něno pomoc&iacute; &scaron;ifrov&aacute;n&iacute; Microsoft Point to Point Encryption.</li>
		<li><b>Vyžadovat MPPE (40/128 bitů)</b>: Připojen&iacute; k&nbsp;s&iacute;ti VPN bude chr&aacute;něno pomoc&iacute; 40bitov&eacute;ho nebo 128bitov&eacute;ho &scaron;ifrov&aacute;n&iacute; Microsoft Point to Point Encryption.</li>
		<li><b>Maxim&aacute;ln&iacute; MPPE (128 bitů)</b>: Připojen&iacute; k&nbsp;s&iacute;ti VPN bude chr&aacute;něno pomoc&iacute; 128bitov&eacute;ho &scaron;ifrov&aacute;n&iacute; Microsoft Point to Point Encryption, kter&eacute; zaji&scaron;ťuje nejvy&scaron;&scaron;&iacute; &uacute;roveň zabezpečen&iacute;.</li>
	</ul>
  </li>
    <div class="section">
    <h4>Pozn&aacute;mka:</h4>
  
    <ul>
    <li>Nastaven&iacute; ověřen&iacute; a &scaron;ifrov&aacute;n&iacute; mus&iacute; b&yacute;t shodn&eacute; s&nbsp;nastaven&iacute;m stanoven&yacute;m na serveru VPN. Dal&scaron;&iacute; informace z&iacute;sk&aacute;te u spr&aacute;vce serveru VPN.</li>
    </ul>
    </div>
   
<li>Podle potřeby za&scaron;krtněte někter&eacute; z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch pol&iacute;ček:<ul>
		<li><b>Použ&iacute;t v&yacute;choz&iacute; br&aacute;nu na vzd&aacute;len&eacute; s&iacute;ti</b>: Povolen&iacute; t&eacute;to možnosti bude směrovat s&iacute;ťov&yacute; provoz zař&iacute;zen&iacute; Synology NAS na stanoven&yacute; server VPN.</li>
		<li><b>Povolit ostatn&iacute;m s&iacute;ťov&yacute;m zař&iacute;zen&iacute;m připojen&iacute; přes internetov&eacute; připojen&iacute; serveru Synology</b>: Povolen&iacute;m t&eacute;to možnosti umožn&iacute;te s&iacute;ťov&yacute;m zař&iacute;zen&iacute;m v&nbsp;r&aacute;mci stejn&eacute; m&iacute;stn&iacute; s&iacute;tě jako zař&iacute;zen&iacute; Synology NAS připojit se ke stejn&eacute;mu serveru VPN.</li>
		<li><b>Znovu připojit při přeru&scaron;en&iacute; připojen&iacute; VPN</b>: Pokud se připojen&iacute; k&nbsp;s&iacute;ti VPN nečekaně přeru&scaron;&iacute;, syst&eacute;m se pokus&iacute; znovu nav&aacute;zat připojen&iacute;, celkem pětkr&aacute;t, jednou každ&yacute;ch 30&nbsp;sekund.</li>
	</ul>
</li>

<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
</ol>




<h4>Vytvořen&iacute; profilu připojen&iacute; OpenVPN (prostřednictv&iacute;m souboru .ovpn):</h4>
<ol>
<li>Po zobrazen&iacute; v&yacute;zvy k&nbsp;volbě metody připojen&iacute; k&nbsp;s&iacute;ti VPN vyberte možnost <b>OpenVPN (prostřednictv&iacute;m importu souboru .ovpn)</b> a&nbsp;pot&eacute; klikněte na možnost <b>Dal&scaron;&iacute;</b>.</li>
<li>Vyberte n&aacute;zev nov&eacute;ho profilu, v&nbsp;poli <strong>Importovat soubor .ovpn</strong> klikněte na položku <strong>Proch&aacute;zet</strong>, vyberte soubor .ovpn exportovan&yacute; ze serveru VPN a importujte ho.</li>
<li>Zadejte n&aacute;sleduj&iacute;c&iacute; informace poskytnut&eacute; spr&aacute;vcem serveru VPN: va&scaron;e <strong>uživatelsk&eacute; jm&eacute;no</strong>, <strong>heslo</strong> a importujte soubor <b>Certifik&aacute;t CA</b> (např. ca.crt).</li>
<li>Pokud v&aacute;m poskytovatel serveru VPN předal tak&eacute; <b>kl&iacute;č ověřen&iacute; TLS</b>, <b>kl&iacute;č klienta</b>, <b>certifik&aacute;t klienta</b> nebo <b>seznam odvolan&yacute;ch certifik&aacute;tů</b>, klikněte na položku <strong>Pokročil&eacute; funkce</strong> a naimportujte je do odpov&iacute;daj&iacute;c&iacute;ch pol&iacute;.</li>
<li>Pokračujte kliknut&iacute;m na možnost <b>Dal&scaron;&iacute;</b>.</li>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Uživatelsk&eacute; jm&eacute;no, heslo, adresu a&nbsp;v&scaron;echny dal&scaron;&iacute; soubory, např&iacute;klad certifik&aacute;ty nebo kl&iacute;če, by v&aacute;m měl poskytnout spr&aacute;vce serveru VPN.</li>
</ul>
</div>

<li>Podle potřeby za&scaron;krtněte někter&eacute; z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch pol&iacute;ček:</li>
<ul>
<li><b>Použ&iacute;t v&yacute;choz&iacute; br&aacute;nu na vzd&aacute;len&eacute; s&iacute;ti</b>: Povolen&iacute; t&eacute;to možnosti bude směrovat s&iacute;ťov&yacute; provoz zař&iacute;zen&iacute; Synology NAS na stanoven&yacute; server VPN.</li>
<li><b>Povolit ostatn&iacute;m s&iacute;ťov&yacute;m zař&iacute;zen&iacute;m připojen&iacute; přes internetov&eacute; připojen&iacute; serveru Synology</b>: Povolen&iacute;m t&eacute;to možnosti umožn&iacute;te s&iacute;ťov&yacute;m zař&iacute;zen&iacute;m v&nbsp;r&aacute;mci stejn&eacute; m&iacute;stn&iacute; s&iacute;tě jako zař&iacute;zen&iacute; Synology NAS připojit se ke stejn&eacute;mu serveru VPN.</li>
<li><b>Znovu připojit při přeru&scaron;en&iacute; připojen&iacute; VPN</b>: Pokud se připojen&iacute; k&nbsp;s&iacute;ti VPN nečekaně přeru&scaron;&iacute;, syst&eacute;m se pokus&iacute; znovu nav&aacute;zat připojen&iacute;, celkem pětkr&aacute;t, jednou každ&yacute;ch 30&nbsp;sekund.</li>
</ul>
<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
</ol>





<h4>Vytvořen&iacute; profilu L2TP/IPSec:</h4>
<ol>
<li>Po zobrazen&iacute; v&yacute;zvy k&nbsp;volbě metody připojen&iacute; k&nbsp;s&iacute;ti VPN vyberte možnost <b>L2TP/IPSec</b> a&nbsp;pot&eacute; klikněte na možnost <b>Dal&scaron;&iacute;</b>.</li>
<li>Pojmenujte nov&yacute; profil, upřesněte adresu serveru VPN, se kter&yacute;m chcete nav&aacute;zat připojen&iacute;, a&nbsp;zadejte uživatelsk&eacute; jm&eacute;no a&nbsp;heslo pro server. Je tak&eacute; potřeba zadat předsd&iacute;len&yacute; kl&iacute;č pro server VPN. Potom klikněte na možnost <strong>Dal&scaron;&iacute;</strong>.</li>

<div class="section">
<h4>Pozn&aacute;mka:</h4>

<ul>
<li>Uživatelsk&eacute; jm&eacute;no, heslo, adresu a&nbsp;předsd&iacute;len&yacute; kl&iacute;č serveru VPN by v&aacute;m měl poskytnout spr&aacute;vce serveru VPN.</li>
</ul>
</div>

<li>V&yacute;běrem jednoho z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch protokolů ověřen&iacute; v&nbsp;nab&iacute;dce <b>Ověřen&iacute;</b> je možn&eacute; stanovit zabezpečen&iacute; hesla VPN klienta během ověřen&iacute;:<ul>
		<li><b>PAP</b>: Heslo se nebude &scaron;ifrovat.</li>
		<li><b>CHAP</b>: Heslo se bude &scaron;ifrovat pomoc&iacute; protokolu CHAP (Challenge-Handshake Authentication Protocol).</li>
		<li><b>MS CHAP</b>: Heslo se bude &scaron;ifrovat pomoc&iacute; protokolu Microsoft CHAP verze&nbsp;1.</li>
		<li><b>MS CHAP v2</b>: Heslo se bude &scaron;ifrovat pomoc&iacute; protokolu Microsoft CHAP verze&nbsp;2.</li>
	</ul>
</li>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Nastaven&iacute; ověřen&iacute; a &scaron;ifrov&aacute;n&iacute; mus&iacute; b&yacute;t shodn&eacute; s&nbsp;nastaven&iacute;m stanoven&yacute;m na serveru VPN. Dal&scaron;&iacute; informace z&iacute;sk&aacute;te u spr&aacute;vce serveru VPN.</li>
</ul>
</div>

<li>Podle potřeby za&scaron;krtněte někter&eacute; z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch pol&iacute;ček:<ul>
		<li><b>Použ&iacute;t v&yacute;choz&iacute; br&aacute;nu na vzd&aacute;len&eacute; s&iacute;ti</b>: Povolen&iacute; t&eacute;to možnosti bude směrovat s&iacute;ťov&yacute; provoz zař&iacute;zen&iacute; Synology NAS na stanoven&yacute; server VPN.</li>
		<li><b>Povolit ostatn&iacute;m s&iacute;ťov&yacute;m zař&iacute;zen&iacute;m připojen&iacute; přes internetov&eacute; připojen&iacute; serveru Synology</b>: Povolen&iacute;m t&eacute;to možnosti umožn&iacute;te s&iacute;ťov&yacute;m zař&iacute;zen&iacute;m v&nbsp;r&aacute;mci stejn&eacute; m&iacute;stn&iacute; s&iacute;tě jako zař&iacute;zen&iacute; Synology NAS připojit se ke stejn&eacute;mu serveru VPN.</li>
		<li><strong>Server je um&iacute;stěn za zař&iacute;zen&iacute;m NAT</strong>: Protokol L2TP/IPSec neumožňuje ve v&yacute;choz&iacute;m nastaven&iacute; připojen&iacute; k&nbsp;serveru VPN za zař&iacute;zen&iacute;m NAT. Povolen&iacute;m t&eacute;to možnosti obejdete zm&iacute;něn&eacute; omezen&iacute; a&nbsp;povol&iacute;te zař&iacute;zen&iacute; Synology NAS připojit se k&nbsp;serveru VPN L2TP/IPSec za zař&iacute;zen&iacute;m NAT.</li>
		<li><b>Znovu připojit při přeru&scaron;en&iacute; připojen&iacute; VPN</b>: Pokud se připojen&iacute; k&nbsp;s&iacute;ti VPN nečekaně přeru&scaron;&iacute;, syst&eacute;m se pokus&iacute; znovu nav&aacute;zat připojen&iacute;, celkem pětkr&aacute;t, jednou každ&yacute;ch 30&nbsp;sekund.</li>
	</ul>
</li>
<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
</ol>


<h4>Připojen&iacute; nebo odpojen&iacute; od serveru VPN:</h4>

<ol>
<li>Vyberte profil VPN.</li>
<li>Klikněte na možnost <b>Připojit</b> nebo <b>Odpojit</b>.</li><img src="about:blank" class="help_image"/></ol>


<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Připojen&yacute; může b&yacute;t v&nbsp;jednu chv&iacute;li pouze jeden profil.</li>
</ul>
</div>

<h4>&Uacute;prava profilu VPN:</h4>

<ol>
<li>Vyberte profil VPN.</li>
<li>Klikněte na možnost <strong>Upravit</strong>.</li>

</ol>


</body>
</html>