
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>S&iacute;ť</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Obecn&eacute;</h2>

<p>Obecn&eacute; volby s&iacute;tě, např&iacute;klad v&yacute;choz&iacute; br&aacute;na, server DNS, proxy a tunelov&aacute;n&iacute; IPv6, se nach&aacute;zej&iacute; v&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>S&iacute;ť</strong> &gt; <strong>Obecn&eacute;</strong>.</p>


<h3>Přejmenov&aacute;n&iacute; zař&iacute;zen&iacute; Synology NAS</h3>
<p>Chcete-li svoje zař&iacute;zen&iacute; Synology NAS přejmenovat, zadejte nov&yacute; n&aacute;zev serveru a klikněte na možnost <b>Použ&iacute;t</b>.</p>
<p>V&nbsp;n&aacute;zvu serveru se rozli&scaron;uj&iacute; velk&aacute; a mal&aacute; p&iacute;smena a může se skl&aacute;dat z&nbsp;1 až 15 znaků &ndash; p&iacute;smen, č&iacute;sel, podtrž&iacute;tek a symbolů m&iacute;nus. Prvn&iacute; znak n&aacute;zvu mus&iacute; b&yacute;t p&iacute;smeno.</p>


<h3>Určen&iacute; v&yacute;choz&iacute; br&aacute;ny</h3>
<p>Stač&iacute; zadat IP adresu pro v&yacute;choz&iacute; br&aacute;nu a uložit nastaven&iacute; kliknut&iacute;m na možnost <b>Použ&iacute;t</b>.</p>


<h3>Určen&iacute; IP adresy služby DNS Server</h3>
<p>IP adresu serveru DNS můžete nakonfigurovat ručně. V&nbsp;takov&eacute;m př&iacute;padě mus&iacute;te zadat IP adresu upřednostňovan&eacute;ho serveru DNS. Můžete tak&eacute; zadat alternativn&iacute; IP adresu serveru DNS jako z&aacute;lohu pro př&iacute;pad v&yacute;skytu probl&eacute;mů s&nbsp;upřednostňovan&yacute;m serverem DNS. Po nakonfigurov&aacute;n&iacute; IP adres serveru DNS podle sv&yacute;ch požadavků uložte nastaven&iacute; kliknut&iacute;m na možnost <strong>Použ&iacute;t</strong>.</p>
<p><b>Roz&scaron;&iacute;řen&aacute; nastaven&iacute;</b>:</p>
<ul>
<li><b>Pokud je c&iacute;lov&aacute; IP adresa totožn&aacute; s&nbsp;m&iacute;stn&iacute; adresou nakonfigurovanou na př&iacute;choz&iacute;m rozhran&iacute;, odpovědět na požadavek ARP</b>: ARP neodpov&iacute;d&aacute; v&nbsp;s&iacute;ťov&eacute;m protokolu na požadavek z&nbsp;totožn&eacute; IP adresy. Tuto možnost povolte v&nbsp;př&iacute;padě, že chcete odpov&iacute;dat na požadavek ARP, a přesvědčte se, že je tabulka ARP kompletn&iacute;.</li>
<li><b>Povolit v&iacute;ce bran</b>: Tuto možnost povolte v&nbsp;př&iacute;padě, že chcete v&nbsp;rozhran&iacute; podporovat v&iacute;ce než jednu br&aacute;nu.</li>
<li><b>Povolit detekci konfliktů IP adres</b>: Tuto možnost povolte v&nbsp;př&iacute;padě, že chcete automaticky zji&scaron;ťovat, jestli se v&nbsp;s&iacute;ti nach&aacute;z&iacute; stejn&aacute; IP adresa.</li>
</ul>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Pokud jsou v&scaron;echna s&iacute;ťov&aacute; rozhran&iacute; konfigurov&aacute;na automaticky nebo pokud použ&iacute;v&aacute;te připojen&iacute; PPPoE, pole Server DNS a V&yacute;choz&iacute; br&aacute;na se nastav&iacute; automaticky a nelze je změnit.</p>
</div>



<h3><a name="proxy"></a>Připojen&iacute; prostřednictv&iacute;m služby Proxy Server</h3>
<p>Chcete-li na zař&iacute;zen&iacute; Synology NAS povolit připojen&iacute; prostřednictv&iacute;m serveru proxy, za&scaron;krtněte možnost <b>Připojit prostřednictv&iacute;m serveru proxy</b>, zadejte hodnoty <b>Adresa</b> a&nbsp;<b>Port</b> a&nbsp;pot&eacute; klikněte na možnost <b>Použ&iacute;t</b>.</p>


<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Kliknut&iacute;m na možnost <strong>Roz&scaron;&iacute;řen&aacute; nastaven&iacute;</strong> provedete konfiguraci serveru proxy HTTP, proxy HTTPS a&nbsp;&uacute;dajů pro ověřen&iacute;.<li>Podle v&yacute;choz&iacute;ho nastaven&iacute; jsou nastaven&iacute; serveru proxy HTTPS stejn&aacute; jako nastaven&iacute; serveru proxy HTTP.</li>
<li>Pokud za&scaron;krtnete možnost <b>Připojit prostřednictv&iacute;m serveru proxy</b>, funkce Aktualizace firmwaru DSM, Centrum bal&iacute;čků a&nbsp;dal&scaron;&iacute; bal&iacute;čky se budou vždy připojovat k&nbsp;internetu prostřednictv&iacute;m serveru proxy.</li>
<li>Pokud za&scaron;krtnete možnost <b>Z&aacute;ložn&iacute; server proxy pro m&iacute;stn&iacute; adresy</b>, tak se přesvědčte, že server DNS použ&iacute;van&yacute; zař&iacute;zen&iacute;m Synology NAS dok&aacute;že vyře&scaron;it dotazy na zař&iacute;zen&iacute; v&nbsp;m&iacute;stn&iacute; s&iacute;ti.</li>
</ul>
</div>


<h3>Povolov&aacute;n&iacute; tunelov&eacute;ho propojen&iacute; IPv6</h3>
<p>Pokud protokol IPv6 zcela nahrazuje protokol IPv4, je potřeba, aby tunel IPv6 umožnil hostiteli s&nbsp;adresou IPv6 dos&aacute;hnout na služby IPv4. T&iacute;mto způsobem umožn&iacute;te st&aacute;vaj&iacute;c&iacute;m s&iacute;t&iacute;m IPv4 n&eacute;st provoz IPv6.<br> Pokud si nejste jist&iacute;, jak nakonfigurovat protokol IPv6 nebo vyře&scaron;it probl&eacute;my s&nbsp;připojen&iacute;m, obraťte se na poskytovatele internetov&yacute;ch služeb.</p>
<h4>Povolen&iacute; tunelov&eacute;ho propojen&iacute; IPv6:</h4>
<ol>
<li>Za&scaron;krtnut&iacute;m pol&iacute;čka <b>Povolit tunel</b> zapněte podporu tunelov&eacute;ho propojen&iacute;.</li>

<li>Do pole <b>Adresa serveru</b> zadejte n&aacute;zev hostitele nebo IP adresu poskytovatele tunelov&eacute;ho propojen&iacute;, např&iacute;klad anonymous.freenet6.net.</li>

<li>Vyberte jednu z&nbsp;možnost&iacute; <b>Připojit anonymně</b> nebo <b>Připojit se st&aacute;vaj&iacute;c&iacute;m &uacute;čtem</b>.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Va&scaron;i extern&iacute; adresu IPv6 může poskytovatel služeb automaticky aktualizovat. Zař&iacute;zen&iacute; Synology NAS v&scaron;ak neodstran&iacute; starou adresu IPv6 okamžitě.</p>
</div>



</body>
</html>
