<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>&Uacute;čet &ndash; N&aacute;pověda Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Protect your account from external attacks.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>&Uacute;čet</h2>

<p>Chraňte svůj &uacute;čet před extern&iacute;mi &uacute;toky.</p>

<h2>Automatick&eacute; blokov&aacute;n&iacute;</h2>

<p>Funkce automatick&eacute;ho blokov&aacute;n&iacute; pom&aacute;h&aacute; zlep&scaron;it zabezpečen&iacute; zař&iacute;zen&iacute; Synology NAS blokov&aacute;n&iacute;m IP adres klientů s&nbsp;př&iacute;li&scaron; mnoha ne&uacute;spě&scaron;n&yacute;mi pokusy o&nbsp;přihl&aacute;&scaron;en&iacute;. T&iacute;m se snižuje riziko napaden&iacute; &uacute;čtu pomoc&iacute; &uacute;toků hrubou silou.</p>

<p>Možn&eacute; je tak&eacute; vytvořit a spravovat seznam povolen&yacute;ch položek a přid&aacute;vat do něho IP adresy, kter&yacute;m důvěřujete, nebo seznam blokovan&yacute;ch položek, kter&yacute; někter&yacute;m IP adres&aacute;m vždy zabr&aacute;n&iacute; v&nbsp;přihl&aacute;&scaron;en&iacute;.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Automatick&eacute; blokov&aacute;n&iacute; podporuj&iacute; různ&eacute; služby a bal&iacute;čky, např&iacute;klad: DSM, SSH, Telnet, rsync, s&iacute;ťov&aacute; z&aacute;loha, synchronizace sd&iacute;len&yacute;ch složek, FTP, WebDAV a služby File Station, Photo Station, Audio Station, Video Station, Download Station, Mail Server, Mail Station, Time Backup, VPN Server, Cloud Station a mobiln&iacute; aplikace Synology.</li>
</ul>
</div>

<h4>Povolen&iacute; automatick&eacute;ho blokov&aacute;n&iacute;:</h4>
<ol>
	<li>Otevřete <strong>Ovl&aacute;dac&iacute; panel</strong> a přejděte do č&aacute;sti <strong>Zabezpečen&iacute;</strong> &gt; <strong>Automatick&yacute; blok</strong>.</li>
	<li>Za&scaron;krtněte možnost <strong>Povolit automatick&yacute; blok</strong>.</li>
	<li>Do pole <strong>Pokusy o přihl&aacute;&scaron;en&iacute;</strong> zadejte počet nezdařen&yacute;ch pokusů o přihl&aacute;&scaron;en&iacute; a do pole <strong>Během (minuty)</strong> počet minut. Pokud dojde během zadan&eacute;ho počtu minut k&nbsp;překročen&iacute; počtu ne&uacute;spě&scaron;n&yacute;ch pokusů o přihl&aacute;&scaron;en&iacute;, bude IP adresa zablokov&aacute;na.</li>
	<li>Za&scaron;krtněte možnost <strong>Povolit vypr&scaron;en&iacute; platnosti blokov&aacute;n&iacute;</strong> a zadejte počet dn&iacute;, po kter&eacute;m bude blokov&aacute;n&iacute; IP adresy zru&scaron;eno.</li>
	<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <strong>Použ&iacute;t</strong>.</li>
</ol>


<h3>Spr&aacute;va seznamu blokov&aacute;n&iacute;</h3>
<p>Klikněte na možnost <strong>Seznam povolen&yacute;ch/blokovan&yacute;ch položek</strong> a přejděte na kartu <strong>Seznam blokov&aacute;n&iacute;</strong>.</p>

<h4>Přid&aacute;n&iacute; IP adres:</h4>
<p>V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce <strong>Vytvořit</strong> vyberte některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;:</p>

<ul>
	<li><strong>Přidat IP adresu</strong>: Zadejte IP adresu a nastavte dobu platnosti.</li>
	<li><strong>Importovat seznam IP&nbsp;adres</strong>: Importov&aacute;n&iacute;m textov&eacute;ho souboru obsahuj&iacute;c&iacute;ho IP adresy můžete přidat v&iacute;ce IP adres a nastavit čas vypr&scaron;en&iacute; platnosti z&aacute;roveň. Za&scaron;krtněte pol&iacute;čko, pokud chcete přepsat st&aacute;vaj&iacute;c&iacute; IP adresy. Pokud tato možnost nen&iacute; zvolena, zdvojen&eacute; IP adresy se přeskoč&iacute;.<br />Pokud m&aacute; vybran&yacute; soubor spr&aacute;vn&yacute; form&aacute;t, zobraz&iacute; se v&scaron;echny IP adresy v&nbsp;oblasti n&aacute;hledu. Kliknut&iacute;m na tlač&iacute;tko <strong>OK</strong> provedete import.</li>
</ul>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<p>Abyste mohli importovat soubor, mus&iacute; tento soubor splňovat n&aacute;sleduj&iacute;c&iacute; krit&eacute;ria:</p>
<ul>
	<li>Mus&iacute; se jednat o prost&yacute; textov&yacute; soubor.</li>
	<li>Každ&yacute; ř&aacute;dek souborů může obsahovat pouze jednu IP adresu.</li>
	<li>Ř&aacute;dky s&nbsp;pozn&aacute;mkami zač&iacute;naj&iacute; znakem #.</li>
</ul>
</div>

<h4>Odebr&aacute;n&iacute; blokovan&yacute;ch IP adres:</h4>
<p>Ze seznamu vyberte IP adresy, kter&eacute; chcete odebrat, a&nbsp;klikněte na možnost <strong>Odebrat</strong>.</p>


<h3>Spr&aacute;va seznamu povolen&yacute;ch položek</h3>

<p>Klikněte na možnost <strong>Seznam povolen&yacute;ch/blokovan&yacute;ch položek</strong> a přejděte na kartu <strong>Seznam povolen&yacute;ch položek</strong>.</p>

<h4>Přid&aacute;n&iacute; IP adres:</h4>
<p>V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce <strong>Vytvořit</strong> vyberte některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;:</p>
<ul>
	<li><strong>Přidat IP adresu</strong>: Zadejte IP adresu, rozsah IP, pods&iacute;ť nebo n&aacute;zev dom&eacute;ny.</li>
	<li><strong>Importovat seznam IP&nbsp;adres</strong>: Importov&aacute;n&iacute;m textov&eacute;ho souboru obsahuj&iacute;c&iacute;ho IP adresy můžete přidat v&iacute;ce IP adres současně. Za&scaron;krtněte pol&iacute;čko, pokud chcete přepsat st&aacute;vaj&iacute;c&iacute; IP adresy. Pokud tato možnost nen&iacute; zvolena, zdvojen&eacute; IP adresy se přeskoč&iacute;.<br />Pokud m&aacute; vybran&yacute; soubor spr&aacute;vn&yacute; form&aacute;t, zobraz&iacute; se v&scaron;echny IP adresy v&nbsp;oblasti n&aacute;hledu. Kliknut&iacute;m na tlač&iacute;tko <strong>OK</strong> provedete import.</li>
</ul>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<p>Abyste mohli importovat soubor, mus&iacute; tento soubor splňovat n&aacute;sleduj&iacute;c&iacute; krit&eacute;ria:</p>
<ul>
<li>Mus&iacute; se jednat o prost&yacute; textov&yacute; soubor.</li>
<li>Každ&yacute; ř&aacute;dek souboru sm&iacute; obsahovat pouze IP adresu, rozsah IP (<em>192.168.1.1 &ndash; 192.168.1.10</em>), pods&iacute;ť (<em>192.168.1.1/255.255.0.0</em>) nebo n&aacute;zev dom&eacute;ny (<em>www.synology.com</em>).</li>
<li>Ř&aacute;dky s&nbsp;pozn&aacute;mkami zač&iacute;naj&iacute; znakem #.</li>
</ul>
</div>

<h4>Odebr&aacute;n&iacute; IP adres:</h4>
<p>Ze seznamu vyberte IP adresy, kter&eacute; chcete odebrat, a&nbsp;klikněte na možnost <strong>Odebrat</strong>.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Pokud se va&scaron;e zař&iacute;zen&iacute; Synology NAS nach&aacute;z&iacute; za reverzn&iacute;m serverem proxy, přidejte do seznamu povolen&yacute;ch položek jeho IP adresu.</li>
</ul>
</div>


<h2>Ochrana &uacute;čtu</h2>

<p>Funkce ochrany &uacute;čtu pom&aacute;h&aacute; zlep&scaron;it zabezpečen&iacute; zař&iacute;zen&iacute; Synology NAS ochranou &uacute;čtů před nedůvěryhodn&yacute;mi klienty s&nbsp;př&iacute;li&scaron; mnoha ne&uacute;spě&scaron;n&yacute;mi pokusy o&nbsp;přihl&aacute;&scaron;en&iacute;. T&iacute;m se snižuje riziko napaden&iacute; &uacute;čtu pomoc&iacute; &uacute;toků hrubou silou.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Podporovan&eacute; služby a bal&iacute;čky: DSM, File Station, Audio Station, Video Station, Download Station, Mail Station, Cloud Station a mobiln&iacute; aplikace Synology.</li>
</ul>
</div>

<h4>Povolen&iacute; ochrany &uacute;čtu:</h4>
<ol>
	<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Zabezpečen&iacute;</strong> &gt; <strong>Ochrana &uacute;čtu</strong>.</li>
	<li>Za&scaron;krtněte možnost <strong>Povolit ochranu &uacute;čtu</strong>.</li>
	<li>Zadejte hodnoty do pol&iacute; <strong>Pokusy o&nbsp;přihl&aacute;&scaron;en&iacute;</strong> a <strong>Během (minuty)</strong>. V&nbsp;př&iacute;padě př&iacute;li&scaron; vysok&eacute;ho počtu ne&uacute;spě&scaron;n&yacute;ch přihl&aacute;&scaron;en&iacute; za předem definovanou dobu bude nedůvěryhodn&yacute; klient zablokov&aacute;n.</li>
	<li>Zadejte hodnotu do pole <strong>Odblokovat (minuty později)</strong>. Ochrana &uacute;čtu bude po uplynut&iacute; předem definovan&eacute; doby zru&scaron;ena.</li>
	<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <strong>Použ&iacute;t</strong>.</li>
</ol>

<h4>Zru&scaron;en&iacute; ochrany vybran&yacute;ch &uacute;čtů</h4>
<ol>
	<li>Kliknut&iacute;m na možnost <strong>Spr&aacute;va chr&aacute;něn&yacute;ch &uacute;čtů</strong>.</li>
	<li>Vyberte &uacute;čty, u&nbsp;kter&yacute;ch chcete ochranu zru&scaron;it a klikněte na možnost <strong>Zru&scaron;it ochranu</strong>.</li> 
</ol>

<h4>Odblokov&aacute;n&iacute; důvěryhodn&yacute;ch klientů</h4>
<ol>
	<li>Klikněte na možnost <strong>Spr&aacute;va důvěryhodn&yacute;ch zař&iacute;zen&iacute;</strong>.</li>
	<li>Vyberte klienty, kter&eacute; chcete odblokovat, a klikněte na možnost <strong>Odblokovat</strong>.</li>
</ol>

</body>
</html>
