<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>S&iacute;ť</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="link_aggr"></a>Link Aggregation</h2>
<p>Zař&iacute;zen&iacute; Synology NAS podporuje funkci multi-LAN, kter&aacute; v&aacute;m umožňuje tato rozhran&iacute; LAN kombinovat pomoc&iacute; technologie Link Aggregation. Funkce Link Aggregation zvy&scaron;uje &scaron;&iacute;řku p&aacute;sma va&scaron;eho zař&iacute;zen&iacute; Synology NAS t&iacute;m, že spojuje několik s&iacute;ťov&yacute;ch rozhran&iacute;, umožňuje tak přepnut&iacute; služeb za provozu a udržen&iacute; s&iacute;ťov&eacute;ho připojen&iacute;, pokud dojde k&nbsp;jeho v&yacute;padku.</p>
<p>Po sloučen&iacute; rozhran&iacute; LAN do rozhran&iacute; uvid&iacute;te na seznamu u možnosti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>S&iacute;ť</b> &gt; <b>S&iacute;ťov&eacute; rozhran&iacute;</b> nov&eacute; rozhran&iacute; s&nbsp;n&aacute;zvem <b>Bond</b>, kter&eacute; můžete nakonfigurovat stejn&yacute;m způsobem jako ostatn&iacute; rozhran&iacute; (např. LAN nebo PPPoE).</p>


<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Funkce Link Aggregation je dostupn&aacute; pouze u&nbsp;modelů minim&aacute;lně se dvěma porty LAN.</li>
<li>Po povolen&iacute; funkce Link Aggregation se s&iacute;ťov&yacute; provoz automaticky přizpůsob&iacute; a vyrovn&aacute; podle jednotliv&yacute;ch připojen&yacute;ch zař&iacute;zen&iacute;.</li>
<li>Pokud jsou s&iacute;ťov&aacute; rozhran&iacute; připojena k&nbsp;v&iacute;ce přep&iacute;načům, zkontrolujte, zda jsou porty přep&iacute;načů ve stejn&eacute; s&iacute;ti LAN nebo VLAN.</li>
</ul>
</div>


<h4>Postup kombinov&aacute;n&iacute; s&iacute;ťov&yacute;ch rozhran&iacute; pomoc&iacute; funkce Link Aggregation:</h4>
<ol>
<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>S&iacute;ť</strong> &gt; <strong>S&iacute;ťov&eacute; rozhran&iacute;</strong>. Klepněte na možnost <strong>Vytvořit</strong> &gt; <strong>Vytvořit propojen&iacute; Bond</strong>.</li><img src="about:blank" class="help_image"/><li>Vyberte požadovan&yacute; režim.<div class="section">
<h4>Popisy režimů:</h4>
<ul>
  <li><strong>Adaptive Load Balancing</strong>: Tento režim optimalizuje tok dat v&nbsp;s&iacute;ti, kter&yacute; odes&iacute;l&aacute; a přij&iacute;m&aacute; va&scaron;e zař&iacute;zen&iacute; Synology NAS, bez ohledu na to, jestli přep&iacute;nač podporuje funkci Link Aggregation. Abyste přede&scaron;li neoček&aacute;van&yacute;m chyb&aacute;m, neaktivujte funkci Link Aggregation na přep&iacute;nači, ani když je podporov&aacute;na.</li>
  <li><strong>IEEE 802.3ad Dynamic Link Aggregation</strong>: Tento režim optimalizuje v&nbsp;s&iacute;ti provoz dat odes&iacute;lan&yacute;ch a přij&iacute;man&yacute;ch zař&iacute;zen&iacute;m Synology NAS, a vyžaduje, aby na přep&iacute;nač&iacute;ch byla povolena funkce IEEE 802.3ad (Dynamic) Link Aggregation (LACP, 802.1AX). Pokud použ&iacute;v&aacute;te v&iacute;ce přep&iacute;načů, musej&iacute; b&yacute;t tyto přep&iacute;nače sdružiteln&eacute; a spr&aacute;vně nastaven&eacute;.</li>
<li><strong>Balance XOR</strong>: Tento režim vyrovn&aacute;v&aacute; v&nbsp;s&iacute;ti provoz dat odes&iacute;lan&yacute;ch a přij&iacute;man&yacute;ch zař&iacute;zen&iacute;m Synology NAS, a vyžaduje, aby na přep&iacute;nač&iacute;ch byla povolena funkce Static Link Aggregation. Pokud použ&iacute;v&aacute;te v&iacute;ce přep&iacute;načů, musej&iacute; b&yacute;t tyto přep&iacute;nače sdružiteln&eacute; a spr&aacute;vně nastaven&eacute;. Tok dat, kter&yacute; odes&iacute;l&aacute; va&scaron;e zař&iacute;zen&iacute; Synology NAS, lze vyrovn&aacute;vat i&nbsp;tehdy, pokud přep&iacute;nač funkci Link Aggregation nepodporuje. V&nbsp;tomto režimu lze zjistit ztracen&aacute; spojen&iacute;, ale ne př&iacute;činu (např. když jsou ethernetov&eacute; kabely odpojeny nebo přep&iacute;nač &scaron;patně nakonfigurov&aacute;n).</li>
<li><strong>Aktivn&iacute;&nbsp;/ Pohotovostn&iacute;</strong>: Tento režim va&scaron;emu zař&iacute;zen&iacute; Synology NAS zaji&scaron;ťuje funkci &bdquo;network fault tolerance&ldquo;. To znamen&aacute;, že pokud aktivn&iacute; s&iacute;ťov&eacute; rozhran&iacute; vypadne z&nbsp;provozu, jeden z&nbsp;ostatn&iacute;ch portů LAN bude s&iacute;ťov&eacute; připojen&iacute; zaji&scaron;ťovat m&iacute;sto něj. Tento režim můžete zvolit bez nastaven&iacute; přep&iacute;nače nebo s&nbsp;přep&iacute;načem, kter&yacute; podporuje IEEE 802.3ad Link Aggregation.</li>
</ul>
<p>Pokud jste povolili přep&iacute;nač Open vSwitch, můžete vybrat jeden z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch režimů:</p>
<ul>
 <li><b>Vyv&aacute;žen&iacute;-SLB</b>: Tento režim vyrovn&aacute;v&aacute; s&iacute;ťov&yacute; provoz, aniž by vyžadoval podporu specifick&yacute;ch s&iacute;ťov&yacute;ch přep&iacute;načů, a umožňuje připojen&iacute; mezi dvěma přep&iacute;nači.</li>
 <li><b>Vyv&aacute;žen&iacute;-TCP</b>: Tento režim umožňuje připojen&iacute; pomoc&iacute; přep&iacute;načů nakonfigurovan&yacute;ch jako Dynamic Link Aggregation (IEEE 802.3ad LACP). Pokud použ&iacute;v&aacute;te v&iacute;ce přep&iacute;načů, mus&iacute; b&yacute;t sdružiteln&eacute; a spr&aacute;vně nakonfigurovan&eacute;.</li>
 <li><b>Aktivn&iacute; režim/režim z&aacute;lohov&aacute;n&iacute;</b>: Tento režim zaji&scaron;ťuje pro zař&iacute;zen&iacute; Synology NAS funkci network fault tolerance pomoc&iacute; dvou s&iacute;ťov&yacute;ch rozhran&iacute;. V&nbsp;př&iacute;padě poruchy aktivn&iacute;ho s&iacute;ťov&eacute;ho rozhran&iacute; převezme provoz to druh&eacute; a připojen&iacute; k&nbsp;s&iacute;ti tak zůstane zachov&aacute;no. Tento režim můžete zvolit bez nakonfigurov&aacute;n&iacute; přep&iacute;nače.</li>
</ul>
</div>
</li><img src="about:blank" class="help_image"/><li>Vyberte rozhran&iacute; pro vytvořen&iacute; Link Aggregation.</li><img src="about:blank" class="help_image"/><li>Nakonfigurujte n&aacute;sleduj&iacute;c&iacute; IP. V&nbsp;př&iacute;padě nutnosti můžete povolit s&iacute;ť VLAN. Změny ulož&iacute;te kliknut&iacute;m na možnost <b>Použ&iacute;t</b>.</li><img src="about:blank" class="help_image"/><li>Po dokončen&iacute; se v&nbsp;seznamu <b>S&iacute;ťov&eacute; rozhran&iacute;</b> zobraz&iacute; nov&eacute; rozhran&iacute; <b>Bond 1</b>.</li><img src="about:blank" class="help_image"/></ol>

<h4>&Uacute;prava nastaven&iacute; Link Aggregation:</h4>
<ol>
<li>Pokud chcete změnit režim Link Aggregation nebo zobrazit informace o fyzick&yacute;ch zař&iacute;zen&iacute;ch, přejděte k&nbsp;možnosti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>S&iacute;ť</b> &gt; <b>S&iacute;ťov&eacute; rozhran&iacute;</b>.</li>
<li>Vyberte rozhran&iacute; <b>Bond 1</b> a klikněte na tlač&iacute;tko <b>Upravit</b>.</li><img src="about:blank" class="help_image"/><li>Přejděte na odpov&iacute;daj&iacute;c&iacute; karty a upravte požadovan&aacute; nastaven&iacute;.</li>
</ol>

<h4>Odebr&aacute;n&iacute; funkce Link Aggregation:</h4>
<ol>
<li>Přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>S&iacute;ť</b> &gt; <b>S&iacute;ťov&eacute; rozhran&iacute;</b>.</li>
<li>Vyberte rozhran&iacute; <b>Bond 1</b> a klikněte na tlač&iacute;tko <b>Odstranit</b>.</li><img src="about:blank" class="help_image"/><li>Po dokončen&iacute; se v&nbsp;seznamu S&iacute;ťov&eacute; rozhran&iacute; zobraz&iacute; dvě oddělen&aacute; rozhran&iacute; LAN.</li><img src="about:blank" class="help_image"/></ol>

</body>
</html>

