<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" charset="utf-8">

<title>Win/Mac/NFS</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>




<h2>Služba NFS</h2>
<p>Služba NFS umožňuje klientům se syst&eacute;mem Linux př&iacute;stup k&nbsp;datům na tomto zař&iacute;zen&iacute; Synology NAS.</p>
<h4>Povolen&iacute; služby&nbsp;NFS:</h4>
<ol>
<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Souborov&eacute; služby</strong> &gt; <strong>SMB/AFP/NFS</strong> a za&scaron;krtněte možnost <b>Povolit NFS</b>.</li>
<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
</ol>


<div class="section">
  <h4>Pozn&aacute;mka:</h4>
<ul>
<li> Zař&iacute;zen&iacute; Synology NAS v&nbsp;současn&eacute; době podporuje protokoly NFSv2, NFSv3 a NFSv4.</li>
<li>Při připojov&aacute;n&iacute; můžete do př&iacute;kazu připojen&iacute; přidat parametr <strong>-o vers=2</strong>, <strong>-o vers=3</strong> nebo <strong>-o vers=4</strong> a stanovit tak, kter&aacute; verze NFS se m&aacute; použ&iacute;vat.</li>
<li>N&aacute;sleduj&iacute;c&iacute; sd&iacute;len&eacute; složky př&iacute;stup prostřednictv&iacute;m protokolu NFS nepovoluj&iacute;:<ul>
    <li>&Scaron;ifrovan&eacute; sd&iacute;len&eacute; složky</li>
    <li>Sd&iacute;len&eacute; složky PetaSpace</li>
    <li>Sd&iacute;len&eacute; složky použ&iacute;vaj&iacute;c&iacute; syst&eacute;my souborů HFS, HFS Plus a exFAT</li>
    </ul>
</li>
</ul>
</div>


<h4>Konfigurace opr&aacute;vněn&iacute; pro př&iacute;stup ke sd&iacute;len&yacute;m složk&aacute;m u klientů se syst&eacute;mem Linux:</h4>
<p>Přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>Sd&iacute;len&aacute; složka</b>. Vyberte sd&iacute;lenou složku a kliknut&iacute;m na možnost <strong>Upravit</strong> spravujte pravidla NFS a regulujte př&iacute;stupov&aacute; pr&aacute;va k&nbsp;t&eacute;to sd&iacute;len&eacute; složce pro klienty syst&eacute;mu Linux.</p>


<h3>Nastaven&iacute; podpory protokolů NFSv4 a NFSv4.1</h3>
<p>Zař&iacute;zen&iacute; Synology NAS podle v&yacute;choz&iacute;ho nastaven&iacute; podporuje protokoly NFSv2 a NFSv3. Můžete se rozhodnout, jestli chcete povolit protokol NFSv4 nebo NFSv4.1.</p>

<h4>Povolen&iacute; podpory protokolu NFSv4 nebo NFSv4.1:</h4>
<ol>
<li>Za&scaron;krtněte pol&iacute;čko <b>Povolit podporu NFSv4</b> nebo <b>Povolit podporu NFSv4.1</b>.</li>
<li>Do pole <b>Dom&eacute;na NFSv4</b> zadejte n&aacute;zev dom&eacute;ny NFSv4, kterou chcete použ&iacute;vat. Toto pole je voliteln&eacute; a může zůstat pr&aacute;zdn&eacute;.</li>
<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Když k&nbsp;připojen&iacute; sd&iacute;len&eacute; složky použ&iacute;v&aacute;te protokol NFSv4, pamatujte na n&aacute;sleduj&iacute;c&iacute; skutečnosti, jinak se operace se soubory asociovan&yacute;mi s&nbsp;uživatelsk&yacute;m jm&eacute;nem nezdař&iacute;.</p>
<ul>
<li>Klient NFS mus&iacute; povolovat službu idmapd.</li>
<li>Nastaven&iacute; dom&eacute;ny NFSv4 v&nbsp;souboru idmapd.conf v&nbsp;klientovi NFS mus&iacute; odpov&iacute;dat poli <b>Dom&eacute;na NFSv4</b> v&nbsp;zař&iacute;zen&iacute; Synology NAS.</li>
</ul>

</div>
<p>V&nbsp;př&iacute;padě povolen&iacute; protokolu NFSv4.1 se automaticky povol&iacute; i&nbsp;protokol NFSv4.</li>

<h4>V&iacute;cen&aacute;sobn&eacute; cesty</h4>
<p>Protokol NFSv4.1 podporuje v&iacute;cen&aacute;sobn&eacute; cesty. Klienti mohou přistupovat k&nbsp;serveru NFS současně prostřednictv&iacute;m v&iacute;ce s&iacute;ťov&yacute;ch připojen&iacute;. V&iacute;cen&aacute;sobn&eacute; cesty zvy&scaron;uj&iacute; &scaron;&iacute;řku p&aacute;sma a umožňuj&iacute; tak přepnut&iacute; služeb za provozu a udržen&iacute; s&iacute;ťov&eacute;ho připojen&iacute;, pokud dojde k&nbsp;jeho v&yacute;padku. V&nbsp;současnosti podporuje klienty NFSv4.1 pouze syst&eacute;m VMware ESXi verze 6.0 a vy&scaron;&scaron;&iacute;. Dal&scaron;&iacute; informace o&nbsp;podpoře protokolu NFSv4.1 v&nbsp;syst&eacute;mu VMware se nach&aacute;zej&iacute; v&nbsp;<a target="_blank" href="https://docs.vmware.com/en/VMware-vSphere/6.0/com.vmware.vsphere.storage.doc/GUID-8A929FE4-1207-4CC5-A086-7016D73C328F.html">dokumentu VMware</a>.</p>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>V&iacute;cen&aacute;sobn&eacute; cesty jsou dostupn&eacute; pouze na modelech podporuj&iacute;c&iacute;ch protokol NFSv4.1.</li>
</ul>
</div>



<h3>Roz&scaron;&iacute;řen&aacute; nastaven&iacute;</h3>

<h4>Použit&iacute; v&yacute;choz&iacute;ch opr&aacute;vněn&iacute; UNIX</h4>
<p> Když je za&scaron;krtnut&aacute; možnost <strong>Použit&iacute; v&yacute;choz&iacute;ch opr&aacute;vněn&iacute; UNIX</strong>, použij&iacute; se při odes&iacute;l&aacute;n&iacute; nebo vytv&aacute;řen&iacute; souborů či složek m&iacute;sto opr&aacute;vněn&iacute; Windows ACL v&yacute;choz&iacute; opr&aacute;vněn&iacute; syst&eacute;mu UNIX nastaven&aacute; v&nbsp;klientovi syst&eacute;mu Linux. Použit&aacute; opr&aacute;vněn&iacute; jsou stejn&aacute; jako opr&aacute;vněn&iacute; použit&aacute; př&iacute;kazem <strong>umask</strong> syst&eacute;mu UNIX. V&yacute;choz&iacute; hodnota umask je 022.</p><div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
  <li>U sd&iacute;len&yacute;ch složek s&nbsp;povolenou službou Windows ACL (v&scaron;echny sd&iacute;len&eacute; složky s&nbsp;v&yacute;jimkou složky &bdquo;photo&ldquo; a sd&iacute;len&eacute; složky na extern&iacute;ch jednotk&aacute;ch) proveďte pomoc&iacute; př&iacute;kazu <strong>chmod</strong> na klientovi se syst&eacute;mem Linux nebo na klientovi FTP změnu typů opr&aacute;vněn&iacute; složek a souborů z&nbsp;Windows ACL na UNIX.</li>
  <li>Povolen&iacute; t&eacute;to možnosti může způsobit probl&eacute;my s&nbsp;konzistenc&iacute; opr&aacute;vněn&iacute; mezi různ&yacute;mi protokoly. Chcete-li zamezit nekonzistenc&iacute;m, doporučujeme, aby tato možnost byla i&nbsp;nad&aacute;le zak&aacute;z&aacute;na.</li>
</ul>
</div>

<h4>Vlastn&iacute; port</h4>
<p>Je možn&eacute; přizpůsobit č&iacute;sla portů pro služby statd a nlockmgr.</p>

<ol>
<li>Vyberte možnost <strong>Přizpůsoben&eacute; porty</strong>.</li>
<li>Do pol&iacute; <strong>Port statd</strong> a <strong>Port nlockmgr</strong> zadejte č&iacute;sla portů.</li>
<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Chcete-li použ&iacute;vat služby NFSv3, přejděte do nab&iacute;dky <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Zabezpečen&iacute;</strong> &gt; <strong>Br&aacute;na firewall</strong> a vytvořte pravidlo pro br&aacute;nu firewall povoluj&iacute;c&iacute; &bdquo;Souborov&yacute; server Mac/Linux&ldquo; ze seznamu integrovan&yacute;ch aplikac&iacute;.</li>
</ul>
</div>
<h4>Nastaven&iacute; velikosti paketu pro čten&iacute;/z&aacute;pis</h4>
<p>Pokud nelze velikost paketu pro čten&iacute;/z&aacute;pis nastavit na klientu NFS, můžete v&yacute;choz&iacute; hodnotu zadat do tohoto pole.</p>

<ol>
<li>V&nbsp;pol&iacute;ch <strong>Velikost paketu pro čten&iacute;</strong> a <strong>Velikost paketu pro z&aacute;pis</strong> vyberte požadovanou velikost paketů.</li>
<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
<li>Znovu připojte sd&iacute;lenou složku.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Po změně velikosti paketu pro čten&iacute;/z&aacute;pis je nutn&eacute; sd&iacute;lenou složku znovu připojit, teprve pot&eacute; se nov&aacute; nastaven&iacute; projev&iacute;.</li>
<li>Tato nastaven&iacute; ovlivňuj&iacute; pouze klienty NFS připojuj&iacute;c&iacute; se prostřednictv&iacute;m protokolu UDP (User Datagram Protocol).</li>
</ul>
</div>

<h3>Nastaven&iacute; protokolu Kerberos</h3>
<p>Kerberos je protokol ověřov&aacute;n&iacute; v&nbsp;s&iacute;ti. Umožňuje klientům a serverům komunikuj&iacute;c&iacute;m v&nbsp;nezabezpečen&eacute; s&iacute;ti, aby se ověřili a bezpečně si vz&aacute;jemně prok&aacute;zali svoji totožnost. Zař&iacute;zen&iacute; Synology NAS nab&iacute;z&iacute; možnosti importu st&aacute;vaj&iacute;c&iacute;ho kl&iacute;če Kerberos. Po importu mohou klienti NFS k&nbsp;připojen&iacute; k&nbsp;zař&iacute;zen&iacute; Synology NAS použ&iacute;vat ověřovac&iacute; protokol Kerberos.</p>

<h4> Import kl&iacute;če Kerberos: </h4>
<ol>
<li>Klikněte na možnost <strong>Nastaven&iacute; Kerberos</strong>.</li>
<li>Klikněte na tlač&iacute;tko <b>Importovat</b>.</li>
<li>Vyberte kl&iacute;č Kerberos, kter&yacute; chcete importovat.</li>
<li>Klikněte na možnost <b>OK</b>.</li>
</ol>

<h3><a name="idmap"></a>Mapov&aacute;n&iacute; ID Kerberos</h3>
<p>Jednotliv&eacute; objekty Kerberos můžete mapovat do m&iacute;stn&iacute;ch uživatelsk&yacute;ch &uacute;čtů zař&iacute;zen&iacute; DSM.</p>
<h4> Mapov&aacute;n&iacute; objektů Kerberos a m&iacute;stn&iacute;ch uživatelsk&yacute;ch &uacute;čtů: </h4>
<ol>
<li>Klikněte na možnost <strong>Nastaven&iacute; Kerberos</strong>.</li>
<li>Přejděte na kartu <strong>Mapov&aacute;n&iacute; ID</strong>.</li>
<li> Klikněte na tlač&iacute;tko <b>Přidat</b>. Vyberte jednu z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;.</li>
<ul>
<li><strong>Mapov&aacute;n&iacute; ID:</strong> Zadejte objekt Kerberos a m&iacute;stn&iacute; uživatelsk&yacute; &uacute;čet, do kter&eacute;ho m&aacute; b&yacute;t namapov&aacute;n.</li>
<li><strong>Navrhovan&yacute; seznam mapov&aacute;n&iacute;:</strong> Tato možnost zobrazuje seznam navrhovan&yacute;ch možnost&iacute; mapov&aacute;n&iacute; objektů Kerberos a m&iacute;stn&iacute;ch uživatelů vytvořen&yacute; syst&eacute;mem.</li>
</ul>
</ol>
<div class="section disable-eds14">
  <h4> Pozn&aacute;mka: </h4>
<ul>
	<li>Objekt Kerberos je dostupn&yacute; pouze na modelech s&nbsp;intern&iacute;mi pevn&yacute;mi disky.</li>
	<li>Pokud chcete namapovat klienta NFS připojuj&iacute;c&iacute;ho se prostřednictv&iacute;m protokolu Kerberos do st&aacute;vaj&iacute;c&iacute;ho uživatelsk&eacute;ho &uacute;čtu dom&eacute;ny nebo LDAP, mus&iacute;te se připojit do adres&aacute;řov&eacute; služby. Služba Directory Server mus&iacute; nav&iacute;c obsahovat atribut zahrnuj&iacute;c&iacute; odpov&iacute;daj&iacute;c&iacute; objekt Kerberos.<ul>
		<li><strong>Uživatel dom&eacute;ny:</strong> Form&aacute;t odpov&iacute;daj&iacute;c&iacute;ho atributu by měl vypadat takto: <strong>userPrincipalName</strong>.</li>
		<li><strong>Uživatel LDAP:</strong> Form&aacute;t odpov&iacute;daj&iacute;c&iacute;ho atributu by měl vypadat takto: <strong>GSSAuthName</strong>.</li>
		</ul></li>
	<li>Pokud nelze uživatele &uacute;spě&scaron;ně namapovat do m&iacute;stn&iacute;ho uživatele nebo uživatele dom&eacute;ny/LDAP, bude uživatel namapov&aacute;n do role &bdquo;guest&ldquo;.<li>Priorita mapov&aacute;n&iacute; je n&aacute;sleduj&iacute;c&iacute;: M&iacute;stn&iacute; uživatel &gt; Uživatel dom&eacute;ny/LDAP &gt; Guest. </li>
	<li>Chcete-li změnit př&iacute;stupov&aacute; opr&aacute;vněn&iacute; klientů NFS, použijte seznam ř&iacute;zen&iacute; př&iacute;stupu (ACL) syst&eacute;mu Windows. Možnosti opr&aacute;vněn&iacute; nach&aacute;zej&iacute;c&iacute; se v&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Uživatel</strong> se nevztahuj&iacute; na klienty NFS.</li>
</ul>
</div>

</body>
</html>
