<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Win/Mac/NFS</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>

<body>

<h2>SMB</h2>
<p>Protokol SMB (Server Message Block) umožňuje klientům Windows, Mac a&nbsp;Linux s&nbsp;podporou protokolu SMB/CIFS př&iacute;stup k&nbsp;datům uložen&yacute;m na zař&iacute;zen&iacute; Synology NAS. Pokud chcete proch&aacute;zet soubory uložen&eacute; na zař&iacute;zen&iacute; Synology NAS pomoc&iacute; n&aacute;stroje Průzkumn&iacute;k Windows nebo připojovat sd&iacute;len&eacute; složky jako s&iacute;ťov&eacute; jednotky, povolte tuto možnost v&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Souborov&eacute; služby</strong> &gt; <strong>SMB/AFP/NFS</strong>.</p>

<h4>Povolen&iacute; protokolu SMB:</h4>
  <ol>
    <li>Za&scaron;krtněte možnost <strong>Povolit službu SMB</strong>.</li>
    <li>Klikněte na možnost <strong>Použ&iacute;t</strong>.</li>
  </ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
  <ul>
    <li>Po povolen&iacute; protokolu SMB je možn&eacute; k&nbsp;poč&iacute;tači Mac připojit prostřednictv&iacute;m služby SMB plně indexovan&eacute; složky a k&nbsp;hled&aacute;n&iacute; obsahu souborů v&nbsp;r&aacute;mci připojen&yacute;ch složek použ&iacute;vat program Finder (nevztahuje se na zař&iacute;zen&iacute; NVR216 a VS360HD).</li>
  </ul>
</div>


<h3>Pracovn&iacute; skupina</h3>
<p>Pomoc&iacute; t&eacute;to možnosti lze pro &uacute;čely spr&aacute;vy s&iacute;tě přiřadit syst&eacute;m jako člena konkr&eacute;tn&iacute; pracovn&iacute; skupiny.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
  <ul>
    <li>N&aacute;zev pracovn&iacute; skupiny může obsahovat 1 až 15 znaků. N&aacute;zev nesm&iacute; obsahovat n&aacute;sleduj&iacute;c&iacute; znaky: [ ] ; : &quot;< >* + = \ / | ? ,</li>
    <li>Pokud použ&iacute;v&aacute;te poč&iacute;tač Mac se syst&eacute;mem OS X 10.9 a&nbsp;zař&iacute;zen&iacute; Synology NAS se připojilo k&nbsp;dom&eacute;ně syst&eacute;mu Windows, můžete se přihl&aacute;sit přid&aacute;n&iacute;m v&yacute;razu <strong>localhost\</strong> před m&iacute;stn&iacute; uživatelsk&eacute; jm&eacute;no zař&iacute;zen&iacute; Synology NAS a&nbsp;z&iacute;skat tak prostřednictv&iacute;m protokolu SMB př&iacute;stup k&nbsp;souborům uložen&yacute;m v&nbsp;zař&iacute;zen&iacute; Synology NAS.</li>
  </ul>
</div>


<h3>Zak&aacute;zat př&iacute;stup k&nbsp;předchoz&iacute;m verz&iacute;m</h3>
<p>V&nbsp;aplikaci Průzkumn&iacute;k Windows jsou sn&iacute;mky složek nebo souborů uživatelům př&iacute;stupn&eacute; kliknut&iacute;m na kartu <strong>Předchoz&iacute; verze</strong> v&nbsp;r&aacute;mci sd&iacute;len&eacute; složky, což uživatelům umožňuje obnovovat nebo kop&iacute;rovat data i bez asistence spr&aacute;vce. Pokud vyberete možnost <strong>Zak&aacute;zat př&iacute;stup k&nbsp;předchoz&iacute;m verz&iacute;m</strong>, nezobraz&iacute; se na str&aacute;nce &bdquo;Předchoz&iacute; verze&ldquo; ž&aacute;dn&eacute; &uacute;daje.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
  <ul>
    <li>Tato funkce je podporov&aacute;na pouze syst&eacute;mem VDSM a&nbsp;modely s&nbsp;n&aacute;sleduj&iacute;c&iacute;mi architekturami bal&iacute;čků: Apollo Lake, Avoton, Braswell, Broadwell, Bromolow, Cedarview a&nbsp;Grantley. Architekturu bal&iacute;čku podporovanou va&scaron;&iacute;m modelem zjist&iacute;te podle <a href="https://www.synology.com/en-us/knowledgebase/DSM/tutorial/General/What_kind_of_CPU_does_my_NAS_have" target="_blank">tohoto čl&aacute;nku</a>.</li>
    <li>Uživatel&eacute; maj&iacute; opr&aacute;vněn&iacute; pro př&iacute;stup k&nbsp;předchoz&iacute; verzi pouze v&nbsp;př&iacute;padě, jestliže v&nbsp;okamžiku vytvořen&iacute; sn&iacute;mku odpov&iacute;daj&iacute;c&iacute;ho předchoz&iacute; verzi byly jejich uživatelsk&eacute; &uacute;čty již vytvořeny a maj&iacute; přiděleno opr&aacute;vněn&iacute; ke čten&iacute; sd&iacute;len&eacute; složky, pro kterou byl př&iacute;slu&scaron;n&yacute; sn&iacute;mek poř&iacute;zen.</li>
  </ul>
</div>


<h3>Povolit protokolov&aacute;n&iacute; přenosu</h3>
<p>Chcete-li povolit protokolov&aacute;n&iacute; operac&iacute; se soubory prov&aacute;děn&yacute;ch prostřednictv&iacute;m protokolu CIFS/SMB, za&scaron;krtněte pol&iacute;čko <strong>Povolit protokol přenosu</strong>. Podle v&yacute;choz&iacute;ho nastaven&iacute; bude protokol přenosu monitorovat pouze odstraněn&iacute; souboru nebo složky, v&nbsp;č&aacute;sti <strong>Nastaven&iacute; protokolů</strong> ale můžete vybrat i&nbsp;jin&eacute; ud&aacute;losti operac&iacute; se soubory (např&iacute;klad vytvořen&iacute;, přesunut&iacute;, přejmenov&aacute;n&iacute;, čten&iacute; nebo z&aacute;pis), kter&eacute; bude syst&eacute;m do protokolu ukl&aacute;dat. Č&iacute;m v&iacute;ce ud&aacute;lost&iacute; operac&iacute; se soubory v&scaron;ak vyberete, t&iacute;m vy&scaron;&scaron;&iacute; je pravděpodobnost, že to ovlivn&iacute; v&yacute;kon syst&eacute;mu.</p>


<h3>Roz&scaron;&iacute;řen&aacute; nastaven&iacute;</h3>
<p>Kliknut&iacute;m na kartu <strong>Roz&scaron;&iacute;řen&aacute; nastaven&iacute;</strong> zobraz&iacute;te n&iacute;že uveden&eacute; možnosti.</p>
  <ul>
    <li><strong>Server WINS</strong>: Microsoft Windows Internet Name Service (WINS) je mapovac&iacute; služba syst&eacute;mu NetBIOS určen&aacute; k&nbsp;mapov&aacute;n&iacute; n&aacute;zvu na IP adresu. Pokud je syst&eacute;m nakonfigurov&aacute;n tak, aby se registroval na serveru WINS, mohou jej uživatel&eacute; syst&eacute;mu Windows v&nbsp;s&iacute;t&iacute;ch TCP/IP naj&iacute;t jednodu&scaron;eji.</li>
    <li><strong>Maxim&aacute;ln&iacute; protokol SMB</strong>: Podle konfigurace sv&eacute; s&iacute;tě nastavte nejnověj&scaron;&iacute; protokol SMB, kter&yacute; bude zař&iacute;zen&iacute;m Synology NAS podporov&aacute;n.<ul>
        <li><strong>SMB1</strong>: SMB1 (naz&yacute;van&yacute; tak&eacute; CIFS) je podporovan&yacute; od syst&eacute;mu Windows NT.</li>
        <li><strong>SMB2</strong>: Protokol SMB2 je podporovan&yacute; od syst&eacute;mu Windows Vista a&nbsp;představuje vylep&scaron;enou verzi protokolu SMB. Protokol SMB2 přid&aacute;v&aacute; možnost slučovat několik akc&iacute; SMB do jedin&eacute;ho požadavku, č&iacute;mž se snižuje počet s&iacute;ťov&yacute;ch paketů a&nbsp;zvy&scaron;uje v&yacute;kon.</li>
        <li><strong>SMB2 a&nbsp;Large MTU</strong>: Term&iacute;nem &bdquo;Maximum transmission unit&ldquo; (MTU, česky &bdquo;největ&scaron;&iacute; přenosov&aacute; jednotka&ldquo;) se označuje největ&scaron;&iacute; datov&aacute; jednotka, kterou lze přen&eacute;st prostřednictv&iacute;m komunikačn&iacute;ho protokolu. Chcete-li využ&iacute;vat v&yacute;hod rychlej&scaron;&iacute;ch s&iacute;ťov&yacute;ch rozhran&iacute;, jako je např&iacute;klad 1- či 10gigabitov&aacute; s&iacute;ť Ethernet, zv&yacute;&scaron;&iacute; funkce Large MTU hodnotu největ&scaron;&iacute; přenosov&eacute; jednotky na 1&nbsp;megabajt (MB). Povolen&iacute;m funkce Large MTU dojde ke zv&yacute;&scaron;en&iacute; rychlosti a&nbsp;efektivity přenosů velk&yacute;ch souborů a&nbsp;z&aacute;roveň ke sn&iacute;žen&iacute; počtu paketů, kter&eacute; je potřeba zpracovat.</li>
        <li><strong>SMB3</strong>: Protokol SMB3 je podporovan&yacute; od syst&eacute;mu Windows 8 a Windows Server 2012. Jedn&aacute; se o&nbsp;zdokonalenou verzi protokolu SMB2. Protokol SMB3 podporuje &scaron;ifrovan&yacute; přenos souborů na b&aacute;zi AES a t&iacute;m podporuje zabezpečen&iacute; přenosu souborů peer-to-peer.</li>
      </ul>

      <div class="section"><h4>Pozn&aacute;mka:</h4>
        <ul>
          <li>Protokol SMB2 podporuj&iacute; syst&eacute;my Windows Vista, Windows 2008 R2, Windows 7 a&nbsp;nověj&scaron;&iacute;.</li>
          <li>Funkci Large MTU podporuj&iacute; syst&eacute;my Windows 2008 R2, Windows 7 a&nbsp;nověj&scaron;&iacute;.</li>
          <li>Chcete-li zv&yacute;&scaron;it &uacute;činnost funkce Large MTU na poč&iacute;tači se syst&eacute;mem Windows, bude nutn&eacute; prov&eacute;st změnu nastaven&iacute; registru poč&iacute;tače. V&iacute;ce informac&iacute; z&iacute;sk&aacute;te od technick&eacute; podpory společnosti Microsoft (můžete použ&iacute;t např&iacute;klad tento <a href="http://technet.microsoft.com/en-us/library/ff625695(v=ws.10).aspx" target="_blank">čl&aacute;nek</a>).</li>
        </ul>
      </div>

      <li><strong>Minim&aacute;ln&iacute; protokol SMB</strong>: Podle konfigurace va&scaron;&iacute; s&iacute;tě nastavte nejstar&scaron;&iacute; protokol SMB, kter&yacute; bude v&nbsp;zař&iacute;zen&iacute; Synology NAS podporov&aacute;n.</li>
      <li><strong>Režim &scaron;ifrov&aacute;n&iacute; přenosu</strong>: Když je povolen protokol SMB3, protokol SMB bude v&nbsp;r&aacute;mci pos&iacute;len&iacute; zabezpečen&iacute; přenosu souborů přenos &scaron;ifrovat.<ul>
          <li><strong>Zak&aacute;zat</strong>: Nebude použito ž&aacute;dn&eacute; &scaron;ifrov&aacute;n&iacute; přenosu.</li>
          <li><strong>Automaticky</strong>: &Scaron;ifrov&aacute;n&iacute; přenosu bude použito pouze u klientů podporuj&iacute;c&iacute;ch tuto funkci.</li>
          <li><strong>Vynutit</strong>: &Scaron;ifrov&aacute;n&iacute; přenosu bude použito vždy. To povede k&nbsp;tomu, že klienti, kteř&iacute; nepodporuj&iacute; &scaron;ifrov&aacute;n&iacute; přenosu, nebudou moci protokol SMB použ&iacute;vat.</li>
        </ul>
      </li>

      <div class="section"><h4>Pozn&aacute;mka:</h4>
        <ul>
          <li>&Scaron;ifrov&aacute;n&iacute; přenosu podporuj&iacute; syst&eacute;my Windows 8, Windows Server 2012 a&nbsp;nověj&scaron;&iacute;.</li>
          <li>Pokud je povoleno &scaron;ifrov&aacute;n&iacute; přenosu, nen&iacute; podporov&aacute;no anonymn&iacute; přihl&aacute;&scaron;en&iacute; k&nbsp;protokolu SMB.</li>
          <li>Pokud je povoleno &scaron;ifrov&aacute;n&iacute; přenosu, ponechte možnost <strong>Povolit funkci Opportunistic Locking</strong> za&scaron;krtnutou, aby nedoch&aacute;zelo k&nbsp;aplikaci časov&yacute;ch limitů.</li>
        </ul>
      </div>

      <li><strong>Povolit funkci Opportunistic Locking</strong>: Když povol&iacute;te funkci Opportunistic Locking protokolu CIFS, budou moci klienti l&eacute;pe ukl&aacute;dat obsah souborů do mezipaměti a vyhnou se mal&eacute; režii čten&iacute;/z&aacute;pisu. Pokud tato možnost vybr&aacute;na nen&iacute;, budou m&iacute;t datab&aacute;zov&eacute; aplikace k&nbsp;datab&aacute;zov&yacute;m souborům uložen&yacute;m v&nbsp;zař&iacute;zen&iacute; Synology NAS lep&scaron;&iacute; s&iacute;ťov&yacute; př&iacute;stup.<ul>
          <li><strong>Povolit pron&aacute;jem SMB2</strong>: Povolen&iacute;m t&eacute;to volby aktivujete dal&scaron;&iacute; nastaven&iacute; souvisej&iacute;c&iacute; s&nbsp;protokolem SMB2, kter&aacute; umožňuj&iacute; jemně vyladit mechanizmus mezipaměti klienta poskytovan&yacute; funkc&iacute; Opportunistic Locking.</li>
        </ul>
      </li>
      <li><strong>Povolit prohl&iacute;žeč Local Master Browser</strong>: Pokud je v&nbsp;r&aacute;mci stejn&eacute; pods&iacute;tě k&nbsp;dispozici několik poč&iacute;tačů se syst&eacute;mem Windows, je možn&eacute; vybrat jeden poč&iacute;tač, kter&yacute; bude plnit funkci prohl&iacute;žeče &bdquo;hlavn&iacute;ho m&iacute;stn&iacute;ho prohl&iacute;žeče&ldquo; (local master browser). Funkce Local Master Browser udržuje seznamy ostatn&iacute;ch poč&iacute;tačů v&nbsp;r&aacute;mci pods&iacute;tě a&nbsp;jej&iacute;ch sd&iacute;len&yacute;ch prostředků a&nbsp;sd&iacute;l&iacute; tyto seznamy s&nbsp;ostatn&iacute;mi poč&iacute;tači. Na z&aacute;kladě t&eacute;to možnosti může zař&iacute;zen&iacute; Synology NAS plnit funkci Local Master Browser.</li>

      <div class="section"><h4>Pozn&aacute;mka:</h4>
        <ul>
          <li>Povolen&iacute; t&eacute;to funkce znemožn&iacute; &uacute;sporn&yacute; režim pevn&yacute;ch disků a&nbsp;aktivuje &uacute;čet typu guest bez hesla.</li>
        </ul>
      </div>

      <li><strong>Povolit modul DirSort VFS</strong>: Tř&iacute;d&iacute; n&aacute;zvy složek a&nbsp;uv&aacute;d&iacute; je podle abecedy. Povolen&iacute; t&eacute;to možnosti ovlivňuje v&yacute;kon syst&eacute;mu.</li>
      <li><strong>Soubory veto</strong>: Skryje soubory podle stanoven&yacute;ch krit&eacute;ri&iacute;. Krit&eacute;ria mohou obsahovat z&aacute;stupn&eacute; znaky (*), v&iacute;ce položek je nutn&eacute; oddělit lom&iacute;tkem (/). Př&iacute;klad: <i>/abc*/*.txt/*.conf/</i>. Povolen&iacute; t&eacute;to možnosti ovlivňuje v&yacute;kon syst&eacute;mu.</li>
      <li><strong>Povolit symbolick&eacute; odkazy v&nbsp;r&aacute;mci sd&iacute;len&yacute;ch složek</strong>: V&yacute;běrem t&eacute;to možnosti umožn&iacute;te, aby symbolick&eacute; odkazy odkazovaly na soubory a složky v&nbsp;r&aacute;mci stejn&eacute; sd&iacute;len&eacute; složky. Symbolick&eacute; odkazy lze vytv&aacute;řet pomoc&iacute; termin&aacute;lu syst&eacute;mu DSM.<ul>
          <li><strong>Povolit symbolick&eacute; odkazy např&iacute;č sd&iacute;len&yacute;mi složkami</strong>: V&yacute;běrem t&eacute;to možnosti umožn&iacute;te, aby symbolick&eacute; odkazy odkazovaly na soubory nebo složky v&nbsp;jin&yacute;ch sd&iacute;len&yacute;ch složk&aacute;ch. Symbolick&eacute; odkazy lze vytv&aacute;řet pomoc&iacute; termin&aacute;lu syst&eacute;mu DSM. Uživatel&eacute; bez opr&aacute;vněn&iacute; ale mohou m&iacute;t k&nbsp;c&iacute;lov&yacute;m sd&iacute;len&yacute;m složk&aacute;m symbolick&yacute;ch odkazů př&iacute;stup.</li>
        </ul>
      </li>
      <li><strong>Povolit modulu VFS přev&aacute;dět speci&aacute;ln&iacute; znaky Mac</strong>: V&yacute;běrem t&eacute;to možnosti umožn&iacute;te při vytvořen&iacute; souboru přev&eacute;st v&nbsp;n&aacute;zvu souboru znaky vyhrazen&eacute; pro protokol SMB (např. &lt; &gt; &quot; * ?) do sady Basic Latin. Takov&eacute; soubory budou rozpoznateln&eacute; prostřednictv&iacute;m protokolu AFP.</li>
      <li><strong>Povolit modul MSDFS VFS</strong>: Umožn&iacute;, aby symbolick&eacute; odkazy odkazovaly na soubory nebo složky um&iacute;stěn&eacute; na jin&yacute;ch serverech SMB. Ve star&scaron;&iacute;ch verz&iacute;ch syst&eacute;mu Windows, jako např. Windows XP, se klient a&nbsp;zař&iacute;zen&iacute; Synology NAS mus&iacute; před povolen&iacute;m t&eacute;to možnosti připojit k&nbsp;dom&eacute;ně Windows. Dal&scaron;&iacute; informace o&nbsp;vytv&aacute;řen&iacute; odkazů MSDFS se nach&aacute;z&iacute; <a href="http://www.samba.org/samba/docs/man/Samba-HOWTO-Collection/msdfs.html" target=_blank>pod t&iacute;mto odkazem</a>. Před z&aacute;kazem t&eacute;to možnosti by se měla vymazat mezipaměť klientsk&eacute;ho zař&iacute;zen&iacute; (rovněž se doporučuje zař&iacute;zen&iacute; restartovat). V&nbsp;opačn&eacute;m př&iacute;padě to může m&iacute;t vliv na norm&aacute;ln&iacute; v&yacute;kon.</li>
      <li><strong>Zak&aacute;zat vět&scaron;&iacute; počet připojen&iacute; ze stejn&eacute; IP adresy</strong>: Pokud je povolena tato možnost, umožn&iacute; zař&iacute;zen&iacute; Synology NAS z&nbsp;IP adresy klientů, kteř&iacute; použ&iacute;vaj&iacute; protokol SMB, pouze jedno připojen&iacute;. Pokud protokol SMB využ&iacute;v&aacute; vět&scaron;&iacute; počet klientů se stejnou IP adresou, zachov&aacute; zař&iacute;zen&iacute; Synology NAS pouze nejnověj&scaron;&iacute; připojen&iacute; a&nbsp;v&scaron;echna ostatn&iacute; budou zru&scaron;ena. V&nbsp;prostřed&iacute; NAT může klient využ&iacute;vat samostatnou IP adresu. V&nbsp;takov&eacute;m př&iacute;padě může m&iacute;t povolen&iacute; t&eacute;to možnosti vliv na norm&aacute;ln&iacute; v&yacute;kon.</li>
      <li><strong>Shromažďovat protokoly laděn&iacute;</strong>: Pokud je povolena tato možnost, budou se pro &uacute;čely laděn&iacute; ukl&aacute;dat podrobněj&scaron;&iacute; protokoly. Povolen&iacute; t&eacute;to možnosti ovlivňuje v&yacute;kon syst&eacute;mu.</li>
      <li><strong>Použit&iacute; v&yacute;choz&iacute;ch opr&aacute;vněn&iacute; UNIX</strong>: Povolen&iacute;m t&eacute;to možnosti použijete při odes&iacute;l&aacute;n&iacute; nebo vytv&aacute;řen&iacute; souborů a&nbsp;složek v&yacute;choz&iacute; opr&aacute;vněn&iacute; UNIX. Opr&aacute;vněn&iacute; syst&eacute;mu UNIX bude 744 pro soubory a&nbsp;755 pro složky. Pokud je tato možnost zak&aacute;z&aacute;na, m&aacute; opr&aacute;vněn&iacute; syst&eacute;mu UNIX pro soubory a&nbsp;složky hodnotu 777.</li>

      <div class="section"><h4>Pozn&aacute;mka:</h4>
        <ul>
          <li>U&nbsp;sd&iacute;len&yacute;ch složek s&nbsp;povolen&yacute;m seznamem Windows ACL (v&scaron;echny sd&iacute;len&eacute; složky s&nbsp;v&yacute;jimkou složky &bdquo;photo&ldquo; a sd&iacute;len&eacute; složky na extern&iacute;ch jednotk&aacute;ch) proveďte pomoc&iacute; př&iacute;kazu <strong>chmod</strong> na klientovi se syst&eacute;mem Linux nebo na klientovi FTP změnu typů opr&aacute;vněn&iacute; složek a souborů z&nbsp;Windows ACL na UNIX (nevztahuje se na zař&iacute;zen&iacute; EDS14).</li>
          <li>Povolen&iacute; t&eacute;to možnosti může způsobit probl&eacute;my s&nbsp;konzistenc&iacute; opr&aacute;vněn&iacute; mezi různ&yacute;mi protokoly. Chcete-li zamezit nekonzistenc&iacute;m, doporučujeme, aby tato možnost byla i&nbsp;nad&aacute;le zak&aacute;z&aacute;na.</li>
        </ul>
      </div>

      <li><strong>Při vytv&aacute;řen&iacute; souborů nevyhrazovat prostor na disku</strong>: Tuto možnost povolte, chcete li při vytv&aacute;řen&iacute; souborů v&nbsp;zař&iacute;zen&iacute; zak&aacute;zat rezervov&aacute;n&iacute; m&iacute;sta na disku Synology NAS.</li>
      <li><strong>Povolit mezipaměť hled&aacute;n&iacute; z&aacute;stupn&yacute;ch znaků</strong>: Tuto možnost povolte, chcete-li zlep&scaron;it v&yacute;kon hled&aacute;n&iacute; v&nbsp;př&iacute;padě, že klienti opakovaně odes&iacute;laj&iacute; požadavky na hled&aacute;n&iacute; z&aacute;stupn&yacute;ch znaků.</li>
      <li><strong>Povolit trval&eacute; popisovače protokolu SMB (uzamyk&aacute;n&iacute; souborů mezi protokoly bude zak&aacute;z&aacute;no)</strong>: Povolen&iacute;m t&eacute;to volby umožn&iacute;te uživatelům obnovit ztracen&eacute; připojen&iacute; SMB2 k&nbsp;tomuto zař&iacute;zen&iacute; Synology NAS po dočasn&eacute;m odpojen&iacute;; otevřen&eacute; soubory zůstanou po dobu v&yacute;padku připojen&iacute; k&nbsp;s&iacute;ti dostupn&eacute;. Uzamyk&aacute;n&iacute; souborů mezi protokoly ale bude zak&aacute;z&aacute;no, aby uživatel&eacute; mohli použ&iacute;vat a měnit uzamknut&yacute; soubor prostřednictv&iacute;m jin&yacute;ch protokolů než SMB2 (např. AFP).</li>
      <li><strong>Vymazat mezipaměť SMB</strong>: Kliknut&iacute;m na toto tlač&iacute;tko je možn&eacute; v&nbsp;r&aacute;mci ře&scaron;en&iacute; probl&eacute;mů odstranit n&aacute;sleduj&iacute;c&iacute; soubory mezipaměti&nbsp;SMB:<ul>
          <li>/var/cache/samba/netsamlogon_cache.tdb</li>
          <li>/var/lib/samba/winbindd_cache.tdb</li>
          <li>/var/lib/samba/share_info.tdb</li>
          <li>/var/lib/samba/registry.tdb</li>
          <li>/run/samba/connections.tdb</li>
          <li>/run/samba/gencacche.tdb</li>
          <li>/run/samba/gencache_notran.tdb</li>
        </ul>
      </li>
    </ul>

</body>
</html>