<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Dom&eacute;na</h2>

<p>Va&scaron;e zař&iacute;zen&iacute; Synology NAS se může připojit k&nbsp;dom&eacute;ně syst&eacute;mu Windows. Po připojen&iacute; k&nbsp;dom&eacute;ně se mohou uživatel&eacute; dom&eacute;ny přihl&aacute;sit do zař&iacute;zen&iacute; Synology NAS pomoc&iacute; &uacute;čtů a hesel dom&eacute;ny a mohou tak použ&iacute;vat soubory a aplikace syst&eacute;mu DSM, aniž by si museli pamatovat dal&scaron;&iacute; sadu uživatelsk&yacute;ch jmen a hesel.</p>

<h4>Připojen&iacute; k&nbsp;dom&eacute;ně:</h4>
<ol>
	<li>Přejděte do nab&iacute;dky <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Dom&eacute;na/LDAP</strong> &gt; <strong>Dom&eacute;na</strong>.</li>
	<li>Za&scaron;krtněte pol&iacute;čko <strong>Připojit k&nbsp;dom&eacute;ně</strong>.</li>
	<li>Do př&iacute;slu&scaron;n&yacute;ch pol&iacute; zadejte n&aacute;zev dom&eacute;ny a stanovte server DNS.</li>
	<li>V&nbsp;př&iacute;padě potřeby za&scaron;krtněte pol&iacute;čko <strong>Roz&scaron;&iacute;řen&eacute; možnosti dom&eacute;ny</strong>. (Podrobnosti viz n&iacute;že.)</li>
	<li>Klikněte na možnost <strong>Použ&iacute;t</strong>.</li>
	<li>V&nbsp;okně, kter&eacute; se otevře, zadejte uživatelsk&eacute; jm&eacute;no a heslo spr&aacute;vce dom&eacute;ny.</li>
	<li>Klikněte na možnost <strong>OK</strong>.</li>
</ol>

<div class="section"><h4>DNS Server</h4>
<p>Doporučujeme stanovit server DNS, aby zař&iacute;zen&iacute; Synology NAS mohlo dom&eacute;nu sn&aacute;ze vyhledat. Pokud v&scaron;ak dom&eacute;na nen&iacute; na serveru DNS zaregistrov&aacute;na, připojen&iacute; k&nbsp;dom&eacute;ně se nemus&iacute; podařit.</p>

<h4>Typ dom&eacute;nov&eacute;ho serveru</h4>
<p>Toto pole zobrazuje typ dom&eacute;ny po připojen&iacute; zař&iacute;zen&iacute; Synology NAS k&nbsp;dom&eacute;ně. Typ dom&eacute;ny bude &bdquo;Dom&eacute;na AD&ldquo;.</p>

<h4>Režim spr&aacute;vy</h4>
<p>Tato možnost určuje, jak bude prob&iacute;hat spr&aacute;va opr&aacute;vněn&iacute; uživatelů a skupin dom&eacute;ny.</p>
<ul>
	<li><strong>Důvěryhodn&aacute; dom&eacute;na</strong>: Můžete spravovat uživatele a skupiny v&nbsp;připojen&eacute; dom&eacute;ně i&nbsp;důvěryhodn&yacute;ch dom&eacute;n&aacute;ch. Seznam uživatelů a skupin můžete filtrovat podle dom&eacute;n.</li>
	<li><strong>Jednoduch&aacute; dom&eacute;na s&nbsp;OJ</strong>: V&nbsp;tomto režimu se zobraz&iacute; pouze uživatel&eacute; a skupiny v&nbsp;připojen&eacute; dom&eacute;ně. V&nbsp;tomto režimu můžete filtrovat seznam uživatelů a skupin podle organizačn&iacute;ch jednotek (OJ).</li>
</ul>

<h4>Roz&scaron;&iacute;řen&eacute; možnosti dom&eacute;ny</h4>
<p>Ve vět&scaron;ině př&iacute;padů nemus&iacute;te ž&aacute;dn&eacute; roz&scaron;&iacute;řen&eacute; možnosti dom&eacute;ny vyplňovat. Roz&scaron;&iacute;řen&eacute; možnosti dom&eacute;ny jsou nutn&eacute; pouze v&nbsp;určit&yacute;ch prostřed&iacute;ch dom&eacute;n.</p>
<ul>
	<li><strong>DC IP/FQDN</strong>: Zadejte IP adresu dom&eacute;nov&eacute;ho řadiče (DC) nebo n&aacute;zev FQDN. Zař&iacute;zen&iacute; Synology NAS se s&nbsp;n&iacute;m pokus&iacute; nav&aacute;zat komunikaci. Pokud zad&aacute;v&aacute;te v&iacute;ce IP adres nebo n&aacute;zvů FQDN, použijte mezi jednotliv&yacute;mi položkami č&aacute;rku (,). Pokud chcete, můžete za posledn&iacute; IP adresu dom&eacute;nov&eacute;ho řadiče nebo n&aacute;zev FQDN zadat hvězdičku (*). Nepodař&iacute;-li se komunikace se zadan&yacute;mi adresami, zař&iacute;zen&iacute; Synology NAS se pokus&iacute; komunikovat s&nbsp;jin&yacute;m dom&eacute;nov&yacute;m řadičem. Mezi hvězdičku a posledn&iacute; IP adresu nebo n&aacute;zev FQDN mus&iacute;te vložit č&aacute;rku.</li>
	<li><strong>N&aacute;zev NetBIOS dom&eacute;ny</strong>: Zadejte n&aacute;zev NetBIOS dom&eacute;ny.</li>
	<li><strong>FQDN dom&eacute;ny (n&aacute;zev DNS)</strong>: Zadejte n&aacute;zev FQDN (n&aacute;zev DNS) dom&eacute;ny.</li>
	<li><strong>Zaregistrovat rozhran&iacute; DNS</strong>: Při připojov&aacute;n&iacute; do dom&eacute;ny se na serveru DNS zaregistruje zde zadan&aacute; karta NIC (Network Interface Card). Pokud n&aacute;zev hostitele zař&iacute;zen&iacute; Synology NAS obsahuje podtrž&iacute;tko (_), registrace se nezdař&iacute;, protože podtrž&iacute;tka nelze ve spojen&iacute; se službou DNS použ&iacute;vat.</li>
	<li><strong>Aktualizovat seznam uživatelů/skupin</strong>: Zadejte, jak často m&aacute; zař&iacute;zen&iacute; Synology NAS automaticky aktualizovat seznam uživatelů/skupin. Čas je možn&eacute; upravit tak, aby se aktualizace prov&aacute;děly denně, t&yacute;dně nebo měs&iacute;čně. Kromě toho je možn&eacute; seznamy uživatelů/skupin dom&eacute;ny aktualizovat ručně přechodem na kartu <strong>Uživatel&eacute; dom&eacute;ny</strong> a kliknut&iacute;m na možnost <strong>Aktualizovat data dom&eacute;ny</strong>. Automatick&eacute; aktualizace ovlivn&iacute; režim sp&aacute;nku syst&eacute;mu.</li>
</ul>

<h4>Připojen&iacute; k&nbsp;ovladači dom&eacute;ny pouze pro čten&iacute;</h4>
<p>Chcete-li připojit zař&iacute;zen&iacute; Synology NAS k&nbsp;ovladači dom&eacute;ny pouze pro čten&iacute; (RODC), mus&iacute;te do pole <strong>DC IP/FQDN</strong> zadat &bdquo;cel&yacute; n&aacute;zev poč&iacute;tače&ldquo; (FQDN) sv&eacute;ho ovladače dom&eacute;ny pro čten&iacute; a z&aacute;pis (RWDC). Cel&yacute; n&aacute;zev poč&iacute;tače by měl b&yacute;t uveden v&nbsp;n&aacute;sleduj&iacute;c&iacute;m form&aacute;tu: <strong>N&aacute;zevPoč&iacute;tače.Dom&eacute;na</strong>, např. &bdquo;ad01.synology.com&ldquo;.</p>
</div>


<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Jestliže va&scaron;e uživatelsk&eacute; jm&eacute;no v&nbsp;dom&eacute;ně obsahuje znaky % nebo $, je možn&eacute;, že nebudete m&iacute;t ke sv&eacute; složce uživatele př&iacute;stup. Pož&aacute;dejte sv&eacute;ho spr&aacute;vce dom&eacute;ny, aby v&aacute;m přidělil nov&eacute; uživatelsk&eacute; jm&eacute;no.</li>
	<li>Skupiny dom&eacute;n <strong>Domain Admins</strong> a <strong>Enterprise Admins</strong> se automaticky přidaj&iacute; do m&iacute;stn&iacute; skupiny <strong>administrators</strong>. Proto budou m&iacute;t uživatel&eacute; dom&eacute;ny v&nbsp;těchto skupin&aacute;ch opr&aacute;vněn&iacute; spr&aacute;vce v&nbsp;zař&iacute;zen&iacute; Synology NAS, včetně př&iacute;stupu k&nbsp;souborov&yacute;m služb&aacute;m, jako např&iacute;klad CIFS/FTP/AFP/WebDAV, a k&nbsp;ostatn&iacute;m aplikac&iacute;m syst&eacute;mu DSM.</li>
	<li>Možn&eacute; je tak&eacute; nakonfigurovat opr&aacute;vněn&iacute; př&iacute;stupu uživatelů dom&eacute;ny ke sd&iacute;len&yacute;m složk&aacute;m zař&iacute;zen&iacute; Synology NAS. Dal&scaron;&iacute; informace se nach&aacute;zej&iacute; <a href="file_directory_service_user_group.html">pod t&iacute;mto odkazem</a>.</li>
</ul>
</div>

<h3>Možnosti dom&eacute;ny</h3>

<p>Tato č&aacute;st obsahuje n&aacute;sleduj&iacute;c&iacute; možnosti dal&scaron;&iacute; dom&eacute;ny.</p>
<ul>
	<li><strong>Zař&iacute;zen&iacute; DiskStation provede synchronizaci se serverem NTP pokažd&eacute;, když se uživatel dom&eacute;ny přihl&aacute;s&iacute;</strong>: Povolen&iacute;m t&eacute;to možnosti vynut&iacute;te synchronizaci času mezi zař&iacute;zen&iacute;m Synology NAS a serverem NTP.</li>
	<li><strong>Z&iacute;skat seznamy uživatelů/skupin s&nbsp;režimem kompatibility NT4</strong>: Povolen&iacute;m t&eacute;to možnosti umožn&iacute;te syst&eacute;mu z&iacute;sk&aacute;vat seznamy uživatelů/skupin pomoc&iacute; režimu NT4 RPC. Tuto možnost lze povolit, pokud někter&eacute; seznamy uživatelů/skupin dom&eacute;ny nelze pomoc&iacute; v&yacute;choz&iacute;ch nastaven&iacute; z&iacute;skat.</li>
	<li><strong>Povolit podepisov&aacute;n&iacute; serveru</strong>: Pokud klient povolil podepisov&aacute;n&iacute; klienta, mus&iacute; b&yacute;t podepisov&aacute;n&iacute; serveru povoleno tak&eacute; v&nbsp;zař&iacute;zen&iacute; Synology NAS, aby mohli uživatel&eacute; dom&eacute;nov&eacute; služby norm&aacute;lně použ&iacute;vat.</li>
	<li><strong>Zobrazit &uacute;rovně vnořen&yacute;ch skupin</strong>: Zadejte počet vnořen&yacute;ch členů skupiny dom&eacute;ny, kter&eacute; lze zobrazit.</li>
	<li><strong>Spr&aacute;vci dom&eacute;ny</strong>: Určete až 10 skupin uživatelů, kter&yacute;m chcete udělit opr&aacute;vněn&iacute; spr&aacute;vce. Každ&yacute; uživatel s&nbsp;opr&aacute;vněn&iacute;m spr&aacute;vce bude m&iacute;t nad zař&iacute;zen&iacute;m Synology NAS a v&nbsp;něm uložen&yacute;mi soubory plnou kontrolu.</li>
	<li><strong>Povolit integrovan&eacute; ověřov&aacute;n&iacute; syst&eacute;mu Windows</strong>: Povolen&iacute;m t&eacute;to možnosti umožn&iacute;te uživatelům, kteř&iacute; se již přihl&aacute;sili do sv&yacute;ch poč&iacute;tačů pomoc&iacute; sv&yacute;ch &uacute;čtů dom&eacute;ny, přihl&aacute;sit se do syst&eacute;mu DSM pomoc&iacute; internetov&eacute;ho prohl&iacute;žeče bez zad&aacute;n&iacute; uživatelsk&eacute;ho jm&eacute;na a hesla.</li>
</ul>

<div class="section"><h4>Použ&iacute;v&aacute;n&iacute; integrovan&eacute;ho ověřov&aacute;n&iacute; syst&eacute;mu Windows</h4>
<ul>
	<li>Na klientsk&eacute;m poč&iacute;tači mus&iacute; b&yacute;t spu&scaron;těn operačn&iacute; syst&eacute;m Windows 7 nebo nověj&scaron;&iacute; verze.</li>
	<li>Klientsk&yacute; poč&iacute;tač mus&iacute; b&yacute;t připojen do stejn&eacute; dom&eacute;ny jako zař&iacute;zen&iacute; Synology NAS.</li>
	<li>V&nbsp;syst&eacute;mu Windows přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>Možnosti internetu</b> &gt; <b>Roz&scaron;&iacute;řen&eacute;</b> a přesvědčte se, že je v&nbsp;č&aacute;sti <b>Zabezpečen&iacute;</b> za&scaron;krtnut&eacute; pol&iacute;čko <b>Povolit integrovan&eacute; ověřov&aacute;n&iacute; syst&eacute;mu Windows</b>.</li>
	<li>Integrovan&eacute; ověřov&aacute;n&iacute; syst&eacute;mu Windows funguje ve v&scaron;ech prohl&iacute;žeč&iacute;ch. V&nbsp;př&iacute;padě prohl&iacute;žeče Firefox obsahuje nastaven&iacute; o&nbsp;několik kroků v&iacute;ce.<ul>
			<li>Otevřete prohl&iacute;žeč Firefox a do ř&aacute;dku URL zadejte <b>about:config</b>.</li>
			<li>Vyhledejte položku <b>network.automatic-ntlm-auth.trusted-uris</b>.</li>
			<li>Dvojitě klikněte na pole <b>hodnota</b> a zadejte IP adresu dom&eacute;ny.</li>
		</ul>
	</li>
	<li>Pokud připojujete zař&iacute;zen&iacute; Synology NAS k&nbsp;dom&eacute;ně vytvořen&eacute; službou Synology Directory Server, je k&nbsp;použ&iacute;v&aacute;n&iacute; integrovan&eacute;ho ověřov&aacute;n&iacute; syst&eacute;mu Windows potřeba dal&scaron;&iacute; konfigurace:<ol>
			<li>Přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>Souborov&eacute; služby</b> &gt; <b>SMB/AFP/NFS</b> syst&eacute;mu DSM.</li>
			<li>V&nbsp;č&aacute;sti <b>SMB</b> klikněte na možnost <b>Roz&scaron;&iacute;řen&aacute; nastaven&iacute;</b>.</li>
			<li>V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce <b>Minim&aacute;ln&iacute; protokol SMB</b> vyberte možnost <b>SMB1</b> a klikněte na možnost <b>Uložit</b>.</li>
		</ol>
	</li>

</ul>
</div>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Přihl&aacute;&scaron;en&iacute; pomoc&iacute; funkce Integrovan&eacute; ověřov&aacute;n&iacute; syst&eacute;mu Windows je k&nbsp;dispozici v&nbsp;syst&eacute;mu DSM 6.2.2 a nověj&scaron;&iacute;ch verz&iacute;ch.</li>
		</ul></li>
</ul>
</div>

<h3>Kontrola stavu dom&eacute;ny</h3>

<p>Kliknut&iacute;m na možnost <strong>Kontrola stavu dom&eacute;ny</strong> můžete zkontrolovat stav připojen&iacute; mezi syst&eacute;mem DSM a připojen&yacute;m serverem dom&eacute;ny. Dal&scaron;&iacute; informace o&nbsp;ře&scaron;en&iacute; probl&eacute;mů se nach&aacute;zej&iacute; v&nbsp;n&aacute;sleduj&iacute;c&iacute;ch kontroln&iacute;ch položk&aacute;ch:</p>
<ul>
	<li><strong>Zkontrolujte, jestli funguje spr&aacute;vně připojen&iacute; mezi zař&iacute;zen&iacute;m Synology NAS a<font>řadičem dom&eacute;ny</font></strong>: Selhala komunikace mezi zař&iacute;zen&iacute;m Synology NAS a<font>řadičem dom&eacute;ny</font>.<ul>
			<li>Zkontrolujte, jestli spr&aacute;vně funguj&iacute; porty 389, 139 a 445 na<font>řadiči dom&eacute;ny</font>.</li>
			<li>Zkontrolujte, jestli služba NTDS spr&aacute;vně funguje na<font>řadiči dom&eacute;ny</font>.</li>
		</ul>
	</li>
	<li><strong>Zkontrolujte, jestli se v&nbsp;s&iacute;ti vyskytuj&iacute; konfliktn&iacute; n&aacute;zvy hostitelů</strong>: Zař&iacute;zen&iacute; Synology NAS m&aacute; n&aacute;zev hostitele, kter&yacute; v&nbsp;pods&iacute;ti již existoval.<ul>
			<li>Pokud je zař&iacute;zen&iacute; Synology NAS připojen&eacute; do pods&iacute;tě s&nbsp;v&iacute;ce s&iacute;ťov&yacute;mi rozhran&iacute;mi, bude syst&eacute;m DSM fungovat spr&aacute;vně.</li>
			<li>Pokud je zař&iacute;zen&iacute; Synology NAS připojen&eacute; do pods&iacute;tě s&nbsp;jedn&iacute;m s&iacute;ťov&yacute;m rozhran&iacute;m, změňte n&aacute;zev hostitele zař&iacute;zen&iacute; Synology NAS a znovu jej připojte do dom&eacute;ny.</li>
		</ul>
	</li>
	<li><strong>Zkontrolujte, jestli funguje spr&aacute;vně připojen&iacute; mezi zař&iacute;zen&iacute;m Synology NAS a serverem Kerberos</strong>: Komunikace mezi zař&iacute;zen&iacute;m Synology NAS a serverem Kerberos se nezdařila.<ul>
			<li>Zkontrolujte, jestli na serveru DNS existuje spr&aacute;vn&yacute; z&aacute;znam Kerberos DNS SRV a souvisej&iacute;c&iacute; z&aacute;znam A.</li>
			<li>Zkontrolujte, jestli je na serveru KDC dostupn&yacute; port 88.</li>
		</ul>
	</li>
	<li><strong>Zkontrolujte, jestli funguje spr&aacute;vně připojen&iacute; mezi zař&iacute;zen&iacute;m Synology NAS a serverem LDAP</strong>: Komunikace mezi zař&iacute;zen&iacute;m Synology NAS a serverem LDAP se nezdařila.<ul>
			<li>Zkontrolujte, jestli na serverech DNS existuje spr&aacute;vn&yacute; z&aacute;znam LDAP DNS SRV a souvisej&iacute;c&iacute; z&aacute;znam A.</li>
			<li>Zkontrolujte, jestli na serveru LDAP spr&aacute;vně funguje port 389.</li>
		</ul>
	</li>
	<li><strong>Zkontrolujte spr&aacute;vnost konfigurace MTU a ověřte, jestli propojen&iacute; mezi zař&iacute;zen&iacute;m Synology NAS a řadičem dom&eacute;ny funguje spr&aacute;vně</strong>: Jeden nebo v&iacute;ce přep&iacute;načů vynechalo pakety přen&aacute;&scaron;en&eacute; mezi zař&iacute;zen&iacute;m Synology NAS a<font>řadičem dom&eacute;ny</font>z&nbsp;důvodu neplatn&eacute; velikosti MTU těchto paketů.<ul>
			<li>Zkontrolujte nastaven&iacute; rozhran&iacute; přep&iacute;načů mezi zař&iacute;zen&iacute;m Synology NAS a<font>řadičem dom&eacute;ny</font>.</li>
		</ul>
	</li>
	<li><strong>Zkontrolujte, jestli prob&iacute;h&aacute; synchronizace času mezi zař&iacute;zen&iacute;m Synology NAS a dom&eacute;nou</strong>: Čas v&nbsp;zař&iacute;zen&iacute; Synology NAS nen&iacute; synchronizovan&yacute; se serverem dom&eacute;ny.<ul>
			<li>Na zař&iacute;zen&iacute; Synology NAS můžete nastavit službu NTP, aby synchronizovala čas se serverem dom&eacute;ny, nebo v&nbsp;č&aacute;sti <strong>Možnosti dom&eacute;ny</strong> povolit možnost <strong>Zař&iacute;zen&iacute; Synology NAS provede synchronizaci se serverem NTP pokažd&eacute;, když se přihl&aacute;s&iacute; uživatel dom&eacute;ny</strong>.</li>
		</ul>
	</li>
</ul>

</body>
</html>