<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>LDAP</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>LDAP</h2>
<p>Protokol LDAP umožňuje zař&iacute;zen&iacute; Synology NAS připojit se ke st&aacute;vaj&iacute;c&iacute; adres&aacute;řov&eacute; službě jako klienta LDAP a n&aacute;sledně ze serveru LDAP (neboli &bdquo;adres&aacute;řov&eacute;ho serveru&ldquo;) nač&iacute;st informace o uživatel&iacute;ch nebo skupin&aacute;ch. Spravovat je možn&eacute; př&iacute;stupov&aacute; opr&aacute;vněn&iacute; uživatelů nebo skupin LDAP k&nbsp;aplikac&iacute;m a sd&iacute;len&yacute;m složk&aacute;m syst&eacute;mu DSM, stejně jako byste postupovali u m&iacute;stn&iacute;ch uživatelů nebo skupin syst&eacute;mu DSM. Dal&scaron;&iacute; informace o&nbsp;protokolu LDAP se nach&aacute;zej&iacute; pod <a href="http://en.wikipedia.org/wiki/LDAP" target="_blank">t&iacute;mto odkazem</a>.</p>

<p>Podporovan&yacute; standard LDAP je LDAP verze 3 (RFC 2251).</p>
<h4>Připojen&iacute; zař&iacute;zen&iacute; Synology NAS k&nbsp;adres&aacute;řov&eacute; službě:</h4>
<ol>
	<li>Přejděte do nab&iacute;dky <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Dom&eacute;na/LDAP</strong>.</li><img src="about:blank" class="help_image" /><li>Přejděte na kartu <strong>LDAP</strong> a za&scaron;krtněte možnost <strong>Povolit klienta LDAP</strong>.</li><img src="about:blank" class="help_image" /><li>Do pole <strong>Adresa serveru LDAP</strong> zadejte IP adresu nebo n&aacute;zev dom&eacute;ny serveru LDAP.</li><img src="about:blank" class="help_image" /><li>V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce <strong>&Scaron;ifrov&aacute;n&iacute;</strong> zvolte typ &scaron;ifrov&aacute;n&iacute; připojen&iacute; LDAP k&nbsp;serveru LDAP.</li><img src="about:blank" class="help_image" /><li>Do pole <strong>Base DN</strong> zadejte hodnotu Base DN serveru LDAP.</li><img src="about:blank" class="help_image" /><li>Podle toho, jak&yacute; m&aacute;te server LDAP, vyberte patřičn&yacute; <strong>Profil</strong>. Např&iacute;klad pokud použ&iacute;v&aacute;te servery Synology LDAP Server nebo Mac Open Directory, zvolte možnost <strong>Standardn&iacute;</strong>.</li><img src="about:blank" class="help_image" /><li>Pokud chcete uživatelům serveru LDAP, kter&yacute; nepodporuje sch&eacute;ma Samba, povolit př&iacute;stup k&nbsp;souborům zař&iacute;zen&iacute; Synology NAS prostřednictv&iacute;m syst&eacute;mu CIFS, za&scaron;krtněte možnost <strong>Povolit ověřen&iacute; hesla CIFS pomoc&iacute; prost&eacute;ho textu</strong>. V&nbsp;č&aacute;sti n&iacute;že se nach&aacute;z&iacute; postup, jak zajistit, aby uživatel&eacute; LDAP mohli sv&eacute; poč&iacute;tače použ&iacute;vat k&nbsp;&uacute;spě&scaron;n&eacute;mu př&iacute;stupu k&nbsp;souborům na zař&iacute;zen&iacute; Synology NAS prostřednictv&iacute;m syst&eacute;mu CIFS.</li><img src="about:blank" class="help_image" /><li>Klikněte na možnost <strong>Použ&iacute;t</strong>.</li>
	<li>Zadejte do př&iacute;slu&scaron;n&yacute;ch hodnotu Bind DN (nebo &uacute;čet spr&aacute;vce LDAP) a&nbsp;heslo a&nbsp;pot&eacute; klikněte na možnost <strong>OK</strong>.</li><img src="about:blank" class="help_image" /></ol>

<div class="section">

<h4>O podpoře syst&eacute;mu CIFS a nastaven&iacute; klientsk&yacute;ch poč&iacute;tačů</h4>
<p>Po povolen&iacute; ověřen&iacute; hesla CIFS pomoc&iacute; prost&eacute;ho textu bude možn&aacute; nutn&eacute;, aby uživatel&eacute; LDAP upravili nastaven&iacute; sv&yacute;ch poč&iacute;tačů tak, aby mohli m&iacute;t př&iacute;stup k&nbsp;souborům v&nbsp;zař&iacute;zen&iacute; Synology NAS prostřednictv&iacute;m syst&eacute;mu CIFS:</p>
<ul>
	<li>Pokud se zař&iacute;zen&iacute; Synology NAS připoj&iacute; k&nbsp;adres&aacute;řov&eacute; službě poskytovan&eacute; serverem Synology LDAP (nebo jin&yacute;m zař&iacute;zen&iacute;m Synology NAS, kter&eacute; m&aacute; nainstalovan&yacute; a spu&scaron;těn&yacute; bal&iacute;ček <strong>LDAP Server</strong>), nebo serverem LDAP podporuj&iacute;c&iacute;m sch&eacute;ma Samba, a v&scaron;ichni uživatel&eacute; LDAP maj&iacute; spr&aacute;vn&eacute; atributy sambaNTPassword, z&iacute;skaj&iacute; uživatel&eacute; LDAP př&iacute;stup k&nbsp;souborům zař&iacute;zen&iacute; Synology NAS prostřednictv&iacute;m syst&eacute;mu CIFS, aniž by bylo nutn&eacute; za&scaron;krtnout možnost <strong>Povolit ověřen&iacute; hesla CIFS pomoc&iacute; prost&eacute;ho textu</strong> nebo upravovat nastaven&iacute; jejich poč&iacute;tačů. Jinak budou uživatel&eacute; LDAP muset na sv&yacute;ch poč&iacute;tač&iacute;ch povolit podporu <a href="http://en.wikipedia.org/wiki/Pluggable_Authentication_Modules" target="_blank">PAM</a>, aby měli k&nbsp;souborům v&nbsp;zař&iacute;zen&iacute; Synology NAS př&iacute;stup prostřednictv&iacute;m syst&eacute;mu CIFS. Povede to v&scaron;ak k&nbsp;přenosu hesla uživatelů LDAP na zař&iacute;zen&iacute; Synology NAS ve formě prost&eacute;ho textu (bez &scaron;ifrov&aacute;n&iacute;), č&iacute;mž se sn&iacute;ž&iacute; &uacute;roveň zabezpečen&iacute;.</li>
</ul>

<h4>&Uacute;prava nastaven&iacute; syst&eacute;mu Windows:</h4>
<ol>
	<li>Přejděte k&nbsp;možnosti <strong>Start</strong> &gt; <strong>Spustit</strong>, zadejte do pole text <strong>regedit</strong> a potom kliknut&iacute;m na tlač&iacute;tko <strong>OK</strong> otevřete Editor registru.</li>
	<li>Podle verze syst&eacute;mu Windows najděte nebo vytvořte n&aacute;sleduj&iacute;c&iacute; registr:<ul>
			<li><strong>Windows 2000, XP, Vista a Windows 7:</strong><br />[HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\LanmanWorkStation\Parameters]</li>
			<li><strong>Windows NT:</strong><br />[HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\Rdr\Parameters]</li>
			<li><strong>Windows 95 (SP1), 98 a Me:</strong><br />[HKEY_LOCAL_MACHINE\System\CurrentControlSet\Services\VxD\VNETSUP]</li>
		</ul>
	</li>
	<li>Vytvořte nebo upravte hodnotu DWORD <strong>EnablePlainTextPassword</strong> a změňte jej&iacute; hodnotu z&nbsp;<strong>0</strong> na <strong>1</strong>.</li>
	<li>Aby se změna uplatnila, je nutn&eacute; syst&eacute;m Windows restartovat.</li>
</ol>

<h4>&Uacute;prava nastaven&iacute; syst&eacute;mu Mac&nbsp;OS&nbsp;X:</h4>
<ol>
	<li>Přejděte do č&aacute;sti <strong>Applicatons</strong> (Aplikace) &gt; <strong>Utilities</strong> (N&aacute;stroje) a otevřete č&aacute;st <strong>Terminal</strong>.</li>
	<li>Vytvořte pr&aacute;zdn&yacute; soubor <strong>/etc/nsmb.conf</strong>:<pre>sudo touch /etc/nsmb.conf</pre></li>
	<li>Otevřete soubor <strong>/etc/nsmb.conf</strong> pomoc&iacute; editoru vi:<pre>sudo vi /etc/nsmb.conf</pre></li>
	<li>Stiskněte kl&aacute;vesu &bdquo;<strong>i</strong>&ldquo;, abyste mohli zad&aacute;vat text, a vložte n&aacute;sleduj&iacute;c&iacute; text:<pre>[default]<br />&gt;minauth=none</pre></li>
	<li>Stiskněte kl&aacute;vesu Esc a potom zadejte &bdquo;<strong>ZZ</strong>&ldquo; (velk&yacute;mi p&iacute;smeny), t&iacute;m změny ulož&iacute;te a editor vi ukonč&iacute;te.</li>
</ol>

<h4>&Uacute;prava nastaven&iacute; syst&eacute;mu Linux:</h4>
<p>Pokud použ&iacute;v&aacute;te klienta <strong>smbclient</strong>, doplňte do odd&iacute;lu <strong>[global]</strong> souboru <strong>smb.conf</strong> n&aacute;sleduj&iacute;c&iacute; kl&iacute;če:<p style="font-family:sans; margin-top:0px; padding-left:20px;line-height:1.25em;">encrypt passwords = no <br /> client plaintext auth = yes <br /> client lanman auth = yes <br /> client ntlmv2 auth = no</p>
	<p>Pokud použ&iacute;v&aacute;te soubor <strong>mount.cifs</strong>, spusťte n&aacute;sleduj&iacute;c&iacute; př&iacute;kaz:</strong>
	<p style="font-family:sans; margin-top:0px; padding-left:20px;line-height:1.25em;">echo 0x30030 &gt; /proc/fs/cifs/SecurityFlags</p>
	<p>Dal&scaron;&iacute; informace se nach&aacute;zej&iacute; na adrese <a href="https://www.kernel.org/doc/readme/Documentation-filesystems-cifs-README" target=_blank>https://www.kernel.org/doc/readme/Documentation-filesystems-cifs-README</a></p>
</p>
</div>

<div class="section"><h4>O profilech</h4>
<p>Různ&eacute; servery LDAP mohou použ&iacute;vat pro n&aacute;zvy &uacute;čtů, pro n&aacute;zvy skupin nebo k&nbsp;rozli&scaron;en&iacute; &uacute;čtů a skupin různ&eacute; atributy. Možnost <strong>Profil</strong> umožňuje stanovit či upravit, jak se informace o uživateli a skupině vůči atributům LDAP mapuje. Podle toho, jak&yacute; m&aacute;te server LDAP, je možn&eacute; vybrat jeden z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch profilů:</p>
<ul>
	<li><strong>Standardn&iacute;:</strong> U serverů se spu&scaron;těn&yacute;mi službami Synology LDAP Server nebo Mac Open Directory.</li>
	<li><strong>IBM Lotus Domino:</strong> U serverů se spu&scaron;těnou službou IBM Lotus Domino 8.5.</li>
	<li><strong>Vlastn&iacute;:</strong> Umožňuje upravit mapov&aacute;n&iacute;. Podrobnosti se nach&aacute;zej&iacute; v&nbsp;n&aacute;sleduj&iacute;c&iacute; č&aacute;sti.</li>
</ul>

<p>Před &uacute;pravou mapov&aacute;n&iacute; atributů LDAP budete potřebovat určit&eacute; znalosti pozad&iacute;. Syst&eacute;m Synology DSM a editor <strong>profilů</strong> oba splňuj&iacute; normu RFC 2307. Např&iacute;klad je možn&eacute; jako hodnotu <strong>userFilter</strong> stanovit <strong>filter</strong> &gt; <strong>passwd</strong>, takže zař&iacute;zen&iacute; Synology NAS bude z&aacute;znamy s&nbsp;v&yacute;razem <strong>objectClass=userFilter</strong> na serveru LDAP interpretovat jako &uacute;čty LDAP. Pokud jako hodnotu <strong>username</strong> nastav&iacute;te v&yacute;raz <strong>passwd</strong> &gt; <strong>uid</strong>, bude zař&iacute;zen&iacute; Synology NAS interpretovat proměnnou <strong>username</strong> na serveru LDAP jako n&aacute;zev &uacute;čtu. Pokud zanech&aacute;te mapov&aacute;n&iacute; pr&aacute;zdn&eacute;, použij&iacute; se pravidla RFC 2307.</p>
<p>Zař&iacute;zen&iacute; Synology NAS vyžaduje, aby jako identifik&aacute;tor &uacute;čtu LDAP (<strong>uidNumber</strong>) nebo identifik&aacute;tor skupiny (<strong>gidNumber</strong>) sloužilo fixn&iacute; cel&eacute; č&iacute;slo. Ne v&scaron;echny servery LDAP v&scaron;ak použ&iacute;vaj&iacute; k&nbsp;reprezentaci takov&yacute;chto atributů cel&aacute; č&iacute;sla. Proto se kvůli převodu takov&yacute;chto atributů na cel&aacute; č&iacute;sla použ&iacute;v&aacute; kl&iacute;čov&eacute; slovo <strong>HASH()</strong>. Např&iacute;klad server LDAP může jako jedinečn&yacute; identifik&aacute;tor &uacute;čtu LDAP využ&iacute;vat atribut <strong>userid</strong> s&nbsp;&scaron;estn&aacute;ctkovou hodnotou. V&nbsp;tomto př&iacute;padě je možn&eacute; nastavit v&yacute;raz <strong>passwd</strong> &gt; <strong>uidNumber</strong> na hodnotu <strong>HASH(userid)</strong>. Zař&iacute;zen&iacute; Synology NAS ho pot&eacute; převede na cel&eacute; č&iacute;slo.</p>
<p>N&aacute;sleduje shrnut&iacute; upraviteln&yacute;ch atributů:</p>
<ul>
	<li><strong>filter</strong><ul>
			<li><strong>group</strong>: vyž&aacute;d&aacute; hodnotu objectClass pro skupinu.</li>
			<li><strong>passwd</strong>: vyž&aacute;d&aacute; hodnotu objectClass pro uživatele.</li>
			<li><strong>shadow</strong>: vyž&aacute;d&aacute; hodnotu objectClass pro hesla uživatelů.</li>
		</ul>
	</li>
	<li><strong>group</strong><ul>
			<li><strong>cn</strong>: n&aacute;zev skupiny.</li>
			<li><strong>gidNumber</strong>: č&iacute;slo GID t&eacute;to skupiny.</li>
			<li><strong>memberUid</strong>: členov&eacute; t&eacute;to skupiny.</li>
		</ul>
	</li>
	<li><strong>passwd</strong><ul>
			<li><strong>uidNumber</strong>: č&iacute;slo UID tohoto uživatele.</li>
			<li><strong>uid</strong>: jm&eacute;no uživatele.</li>
			<li><strong>gidNumber</strong>: prim&aacute;rn&iacute; č&iacute;slo GID tohoto uživatele.</li>
		</ul>
	</li>
	<li><strong>shadow</strong><ul>
			<li><strong>uid</strong>: jm&eacute;no uživatele.</li>
			<li><strong>userPassword</strong>: heslo uživatele.</li>
		</ul>
	</li>
</ul>
</div>

<div class="section"><h4>O posunu UID/GID</h4>
<p>Aby nedoch&aacute;zelo ke konfliktům UID/GID mezi uživateli/skupinami LDAP a m&iacute;stn&iacute;mi uživateli/skupinami, je možn&eacute; povolit posun UID/GID uživatelů/skupin LDAP o 1000000. Tato možnost je určena pouze pro jin&eacute; servery LDAP než Synology a m&aacute; jedinečn&yacute; č&iacute;seln&yacute; atribut ID pro každ&eacute;ho uživatele/skupinu.</p>
</div>

<div class="section"><h4>O&nbsp;roz&scaron;&iacute;řen&iacute; vnořen&yacute;ch skupin</h4>
<p>Ve vnořen&eacute; skupině patř&iacute; člen skupiny LDAP do jin&eacute; skupiny LDAP představuj&iacute;c&iacute; hierarchii organizace. Když uživatel&eacute; vyhled&aacute;vaj&iacute;, do kter&eacute; skupiny patř&iacute; určit&yacute; člen, nebo vyhled&aacute;vaj&iacute; seznam jmen v&nbsp;určit&eacute; skupině, provede zař&iacute;zen&iacute; Synology NAS rozbalen&iacute; vnořen&eacute; skupiny podle atributů <strong>člen</strong> skupiny LDAP, kde se na rozli&scaron;uj&iacute;c&iacute; n&aacute;zev (DN) podř&iacute;zen&eacute; skupiny odkazuje t&iacute;mto atributem. Rozbalen&iacute; vnořen&eacute; skupiny může b&yacute;t za určit&yacute;ch okolnost&iacute; časově velice n&aacute;ročn&eacute;, např&iacute;klad v&nbsp;situaci, kdy server neindexuje atribut <strong>člen</strong> nebo je skupina hluboce vnořen&aacute;. Aby k&nbsp;tomu nedoch&aacute;zelo, můžete se rozhodnout vnořenou skupinu nerozbalovat.</p>
</div>


<div class="section" ><h4>Informace o&nbsp;certifik&aacute;tech klienta</h4>
<p>Podporujeme použ&iacute;v&aacute;n&iacute; certifik&aacute;tu klienta. Někter&eacute; specifick&eacute; servery LDAP, např&iacute;klad Google LDAP, použ&iacute;vaj&iacute; certifik&aacute;ty k&nbsp;ověřov&aacute;n&iacute; klientů. Po za&scaron;krtnut&iacute; možnosti <strong>Povolit certifik&aacute;t klienta</strong> můžete certifik&aacute;t klienta odeslat.</p>
<h4>Pozn&aacute;mka:</h4>
<p>Tato funkce je podporov&aacute;na v&nbsp;syst&eacute;mu DSM 6.2.2 a nověj&scaron;&iacute;ch verz&iacute;ch.</p>
</div>


</body>
</html>
