<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" charset="utf-8">

<title>Group</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>&Uacute;prava skupiny</h2>
<p>Můžete upravit informace o&nbsp;skupině a&nbsp;př&iacute;stupov&aacute; opr&aacute;vněn&iacute; ke sd&iacute;len&yacute;m složk&aacute;m.</p>
<h4>Postup &uacute;pravy informac&iacute; o&nbsp;skupině:</h4>
<ol>
<li>Vyberte skupinu, kterou chcete upravit.</li>
<li>Klikněte na možnost <b>Upravit</b> a&nbsp;upravte informace o&nbsp;skupině.</li>
<li>Postup dokonč&iacute;te kliknut&iacute;m na možnost <b>OK</b>.</li>
</ol>
<h4>Postup &uacute;pravy př&iacute;stupov&yacute;ch pr&aacute;v skupiny ke sd&iacute;len&yacute;m složk&aacute;m:</h4>
<ol>
<li>Vyberte skupinu, kterou chcete upravit.</li>
<li>Klikněte na možnost <b>Upravit</b> a&nbsp;<b>Opr&aacute;vněn&iacute;</b>.</li>
<li>Za&scaron;krtněte nebo zru&scaron;te za&scaron;krtnut&iacute; n&aacute;sleduj&iacute;c&iacute;ch opr&aacute;vněn&iacute; a&nbsp;zadejte př&iacute;stupov&aacute; opr&aacute;vněn&iacute; skupiny:</li>
<ol>
<li><b>Čten&iacute;/z&aacute;pis</b>: Skupina může přistupovat ke sd&iacute;len&eacute; složce a prov&aacute;dět v&nbsp;n&iacute; změny.</li>
<li><b>Jen pro čten&iacute;</b>: Skupina může přistupovat ke sd&iacute;len&eacute; složce, ale nemůže v&nbsp;n&iacute; prov&aacute;dět změny.</li>
<li><b>Ž&aacute;dn&yacute; př&iacute;stup</b>: Skupina nemůže přistupovat ke sd&iacute;len&eacute; složce.</li>
</ol>
<li>Postup dokonč&iacute;te kliknut&iacute;m na možnost <b>OK</b>.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>V&nbsp;př&iacute;padě konfliktu opr&aacute;vněn&iacute; je priorita opr&aacute;vněn&iacute; n&aacute;sleduj&iacute;c&iacute;: Ž&aacute;dn&yacute; př&iacute;stup &gt; Čten&iacute;/z&aacute;pis &gt; Jen pro čten&iacute;.</p>
</div>


<h4>&Uacute;prava kv&oacute;ty použ&iacute;v&aacute;n&iacute; skupiny:</h4>
<ol>
<li>Vyberte skupinu, kterou chcete upravit.</li>
<li>Přejděte do č&aacute;sti <strong>Upravit</strong> a&nbsp;přejděte na kartu <strong>Kv&oacute;ta</strong>.</li>
<li>U&nbsp;každ&eacute;ho svazku/sd&iacute;len&eacute; složky za&scaron;krtněte pol&iacute;čko pod možnost&iacute; <strong>Povolit kv&oacute;tu</strong>. Do pole <strong>Kv&oacute;ta</strong> pot&eacute; zadejte kv&oacute;tu použ&iacute;v&aacute;n&iacute; (např. 10 GB).</li>
</ol>
<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Každ&yacute; člen skupiny přeb&iacute;r&aacute; stanovenou kv&oacute;tu použ&iacute;v&aacute;n&iacute; skupiny. Kv&oacute;ta použ&iacute;v&aacute;n&iacute; skupiny nen&iacute; sd&iacute;lena mezi v&scaron;emi členy skupiny (nevztahuje se na zař&iacute;zen&iacute; EDS14 a DDSM).</li>
<li>Maxim&aacute;ln&iacute; kv&oacute;ta využit&iacute; &uacute;loži&scaron;tě, kterou lze zadat pro jednotliv&eacute; skupiny, čin&iacute; přibližně 4&nbsp;TB (4095&nbsp;GB).</li>
	<li>&Uacute;pravy kv&oacute;ty použ&iacute;v&aacute;n&iacute; skupiny prostřednictv&iacute;m sd&iacute;len&eacute; složky podporuje pouze zař&iacute;zen&iacute; VDSM a modely s&nbsp;n&aacute;sleduj&iacute;c&iacute;mi architekturami bal&iacute;čků: Apollo Lake, Avoton, Braswell, Broadwell, Bromolow, Cedarview a Grantley. Architekturu bal&iacute;čku podporovanou va&scaron;&iacute;m modelem zjist&iacute;te v&nbsp;<a href="https://www.synology.com/en-us/knowledgebase/DSM/tutorial/General/What_kind_of_CPU_does_my_NAS_have" target="_blank">tomto čl&aacute;nku</a>.</li>
<li>Syst&eacute;m DDSM tuto funkci nepodporuje.</li>
</ul>
</div>


<h4>Postup &uacute;pravy př&iacute;stupov&yacute;ch opr&aacute;vněn&iacute; skupiny k&nbsp;aplikac&iacute;m:</h4>
<ol>
<li>Vyberte skupinu, kterou chcete upravit.</li>
<li>Přejděte do č&aacute;sti <b>Upravit</b> a&nbsp;přejděte na kartu <strong>Aplikace</strong>.</li>
<li>Pro jednotliv&eacute; služby můžete vybrat jednu z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;:<ul>
<li><strong>Povolit:</strong> Skupina bude m&iacute;t př&iacute;stup k&nbsp;aplikaci.</li>
<li><strong>Zak&aacute;zat:</strong> Skupina nebude m&iacute;t k&nbsp;aplikaci ž&aacute;dn&yacute; př&iacute;stup.</li>
<li><strong>Vlastn&iacute;:</strong> Prov&aacute;dějte spr&aacute;vu opr&aacute;vněn&iacute; př&iacute;stupu podle IP&nbsp;adresy.</li>
</ul>
</li>
<li>Postup dokonč&iacute;te kliknut&iacute;m na možnost <b>OK</b>.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>V&nbsp;př&iacute;padě konfliktu opr&aacute;vněn&iacute; je priorita opr&aacute;vněn&iacute; n&aacute;sleduj&iacute;c&iacute;: Zak&aacute;zat &gt; Povolit.</li>
<li>Ne v&scaron;echny bal&iacute;čky a&nbsp;služby podporuj&iacute; nastaven&iacute; opr&aacute;vněn&iacute; př&iacute;stupu <strong>Podle IP</strong>.</li>
</ul>
</div>

<h4>&Uacute;prava omezen&iacute; rychlosti skupiny:</h4>
<p>Povolen&iacute;m omezen&iacute; rychlosti skupiny pro různ&eacute; služby (např. File&nbsp;Station, FTP atd.) můžete omezit zat&iacute;žen&iacute; &scaron;&iacute;řky p&aacute;sma, kter&eacute; využ&iacute;vaj&iacute; členov&eacute; skupiny při přenosu souborů prostřednictv&iacute;m jednotliv&yacute;ch služeb. Jednotliv&aacute; omezen&iacute; rychlosti sd&iacute;lej&iacute; v&scaron;ichni členov&eacute; skupiny.</p>
<ol>
<li>Vyberte skupinu, kterou chcete upravit.</li>
<li>Klikněte na možnost <b>Upravit</b> a&nbsp;přejděte na kartu <strong>Omezen&iacute; rychlosti</strong>.</li>
<li>Pro jednotliv&eacute; služby můžete vybrat jednu z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;:<ul>
<li><strong>Ž&aacute;dn&yacute;:</strong> Při přenosu souborů pomoc&iacute; t&eacute;to služby nebude uplatněno ž&aacute;dn&eacute; omezen&iacute; rychlosti.</li>  
<li><strong>Nastavit omezen&iacute; rychlosti:</strong> Na členy skupiny se uplatn&iacute; fixn&iacute;, konstantn&iacute; omezen&iacute; rychlosti. Omezen&iacute; rychlosti odes&iacute;l&aacute;n&iacute; a&nbsp;stahov&aacute;n&iacute; lze stanovit v&nbsp;pol&iacute;ch vlevo.</li>
<li><strong>Přizpůsobit rozsah omezen&iacute;:</strong> Pro členy skupiny lze zadat a&nbsp;uplatnit dva typy omezen&iacute; rychlosti podle pl&aacute;nu. Kliknut&iacute;m na tlač&iacute;tko <strong>Nastavit</strong> nastaven&iacute; omezen&iacute; rychlosti a&nbsp;pl&aacute;n změn&iacute;te.</li>  
</ul>
</li>
<li>Postup dokonč&iacute;te kliknut&iacute;m na možnost <b>OK</b>.</li>
</ol>

<div class="section">
<h4>Omezen&iacute; rychlosti uživatelů z&nbsp;různ&yacute;ch skupin</h4>

<p>Pokud je uživatel souč&aacute;st&iacute; různ&yacute;ch skupin, je omezen&iacute; rychlosti podm&iacute;něno skupinou s&nbsp;největ&scaron;&iacute; &scaron;&iacute;řkou p&aacute;sma při přenosu souborů. Z&nbsp;důvodu rovnoměrn&eacute;ho rozdělen&iacute; &scaron;&iacute;řky p&aacute;sma mezi uživateli, kteř&iacute; nyn&iacute; prov&aacute;d&iacute; přenos souborů, jsou změny &scaron;&iacute;řky p&aacute;sma prov&aacute;děny v&nbsp;z&aacute;vislosti na tom, kolik uživatelů aktu&aacute;lně využ&iacute;v&aacute; sd&iacute;lenou &scaron;&iacute;řku p&aacute;sma skupiny.</p>

<p>Uživatel &bdquo;John&ldquo; může b&yacute;t např&iacute;klad členem skupiny &bdquo;Group&nbsp;1&ldquo; (omezen&iacute; rychlosti 500&nbsp;kB/s; celkem pět uživatelů) a&nbsp;skupiny &bdquo;Group&nbsp;2&ldquo; (omezen&iacute; rychlosti 400&nbsp;kB/s; celkem dva uživatel&eacute;).</p>
<ul>
<li>Pokud uživatel&eacute; skupiny Group&nbsp;1 a&nbsp;Group&nbsp;2 prov&aacute;d&iacute; ve stejnou dobu přenos souborů, bude omezen&iacute; rychlosti uživatele John stanoveno hodnotou 200&nbsp;kB/s a&nbsp;využit&iacute; &scaron;&iacute;řky p&aacute;sma bude připočteno ke kv&oacute;tě &scaron;&iacute;řky p&aacute;sma skupiny Group&nbsp;2.</li>
<li>Jakmile ostatn&iacute; uživatel&eacute; skupiny Group&nbsp;1 dokonč&iacute; přenos souborů, bude omezen&iacute; rychlosti uživatele John změněno na hodnotu 500&nbsp;kB/s a&nbsp;využit&iacute; &scaron;&iacute;řky p&aacute;sma bude připočteno ke kv&oacute;tě &scaron;&iacute;řky p&aacute;sma skupiny Group&nbsp;1.</li>
</ul>
</div>


</body>
</html>
