<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Služby z&aacute;lohov&aacute;n&iacute;&nbsp;&ndash; N&aacute;pověda Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Allow other users to back up data from their Synology NAS or rsync-compatible clients to your Synology NAS.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Rsync</h2>

<p>Je možn&eacute; povolit, aby jin&iacute; uživatel&eacute; z&aacute;lohovali data ze zař&iacute;zen&iacute; Synology NAS nebo klientů kompatibiln&iacute;ch se službou rsync do va&scaron;eho zař&iacute;zen&iacute; Synology NAS prostřednictv&iacute;m služby rsync.</p>

<h3>Povolen&iacute; služby z&aacute;lohov&aacute;n&iacute; rsync</h3>

<h4>Povolen&iacute; služby rsync:</h4>

<p>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Souborov&eacute; služby</strong> &gt; <strong>rsync</strong> a vyberte možnost <strong>Povolit službu rsync</strong>.</p>


<h4>Přiřazen&iacute; opr&aacute;vněn&iacute; z&aacute;lohov&aacute;n&iacute; rsync:</h4>


<p>Přidělte uživatelům vhodn&aacute; opr&aacute;vněn&iacute; pro službu rsync, aby mohli data ze zdrojov&eacute;ho zař&iacute;zen&iacute; Synology NAS nebo serveru kompatibiln&iacute;ho se službou rsync z&aacute;lohovat do c&iacute;lov&eacute;ho zař&iacute;zen&iacute; Synology NAS.</p>

<ol>
<li>Přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>Opr&aacute;vněn&iacute;</b>.</li>
<li>Vyberte možnost <strong>rsync (synchronizace sd&iacute;len&yacute;ch složek, z&aacute;loha jednotky LUN na podporovan&yacute;ch modelech)</strong> a kliknut&iacute;m na možnost <strong>Upravit</strong> přiřaďte opr&aacute;vněn&iacute;.</li>
<li>Přiřaďte požadovan&yacute;m uživatelům (uživatelům syst&eacute;mu DSM pro &scaron;ifrovanou službu rsync nebo &uacute;čtům rsync pro ne&scaron;ifrovanou službu rsync) opr&aacute;vněn&iacute; <strong>Povolit</strong> nebo zadejte povolen&eacute; IP adresy pro určit&eacute; uživatele.</li>
</ol>



<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Chcete-li prov&eacute;st z&aacute;lohu rsync ze zař&iacute;zen&iacute; Synology NAS s&nbsp;verz&iacute; syst&eacute;mu DSM niž&scaron;&iacute; než 3.0 nebo z&nbsp;klienta, kter&yacute; nen&iacute; zař&iacute;zen&iacute;m Synology NAS, a chcete zachovat informace <b>majitel</b> a <b>skupina</b> obsažen&eacute; ve zdrojov&yacute;ch datech, mus&iacute;te přidat &uacute;čty rsync do skupiny <b>administrators</b> a z&aacute;lohovat data do sd&iacute;len&eacute; složky <b>NetBackup</b> v&nbsp;režimu daemon.</p>
</div>

<h3>Povolen&iacute; &uacute;čtů rsync</h3>
<p>Prov&aacute;d&iacute;te-li z&aacute;lohov&aacute;n&iacute; rsync z&nbsp;klienta, kter&yacute; nen&iacute; zař&iacute;zen&iacute;m Synology NAS, mus&iacute;te v&nbsp;c&iacute;lov&eacute;m zař&iacute;zen&iacute; Synology NAS vytvořit &uacute;čty rsync, kter&eacute; umožn&iacute; uživatelům služby rsync z&aacute;lohovat data do va&scaron;eho zař&iacute;zen&iacute; Synology NAS.</p>

<h4>Povolen&iacute; &uacute;čtů rsync:</h4>
<ol>
<li>Přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>Souborov&eacute; služby</b> &gt; <strong>rsync</strong> a vyberte možnost <b>Povolit &uacute;čet rsync</b>.</li>
<li>Klikněte na možnost <b>Upravit &uacute;čet rsync</b> a nastavte uživatele a odpov&iacute;daj&iacute;c&iacute; hesla pro ověřov&aacute;n&iacute;.</li>
<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Pokud je služba rsync &scaron;ifrovan&aacute; (to znamen&aacute;, že m&aacute; zadan&yacute; port &scaron;ifrov&aacute;n&iacute; SSH), použije syst&eacute;m jako &uacute;čty rsync automaticky uživatelsk&aacute; jm&eacute;na a hesla uživatelů syst&eacute;mu DSM.</li>
<li>Pokud služba rsync nen&iacute; &scaron;ifrovan&aacute;, mus&iacute;te pro ně vytvořit odpov&iacute;daj&iacute;c&iacute; &uacute;čty rsync.</li>
</ul>
</div>


<h3>Použit&iacute; vlastn&iacute; konfigurace rsync</h3>

<p>Na zař&iacute;zen&iacute; Synology NAS je možn&eacute; použ&iacute;t vlastn&iacute; konfiguraci rsync a&nbsp;nastavit uživatelsk&aacute; opr&aacute;vněn&iacute; a&nbsp;c&iacute;l z&aacute;lohov&aacute;n&iacute;. Do c&iacute;lov&yacute;ch sd&iacute;len&yacute;ch složek (neboli &bdquo;z&aacute;lohovac&iacute;ch modulů&ldquo;) va&scaron;eho zař&iacute;zen&iacute; Synology NAS tak mohou prov&aacute;dět z&aacute;lohov&aacute;n&iacute; rsync ze sv&yacute;ch zař&iacute;zen&iacute; Synology NAS nebo klientsk&yacute;ch zař&iacute;zen&iacute; kompatibiln&iacute;ch s&nbsp;n&aacute;strojem rsync i jin&iacute; lid&eacute;.</p>

<h4>Použit&iacute; vlastn&iacute; konfigurace rsync:</h4>

<ol>
<li>Přihlaste se ke sv&eacute;mu zař&iacute;zen&iacute; Synology NAS prostřednictv&iacute;m služeb Telnet nebo SSH.</li>
<li>Do konfiguračn&iacute;ho souboru rsync &bdquo;<b><code>/etc/rsyncd.conf</code></b>&ldquo; uveďte z&aacute;lohovac&iacute; modul a&nbsp;opr&aacute;vněn&eacute; uživatele. V&iacute;ce informac&iacute; z&iacute;sk&aacute;te na str&aacute;nce <b>rsyncd.conf</b> manu&aacute;lu va&scaron;eho klientsk&eacute;ho zař&iacute;zen&iacute; rsync nebo <a href="http://rsync.samba.org/ftp/rsync/rsyncd.conf.html" target="_blank">pod t&iacute;mto odkazem</a>.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Pokud z&aacute;lohovac&iacute; modul a sd&iacute;len&aacute; složka sd&iacute;lej&iacute; stejn&yacute; n&aacute;zev, použije se nastaven&iacute; z&aacute;lohovac&iacute;ho modulu.</p>
</div>


<h3>Povolen&iacute; omezen&iacute; rychlosti</h3>
<p>U uživatelů a skupin je možn&eacute; ř&iacute;dit maxim&aacute;ln&iacute; využitelnou &scaron;&iacute;řku p&aacute;sma z&aacute;lohov&aacute;n&iacute; rsync.</p>

<h4>Povolen&iacute; omezen&iacute; rychlosti:</h4>
<ol>
  <li>Přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>Souborov&eacute; služby</b> &gt; <strong>rsync</strong>. Vyberte některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;:<ul>
  <li><strong>Bez omezen&iacute; rychlosti</strong></li>
  <li><strong>Povolit omezen&iacute; rychlosti</strong></li>
  <li><strong>Povolit omezen&iacute; rychlosti podle pl&aacute;nu</strong> (Kliknut&iacute;m na možnost <strong>Nastavit pl&aacute;n</strong> je možn&eacute; prov&aacute;dět dal&scaron;&iacute; &uacute;pravy.)</li>
  </ul>
  
<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Jedn&aacute; se o nastaven&iacute; na straně serveru, kter&eacute; přep&iacute;&scaron;e nastaven&iacute; jednotliv&yacute;ch uživatelů a skupin. Např&iacute;klad volbou možnosti <strong>Bez omezen&iacute; rychlosti</strong> vypnete nastaven&iacute; omezen&iacute; rychlosti v&scaron;ech uživatelů a skupin.</p>
</div>
  </li>

  <li>Pokud jste povolili omezen&iacute; rychlosti, klikněte na možnost <strong>Nastaven&iacute; omezen&iacute; rychlosti</strong> a kliknut&iacute;m na požadovan&eacute;ho uživatele nebo skupinu změňte nastaven&iacute;:<ul>
       <li><strong>Ž&aacute;dn&aacute;</strong>: Při přenosu souborů členy skupiny pomoc&iacute; t&eacute;to služby se nebude uplatňovat ž&aacute;dn&eacute; omezen&iacute; rychlosti.</li>
      <li><strong>Použ&iacute;t nastaven&iacute; skupin</strong>: Uživatel bude sd&iacute;let stejn&eacute; nastaven&iacute; omezen&iacute; rychlosti s&nbsp;přidruženou skupinou.</li>
      <li><strong>Konstantn&iacute;</strong>: U uživatelů nebo členů skupiny se uplatn&iacute; pevn&eacute;, konstantn&iacute; omezen&iacute; rychlosti. Omezen&iacute; rychlosti odes&iacute;l&aacute;n&iacute; a&nbsp;stahov&aacute;n&iacute; lze stanovit v&nbsp;pol&iacute;ch vlevo.</li>
      <li><strong>Přizpůsobeno</strong>: U uživatelů nebo členů skupiny lze zadat a&nbsp;uplatnit dva různ&eacute; typy omezen&iacute; rychlosti podle pl&aacute;nu. Kliknut&iacute;m na možnost <strong>Nastavit</strong> změn&iacute;te nastaven&iacute; omezen&iacute; rychlosti a&nbsp;nastav&iacute;te pl&aacute;n.</li>
    </ul>
  </li>
 <li>Klikněte na možnost <b>Použ&iacute;t</b>.</li> 

</ol>
<div class="section">
  <h4>Pozn&aacute;mka:</h4>
    <p>V&nbsp;č&aacute;sti <strong>V&yacute;sledek (OD/ST)</strong> se nach&aacute;z&iacute; skutečn&yacute; limit odes&iacute;l&aacute;n&iacute; a stahov&aacute;n&iacute; dan&eacute;ho uživatele podle jeho nastaven&iacute; pro jednotlivce a pro skupinu. Pokud m&aacute; např&iacute;klad uživatel &bdquo;Achileus&ldquo; nastaveno individu&aacute;ln&iacute; omezen&iacute; stahov&aacute;n&iacute; na 100&nbsp;kB/s, ale patř&iacute; do uživatelsk&eacute; skupiny se stahov&aacute;n&iacute;m omezen&yacute;m na 500&nbsp;kB/s, zobraz&iacute; se v&nbsp;č&aacute;sti <strong>V&yacute;sledek (OD/ST)</strong> hodnota &bdquo;0/500&ldquo;.</p>
</div>

</body>
</html>
