<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<meta name="author" content="Synology Inc.">
<meta name="description" content="Enabling email notifications allows your Synology NAS to send messages to your email when specified events occur.">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>E-mail</h2>

<p>Povolen&iacute;m upozorněn&iacute; e-mailem umožn&iacute;te zař&iacute;zen&iacute; Synology NAS pos&iacute;lat zpr&aacute;vy na v&aacute;&scaron; e-mail, když nastanou specifick&eacute; ud&aacute;losti, např&iacute;klad chyby syst&eacute;mu, ztr&aacute;ta připojen&iacute; k&nbsp;s&iacute;ti, chov&aacute;n&iacute; ventil&aacute;toru, v&yacute;padek nap&aacute;jen&iacute; nebo selh&aacute;n&iacute; &uacute;lohy z&aacute;lohov&aacute;n&iacute;.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Ud&aacute;lost chov&aacute;n&iacute; ventil&aacute;toru nen&iacute; dostupn&aacute; u&nbsp;modelu bez ventil&aacute;toru, např&iacute;klad EDS14. Dal&scaron;&iacute; informace se nach&aacute;zej&iacute; na <a href="https://www.synology.com/" target="_blank">webov&yacute;ch str&aacute;nk&aacute;ch Synology</a>.</li>
</ul>
</div>

<h4>Povolen&iacute; e-mailov&yacute;ch upozorněn&iacute;:</h4>
<ol>
	<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Upozorněn&iacute;</strong> &gt; <strong>E-mail</strong>.</li>
	<li>Za&scaron;krtněte pol&iacute;čko <strong>Povolit e-mailov&aacute; upozorněn&iacute;</strong>.</li>
	<li>Do pole <strong>E-mailov&aacute; adresa př&iacute;jemce</strong> zadejte jednu nebo v&iacute;ce e-mailov&yacute;ch adres. Upozorněn&iacute; syst&eacute;mu se budou zas&iacute;lat na zde zadan&eacute; adresy. Jsou povoleny dvě adresy. V&iacute;ce adres můžete oddělit středn&iacute;kem (;).</li>
	<li>V&nbsp;př&iacute;padě potřeby můžete v&nbsp;poli <strong>Předpona předmětu</strong> zadat předponu předmětu. Tato předpona bude přid&aacute;na do předmětu každ&eacute; zpr&aacute;vy odeslan&eacute; ze zař&iacute;zen&iacute; Synology NAS a&nbsp;umožn&iacute; v&aacute;m tak rozpoznat a&nbsp;vyfiltrovat zpr&aacute;vy.</li>
	<li>Chcete-li k&nbsp;přen&aacute;&scaron;en&iacute; zpr&aacute;v použ&iacute;vat e-mailov&yacute; server třet&iacute; strany (např. Gmail nebo Outlook), pod&iacute;vejte se n&iacute;že do č&aacute;sti &bdquo;e-mailov&aacute; služba třet&iacute; strany&ldquo;. Chcete-li použ&iacute;vat vlastn&iacute; server, přejděte do č&aacute;sti &bdquo;vlastn&iacute; server SMTP&ldquo;.</li>
</ol>

<h4>Použ&iacute;v&aacute;n&iacute; e-mailov&eacute; služby třet&iacute; strany:</h4>
<ol>
	<li>V&nbsp;nab&iacute;dce <strong>Poskytovatel služeb</strong> vyberte e-mailovou službu třet&iacute; strany, např&iacute;klad Gmail nebo Outlook.</li>
	<li>Zadejte sv&eacute; uživatelsk&eacute; jm&eacute;no a heslo ve vybran&eacute; e-mailov&eacute; službě.</li>
	<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <strong>Použ&iacute;t</strong>.</li>
	<li>Kliknut&iacute;m na možnost <strong>Poslat zku&scaron;ebn&iacute; e-mail</strong> můžete zkontrolovat spr&aacute;vnost sv&yacute;ch nastaven&iacute;.</li>
</ol>

<h4>Použ&iacute;v&aacute;n&iacute; vlastn&iacute;ho serveru SMTP:</h4>
<ol>
	<li>V&nbsp;nab&iacute;dce <strong>Poskytovatel služeb</strong> vyberte možnost <strong>Vlastn&iacute; server SMTP</strong>.</li>
	<li>Do pole <strong>Server SMTP</strong> zadejte n&aacute;zev nebo IP adresu serveru SMTP.</li>
	<li>Do pole <strong>Port SMTP</strong> zadejte č&iacute;slo portu SMTP. (Pokud jste při nastaven&iacute; pravidel před&aacute;v&aacute;n&iacute; portů nastavili jin&yacute; port SMTP, zadejte toto č&iacute;slo.)</li>
	<li>Pokud v&aacute;&scaron; server SMTP vyžaduje ověřen&iacute;, za&scaron;krtněte možnost <strong>Je požadov&aacute;no ověřen&iacute;</strong> a zadejte <strong>Uživatelsk&eacute; jm&eacute;no</strong> a <strong>Heslo</strong> na e-mailov&eacute;m serveru.</li>
	<li>Pokud server SMTP vyžaduje připojen&iacute; SSL/TLS, za&scaron;krtněte možnost <strong>Je vyžadov&aacute;no zabezpečen&eacute; připojen&iacute; (SSL/TLS)</strong>.</li>
	<li>Chcete-li přizpůsobit jm&eacute;no odes&iacute;latele uveden&eacute; v&nbsp;e-mailov&yacute;ch zpr&aacute;v&aacute;ch odeslan&yacute;ch zař&iacute;zen&iacute;m Synology NAS, zadejte jm&eacute;no do pole <strong>Jm&eacute;no odes&iacute;latele</strong>. Chcete-li přizpůsobit e-mailovou adresu odes&iacute;latele, zadejte e-mailovou adresu do pole <strong>E-mail odes&iacute;latele</strong>. Pokud zůstane toto pole pr&aacute;zdn&eacute;, použije se prvn&iacute; e-mailov&aacute; adresa z&nbsp;pole <strong>E-mailov&aacute; adresa př&iacute;jemce</strong>.</li>
	<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <strong>Použ&iacute;t</strong>.</li>
	<li>Kliknut&iacute;m na možnost <strong>Poslat zku&scaron;ebn&iacute; e-mail</strong> můžete zkontrolovat spr&aacute;vnost sv&yacute;ch nastaven&iacute;.</li>
</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Chcete-li pos&iacute;lat uv&iacute;tac&iacute; zpr&aacute;vu každ&eacute;mu nově vytvořen&eacute;mu uživatelsk&eacute;mu &uacute;čtu, za&scaron;krtněte možnost <strong>Odeslat uv&iacute;tac&iacute; zpr&aacute;vu nov&yacute;m uživatelům</strong> a každ&yacute; uživatel při vytvořen&iacute; &uacute;čtu obdrž&iacute; uv&iacute;tac&iacute; zpr&aacute;vu.</li>
	<li>Jazyk pro upozorněn&iacute; e-mailem lze nastavit v&nbsp;č&aacute;sti <strong>Jazyk ozn&aacute;men&iacute;</strong>. Pokud chcete změnit jazyk upozorněn&iacute; e-mailem, přejděte do č&aacute;sti <strong>Hlavn&iacute; nab&iacute;dka</strong> &gt; <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>M&iacute;stn&iacute; nastaven&iacute;</strong>, klikněte na kartu <strong>Jazyk</strong> a&nbsp;vyberte preferovan&yacute; jazyk z&nbsp;rozev&iacute;rac&iacute; nab&iacute;dky v&nbsp;č&aacute;sti <strong>Jazyk ozn&aacute;men&iacute;</strong>.</li>
	<li>Použ&iacute;v&aacute;te-li server SMTP syst&eacute;mu Gmail a povolili jste dvouf&aacute;zov&eacute; ověřen&iacute;, nezapomeňte použ&iacute;t &bdquo;heslo specifick&eacute; pro aplikaci&ldquo; poskytnut&eacute; společnost&iacute; Google pro ověřen&iacute; SMTP.</li>
</ul>
</div>

<div class="section"><h4>N&aacute;zev dom&eacute;ny serveru SMTP:</h4>
<p>Server SMTP lze zadat jako IP adresu nebo jako n&aacute;zev dom&eacute;ny. Pokud použijete n&aacute;zev dom&eacute;ny, zadejte na str&aacute;nce <b>Hlavn&iacute; nab&iacute;dka</b> &gt; <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>S&iacute;ť</b> platnou IP adresu serveru DNS a zkontrolujte, zda je server připojen k&nbsp;internetu.</p>
</div>

<div class="section">
<h4>Poznámka:</h4>
<p>Aby mohli uživatelé odeslat e-mail k následujícím třem účelům, musejí z důvodu změny zásad rozhraní API služby Google Gmail vybrat v rozevírací nabídce <b>Poskytovatel služeb</b> možnost <b>Nastavení vlastního serveru SMTP</b>. Další informace o nastavení se nacházejí v tomto <a href="https://www.synology.com/knowledgebase/DSM/tutorial/Management/How_to_use_Gmail_SMTP_server_to_send_emails_for_DSM" target="_blank">návodu</a>. <ul><li>K odesílání e-mailů používat binární kód ssmtp, například ke spouštění skriptů definovaných uživatelem v nástroji Plánovač úloh.</li>
		<li>Vytvořit webové stránky pomocí služby Web Station a odesílat e-maily pomocí protokolu PHP. Patří sem rovněž odesílání e-mailů z webových balíčků jiných výrobců, například Wordpress, MantisBT apod.</li>
		<li>Odesílat upozornění e-mailem, když někdo zanechá poznámku nebo článek u fotografie ve službě Photo Station.</li></ul></p>
</div>

</body>
</html>