<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Nap&aacute;jen&iacute;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>





<h2>UPS</h2>

<p>UPS (Uninterruptible Power Supply) představuje z&aacute;ložn&iacute; energetick&eacute; zař&iacute;zen&iacute;, d&iacute;ky němuž může zař&iacute;zen&iacute; Synology NAS kr&aacute;tkou dobu pracovat i&nbsp;v&nbsp;př&iacute;padě v&yacute;padku proudu. Tato funkce, nach&aacute;zej&iacute;c&iacute; se v&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Hardware a&nbsp;nap&aacute;jen&iacute;</strong> &gt; <strong>UPS</strong>, pom&aacute;h&aacute; předch&aacute;zet ztr&aacute;tě dat t&iacute;m, že d&aacute; zař&iacute;zen&iacute; Synology NAS k&nbsp;dispozici dostatek času k&nbsp;uložen&iacute; dat a odpojen&iacute; svazků před v&yacute;padkem nap&aacute;jen&iacute; a vypnut&iacute;m (zastaven&iacute;m v&nbsp;př&iacute;padě EDS14).</p>

<div class="section">
<h4>Nouzov&yacute; režim</h4>
<p>Když zař&iacute;zen&iacute; Synology NAS přejde do nouzov&eacute;ho režimu, zastav&iacute; v&scaron;echny služby a odpoj&iacute; svazky, aby nedo&scaron;lo ke ztr&aacute;tě dat a syst&eacute;m mohl b&yacute;t bezpečně vypnut (zastaven v&nbsp;př&iacute;padě EDS14) je&scaron;tě před t&iacute;m, než dojde k&nbsp;vybit&iacute; zař&iacute;zen&iacute; UPS. Ve v&yacute;choz&iacute;m nastaven&iacute; syst&eacute;m přejde do nouzov&eacute;ho režimu, jakmile začne zař&iacute;zen&iacute; UPS doch&aacute;zet energie. Můžete tak&eacute; určit dobu, po kter&eacute; zař&iacute;zen&iacute; Synology NAS přejde po v&yacute;padku nap&aacute;jen&iacute; do nouzov&eacute;ho režimu. Pokud ale poklesne množstv&iacute; energie v&nbsp;baterii zař&iacute;zen&iacute; UPS před uplynut&iacute;m t&eacute;to doby, přejde syst&eacute;m do nouzov&eacute;ho režimu okamžitě.</p>

<p>Povol&iacute;te-li možnost <strong>Po selh&aacute;n&iacute; nap&aacute;jen&iacute; automaticky restartovat</strong> (nach&aacute;z&iacute; se v&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Hardware a&nbsp;nap&aacute;jen&iacute;</strong> &gt; <strong>Obecn&eacute;</strong>), zař&iacute;zen&iacute; Synology NAS se po obnoven&iacute; nap&aacute;jen&iacute; automaticky zapne, pokud do&scaron;lo k&nbsp;jeho vypnut&iacute; v&nbsp;r&aacute;mci nouzov&eacute;ho režimu.</p>
</div>

<h3>M&iacute;stn&iacute; podpora UPS</h3>
<p>Podrobnosti o instalaci hardwaru naleznete v&nbsp;uživatelsk&eacute; př&iacute;ručce k&nbsp;zař&iacute;zen&iacute; UPS. Po dokončen&iacute; instalace a připojen&iacute; zař&iacute;zen&iacute; Synology NAS k&nbsp;zař&iacute;zen&iacute; UPS můžete pomoc&iacute; n&aacute;sleduj&iacute;c&iacute;ho postupu podporu UPS povolit.</p>
<h4>Povolen&iacute; m&iacute;stn&iacute; podpory UPS:</h4>
<ol>
<li>Připojte zař&iacute;zen&iacute; UPS do portu USB zař&iacute;zen&iacute; Synology NAS.</li>
<li>Na kartě <b>UPS</b> za&scaron;krtněte pol&iacute;čko <b>Povolit podporu UPS</b>.</li>
<li>Vyberte, kdy m&aacute; zař&iacute;zen&iacute; Synology NAS přej&iacute;t po v&yacute;padku nap&aacute;jen&iacute; do nouzov&eacute;ho režimu.</li>
<li>Vyberte, zda se m&aacute; vyslat sign&aacute;l k&nbsp;vypnut&iacute; zař&iacute;zen&iacute; UPS, když syst&eacute;m přejde do nouzov&eacute;ho režimu. Vět&scaron;ina zař&iacute;zen&iacute; UPS se dok&aacute;že po obnoven&iacute; nap&aacute;jen&iacute; automaticky zapnout.
<ul><li>Pokud je tato možnost povolená, zařízení Synology NAS se kvůli ztrátě napájení okamžitě vypne.</li>
<li>Pokud je tato možnost povolená, nezapomeňte v části <strong>Ovládací panel</strong> > <strong>Hardware a napájení</strong> > <strong>Obecné</strong> zaškrtnout možnost <strong>Po selhání napájení automaticky restartovat</strong>, aby se zařízení Synology NAS po obnovení napájení automaticky restartovalo.</li></ul></li>
<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
</ol>

<h3>Podpora SNMP UPS</h3>

<p>SNMP UPS je z&aacute;ložn&iacute; nap&aacute;jec&iacute; zař&iacute;zen&iacute;, kter&eacute; se připoj&iacute; k&nbsp;zař&iacute;zen&iacute; Synology NAS prostřednictv&iacute;m protokolu SNMP. Informace o&nbsp;instalaci hardwaru se nach&aacute;zej&iacute; v&nbsp;uživatelsk&eacute; př&iacute;ručce k&nbsp;zař&iacute;zen&iacute; SNMP UPS. Po připojen&iacute; zař&iacute;zen&iacute; Synology NAS k&nbsp;tomuto zař&iacute;zen&iacute; a připojen&iacute; se do stejn&eacute; s&iacute;tě můžete podporu UPS povolit pomoc&iacute; n&aacute;sleduj&iacute;c&iacute;ho postupu.</p>

<h4>Povolen&iacute; podpory SNMP UPS:</h4>
<ol>
<li>Na kartě <strong>UPS</strong> za&scaron;krtněte pol&iacute;čko <b>Povolit podporu UPS</b>.</li>
<li>V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce <strong>Typ UPS</strong> vyberte možnost <strong>SNMP UPS</strong>.</li>
<li>Chcete-li nastavit, kdy m&aacute; zař&iacute;zen&iacute; Synology NAS po v&yacute;padku nap&aacute;jen&iacute; přej&iacute;t do nouzov&eacute;ho režimu, za&scaron;krtněte možnost <strong>Doba, po kter&eacute; zař&iacute;zen&iacute; Synology NAS přejde do nouzov&eacute;ho režimu</strong>. Zadejte č&iacute;selnou hodnotu a v&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce vyberte <b>sekundy</b>, <b>minuty</b> nebo <b>hodiny</b>. Pokud tato možnost nen&iacute; za&scaron;krtnut&aacute;, plat&iacute; volba <b>Dokud nebude napět&iacute; baterie n&iacute;zk&eacute;</b>, což znamen&aacute;, že zař&iacute;zen&iacute; Synology NAS automaticky přejde do nouzov&eacute;ho režimu, až začne doch&aacute;zet baterie zař&iacute;zen&iacute; UPS.</li>
	<p><span class="note_head">Pozn&aacute;mka:</span> Bez ohledu na vybranou možnost přejde zař&iacute;zen&iacute; Synology NAS v&nbsp;př&iacute;padě slab&eacute; baterie do nouzov&eacute;ho režimu automaticky.</p>
<li>Do pole <strong>IP adresa zař&iacute;zen&iacute; SNMP UPS</strong> zadejte IP adresu zař&iacute;zen&iacute; SNMP UPS.</li>
<li>V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce vyberte možnost <strong>SNMP MIB</strong>.</li>
<li>V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce vyberte <strong>verzi SNMP</strong>.</li>
<li>Do pole <strong>Komunita SNMP</strong> zadejte řetězec komunity pro zař&iacute;zen&iacute; SNMP UPS.</li>
<li>Pokud je toto zař&iacute;zen&iacute; Synology NAS připojeno prostřednictv&iacute;m protokolu SNMP a bude sloužit jako s&iacute;ťov&yacute; server UPS, za&scaron;krtněte možnost <strong>Povolit s&iacute;ťov&yacute; server UPS</strong>. Klikněte na možnost <strong>Povolen&aacute; zař&iacute;zen&iacute; Synology NAS</strong> a zadejte IP adresy v&scaron;ech zař&iacute;zen&iacute; Synology NAS, kter&yacute;m chcete povolit připojen&iacute; k&nbsp;tomuto zař&iacute;zen&iacute; UPS.</li>
<p><span class="note_head">Pozn&aacute;mka: </span>Funkce <b>Povolen&aacute; zař&iacute;zen&iacute; Synology NAS</b> nen&iacute; dostupn&aacute; na zař&iacute;zen&iacute; SA3200D.</p>
<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Syst&eacute;m <b>SNMP UPS</b> důrazně doporučujeme použ&iacute;vat u nasazen&iacute; Synology High Availability (SHA).</li>
<li>Zař&iacute;zen&iacute; Synology NAS podporuje zař&iacute;zen&iacute; UPS SNMPv1 a SNMPv2c.</li>
</ul>
</div>

<h3>Server Synology UPS</h3>

<p>Pokud zař&iacute;zen&iacute; UPS použ&iacute;v&aacute; několik produktů Synology a pouze jeden produkt Synology je připojen k&nbsp;zař&iacute;zen&iacute; UPS prostřednictv&iacute;m portu USB nebo s&iacute;tě, může informace o&nbsp;stavu zař&iacute;zen&iacute; UPS z&iacute;sk&aacute;vat pouze zař&iacute;zen&iacute; Synology NAS připojen&eacute; pomoc&iacute; USB nebo s&iacute;tě. V&nbsp;takov&eacute;m př&iacute;padě bude toto zař&iacute;zen&iacute; Synology NAS fungovat jako &bdquo;s&iacute;ťov&yacute; server UPS&ldquo;. S&iacute;ťov&yacute; server UPS pot&eacute; přij&iacute;m&aacute; informace UPS a před&aacute;v&aacute; je do klienta zař&iacute;zen&iacute; Synology NAS.</p>

<h4>Povolen&iacute; serveru Synology UPS:</h4>
<ol>
<li>Přihlaste se do zař&iacute;zen&iacute; Synology NAS připojen&eacute;ho k&nbsp;zař&iacute;zen&iacute; UPS (prostřednictv&iacute;m USB nebo s&iacute;tě).</li>
<li>Za&scaron;krtnut&iacute;m pol&iacute;čka <strong>Povolit s&iacute;ťov&yacute; server UPS</strong> na kartě <strong>UPS</strong> povolte zař&iacute;zen&iacute; Synology NAS přen&aacute;&scaron;et informace o&nbsp;UPS do klientsk&eacute;ho zař&iacute;zen&iacute; Synology NAS.</li>
<li>Klikněte na tlač&iacute;tko <strong>Povolen&aacute; zař&iacute;zen&iacute; Synology NAS</strong>.</li>
<li>Zobraz&iacute; se okno, ve kter&eacute;m zadejte IP adresy klientsk&eacute;ho zař&iacute;zen&iacute; Synology NAS. Klikněte na možnost <strong>OK</strong>.</li>
<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <strong>Použ&iacute;t</strong>.</li>
</ol>

<p>Nyn&iacute; může s&iacute;ťov&yacute; server UPS z&iacute;sk&aacute;vat informace UPS a před&aacute;vat je do klienta Synology NAS použ&iacute;vaj&iacute;c&iacute;ho zař&iacute;zen&iacute; UPS. Podle n&iacute;že uveden&yacute;ch pokynů povolte podporu UPS na klientsk&eacute;m zař&iacute;zen&iacute; Synology NAS.</p></strike>

<h4>Povolen&iacute; podpory UPS na klientsk&eacute;m zař&iacute;zen&iacute; Synology NAS:</h4>
<ol>
<li>Přihlaste se ke klientsk&eacute;mu zař&iacute;zen&iacute; Synology NAS použ&iacute;vaj&iacute;c&iacute;mu zař&iacute;zen&iacute; UPS, ale nepřipojen&eacute;ho prostřednictv&iacute;m USB nebo s&iacute;tě.</li>
<li>Na kartě <strong>UPS</strong> za&scaron;krtněte pol&iacute;čko <strong>Povolit podporu UPS</strong>.</li>
<li>V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce <strong>Server Synology UPS</strong> vyberte možnost <strong>Typ UPS</strong>.</li>
<li>Chcete-li nastavit, kdy m&aacute; zař&iacute;zen&iacute; Synology NAS po v&yacute;padku nap&aacute;jen&iacute; přej&iacute;t do nouzov&eacute;ho režimu, za&scaron;krtněte možnost <strong>Doba, po kter&eacute; zař&iacute;zen&iacute; Synology NAS přejde do nouzov&eacute;ho režimu</strong>. Zadejte č&iacute;selnou hodnotu a v&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce vyberte <strong>sekundy</strong>, <strong>minuty</strong> nebo <strong>hodiny</strong>. Pokud tato možnost nen&iacute; za&scaron;krtnut&aacute;, plat&iacute; volba <b>Stejn&eacute; jako server</b>, což znamen&aacute;, že zař&iacute;zen&iacute; Synology NAS přejde do nouzov&eacute;ho režimu v&nbsp;př&iacute;padě vypnut&iacute; serveru.</li>
	<p><span class="note_head">Pozn&aacute;mka:</span> Bez ohledu na vybranou možnost přejde zař&iacute;zen&iacute; Synology NAS v&nbsp;př&iacute;padě slab&eacute; baterie do nouzov&eacute;ho režimu automaticky.</p>
<li>Do pole <strong>IP adresa s&iacute;ťov&eacute;ho serveru UPS</strong> zadejte IP adresu s&iacute;ťov&eacute;ho serveru UPS.</li>
<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <b>Použ&iacute;t</b>.</li>
</ol>

<div class="section">
<h4>Požadavky pro s&iacute;ťov&eacute; UPS:</h4>
<ul>
<li>Aby bylo možn&eacute; přen&aacute;&scaron;et informace zař&iacute;zen&iacute; UPS, mus&iacute; b&yacute;t v&scaron;echna zař&iacute;zen&iacute; Synology NAS připojena do stejn&eacute; s&iacute;tě.</li>
<li>S&iacute;ťov&eacute; zař&iacute;zen&iacute; (např. přep&iacute;nač nebo rozbočovač), ke kter&eacute;mu jsou jednotliv&aacute; zař&iacute;zen&iacute; Synology NAS připojena, mus&iacute; b&yacute;t připojeno do stejn&eacute;ho zař&iacute;zen&iacute; UPS. Jinak zař&iacute;zen&iacute; Synology NAS nedok&aacute;žou v&nbsp;př&iacute;padě v&yacute;padku nap&aacute;jen&iacute; přen&aacute;&scaron;et informace o&nbsp;zař&iacute;zen&iacute; UPS.</li>
</ul>
</div>






</body>
</html>
