<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Informačn&iacute; centrum</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>Informačn&iacute; centrum</h1>
<p>Informačn&iacute; centrum zobrazuje z&aacute;kladn&iacute; informace t&yacute;kaj&iacute;c&iacute; se různ&yacute;ch aspektů zař&iacute;zen&iacute; Synology NAS, např&iacute;klad specifikace hardwaru, s&iacute;tě, &uacute;loži&scaron;tě a služeb. Informačn&iacute; centrum se nach&aacute;z&iacute; v&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Informačn&iacute; centrum</strong>.</p>
<h2><a name="general"></a>Obecn&eacute;</h2>
<p>Na kartě <b>Obecn&eacute;</b> se zobrazuj&iacute; z&aacute;kladn&iacute; informace o&nbsp;zař&iacute;zen&iacute; Synology NAS, např&iacute;klad s&eacute;riov&eacute; č&iacute;slo, n&aacute;zev modelu, velikost fyzick&eacute; paměti, verze syst&eacute;mu DSM, informace o&nbsp;čase, stav teploty syst&eacute;mu nebo extern&iacute; zař&iacute;zen&iacute;.</p>

<h3 class="disable-eds14">Stav teploty syst&eacute;mu</h3>
<p class="disable-eds14">Stav teploty syst&eacute;mu zař&iacute;zen&iacute; Synology NAS se zn&aacute;zorňuje zelen&yacute;mi nebo oranžov&yacute;mi kontrolkami:</p>

<ul class="disable-eds14">
<li><strong>Zelen&aacute;</strong>: Stav teploty syst&eacute;mu je norm&aacute;ln&iacute;.</li>
<li><strong>Oranžov&aacute;</strong>: Teplota zař&iacute;zen&iacute; Synology NAS je př&iacute;li&scaron; vysok&aacute;. Pokud teplota zař&iacute;zen&iacute; Synology NAS zůstane i&nbsp;nad&aacute;le vysok&aacute;, může doj&iacute;t k&nbsp;jeho vypnut&iacute; z&nbsp;důvodu přehř&aacute;t&iacute;.</li>
</ul>
<div class="section disable-eds14">
<h4>Pozn&aacute;mka:</h4>
<p>Na někter&yacute;ch modelech bez ventil&aacute;toru se informace o&nbsp;stavu teploty syst&eacute;mu nebudou zobrazovat.</p>
</div>

<h2><a name="network"></a>S&iacute;ť</h2>
<p>Na kartě <b>S&iacute;ť</b> se zobrazuj&iacute; informace o&nbsp;s&iacute;ti, např&iacute;klad server DNS, IP adresa, maska pods&iacute;tě a dal&scaron;&iacute;.</p>

<h2><a name="storage"></a>&Uacute;loži&scaron;tě</h2>
<p class="disable-eds14">Na kartě <b>&Uacute;loži&scaron;tě</b> se zobrazuj&iacute; informace o&nbsp;využit&iacute; svazku a o&nbsp;stavu pevn&eacute;ho disku.</p>
<p class="enable-eds14">Na kartě <strong>&Uacute;loži&scaron;tě</strong> se zobrazuj&iacute; informace o&nbsp;využit&iacute; &uacute;loži&scaron;tě a o&nbsp;stavu zař&iacute;zen&iacute; extern&iacute;ch &uacute;loži&scaron;ť.</p>

<h3 class="disable-eds14">Stav pevn&eacute;ho disku</h3>

<p class="disable-eds14">N&iacute;že jsou uvedeny možn&eacute; stavy intern&iacute;ho pevn&eacute;ho disku:</p>

<ul class="disable-eds14">
<li><strong>Nen&iacute; nainstalov&aacute;n ž&aacute;dn&yacute; disk:</strong> V&nbsp;př&iacute;slu&scaron;n&eacute;m slotu pro pevn&yacute; disk nen&iacute; nainstalov&aacute;n ž&aacute;dn&yacute; disk.</li>
<li><strong>Nen&iacute; inicializov&aacute;no:</strong> Na pevn&eacute;m disku nejsou vytvořeny syst&eacute;mov&yacute; odd&iacute;l a svazek.</li>
<li><strong>Norm&aacute;ln&iacute;:</strong> Na pevn&eacute;m disku je možn&eacute; použ&iacute;vat syst&eacute;mov&yacute; odd&iacute;l a svazek.</li>
<li><strong>Inicializov&aacute;no:</strong> Je vytvořen syst&eacute;mov&yacute; odd&iacute;l, ale nen&iacute; vytvořen ž&aacute;dn&yacute; svazek.</li>
<li><strong>Syst&eacute;mov&yacute; odd&iacute;l selhal:</strong> Syst&eacute;mov&yacute; odd&iacute;l na pevn&eacute;m disku nen&iacute; dostupn&yacute;.</li>
<li><strong>Zhroucen&iacute;:</strong> Př&iacute;stup k&nbsp;svazku na pevn&eacute;m disku se nezdařil. Doporučujeme pevn&yacute; disk vyměnit.</li>
</ul>




<div class="section disable-eds14">

<h4>Pozn&aacute;mka:</h4>
<p>Aby syst&eacute;m fungoval norm&aacute;lně, mus&iacute; b&yacute;t k&nbsp;dispozici alespoň jeden disk se stavem <b>Norm&aacute;ln&iacute;</b> nebo <b>Inicializov&aacute;no</b>.</p>

</div>


<h2><a name="service"></a>Služba</h2>
<p>Na kartě <b>Služba</b> se zobrazuje seznam služeb a nainstalovan&yacute;ch bal&iacute;čků, včetně možnost&iacute; jednotliv&eacute; služby či bal&iacute;čky zapnout nebo vypnout. U&nbsp;někter&yacute;ch služeb a bal&iacute;čků se nav&iacute;c nach&aacute;zej&iacute; možnosti testu připojen&iacute; nebo volby, jestli m&aacute; b&yacute;t k&nbsp;jednotliv&yacute;m služb&aacute;m či bal&iacute;čkům umožněn př&iacute;stup přes br&aacute;nu firewall.</p>

<h4>&Uacute;prava nastaven&iacute; služby nebo bal&iacute;čku:</h4>
<ol>
<li>K&nbsp;dispozici jsou n&aacute;sleduj&iacute;c&iacute; možnosti:<ul>
	  <li><strong>Povolit:</strong> Povolte nebo zakažte služby nebo bal&iacute;ček.</li>
	  <li><strong>Povolit prostřednictv&iacute;m br&aacute;ny firewall:</strong> V&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Extern&iacute; př&iacute;stup</strong> &gt; <strong>Konfigurace směrovače</strong> je možn&eacute; přid&aacute;vat nebo odeb&iacute;rat porty použ&iacute;van&eacute; službou nebo bal&iacute;čkem, a tak službě nebo bal&iacute;čku umožnit průchod přes br&aacute;nu firewall zař&iacute;zen&iacute; Synology NAS.</li>
	  <li><strong>Nastaven&iacute;:</strong> Vyberte s&iacute;ťov&eacute; rozhran&iacute;, jehož nastaven&iacute; br&aacute;ny firewall chcete zobrazit a spravovat. Jestliže vyberete možnosti <strong>V&scaron;e</strong>, je možn&eacute; zobrazit a spravovat nastaven&iacute; br&aacute;ny firewall v&scaron;ech s&iacute;ťov&yacute;ch rozhran&iacute;.</li>
	  <li><strong>Vyzkou&scaron;et připojen&iacute;:</strong> Vyzkou&scaron;ejte porty použ&iacute;van&eacute; službami a bal&iacute;čky. Je možn&eacute; vyzkou&scaron;et, jestli zař&iacute;zen&iacute; maj&iacute; př&iacute;stup ke služb&aacute;m a bal&iacute;čkům z&nbsp;extern&iacute; s&iacute;tě.</li>
    </ul>
</li>
<li>Kliknut&iacute;m na možnost <strong>Uložit</strong> změny ulož&iacute;te, kliknut&iacute;m na možnost <strong>Obnovit</strong> změny zru&scaron;&iacute;te.</li>
</ol>

<h2>&Uacute;čet Synology</h2>
<p>&Uacute;čet Synology je integrovan&aacute; webov&aacute; platforma, kter&aacute; uživatelům pom&aacute;h&aacute; použ&iacute;vat n&aacute;sleduj&iacute;c&iacute; služby nab&iacute;zen&eacute; společnost&iacute; Synology:</p>

<ul>
<li>Služby QuickConnect a DDNS pro zař&iacute;zen&iacute; Synology NAS</li>
<li>Spr&aacute;va softwarov&yacute;ch licenc&iacute;</li>
<li>Nal&eacute;hav&aacute; podpora Synology</li>
<li>Přihl&aacute;&scaron;en&iacute; k&nbsp;odběru elektronick&eacute;ho zpravodajstv&iacute;</li>
<li>Historie n&aacute;kupů produktů Synology</li>
</ul>


<h4>Registrace nebo přihl&aacute;&scaron;en&iacute; k&nbsp;&uacute;čtu Synology:</h4>

<ol>
<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Informačn&iacute; centrum</strong> &gt; <strong>&Uacute;čet Synology</strong>.</li>
<li>Klikněte na možnost <strong>Přihl&aacute;sit se nebo zaregistrovat &uacute;čet Synology</strong>.</li>
<li>Zadejte přihla&scaron;ovac&iacute; &uacute;daje uživatele nebo po kliknut&iacute; na možnost <strong>Zaregistrovat</strong> zaregistrujte &uacute;čet Synology.</li>
</ol>


<h4>Spr&aacute;va &uacute;čtu Synology:</h4>

<ol>
<li>Kliknut&iacute;m na možnost <strong>Spr&aacute;va &uacute;čtu</strong> přejděte do webov&eacute; platformy.</li>
<li>Podle pokynů webu přejděte do č&aacute;sti, ve kter&eacute; je možn&eacute; prov&aacute;dět spr&aacute;vu &uacute;čtu Synology.</li>
</ol>

<h4>Odhl&aacute;&scaron;en&iacute; od &uacute;čtu Synology:</h4>

<p>Chcete-li se od &uacute;čtu Synology odhl&aacute;sit, klikněte na možnost <strong>Změnit &uacute;čet</strong>.</p>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Odhl&aacute;&scaron;en&iacute; od &uacute;čtu Synology může způsobit pozastaven&iacute; přidružen&yacute;ch služeb poskytovan&yacute;ch společnost&iacute; Synology (např. QuickConnect a DDNS).</p>
</div>



</body>
</html>
