<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Čas</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Čas</h2>
<p>Můžete zkontrolovat aktu&aacute;ln&iacute; čas, ručně nastavit datum a čas serveru nebo je nechat nastavit automaticky pomoc&iacute; s&iacute;ťov&eacute;ho časov&eacute;ho serveru.</p>

<h4>Nastaven&iacute; form&aacute;tu data:</h4>
<p>Vyberte form&aacute;t data podle va&scaron;ich požadavků a geografick&eacute; polohy.</p>

<h4>Nastaven&iacute; form&aacute;tu času:</h4>
<p>Vyberte zobrazen&iacute; času ve 12hodinov&eacute;m nebo 24hodinov&eacute;m form&aacute;tu.</p>

<h4>Nastaven&iacute; časov&eacute;ho p&aacute;sma:</h4>
<p>Vyberte možnost z&nbsp;rozev&iacute;rac&iacute; nab&iacute;dky <b>Časov&eacute; p&aacute;smo</b>.</p>

<h4>Ručn&iacute; nastaven&iacute; data a času:</h4>
<p>Zvolte možnost <b>Ručně</b> a nastavte datum a čas.</p>

<h4>Synchronizace data a času se serverem NTP:</h4>
<ol>
<li>Vyberte možnost <b>Synchronizovat se serverem NTP</b> a zadejte adresu s&iacute;ťov&eacute;ho časov&eacute;ho serveru nebo zvolte server z&nbsp;rozev&iacute;rac&iacute; nab&iacute;dky.</li>
<li>Kliknut&iacute;m na možnost <strong>Aktualizovat</strong> se ujistěte, zda může aplikace Synology NAS &uacute;spě&scaron;ně synchronizovat čas se serverem.</li>
<li>Klikněte na možnost <strong>Použ&iacute;t</strong>.</li>
</ol>
<p><span class="note_head">Pozn&aacute;mka:</span> Pokud chcete synchronizovat datum a čas pomoc&iacute; s&iacute;ťov&eacute;ho časov&eacute;ho serveru, zadejte na str&aacute;nce <b>Hlavn&iacute; nab&iacute;dka</b> &gt; <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>S&iacute;ť</b> platnou IP adresu serveru DNS a zkontrolujte, zda je syst&eacute;m Synology NAS připojen k&nbsp;internetu.</p>

<div class="section">
<h4>Informace o serveru NTP (Network Time Protocol)</h4>
<p>Z&aacute;kladn&iacute;m &uacute;čelem protokolu NTP (Network Time Protocol) je synchronizace hodin poč&iacute;tačov&eacute;ho syst&eacute;mu přes datovou s&iacute;ť.</p>

<p>Dal&scaron;&iacute; informace o&nbsp;serverech NTP se nach&aacute;zej&iacute; na adrese <a href="http://support.ntp.org/bin/view/Servers/WebHome" target="_blank">http://support.ntp.org/bin/view/Servers/WebHome</a></p>
</div>
</body>
</html>
