<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Aktualizace</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1><a name="leaf_update"></a>Aktualizace</h1>
<h2><a name="leaf_update"></a>Aktualizace DSM</h2>
<p>Společnost Synology pravidelně vyd&aacute;v&aacute; bezplatn&eacute; aktualizace DSM. Aktualizace mohou obsahovat nov&eacute; funkce, vylep&scaron;en&iacute; funkc&iacute; a vylep&scaron;en&iacute; v&yacute;konnosti. Aktualizace syst&eacute;mu DSM mohou b&yacute;t ve formě mal&yacute;ch nebo velk&yacute;ch aktualizac&iacute;. V&nbsp;př&iacute;padě mal&eacute; aktualizace zobraz&iacute; syst&eacute;m zpr&aacute;vu vedle položky <b>Stav</b>. V&nbsp;př&iacute;padě vyd&aacute;n&iacute; hlavn&iacute; verze syst&eacute;mu DSM se pod položkou <b>Stav</b> zobraz&iacute; č&aacute;st s&nbsp;informacemi o&nbsp;t&eacute;to verzi a s&nbsp;odkazem na stažen&iacute; aktualizace hlavn&iacute; verze. Obecně plat&iacute;, že mal&eacute; aktualizace obsahuj&iacute; opravy kritick&yacute;ch chyb a bezpečnostn&iacute; z&aacute;platy t&yacute;kaj&iacute;c&iacute; se stability syst&eacute;mu, zat&iacute;mco hlavn&iacute; aktualizace obsahuj&iacute; kromě oprav kritick&yacute;ch chyb a bezpečnostn&iacute;ch z&aacute;plat předev&scaron;&iacute;m zcela nov&eacute; funkce a vylep&scaron;en&iacute; v&yacute;konu.</p>


<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Upgradov&aacute;n&iacute; syst&eacute;mu DSM na data v&nbsp;zař&iacute;zen&iacute; Synology NAS nem&aacute; vliv. Přesto se kvůli zabezpečen&iacute; dat důrazně doporučuje data před aktualizac&iacute; z&aacute;lohovat.</li>
<li>Po upgradov&aacute;n&iacute; na nov&eacute; verze syst&eacute;mu DSM již nemůžete prov&eacute;st downgrade na předchoz&iacute; verze aktualizac&iacute; syst&eacute;mu DSM.</li>
<li>Zař&iacute;zen&iacute; Synology NAS provede na z&aacute;kladě konfigurac&iacute; služeb a syst&eacute;mu automatickou kontrolu, jestli jsou nov&eacute; verze relevantn&iacute; pro v&aacute;&scaron; syst&eacute;m. Proto se dostupn&eacute; aktualizace a nejnověj&scaron;&iacute; verze v&nbsp;z&aacute;vislosti na aktu&aacute;ln&iacute;ch konfigurac&iacute;ch syst&eacute;mu DSM mohou li&scaron;it.</li>
</ul>
</div>

<h3>Proveden&iacute; ručn&iacute; aktualizace syst&eacute;mu DSM</h3>
<p>Z&nbsp;<a href="http://www.synology.com/support/download.php" target="_blank">Centra pro stahov&aacute;n&iacute;</a> společnosti Synology je možn&eacute; st&aacute;hnout soubor .pat s&nbsp;aktualizac&iacute; a pot&eacute; syst&eacute;m DSM ručně aktualizovat.</p>

<h4>Proveden&iacute; ručn&iacute; aktualizace syst&eacute;mu DSM:</h4>

<ol>
<li>Nejnověj&scaron;&iacute; aktualizaci syst&eacute;mu DSM je možn&eacute; do m&iacute;stn&iacute;ho poč&iacute;tače st&aacute;hnout z&nbsp;<a href="http://www.synology.com/support/download.php" target="_blank">Centra pro stahov&aacute;n&iacute;</a>. Soubor .pat nen&iacute; nutn&eacute; extrahovat.</li>
<li>Kliknut&iacute;m na možnost <b>Ručn&iacute; aktualizace syst&eacute;mu DSM</b> otevřete str&aacute;nku Ručn&iacute; aktualizace syst&eacute;mu DSM</li>
<li>Klikněte na možnost <b>Proch&aacute;zet</b> a vyberte soubor s&nbsp;aktualizac&iacute;.</li>
<li>Kliknut&iacute;m na možnost <b>Použ&iacute;t</b> zah&aacute;j&iacute;te aktualizaci syst&eacute;mu DSM. Po dokončen&iacute; aktualizace se syst&eacute;m automaticky restartuje.</li>
</ol>
<div class="section">
<h4>Odstraňov&aacute;n&iacute; pot&iacute;ž&iacute;:</h4>
<p>Pokud firmware DSM nelze aktualizovat, mohou v&aacute;m pomoci n&aacute;sleduj&iacute;c&iacute; rady:</p>
<ul>
<li>Zkontrolujte, zda byl upgrade přeru&scaron;en uživateli nebo jin&yacute;mi nečekan&yacute;mi ud&aacute;lostmi, např&iacute;klad v&yacute;padkem nap&aacute;jen&iacute;.</li>
<li>Zkontrolujte verzi syst&eacute;mu DSM. Syst&eacute;m lze aktualizovat pouze pomoc&iacute; nověj&scaron;&iacute; verze syst&eacute;mu DSM.</li>
<li>St&aacute;hněte aktualizaci syst&eacute;mu DSM znovu, protože soubor může b&yacute;t po&scaron;kozen.</li>
</ul>
<p>Pokud probl&eacute;m přetrv&aacute;v&aacute;, obraťte se na <a href="https://account.synology.com" target="_blank">technickou podporu</a> společnosti Synology.</p>
</div>

<h3>Nastaven&iacute; předvoleb automatick&yacute;ch aktualizac&iacute; a instalac&iacute; syst&eacute;mu DSM</h3>
<p>
<font>Chcete-li nakonfigurovat nastaven&iacute; instalace aktualizac&iacute; a zkontrolovat pl&aacute;n, klikněte na možnost <b>Nastaven&iacute; aktualizac&iacute;</b>.</font>
</p>

<h4>Pokud chcete, aby v&aacute;s syst&eacute;m upozornil na dostupnost nov&eacute; aktualizace syst&eacute;mu DSM:</h4>
<p>Pokud bude zapnut&aacute; možnost <b>Upozornit a nechat mě rozhodnout, jestli se m&aacute; nov&aacute; aktualizace nainstalovat</b>, syst&eacute;m v&aacute;s na dostupnost nov&eacute; verze pouze upozorn&iacute;. Až obdrž&iacute;te upozorněn&iacute;, můžete se rozhodnout, jestli chcete aktualizaci st&aacute;hnout.</p>

<p>Jakmile se aktualizace syst&eacute;mu DSM st&aacute;hne a připrav&iacute; k&nbsp;instalaci, zobraz&iacute; se upozorněn&iacute; na plo&scaron;e. Chcete-li zabr&aacute;nit automatick&eacute; aktualizaci syst&eacute;mu DSM, můžete ji v&nbsp;upozorněn&iacute; na plo&scaron;e zru&scaron;it. Pokud jste nav&iacute;c v&nbsp;č&aacute;sti <strong>Pl&aacute;n nap&aacute;jen&iacute;</strong> povolili možnost <strong>Vypnout</strong>, nainstaluj&iacute; se aktualizace syst&eacute;mu DSM před napl&aacute;novan&yacute;m vypnut&iacute;m.</p>

<h4>Automatick&aacute; instalace nov&eacute; aktualizace syst&eacute;mu DSM:</h4>
<p>Pokud je zapnut&aacute; možnost <b>Automaticky nainstalovat novou aktualizaci</b> a v&yacute;sledek kontroly zjist&iacute;, že je dostupn&aacute; nov&aacute; aktualizace, provede syst&eacute;m na z&aacute;kladě t&eacute;to volby automatickou instalaci nov&eacute; aktualizace syst&eacute;mu DSM. T&yacute;k&aacute; se to pouze mal&yacute;ch aktualizac&iacute; uveden&yacute;ch v&nbsp;č&aacute;sti <b>Stav</b>, nikoli hlavn&iacute;ch aktualizac&iacute;.</p>

<h4>Nastaven&iacute; pl&aacute;nu kontroly:</h4>
<p>Pomoc&iacute; možnosti <b>Zkontrolovat pl&aacute;n</b> můžete rozhodnout, kdy bude syst&eacute;m dostupnost aktualizac&iacute; kontrolovat. Vyberte dny v&nbsp;t&yacute;dnu a čas v&nbsp;určen&eacute; dny, kdy se m&aacute; prov&eacute;st kontrola dostupnosti aktualizac&iacute;. Např&iacute;klad každ&eacute; &uacute;ter&yacute; a p&aacute;tek v&nbsp;11:00.</p>

<h3>Hlavn&iacute; aktualizace</h3>
<p>Pokud je dostupn&aacute; hlavn&iacute; verze syst&eacute;mu DSM, zobraz&iacute; se tato informace dole v&nbsp;č&aacute;sti Aktualizace DSM. Kliknut&iacute;m na možnost <b>St&aacute;hnout</b> můžete st&aacute;hnout verzi s&nbsp;hlavn&iacute; aktualizac&iacute;. Po dokončen&iacute; stahov&aacute;n&iacute; můžete proces dokončit kliknut&iacute;m na možnost <b>Aktualizovat</b>.</p>


<div class="section">
<h4>Odstraňov&aacute;n&iacute; pot&iacute;ž&iacute;:</h4>
<p>Pokud se v&nbsp;průběhu kontroly nebo stahov&aacute;n&iacute; nov&eacute;ho syst&eacute;mu DSM zobraz&iacute; chyby napsan&eacute; červen&yacute;m textem, zkontrolujte n&aacute;sleduj&iacute;c&iacute;:</p>
<ul>
<li>Zkontrolujte, jestli je zař&iacute;zen&iacute; Synology NAS připojeno k&nbsp;internetu.</li>
<li>Stahovac&iacute; server Synology je možn&aacute; moment&aacute;lně zanepr&aacute;zdněn&yacute;. Probl&eacute;m může vyře&scaron;it pozděj&scaron;&iacute; stažen&iacute;.</li>
</ul>
<p>Pokud probl&eacute;m přetrv&aacute;v&aacute;, obraťte se na <a href="https://account.synology.com" target="_blank">technickou podporu</a> společnosti Synology.</p>
</div>

<h2><a name="leaf_update"></a>Aktualizace firmwaru roz&scaron;iřovac&iacute; jednotky</h2>

<p>Pokud m&aacute;te roz&scaron;iřovac&iacute; jednotky SAS, může b&yacute;t občas potřeba aktualizace firmwaru. Syst&eacute;m aktualizace firmwaru automaticky zkontroluje a zobraz&iacute; jeden z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch stavů: <b>Je nutn&eacute; okamžitě aktualizovat firmware</b>, <b>Firmware v&scaron;ech roz&scaron;iřovac&iacute;ch jednotek je aktu&aacute;ln&iacute;</b> nebo <b>Nen&iacute; připojen&aacute; ž&aacute;dn&aacute; roz&scaron;iřovac&iacute; jednotka</b>.<ul>
<li><b>Je nutn&eacute; okamžitě aktualizovat firmware</b>: Pokud se zobraz&iacute; tento stav, potom vřele doporučujeme firmware roz&scaron;iřovac&iacute; jednotky co nejdř&iacute;ve aktualizovat. Roz&scaron;iřovac&iacute; jednotky nebudou až do proveden&iacute; aktualizace dostupn&eacute;. Po tuto dobu nebude tak&eacute; možn&eacute; vytv&aacute;řet na těchto roz&scaron;iřovac&iacute;ch jednotk&aacute;ch nov&eacute; svazky.</li>

<li><b>Firmware v&scaron;ech roz&scaron;iřovac&iacute;ch jednotek je aktu&aacute;ln&iacute;</b>: Tento stav oznamuje, že syst&eacute;m dokončil aktualizaci a pracuje ve stabiln&iacute;m prostřed&iacute;.</li>

<li><b>Nen&iacute; připojen&aacute; ž&aacute;dn&aacute; roz&scaron;iřovac&iacute; jednotka</b>: Tento stav oznamuje, že k&nbsp;zař&iacute;zen&iacute; Synology NAS nejsou připojen&eacute; ž&aacute;dn&eacute; roz&scaron;iřovac&iacute; jednotky. Proto nen&iacute; potřeba prov&aacute;dět aktualizace firmwaru.</li>
</ul></p>

<p><span class="note_head">Důležit&eacute; upozorněn&iacute;:</span> Upgradov&aacute;n&iacute; firmwaru roz&scaron;iřovac&iacute; jednotky norm&aacute;lně nem&aacute; na data v&nbsp;zař&iacute;zen&iacute; Synology NAS vliv. Přesto se kvůli zabezpečen&iacute; dat důrazně doporučuje data před aktualizac&iacute; z&aacute;lohovat.</p>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Aktualizace firmwaru roz&scaron;iřovac&iacute; jednotky je nutn&aacute; pouze u někter&yacute;ch modelů SAS.</li>
<li>Aktualizace firmwaru roz&scaron;iřovac&iacute; jednotky je dostupn&aacute; u&nbsp;syst&eacute;mu DSM 6.2.2 a nověj&scaron;&iacute;ch verz&iacute;.</li>
</ul>
</div>

<h4>Proveden&iacute; aktualizace firmwaru roz&scaron;iřovac&iacute; jednotky:</h4>

<p>Proveden&iacute; aktualizace firmwaru roz&scaron;iřovac&iacute; jednotky trv&aacute; jen několik minut a nevyžaduje restartov&aacute;n&iacute; syst&eacute;mu. Aktualizace tak&eacute; nepřeru&scaron;&iacute; ž&aacute;dn&eacute; dal&scaron;&iacute; spu&scaron;těn&eacute; služby.</p>

<ol>
<li>Kliknut&iacute;m na možnost <b>Aktualizovat</b> spusťte aktualizaci.</li>
<li>Zobraz&iacute; se dialogov&eacute; okno s&nbsp;varov&aacute;n&iacute;m. Vyberte některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;:<ul>
		<li>Chcete-li pokračovat v&nbsp;aktualizaci, klikněte na možnost <b>OK</b>. Zobraz&iacute; se indik&aacute;toru průběhu.</li>
		<li>Chcete-li prov&eacute;st aktualizaci později, klikněte na možnost <b>Storno</b>.</li>
	</ul>
</li>
<li>Syst&eacute;m ozn&aacute;m&iacute; v&yacute;sledek aktualizace zobrazen&iacute;m jednoho z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch upozorněn&iacute;: <b>Aktualizace firmwaru roz&scaron;iřovac&iacute; jednotky byla dokončena</b> nebo <b>Aktualizace firmwaru roz&scaron;iřovac&iacute; jednotky se nezdařila</b>.</li>
<li>V&nbsp;č&aacute;sti <b>Stav</b> se zobraz&iacute; jedna z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch stavov&yacute;ch zpr&aacute;v:<ul>
		<li><b>Firmware v&scaron;ech roz&scaron;iřovac&iacute;ch jednotek je aktu&aacute;ln&iacute;</b>: Tato zpr&aacute;va se zobraz&iacute;, pokud byla aktualizace &uacute;spě&scaron;ně dokončena. Syst&eacute;m pracuje ve stabiln&iacute;m prostřed&iacute; a roz&scaron;iřovac&iacute; jednotky jsou připraveny k&nbsp;použit&iacute;.</li>
		<li><b>Aktualizace se nezdařila</b>: Pokud se aktualizace firmwaru roz&scaron;iřovac&iacute; jednotky nezdařila, vyře&scaron;te tento probl&eacute;m kliknut&iacute;m na možnost <b>Kontaktovat podporu</b>.</li>
	</ul></li>
</ol>
<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Aby byla zaji&scaron;těna stabilita syst&eacute;mu, nebude po zji&scaron;těn&iacute; dostupnosti aktualizace firmwaru služba roz&scaron;iřovac&iacute;ch jednotek dostupn&aacute;. Znovu dostupn&aacute; bude tato služba po dokončen&iacute; aktualizace firmwaru.</li>
<li>Pokud se aktualizace firmwaru roz&scaron;iřovac&iacute; jednotky nezdařila, nepokou&scaron;ejte se restartovat nebo odebrat disky ani roz&scaron;iřovac&iacute; jednotky. Postup ře&scaron;en&iacute; tohoto probl&eacute;mu se nach&aacute;z&iacute; v&nbsp;<a href="https://www.synology.com/knowledgebase/DSM/help/DSM/SupportCenter/contact_support" target="_blank">tomto čl&aacute;nku</a>, př&iacute;padně pož&aacute;dejte o&nbsp;dal&scaron;&iacute; pomoc <a href="https://account.synology.com" target="_blank">technickou podporu</a> společnosti Synology.</li>
</ul>
</div>

</body>
</html>
