<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Upozorněn&iacute;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="advanced"></a>Roz&scaron;&iacute;řen&aacute; nastaven&iacute;</h2>
<p>Je možn&eacute; vybrat typ ud&aacute;lost&iacute;, kter&eacute; aktivuj&iacute; syst&eacute;m, aby odeslal zpr&aacute;vy upozorněn&iacute;, a&nbsp;tak&eacute; m&eacute;dium (e-mail, zpr&aacute;vy SMS a mobiln&iacute; zař&iacute;zen&iacute;), prostřednictv&iacute;m kter&eacute;ho zpr&aacute;vy obdrž&iacute;te.</p>
<p>Pro každou z&nbsp;ud&aacute;lost&iacute; byla nastavena v&yacute;choz&iacute; zpr&aacute;va upozorněn&iacute;, m&aacute;te v&scaron;ak tak&eacute; možnost zpr&aacute;vu upozorněn&iacute; upravit a&nbsp;upozorněn&iacute; přizpůsobit. Pokud se později rozhodnete vlastn&iacute; nastaven&iacute; zru&scaron;it, je možn&eacute; v&yacute;choz&iacute; zpr&aacute;vu obnovit.</p>

<h4>Vyhled&aacute;n&iacute; ud&aacute;lost&iacute; upozorněn&iacute;:</h4>
	<ol>
	<li>Do pole hled&aacute;n&iacute; v&nbsp;prav&eacute;m horn&iacute;m rohu zadejte kl&iacute;čov&eacute; slovo.</li>
	<li>Zobraz&iacute; se ud&aacute;losti souvisej&iacute;c&iacute; se zadan&yacute;m kl&iacute;čov&yacute;m slovem.</li>
	</ol>


<h4>V&yacute;běr m&eacute;di&iacute; upozorněn&iacute; pro ud&aacute;losti upozorněn&iacute;:</h4>
	<ol>
	<li>Za&scaron;krtněte u&nbsp;každ&eacute; ud&aacute;losti pol&iacute;čko a&nbsp;vyberte požadovan&aacute; m&eacute;dia upozorněn&iacute;.</li>
	<li>Nastaven&iacute; použijete kliknut&iacute;m na možnost <b>Uložit</b>.</li>
	</ol>

<h4>&Uacute;prava zpr&aacute;v upozorněn&iacute;:</h4>
<ol>
	<li>V&nbsp;seznamu ud&aacute;lost&iacute; vyberte ud&aacute;lost a pot&eacute; klikněte na možnost <b>Upravit zpr&aacute;vu</b>.</li>
	<li>V&nbsp;zobrazen&eacute;m okně &uacute;pravou předmětu a obsahu zpr&aacute;vy přizpůsobte zpr&aacute;vu upozorněn&iacute;.</li>
	<li>Upravit lze rovněž n&aacute;sleduj&iacute;c&iacute; proměnn&eacute;. Aktualizovan&eacute; proměnn&eacute; se budou vztahovat na v&scaron;echny zpr&aacute;vy upozorněn&iacute;:<ul>
			<li><strong>%COMPANY_NAME%</strong>: Podpis uveden&yacute; na konci zpr&aacute;vy upozorněn&iacute;. V&yacute;choz&iacute; hodnotou je <strong>Synology DiskStation</strong>, <strong>Synology RackStation</strong>, <strong>Synology FlashStation</strong> nebo <strong>Synology Unified Controller</strong>, podle modelu zař&iacute;zen&iacute;.</li>
			<li><strong>%HTTP_URL%</strong>: Hypertextov&yacute; odkaz na zař&iacute;zen&iacute; Synology NAS. Pokud nen&iacute; uveden, zobraz&iacute; syst&eacute;m ve zpr&aacute;vě upozorněn&iacute; v&scaron;echny možn&eacute; odkazy.</li></ul></li>
	<li>Změny ulož&iacute;te kliknut&iacute;m na možnost <strong>Uložit</strong>.</li>
	<li>Obnoven&iacute; v&yacute;choz&iacute;ho nastaven&iacute; zpr&aacute;vy upozorněn&iacute;:<ol>
		<li>V&nbsp;seznamu ud&aacute;lost&iacute; vyberte ud&aacute;lost a pot&eacute; klikněte na možnost <b>Upravit zpr&aacute;vu</b>.</li>
		<li>V&nbsp;zobrazen&eacute;m okně klikněte na možnost <b>Obnovit v&yacute;choz&iacute; nastaven&iacute;</b> a&nbsp;v&nbsp;dialogov&eacute;m okně změny potvrďte kliknut&iacute;m na možnost <strong>Ano</strong>.</li>
		</ol></li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4> 
<ul>
	<li>Doporučujeme, abyste v&nbsp;předmětu a&nbsp;textu zpr&aacute;vy nepouž&iacute;vali segmenty řetězců obsahuj&iacute;c&iacute; znak &bdquo;%&ldquo;. Při odes&iacute;l&aacute;n&iacute; upozorněn&iacute; je nahrad&iacute; skutečn&eacute; informace o syst&eacute;mu.</li>
</ul>
</div>

</body>
</html>
