<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Extern&iacute; zař&iacute;zen&iacute;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="usbprinter"></a>Tisk&aacute;rny</h2>
<p>Zař&iacute;zen&iacute; Synology NAS se může st&aacute;t tiskov&yacute;m serverem, kter&yacute; umožňuje klientsk&yacute;m poč&iacute;tačům nebo mobiln&iacute;m zař&iacute;zen&iacute;m př&iacute;stup k&nbsp;tisk&aacute;rn&aacute;m připojen&yacute;m k&nbsp;zař&iacute;zen&iacute; Synology NAS. Kromě toho podpora technologie Apple Wireless Printing podporuje vzd&aacute;len&yacute; tisk pomoc&iacute; zař&iacute;zen&iacute; se syst&eacute;mem iOS.</p>
<p>Seznam kompatibiln&iacute;ch tisk&aacute;ren se nach&aacute;z&iacute; na str&aacute;nk&aacute;ch <a href="http://www.synology.com" target="_blank">www.synology.com</a>.</p>

<h3>Nastaven&iacute; tisk&aacute;ren</h3>
<p>Nastaven&iacute; a&nbsp;připojen&iacute; tisk&aacute;rny USB nebo s&iacute;ťov&eacute; tisk&aacute;rny k&nbsp;zař&iacute;zen&iacute; Synology NAS provedete podle n&aacute;sleduj&iacute;c&iacute;ho postupu.</p>


<h4><a id="t1"></a>Nastaven&iacute; tisk&aacute;rny USB:</h4>
<ol>
<li>Tisk&aacute;rnu zapněte a&nbsp;připojte ji k&nbsp;portu USB zař&iacute;zen&iacute; Synology NAS.</li>
<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Extern&iacute; zař&iacute;zen&iacute;</strong> &gt; <strong>Tisk&aacute;rna</strong>.</li>
<li>Vyberte tisk&aacute;rnu, kterou chcete nastavit. Zař&iacute;zen&iacute; Synology NAS nedok&aacute;že rozpoznat tisk&aacute;rny připojen&eacute; prostřednictv&iacute;m rozbočovačů USB.</li>
<li>Klikněte na možnost <b>Spr&aacute;va tisk&aacute;rny</b> a&nbsp;vyberte možnost <b>Nastavit tisk&aacute;rnu</b>.</li>
<li>V&nbsp;dialogov&eacute;m okně vyberte jeden z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch režimů:<ul>
<li><b>Network MFP:</b> Umožňuje klientům v&nbsp;m&iacute;stn&iacute; s&iacute;ti použ&iacute;vat funkce tisku, skenov&aacute;n&iacute; a&nbsp;faxu u multifunkčn&iacute; tisk&aacute;rny. Skenov&aacute;n&iacute; a&nbsp;faxov&aacute;n&iacute; je k&nbsp;dispozici pouze u&nbsp;poč&iacute;tačů se syst&eacute;mem Windows.</li>
<li><b>S&iacute;ťov&aacute; tisk&aacute;rna:</b> Tento režim zvolte v&nbsp;př&iacute;padě tisk&aacute;ren podporuj&iacute;c&iacute;ch pouze tisk nebo pokud chcete klientsk&yacute;m zař&iacute;zen&iacute;m umožnit použ&iacute;vat pouze funkci tisku.</li>
</ul>
</li>
<li>Nakonfigurujte nastaven&iacute; služby Apple Wireless Printing (voliteln&eacute;).</li>
<li>Klikněte na možnost <b>Uložit</b>.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Př&iacute;stup k&nbsp;s&iacute;ťov&eacute; multifunkčn&iacute; tisk&aacute;rně může m&iacute;t v&nbsp;jednom okamžiku pouze jeden klient.</li>
</ul>
</div>

<h4>Nastaven&iacute; s&iacute;ťov&eacute; tisk&aacute;rny:</h4>
<ol>
<li>Zapněte a&nbsp;připojte s&iacute;ťovou tisk&aacute;rnu ke stejn&eacute; s&iacute;ti, ke kter&eacute; je připojeno zař&iacute;zen&iacute; Synology NAS.</li>
<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Extern&iacute; zař&iacute;zen&iacute;</strong> &gt; <strong>Tisk&aacute;rna</strong>.</li>
<li>Klikněte na možnost <b>Přidat s&iacute;ťovou tisk&aacute;rnu</b> a&nbsp;postupujte podle pokynů průvodce nastaven&iacute;m.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li><strong>N&aacute;zev tisk&aacute;rny:</strong> N&aacute;zev tisk&aacute;rny je nutn&eacute; zadat během nastaven&iacute; a&nbsp;může obsahovat maxim&aacute;lně 32&nbsp;znaků včetně p&iacute;smen, č&iacute;slic a&nbsp;podtrž&iacute;tek.</li>
	<li><strong>Protokol:</strong> V&nbsp;běžn&yacute;ch situac&iacute;ch použ&iacute;vaj&iacute; s&iacute;ťov&eacute; tisk&aacute;rny&nbsp;HP protokol Socket, s&iacute;ťov&eacute; tisk&aacute;rny Canon protokol BJNP a&nbsp;ostatn&iacute; tisk&aacute;rny přev&aacute;žně protokol LPR.</li>
<li><strong>N&aacute;zev fronty:</strong> N&aacute;zev fronty vyžaduj&iacute; s&iacute;ťov&eacute; tisk&aacute;rny s&nbsp;protokolem LPR a&nbsp;IPP, nevyžaduje se ale v&nbsp;př&iacute;padě tisk&aacute;ren s&nbsp;protokoly Socket nebo BJNP.</li>
<li><strong>Bez s&iacute;ťov&eacute; multifunkčn&iacute; tisk&aacute;rny:</strong> S&iacute;ťov&eacute; tisk&aacute;rny připojen&eacute; k&nbsp;zař&iacute;zen&iacute; Synology NAS nemohou v&nbsp;současnosti využ&iacute;vat režim Network MFP.</li>
<li><strong>Bez tisk&aacute;ren USB:</strong> Tisk&aacute;rny USB sd&iacute;len&eacute; produktem Synology nelze nastavit jako s&iacute;ťov&eacute; tisk&aacute;rny.</li>
</ul>
</div>

<div>
<h4>Instalace tisk&aacute;rny USB využ&iacute;vaj&iacute;c&iacute; jazyk PostScript pomoc&iacute; poč&iacute;tače se syst&eacute;mem Mac:</h4>

<p><strong>U syst&eacute;mu Mac OS 10.12.X:</strong></p>
<ol>
<li>Postupujte podle kroků uveden&yacute;ch v&nbsp;č&aacute;sti <a href="system_externaldevice_printer.html#t1">Nastaven&iacute; tisk&aacute;rny&nbsp;USB</a>.</li>
<li>V&nbsp;poč&iacute;tači se syst&eacute;mem Mac přejděte do č&aacute;sti <b>System Preferences</b> (Syst&eacute;mov&eacute; předvolby) &gt; <b>Printer &amp; Scanners</b> (Tisk&aacute;rna a&nbsp;skenery) a&nbsp;kliknut&iacute;m na symbol <strong>+</strong> přidejte novou tisk&aacute;rnu.</li>
<li>Jako typ tisk&aacute;rny zvolte možnost <strong>IP</strong>.</li>
<ul>
	<li>Zadejte n&aacute;zev hostitele nebo IP adresu tisk&aacute;rny.</li>
	<li>Jako <strong>Protokol</strong> nastavte možnost <strong>Line Printer Daemon&nbsp;&ndash; LPD</strong>.</li>
	<li>Do pole <strong>Fronta</strong> zadejte hodnotu &bdquo;usbprinter&ldquo;. Pokud se v&aacute;m nedař&iacute; naj&iacute;t <strong>N&aacute;zev fronty</strong>, přejděte v&nbsp;syst&eacute;mu DSM do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Extern&iacute; zař&iacute;zen&iacute;</strong> &gt; <strong>Tisk&aacute;rna</strong>.</li></ul>
	<li>Jako možnost <strong>Use</strong> (Použ&iacute;t) vyberte položku <strong>Generic PostScript Printer</strong> (Obecn&aacute; tisk&aacute;rna PostScript).</li>
	<li>Dokončete postup kliknut&iacute;m na možnost <strong>Přidat</strong>.</li>
</ol>

<p><strong>U syst&eacute;mu Mac OS 10.6.X:</strong></p>
<ol>
<li>Postupujte podle kroků uveden&yacute;ch v&nbsp;č&aacute;sti <a href="system_externaldevice_printer.html#t1">Nastaven&iacute; tisk&aacute;rny&nbsp;USB</a>.</li>
<li>V&nbsp;poč&iacute;tači se syst&eacute;mem Mac přejděte do č&aacute;sti <b>System Preferences</b> (Syst&eacute;mov&eacute; předvolby) &gt; <b>Printer &amp; Fax</b> (Tisk&aacute;rna a&nbsp;fax) a&nbsp;kliknut&iacute;m na symbol <strong>+</strong> přidejte novou tisk&aacute;rnu.</li>
<li>Vyberte možnost <strong>IP</strong>.</li>
<ul>
	<li>Jako <strong>Protokol</strong> nastavte možnost <strong>Line Printer Daemon&nbsp;&ndash; LPD</strong>.</li>
	<li>Zadejte IP adresu tisk&aacute;rny.</li>
	<li>Do pole <strong>Fronta</strong> zadejte hodnotu &bdquo;usbprinter&ldquo;.</li>
	<li>Jako možnost <strong>Print Using</strong> (Tisknout pomoc&iacute;) vyberte položku <strong>Generic PostScript Printer</strong> (Obecn&aacute; tisk&aacute;rna PostScript).</li>
	<li>Dokončete postup kliknut&iacute;m na možnost <strong>Přidat</strong>.</li>
</ul>
</ol>
<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Syst&eacute;m AppleTalk již nen&iacute; v&nbsp;r&aacute;mci syst&eacute;mu Mac OS 10.6.X podporov&aacute;n. Chcete-li použ&iacute;t tisk&aacute;rnu AppleTalk, vyhledejte v&nbsp;př&iacute;slu&scaron;n&eacute; dokumentaci možnosti připojen&iacute; tisk&aacute;rny k&nbsp;poč&iacute;tači se syst&eacute;mem Mac nebo k&nbsp;m&iacute;stn&iacute; s&iacute;ti. Pokud nelze tisk&aacute;rnu připojit, připojte ji k&nbsp;poč&iacute;tači Mac se syst&eacute;mem Mac OS 10.5.X a&nbsp;nastavte ji jako sd&iacute;lenou tisk&aacute;rnu.</li>
</ul>
</div>

<p><strong>Pro Mac OS 10.5.X:</strong></p>
<ol>
<li>Postupujte podle kroků uveden&yacute;ch v&nbsp;č&aacute;sti <a href="system_externaldevice_printer.html#t1">Nastaven&iacute; tisk&aacute;rny&nbsp;USB</a>.</li>
<li>V&nbsp;poč&iacute;tači se syst&eacute;mem Mac přejděte do č&aacute;sti <b>System Preferences</b> (Syst&eacute;mov&eacute; předvolby) &gt; <b>Printer &amp; Fax</b> (Tisk&aacute;rna a&nbsp;fax) a&nbsp;kliknut&iacute;m na symbol <strong>+</strong> přidejte novou tisk&aacute;rnu.</li>
<li>Zvolte metodu.</li>
<ul>
	<li>Metoda č. 1: <strong>AppleTalk</strong></li>
	<ul>
		<li>Jako možnost <strong>Print Using</strong> (Tisknout pomoc&iacute;) vyberte položku <strong>Generic PostScript Printer</strong> (Obecn&aacute; tisk&aacute;rna PostScript).</li>
		<li>Dokončete postup kliknut&iacute;m na možnost <strong>Přidat</strong>.</li>
	</ul>
	<li>Metoda č. 2: <strong>IP</strong></li>
	<ul>
		<li>Jako Protokol nastavte možnost <strong>Line Printer Daemon&nbsp;&ndash; LPD</strong>.</li>
		<li>Zadejte IP adresu tisk&aacute;rny.</li>
		<li>Do pole <strong>Fronta</strong> zadejte hodnotu &bdquo;usbprinter&ldquo;.</li>
		<li>Jako možnost <strong>Print Using</strong> (Tisknout pomoc&iacute;) vyberte položku <strong>Generic PostScript Printer</strong> (Obecn&aacute; tisk&aacute;rna PostScript).</li>
		<li>Dokončete postup kliknut&iacute;m na možnost <strong>Přidat</strong>.</li>
	</ul>
</ul>
</ol>
</div>

<h3>Spr&aacute;va tisk&aacute;ren</h3>
<p>Karta tisk&aacute;ren obsahuje n&aacute;sleduj&iacute;c&iacute; možnosti spr&aacute;vy tisk&aacute;ren USB nebo s&iacute;ťov&yacute;ch tisk&aacute;ren připojen&yacute;ch k&nbsp;zař&iacute;zen&iacute; Synology NAS.</p>

<ul>
<li><b>Z&iacute;skat informace:</b> Zobraz&iacute; informace t&yacute;kaj&iacute;c&iacute; se vybran&eacute; tisk&aacute;rny, např&iacute;klad n&aacute;zev zař&iacute;zen&iacute;, v&yacute;robce, stav apod.</li>
<li><strong>Odebrat:</strong> Odebere a&nbsp;odpoj&iacute; tisk&aacute;rnu od zař&iacute;zen&iacute; Synology NAS.</li>
<li><strong>Spr&aacute;va tisk&aacute;rny:</strong> Obsahuje n&aacute;sleduj&iacute;c&iacute; možnosti:<ul>
<li><strong>Nastavit tisk&aacute;rnu</strong>: Upravte nastaven&iacute; tisk&aacute;rny. Službu Apple Wireless Printing lze nastavit podle n&iacute;že uveden&yacute;ch pokynů.</li>
<li><strong>Vyčistit frontu:</strong> Zru&scaron;&iacute; v&scaron;echny tiskov&eacute; &uacute;lohy na v&scaron;ech tisk&aacute;rn&aacute;ch.</li>
<li><strong>Tisk zku&scaron;ebn&iacute; str&aacute;nky:</strong> Vytiskne zku&scaron;ebn&iacute; str&aacute;nku a&nbsp;ověř&iacute; spr&aacute;vnost konfigurac&iacute;.</li>
<li><b>Uvolnit tisk&aacute;rnu:</b> Odpoj&iacute; tisk&aacute;rnu a&nbsp;klienta (k&nbsp;dispozici pouze u režimu Network MFP). Pokud se klient připojuje k&nbsp;multifunkčn&iacute; tisk&aacute;rně kvůli př&iacute;jmu faxov&yacute;ch zpr&aacute;v nebo skenov&aacute;n&iacute; souborů, může tato &uacute;loha trvat d&eacute;le. Je-li potřeba, může se připojen&iacute; pozastavit, aby bylo možn&eacute; př&iacute;stup k&nbsp;tisk&aacute;rně umožnit dal&scaron;&iacute;mu klientovi v&nbsp;řadě.</li>
</ul></li>
</ul>


<h4>Povolen&iacute; služby Apple Wireless Printing:</h4>
<ol>
<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Extern&iacute; zař&iacute;zen&iacute;</strong> &gt; <strong>Tisk&aacute;rna</strong>.</li>
<li>Vyberte tisk&aacute;rnu ze seznamu zař&iacute;zen&iacute;.</li>
<li>Klikněte na možnost <b>Spr&aacute;va tisk&aacute;rny</b> &gt; <b>Nastavit tisk&aacute;rnu</b>.</li>
<li>Za&scaron;krtněte pol&iacute;čko <b>Povolit Apple Wireless Printing</b>.</li>
<li>Vyberte značku a&nbsp;ovladač tisk&aacute;rny.</li>
<li>Klikněte na možnost <b>Uložit</b>.</li>
</ol>

<p>Po dokončen&iacute; nastaven&iacute; můžete vytisknout zku&scaron;ebn&iacute; str&aacute;nku, a&nbsp;to kliknut&iacute;m na možnost <b>Spr&aacute;va tisk&aacute;rny</b> &gt; <b>Tisk zku&scaron;ebn&iacute; str&aacute;nky</b>.</li>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Povolen&iacute;m technologie Apple Wireless Printing se pro syst&eacute;m DSM povol&iacute; tak&eacute; funkce Přenos tisk&aacute;rny Bonjour.</li>
<li>Služba Apple Wireless Printing je k&nbsp;dispozici u syst&eacute;mu iOS&nbsp;4.2 nebo nověj&scaron;&iacute;ch.</li>
</ul>
</div>

<h3>Př&iacute;stup k&nbsp;tisk&aacute;rn&aacute;m</h3>
<p>Př&iacute;stup k&nbsp;tisk&aacute;rn&aacute;m pomoc&iacute; poč&iacute;tače PC nebo Mac z&iacute;sk&aacute;te podle pokynů v&nbsp;n&iacute;že uveden&eacute; č&aacute;sti.</p>
<h4><a name="others"></a>Možnosti př&iacute;stupu k&nbsp;tisk&aacute;rn&aacute;m pomoc&iacute; poč&iacute;tače se syst&eacute;mem Windows:</h4>
<p>Př&iacute;stup ke službě tisku zař&iacute;zen&iacute; Synology NAS lze nejl&eacute;pe nastavit připojen&iacute;m k&nbsp;tisk&aacute;rně prostřednictv&iacute;m aplikace Synology Assistant. Podrobn&eacute; pokyny se nach&aacute;zej&iacute; v&nbsp;jej&iacute; n&aacute;povědě.</p>

<p>Pokud nen&iacute; aplikace Synology Assistant v&nbsp;poč&iacute;tači nainstalov&aacute;na, přečtěte si n&iacute;že uveden&eacute; rady t&yacute;kaj&iacute;c&iacute; se jin&yacute;ch způsobů př&iacute;stupu k&nbsp;tiskov&eacute; službě zař&iacute;zen&iacute; Synology NAS.</p>
<p><strong>Typ 1. Sd&iacute;len&aacute; s&iacute;ťov&aacute; tisk&aacute;rna</strong></p>
<ol>
<li>Aktivujte na poč&iacute;tači v&nbsp;programu Průzkumn&iacute;k souborů možnost <b>S&iacute;ť</b> a&nbsp;klikněte dvakr&aacute;t na zař&iacute;zen&iacute; Synology NAS.</li>

<li>Dvakr&aacute;t klikněte na možnost <b>usbprinter</b> nebo <b>n&aacute;zev s&iacute;ťov&eacute; tisk&aacute;rny</b>; syst&eacute;m v&aacute;s vyzve k&nbsp;instalaci spr&aacute;vn&eacute;ho ovladače. Pot&eacute; klikněte na možnost <b>Ano</b>.</li>

<li>Ovladač tisk&aacute;rny se nach&aacute;z&iacute; na disku&nbsp;CD nebo na webov&eacute; str&aacute;nce v&yacute;robce. Vyberte v&yacute;robce a&nbsp;model tisk&aacute;rny nebo vyberte um&iacute;stěn&iacute; ovladače kliknut&iacute;m na možnost <strong>Z&nbsp;disku</strong>. Pot&eacute; klikněte na možnost <b>OK</b>.</li>
<li>Syst&eacute;m zah&aacute;j&iacute; instalaci s&iacute;ťov&eacute; tisk&aacute;rny. Po dokončen&iacute; nastaven&iacute; je možn&eacute; zač&iacute;t tisk&aacute;rnu použ&iacute;vat.</li>
</ol>


<p><strong>Typ&nbsp;2 Port LPR (doporučeno)</strong></p>
<ol>
<li>Klikněte v&nbsp;poč&iacute;tači na tlač&iacute;tko <b>Start</b> a&nbsp;přejděte do č&aacute;sti <b>Zař&iacute;zen&iacute; a&nbsp;tisk&aacute;rny</b>.</li>
<li>Klikněte na možnost <b>Přidat tisk&aacute;rnu</b>.</li>
	<li>Vyberte možnost <strong>Přidat s&iacute;ťovou tisk&aacute;rnu, bezdr&aacute;tovou tisk&aacute;rnu nebo tisk&aacute;rnu s&nbsp;technologi&iacute; Bluetooth</strong>.</li>
	<li>Vyberte možnost <strong>Požadovan&aacute; tisk&aacute;rna nen&iacute; v&nbsp;seznamu</strong>.</li>
<li>Vyberte možnost <b>Přidat tisk&aacute;rnu pomoc&iacute; TCP/IP&nbsp;adresy nebo n&aacute;zvu hostitele</b>. Pokračujte kliknut&iacute;m na možnost <b>Dal&scaron;&iacute;</b>.</li>
<li>V&nbsp;č&aacute;sti Typ zař&iacute;zen&iacute; vyberte možnost <b>Zař&iacute;zen&iacute; TCP/IP</b>.</li>
<li>Zadejte IP adresu zař&iacute;zen&iacute; Synology NAS. Pokračujte kliknut&iacute;m na možnost <b>Dal&scaron;&iacute;</b>.</li>
<li>Vyberte položku <b>Typ zař&iacute;zen&iacute;</b>: <strong>Vlastn&iacute;</strong> &gt; <strong>Nastaven&iacute;</strong> &gt; …. Pokračujte kliknut&iacute;m na možnost <b>Dal&scaron;&iacute;</b>.</li>

<li>Jako protokol vyberte <b>LPR</b>, jako n&aacute;zev fronty zadejte <b>usbprinter</b> nebo <b>network printer name</b> a&nbsp;za&scaron;krtněte pol&iacute;čko <b>Povolit poč&iacute;t&aacute;n&iacute; bajtů protokolu LPR</b>. Pokračujte kliknut&iacute;m na možnost <b>OK</b>.</li>

<li>Ovladač tisk&aacute;rny se nach&aacute;z&iacute; na disku&nbsp;CD nebo na webov&eacute; str&aacute;nce v&yacute;robce. Vyberte v&yacute;robce a&nbsp;model tisk&aacute;rny nebo vyberte um&iacute;stěn&iacute; ovladače kliknut&iacute;m na možnost <strong>Z&nbsp;disku</strong>. Pot&eacute; klikněte na možnost <b>OK</b>.</li>
	<li>Syst&eacute;m zah&aacute;j&iacute; instalaci s&iacute;ťov&eacute; tisk&aacute;rny. Po dokončen&iacute; nastaven&iacute; je možn&eacute; zač&iacute;t tisk&aacute;rnu použ&iacute;vat.</li>
</ol>

<h4>Př&iacute;stup k&nbsp;tisk&aacute;rn&aacute;m pomoc&iacute; poč&iacute;tače Mac:</h4>
<p>Uživatel&eacute; poč&iacute;tačů Mac mohou z&iacute;skat př&iacute;stup ke službě tisku zař&iacute;zen&iacute; Synology NAS povolen&iacute;m přenosu tisk&aacute;rny Bonjour syst&eacute;mu DSM a přid&aacute;n&iacute;m tisk&aacute;rny v&nbsp;č&aacute;sti Syst&eacute;mov&eacute; předvolby.</p>

<P>Než budete pokračovat, přesvědčte se, zda je k&nbsp;zař&iacute;zen&iacute; Synology NAS připojena tisk&aacute;rna využ&iacute;vaj&iacute;c&iacute; jazyk Postscript.</p>

<p><strong>Krok&nbsp;1 Povolen&iacute; přenosu tisk&aacute;rny DSM Bonjour:</strong></p>
<ol>
<li>Přihlaste se do syst&eacute;mu DSM jako uživatel <b>admin</b> nebo uživatel ze skupiny <b>administrators</b>.</li>
<li>Přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <strong>Souborov&eacute; služby</strong> &gt; <b>Win/Mac/NFS</b>.</li>
<li>Za&scaron;krtněte možnost <b>Povolit přenos tisk&aacute;rny Bonjour</b>.</li>
</ol>

<p><strong>Krok&nbsp;2 Př&iacute;stup k&nbsp;tisk&aacute;rně pomoc&iacute; poč&iacute;tače Mac</strong></p>
<ol>
  <li>V&nbsp;poč&iacute;tači Mac přejděte do č&aacute;sti <strong>System Preferences</strong> (Syst&eacute;mov&eacute; předvolby) &gt; <strong>Print &amp; Scan</strong> (Tisk&aacute;rny a&nbsp;skenov&aacute;n&iacute;) a&nbsp;klikněte na symbol <strong>+</strong>.</li>
  <li>V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce vyberte možnost <strong>usbprinter[č&iacute;slo]</strong> nebo <strong>n&aacute;zev s&iacute;ťov&eacute; tisk&aacute;rny</strong>. Poč&iacute;tač Mac provede automatick&eacute; nastaven&iacute; tisk&aacute;rny.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Zař&iacute;zen&iacute; RC18015xs+ nepodporuje USB tisk&aacute;rny.</li>
  </ul>
</div>



</body>
</html>
