<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Extern&iacute; zař&iacute;zen&iacute;</h2>

<p>Seznam extern&iacute;ch &uacute;ložn&yacute;ch zař&iacute;zen&iacute; připojen&yacute;ch k&nbsp;zař&iacute;zen&iacute; Synology NAS je možn&eacute; zobrazit v&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <b>Extern&iacute; zař&iacute;zen&iacute;</b> &gt; <b>Extern&iacute; zař&iacute;zen&iacute;</b>.</p>

<h3><a name="usbdisk"></a><a name="esatadisk"></a>Extern&iacute; zař&iacute;zen&iacute;</h3>
<p>Připojen&iacute;m extern&iacute;ho disku k&nbsp;syst&eacute;mu z&iacute;sk&aacute;te možnost sd&iacute;let kapacitu disku prostřednictv&iacute;m syst&eacute;mem vytvořen&eacute; sd&iacute;len&eacute; složky <b>usbshare[č&iacute;slo]</b> (u&nbsp;disků USB) nebo <b>satashare[č&iacute;slo]</b> (u&nbsp;disků eSATA). Sd&iacute;len&aacute; složka se po odpojen&iacute; extern&iacute;ho disku od syst&eacute;mu automaticky odebere.</p>

<p>Zař&iacute;zen&iacute; Synology NAS dok&aacute;že rozpoznat n&aacute;sleduj&iacute;c&iacute; form&aacute;ty: <strong>Btrfs</strong>, <strong>ext3</strong>, <strong>ext4</strong>, <strong>FAT</strong>, <strong>FAT32</strong>, <strong>exFAT</strong>, <strong>HFS</strong>, <strong>HFS Plus</strong> a <strong>NTFS</strong>. Nerozpoznan&yacute; extern&iacute; disk je nutn&eacute; před prvn&iacute;m použit&iacute;m v&nbsp;syst&eacute;mu naform&aacute;tovat.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ol>
	<li>Někter&eacute; modely podporuj&iacute; u&nbsp;syst&eacute;mu&nbsp;HFS/HFS Plus jen čten&iacute;.</li>
	<li>Syst&eacute;m&nbsp;HFS/HFS Plus nepodporuje funkci Journal.</li>
	<li>Chcete-li na serveru Synology NAS povolit podporu syst&eacute;mu exFAT, je nutn&eacute; z&nbsp;<strong>Centra bal&iacute;čků</strong> nainstalovat bal&iacute;ček <strong>exFAT Access</strong>. Seznam modelů produktů Synology, kter&eacute; podporuj&iacute; form&aacute;t exFAT, se nach&aacute;z&iacute; na <a href="https://www.synology.com/dsm/packages/exFAT" target="_blank">t&eacute;to str&aacute;nce</a>.</li>
	<li>Před odpojen&iacute;m se přesvědčte, že jste extern&iacute; disk vysunuli.</li>
	<li>Syst&eacute;m Btrfs je dostupn&yacute; pouze na někter&yacute;ch modelech. Chcete-li zkontrolovat, jestli v&aacute;&scaron; model podporuje syst&eacute;m Btrfs, přečtěte si <a href="https://www.synology.com/knowledgebase/DSM/tutorial/General/Which_Synology_NAS_models_support_the_Btrfs_file_system" target="_blank">tento čl&aacute;nek</a>.</li>
</ol>
</div>

<h4>Př&iacute;stup k&nbsp;bitov&yacute;m kopi&iacute;m disků:</h4>
<p>Zař&iacute;zen&iacute; Synology NAS podporuje připojen&iacute; virtu&aacute;ln&iacute;ch disků umožňuj&iacute;c&iacute;ch př&iacute;stup k&nbsp;obsahu bitov&yacute;ch kopi&iacute; disků na extern&iacute;ch zař&iacute;zen&iacute;ch pomoc&iacute; služby File Station. Postup připojen&iacute; virtu&aacute;ln&iacute;ch disků se nach&aacute;z&iacute; v&nbsp;<a href="https://www.synology.com/knowledgebase/DSM/help/FileStation/mountiso" target="_blank">tomto čl&aacute;nku</a>.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
<li>Podporovan&eacute; form&aacute;ty bitov&eacute; kopie disku: Soubory &bdquo;.iso&ldquo; použ&iacute;vaj&iacute; standard ISO 9960 a souborov&yacute; syst&eacute;m UDF.</li>
</ul>
</div>

<h4>Form&aacute;tov&aacute;n&iacute; disku:</h4>

<p>Klikněte na možnost <b>Naform&aacute;tovat</b> a&nbsp;postupujte podle pokynů průvodce. Na serveru Synology NAS je možn&eacute; extern&iacute; disky naform&aacute;tovat na form&aacute;t <b>ext4</b> a&nbsp;<b>FAT32</b>.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ol>
	<li>Před form&aacute;tov&aacute;n&iacute;m extern&iacute;ho disku se přesvědčte, zda jste data z&aacute;lohovali. Při form&aacute;tov&aacute;n&iacute; se v&scaron;echna data odstran&iacute; a nelze je obnovit.</li>
	<li>Pokud chcete naform&aacute;tovat extern&iacute; disk na form&aacute;t ext3 nebo ext4, mus&iacute; b&yacute;t kapacita disku vět&scaron;&iacute; než 1&nbsp;GB.</li>
	<li>Pokud je disk naform&aacute;tov&aacute;n na form&aacute;t ext3 nebo ext4, rozpozn&aacute; jej pouze zař&iacute;zen&iacute; Synology NAS. Chcete-li data př&iacute;mo z&nbsp;extern&iacute;ho disku č&iacute;st na poč&iacute;tači PC nebo Mac, zvolte form&aacute;t FAT32.</li>
</ol>
</div>

<h4>Proveden&iacute; testu S.M.A.R.T. Test:</h4>
<p>S.M.A.R.T. pro disky Test zkoum&aacute; a hl&aacute;s&iacute; stav pevn&yacute;ch disků a&nbsp;poskytuje včasnou v&yacute;strahu u hroz&iacute;c&iacute;ch poruch disku. V&nbsp;př&iacute;padě v&yacute;skytu jak&yacute;chkoliv chyb doporučujeme disky vyměnit. <br /> Proveden&iacute; testu S.M.A.R.T. Test se prov&aacute;d&iacute; kliknut&iacute;m na tlač&iacute;tko <strong>Test S.M.A.R.T.</strong> a postupem podle pokynů průvodce.<br /> V&yacute;sledky testu vyvol&aacute;te kliknut&iacute;m na možnost <strong>Informace S.M.A.R.T.</strong></p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Doba testu se může li&scaron;it podle prostřed&iacute; syst&eacute;mu.</li>
</ul>
</div>


<div class="section">
<h4>Omezen&iacute;</h4>

<p>Form&aacute;tov&aacute;n&iacute; disků nen&iacute; k&nbsp;dispozici v&nbsp;n&aacute;sleduj&iacute;c&iacute;ch situac&iacute;ch:</p>

<ul>
	<li>Extern&iacute; disk se inicializuje, tj. když bylo extern&iacute; zař&iacute;zen&iacute; pr&aacute;vě připojeno.</li>
	<li>Kapacita extern&iacute;ho disku je men&scaron;&iacute; než 1&nbsp;GB (form&aacute;t ext3 nebo ext4).</li>
	<li>Extern&iacute; disk se pr&aacute;vě form&aacute;tuje.</li>
	<li>Syst&eacute;m na extern&iacute; disk z&aacute;lohuje soubory.</li>
	<li>Extern&iacute; disk je po&scaron;kozen&yacute;.</li>
</ul>

<h4>Odstraňov&aacute;n&iacute; pot&iacute;ž&iacute;</h4>
<ol>
	<li>Extern&iacute; disk se nepodařilo naform&aacute;tovat. Proč?<ul>
			<li>Ověřte, jestli je extern&iacute; disk spr&aacute;vně vložen&yacute;.</li>
			<li>Ověřte, jestli nen&iacute; extern&iacute; disk chr&aacute;něn&yacute; proti z&aacute;pisu. Pokud ano, před form&aacute;tov&aacute;n&iacute;m ochranu zru&scaron;te.</li>
		</ul>
	</li>
	<li>Souborov&yacute; syst&eacute;m extern&iacute;ho disku se zobrazuje se stavem <strong>Nepodporov&aacute;no</strong>, př&iacute;padně syst&eacute;m nevytvoř&iacute; pro extern&iacute; disk sd&iacute;lenou složku <strong>usbshare[č&iacute;slo]</strong> nebo <strong>satashare[č&iacute;slo]</strong>. Co m&aacute;m dělat?<ul>
			<li>Aktu&aacute;ln&iacute; syst&eacute;m dok&aacute;že rozpoznat form&aacute;ty Btrfs, ext3, ext4, FAT, FAT32, HFS, HFS Plus a NTFS. Extern&iacute; disk, kter&yacute; nen&iacute; naform&aacute;tovan&yacute; na někter&yacute; z&nbsp;v&yacute;&scaron;e uveden&yacute;ch form&aacute;tů, nebude rozpozn&aacute;n a&nbsp;jeho stav se bude zobrazovat jako <b>Nepodporov&aacute;no</b>.</li>
		</ul>
	</li>
	<li>Nen&iacute; možn&yacute; př&iacute;stup ke sd&iacute;len&eacute; složce <b>usbshare[č&iacute;slo]</b> nebo <b>satashare[č&iacute;slo]</b>. Co m&aacute;m dělat?<ul>
			<li>Toto může b&yacute;t způsobeno probl&eacute;mem v&nbsp;souborov&eacute;m syst&eacute;mu extern&iacute;ho disku. Chcete-li probl&eacute;m vyře&scaron;it, připojte extern&iacute; disk k&nbsp;poč&iacute;tači a&nbsp;proveďte kontrolu souborov&eacute;ho syst&eacute;mu.</li>
		</ul>
	</li>
	<li>Je možn&eacute; extern&iacute; disk s&nbsp;form&aacute;tem&nbsp;ext3 nebo ext4 připojit k&nbsp;poč&iacute;tači PC nebo Mac a m&iacute;t k&nbsp;němu př&iacute;m&yacute; př&iacute;stup?<ul>
			<li>Ne, form&aacute;t ext3 nebo ext4 dok&aacute;že rozpoznat pouze zař&iacute;zen&iacute; Synology NAS. Chcete-li data př&iacute;mo z&nbsp;extern&iacute;ho disku č&iacute;st na poč&iacute;tači PC nebo Mac, zvolte form&aacute;t FAT32.</li>
		</ul>
	</li>
	<li>Proč se na extern&iacute;m disku zobrazuje složka &bdquo;lost+found&ldquo;?<ul>
			<li>Jedn&aacute; se o&nbsp;v&yacute;choz&iacute; syst&eacute;movou složku, kter&aacute; se vytv&aacute;ř&iacute; automaticky při použit&iacute; souborov&eacute;ho syst&eacute;mu ext3/ext4. Existence t&eacute;to složky na extern&iacute;m disku je norm&aacute;ln&iacute;. Spr&aacute;vci maj&iacute; opr&aacute;vněn&iacute; pro př&iacute;stup a spr&aacute;vu obsahu t&eacute;to složky, doporučuje se v&scaron;ak, abyste do t&eacute;to složky nezasahovali.</li>
		</ul>
	</li>
</ol>
</div>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Syst&eacute;m Btrfs je dostupn&yacute; pouze na někter&yacute;ch modelech. Chcete-li zkontrolovat, jestli v&aacute;&scaron; model podporuje syst&eacute;m Btrfs, přečtěte si <a href="https://www.synology.com/knowledgebase/DSM/tutorial/General/Which_Synology_NAS_models_support_the_Btrfs_file_system" target="_blank">tento čl&aacute;nek</a>.</li>
</ul>
</div>

<h4>Nastaven&iacute; v&yacute;choz&iacute;ch opr&aacute;vněn&iacute; pro v&scaron;echna extern&iacute; zař&iacute;zen&iacute;:</h4>
<p>V&yacute;choz&iacute; opr&aacute;vněn&iacute; nastav&iacute;te kliknut&iacute;m na možnost <strong>Nastaven&iacute;</strong> &gt; <strong>V&yacute;choz&iacute; opr&aacute;vněn&iacute;</strong> a stanoven&iacute;m uživatelů a&nbsp;skupin, kter&eacute; mohou m&iacute;t k&nbsp;extern&iacute;m zař&iacute;zen&iacute;m a jejich obsahu př&iacute;stup a tato zař&iacute;zen&iacute; a obsah zobrazovat nebo upravovat. Pokud k&nbsp;zař&iacute;zen&iacute; Synology NAS připoj&iacute;te extern&iacute; zař&iacute;zen&iacute;, budou stanoven&aacute; opr&aacute;vněn&iacute; přiřazena tomuto extern&iacute;mu zař&iacute;zen&iacute; automaticky.</p>

<p>V&nbsp;okně opr&aacute;vněn&iacute; nastavte v&yacute;choz&iacute; opr&aacute;vněn&iacute; takto:</p>
<ol>
	<li>V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce vyberte jednu z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;:<ul>
			<li><b>Intern&iacute; uživatel syst&eacute;mu:</b> Přiřaďte opr&aacute;vněn&iacute; pro v&yacute;choz&iacute; uživatele syst&eacute;mu, např. uživatele služeb Anonymous FTP/WebDAV.</li>
			<li><b>M&iacute;stn&iacute; uživatel&eacute;:</b> Přiřaďte opr&aacute;vněn&iacute; pro m&iacute;stn&iacute; uživatele (včetně uživatele <b>guest</b>).</li>
			<li><b>M&iacute;stn&iacute; skupiny:</b> Přiřaďte opr&aacute;vněn&iacute; pro m&iacute;stn&iacute; skupiny.</li>
		</ul>
	</li>
	<li>Za&scaron;krtnut&iacute;m nebo zru&scaron;en&iacute;m za&scaron;krtnut&iacute; pol&iacute;ček přizpůsob&iacute;te př&iacute;stupov&aacute; opr&aacute;vněn&iacute; extern&iacute;ch zař&iacute;zen&iacute; pro jednotliv&eacute; uživatele nebo skupiny:<ul>
			<li><b>Čten&iacute;/z&aacute;pis</b>: Uživatel nebo skupina budou m&iacute;t př&iacute;stup k&nbsp;souborům a&nbsp;složk&aacute;m na extern&iacute;ch zař&iacute;zen&iacute;ch a&nbsp;mohou prov&aacute;dět jejich změny.</li>
			<li><b>Jen pro čten&iacute;</b>: Uživatel nebo skupina budou m&iacute;t př&iacute;stup k&nbsp;souborům a&nbsp;složk&aacute;m na extern&iacute;ch zař&iacute;zen&iacute;ch.</li>
			<li><b>Ž&aacute;dn&yacute; př&iacute;stup</b>: Uživatel nebo skupina k&nbsp;souborům a&nbsp;složk&aacute;m na extern&iacute;ch zař&iacute;zen&iacute;ch nebudou m&iacute;t př&iacute;stup.</li>
		</ul>
	</li>
</ol>

</body>
</html>