<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" charset="utf-8">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Obecn&eacute;</h2>

<p>Č&aacute;st <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Hardware a&nbsp;nap&aacute;jen&iacute;</strong> &gt; <strong>Obecn&eacute;</strong> nab&iacute;z&iacute; možnosti umožňuj&iacute;c&iacute; zotaven&iacute; po ztr&aacute;tě nap&aacute;jen&iacute; a funkci Wake on LAN (WOL) (Probuzen&iacute; přes LAN). Můžete zde tak&eacute; změnit nastaven&iacute; zvukov&yacute;ch sign&aacute;lů, režim ot&aacute;ček ventil&aacute;toru a jas kontrolek LED.</p>

<h3>Komprese paměti</h3>
	<p>Povolen&iacute;m komprese paměti je možn&eacute; zlep&scaron;it obecnou odezvu syst&eacute;mu při zat&iacute;žen&iacute; proveden&iacute;m komprese nejm&eacute;ně často ned&aacute;vno použ&iacute;van&yacute;ch dat v&nbsp;paměti.</p>
	<p>Když m&aacute;te spu&scaron;těn&yacute;ch v&iacute;ce aplikac&iacute; a paměť se zač&iacute;n&aacute; plnit, provede dynamick&aacute; komprese paměti zmen&scaron;en&iacute; zř&iacute;dka použ&iacute;van&yacute;ch položek paměti a sn&iacute;ž&iacute; tak velikost využ&iacute;van&eacute; paměti. Když jsou tyto položky znovu potřeba, je možn&eacute; je okamžitě dekomprimovat. Snižuje se tak potřeba čten&iacute; a z&aacute;pisu odkl&aacute;dac&iacute;ch souborů paměti na disk a zvy&scaron;uje efektivita a odezva.</p>
	<p>Kompresi paměti povol&iacute;te za&scaron;krtnut&iacute;m pol&iacute;čka.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Komprese paměti je dostupn&aacute; pouze u&nbsp;vybran&yacute;ch modelů. Dal&scaron;&iacute; informace se nach&aacute;zej&iacute; na <a href="https://www.synology.com/" target="_blank">webov&yacute;ch str&aacute;nk&aacute;ch Synology</a>.</li>
	</ul>
</div>

<h3>Zotaven&iacute; po ztr&aacute;tě nap&aacute;jen&iacute;</h3>
<p>V&nbsp;př&iacute;padě, že se syst&eacute;m vypnul kvůli neoček&aacute;van&eacute;mu přeru&scaron;en&iacute; nap&aacute;jen&iacute;, umožňuje funkce zotaven&iacute; po ztr&aacute;tě nap&aacute;jen&iacute; syst&eacute;mu po obnoven&iacute; dod&aacute;vky nap&aacute;jen&iacute; automatick&eacute; spu&scaron;těn&iacute;.</p>

<h3>Probuzen&iacute; přes LAN</h3>
<p>Povolen&iacute;m funkce Wake on LAN (WOL) (Probuzen&iacute; přes LAN) umožn&iacute;te zap&iacute;n&aacute;n&iacute; zař&iacute;zen&iacute; Synology NAS přes m&iacute;stn&iacute; s&iacute;ť nebo internet zad&aacute;n&iacute;m IP adresy (nebo n&aacute;zvu hostitele DDNS) a adresy MAC zař&iacute;zen&iacute; Synology NAS pomoc&iacute; aplikace WOL, např&iacute;klad Synology Assistant, DS finder nebo jin&eacute;.</p>

<p>Probuzen&iacute; přes LAN funguje pouze tehdy, pokud je zař&iacute;zen&iacute; Synology NAS ř&aacute;dně vypnut&eacute; stisknut&iacute;m fyzick&eacute;ho tlač&iacute;tka <b>Nap&aacute;jen&iacute;</b> nebo kliknut&iacute;m na možnost <b>Vypnout</b> na rozhran&iacute; syst&eacute;mu DSM. Po vypnut&iacute; ponechejte nap&aacute;jec&iacute; kabel zapojen&yacute; do funkčn&iacute; elektrick&eacute; z&aacute;suvky.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Funkce WOL je k&nbsp;dispozici pouze u&nbsp;vybran&yacute;ch modelů. Dal&scaron;&iacute; informace se nach&aacute;zej&iacute; na <a href="https://www.synology.com/knowledgebase/DSM/tutorial/General/Which_Synology_DiskStation_supports_WOL_Wake_on_LAN" target="_blank">webov&yacute;ch str&aacute;nk&aacute;ch Synology</a>.</li>
	<li>Funkce WOL nen&iacute; podporov&aacute;na na portech LAN 10GbE (pokud jsou ve va&scaron;em zař&iacute;zen&iacute; Synology NAS k&nbsp;dispozici).</li>
	<li>U&nbsp;zař&iacute;zen&iacute; RC18015xs+ je funkce WOL podle v&yacute;choz&iacute;ho nastaven&iacute; povolena u&nbsp;zař&iacute;zen&iacute; Synology NAS na portech LAN 1GbE a nelze ji zak&aacute;zat.</li>
</ul>
</div>

<h3>Režim ot&aacute;ček ventil&aacute;toru</h3>
<p>K&nbsp;dispozici jsou n&aacute;sleduj&iacute;c&iacute; volby ot&aacute;ček ventil&aacute;toru:</p>
<ul>
	<li><strong>Vysokorychlostn&iacute; režim</strong>: Ventil&aacute;tor běž&iacute; na maxim&aacute;ln&iacute; ot&aacute;čky, nepřetržitě zař&iacute;zen&iacute; Synology NAS ochlazuje, ale vyd&aacute;v&aacute; v&iacute;ce hluku.</li>
	<li><strong>Režim chlazen&iacute;:</strong> Ventil&aacute;tor běž&iacute; na vy&scaron;&scaron;&iacute; ot&aacute;čky, nepřetržitě zař&iacute;zen&iacute; Synology NAS ochlazuje, ale vyd&aacute;v&aacute; v&iacute;ce hluku.</li>
	<li><strong>Tich&yacute; režim:</strong> Ventil&aacute;tor běž&iacute; na niž&scaron;&iacute; ot&aacute;čky, vyd&aacute;v&aacute; m&eacute;ně hluku, může ale doch&aacute;zet k&nbsp;zahř&iacute;v&aacute;n&iacute; zař&iacute;zen&iacute; Synology NAS.</li>
	<li><strong>&Uacute;sporn&yacute; režim:</strong> Ventil&aacute;tor běž&iacute; na niž&scaron;&iacute; ot&aacute;čky, vyd&aacute;v&aacute; m&eacute;ně hluku, může ale doch&aacute;zet k&nbsp;zahř&iacute;v&aacute;n&iacute; zař&iacute;zen&iacute; Synology NAS. Kromě toho dojde po ochlazen&iacute; zař&iacute;zen&iacute; Synology NAS z&nbsp;důvodu &uacute;spory energie k&nbsp;zastaven&iacute; ventil&aacute;toru. &Uacute;sporn&yacute; režim je dostupn&yacute; pouze u&nbsp;určit&yacute;ch modelů.</li>
</ul>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Konfigurace souvisej&iacute;c&iacute; s&nbsp;ventil&aacute;torem nen&iacute; dostupn&aacute; u&nbsp;modelu bez ventil&aacute;toru, např&iacute;klad EDS14. Dal&scaron;&iacute; informace se nach&aacute;zej&iacute; na <a href="https://www.synology.com/knowledgebase/DSM/tutorial/General/What_type_of_fan_speed_modes_are_available_on_my_Synology_NAS" target="_blank">webov&yacute;ch str&aacute;nk&aacute;ch Synology</a>.</li>
</ul>
</div>

<h3>Nastaven&iacute; zvukov&yacute;ch sign&aacute;lů</h3>
<p>Zař&iacute;zen&iacute; Synology NAS může v&nbsp;př&iacute;padě v&yacute;skytu určit&yacute;ch ud&aacute;lost&iacute; nebo chyb vyd&aacute;vat zvukov&eacute; sign&aacute;ly. Za&scaron;krtnut&iacute;m pol&iacute;ček př&iacute;slu&scaron;n&yacute;ch ud&aacute;lost&iacute; povol&iacute;te zař&iacute;zen&iacute; Synology NAS upozornit zvukov&yacute;m sign&aacute;lem v&nbsp;př&iacute;padě v&yacute;skytu chyb.</p>

<h4>Vypnut&iacute; zvukov&yacute;ch sign&aacute;lů:</h4>
<ul>
	<li>Pokud zař&iacute;zen&iacute; Synology NAS vyd&aacute;v&aacute; zvukov&eacute; sign&aacute;ly, je možn&eacute; je vypnout kliknut&iacute;m na možnost <strong>Zvukov&yacute; sign&aacute;l je vypnut</strong>.</li>
</ul>



<h3>Kontrolka LED</h3>
<p>V&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Hardware a&nbsp;nap&aacute;jen&iacute;</strong> &gt; <strong>Obecn&eacute;</strong> &gt; <strong>Ovl&aacute;d&aacute;n&iacute; jasu LED</strong> je možn&eacute; nastavit jas kontrolek LED na zař&iacute;zen&iacute; Synology NAS.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Konfigurace LED je dostupn&aacute; pouze u&nbsp;vybran&yacute;ch modelů. Dal&scaron;&iacute; informace se nach&aacute;zej&iacute; na <a href="https://www.synology.com/knowledgebase/DSM/tutorial/General/Which_Synology_DiskStation_supports_LED_brightness_adjustment" target="_blank">webov&yacute;ch str&aacute;nk&aacute;ch Synology</a>.</li>
	<li>Nastaven&iacute; jasu plat&iacute; pro v&scaron;echny kontrolky LED na zař&iacute;zen&iacute; Synology NAS (tj. nap&aacute;jen&iacute;, STATUS, LAN, stav disku atd.).</li>
</ul>
</div>

<h4>&Uacute;prava jasu kontrolek LED:</h4>
<p>U kontrolek LED na zař&iacute;zen&iacute; Synology NAS jsou nyn&iacute; možn&eacute; čtyři &uacute;rovně jasu.</p>
<ol>
	<li>Klikněte a přet&aacute;hněte ukazatel jasu někter&yacute;m směrem:<ul>
			<li>Doprava: Zv&yacute;&scaron;&iacute; jas kontrolek LED.</li>
			<li>Doleva: Sn&iacute;ž&iacute; jas kontrolek LED.</li>
		</ul>
	</li>
	<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <strong>Použ&iacute;t</strong>.</li>
</ol>

<h4>&Uacute;prava jasu kontrolek LED podle pl&aacute;nu:</h4>
<p>Kontrolky LED mohou měnit &uacute;roveň jasu v&nbsp;napl&aacute;novan&yacute; čas.</p>

<ol>
	<li>Klikněte na možnost <strong>Nastavit pl&aacute;n</strong>.</li>
	<li>Klikněte na někter&yacute; z&nbsp;typů jasu n&iacute;že:<ul>
			<li><strong>V&yacute;choz&iacute; jas</strong>: Nejvy&scaron;&scaron;&iacute; jas</li>
			<li><strong>Upraven&yacute; jas</strong>: &Uacute;roveň jasu stanoven&aacute; na ukazateli jasu</li>
			<li><strong>Vypnout</strong>: Kontrolka LED nesv&iacute;t&iacute;</li>
		</ul>
	</li>
	<li>Kliknut&iacute;m na požadovan&aacute; obdob&iacute; uprav&iacute;te pl&aacute;n jasu.</li>
	<li>Kliknut&iacute;m na možnosti <strong>OK</strong> a <strong>Použ&iacute;t</strong> nastaven&iacute; ulož&iacute;te.</li>
</ol>

</body>
</html>