<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

	<h2>HDD/SSD</h2>
	<p>Bu b&ouml;l&uuml;m Synology NAS sunucunuza kurulu olan dahili depolama s&uuml;r&uuml;c&uuml;lerinin durumunu izlemenizi ve anlamanızı sağlar. Bu se&ccedil;enekleri y&ouml;netmek i&ccedil;in <strong>Depolama Y&ouml;neticisi</strong> &gt; <strong>HDD/SSD</strong> b&ouml;l&uuml;m&uuml;ne gidin.</p>


	<h4>HDD/SSD bilgilerini kontrol etmek i&ccedil;in:</h4>
	<ol>
		<li><b>HDD/SSD</b> sekmesine gidin.</li>
		<li>Listeden bir s&uuml;r&uuml;c&uuml; se&ccedil;erek genişletin. Burada S.M.A.R.T. durumunu, Disk/RAID Group bilgisini, model adını, seri numarasını, donanım yazılımı s&uuml;r&uuml;m&uuml;n&uuml; ve sıcaklığı g&ouml;rebilirsiniz.</li>
	</ol>	
	
	<h4>Sağlık bilgisini kontrol etmek i&ccedil;in:</h4>
    <ol>
      <li><b>HDD/SSD</b> sekmesine gidin.</li>
	  <li>Bir s&uuml;r&uuml;c&uuml; se&ccedil;in.</li>
      <li><b>Sağlık Bilgisi</b>'ne tıklayın.</li>
	  <li><strong>Genel bakış</strong> sekmesine giderek s&uuml;r&uuml;c&uuml;n&uuml;n ka&ccedil; saattir a&ccedil;ık olduğunu &ouml;ğrenebilir ve mevcut sıcaklığını, yeniden bağlanma/yeniden tanımlanma sayısını, bozuk sekt&ouml;r sayısını g&ouml;r&uuml;nt&uuml;leyebilirsiniz. Burada genel sağlık durumunu, S.M.A.R.T. durumunu ve IronWolf Health* durumunu da g&ouml;r&uuml;nt&uuml;leyebilirsiniz. Genel s&uuml;r&uuml;c&uuml; sağlık durumunun ve ilişkili sağlık koşullarının bir genel g&ouml;r&uuml;n&uuml;m&uuml; i&ccedil;in l&uuml;tfen aşağıdaki tabloya bakın.</li>
      <li>S&uuml;r&uuml;c&uuml; durumunu daha ayrıntılı teşhis etmek i&ccedil;in <strong>S.M.A.R.T. Bilgisi</strong> sekmesine gidin.</li>
    </ol>

<table>
	<tr>
		<th>S&uuml;r&uuml;c&uuml; Durumu</th>
		<th>Sağlık Koşulu</th>
	</tr>
	<tr>
		<td>Normal</td>
		<td>
			<p>S&uuml;r&uuml;c&uuml; ya iyi durumdadır ya da s&uuml;r&uuml;c&uuml; hakkındaki uyarı baskılanmıştır veya devre dışı bırakılmıştır.</p>
		</td>
	</tr>
	<tr>
		<td>Uyarı</td>
		<td>
			<p>S&uuml;r&uuml;c&uuml; &uuml;zerinde sorunlar algılandı ve/veya bozuk sekt&ouml;r sayısı belirlenen limiti aştı. Bu durumdaki s&uuml;r&uuml;c&uuml;lere bakım yapılabilse de takip edilmeleri gerekir.</p>
		</td>
	</tr>
	<tr>
		<td>Kritik</td>
		<td>
			<p>S&uuml;r&uuml;c&uuml; &uuml;zerinde kritik bir sorun ya da birden &ccedil;ok sorun algılandı. S&uuml;r&uuml;c&uuml;n&uuml;n hemen değiştirilmesi şiddetle &ouml;nerilir.</p>
		</td>
	</tr>
	<tr>
		<td>Arızalanıyor</td>
		<td>
			<p>S&uuml;r&uuml;c&uuml; &uuml;zerinde birden &ccedil;ok kritik sorun algılandı. S&uuml;r&uuml;c&uuml;ler bu sağlık durumunda olduklarında s&uuml;r&uuml;c&uuml; b&uuml;t&uuml;nl&uuml;ğ&uuml; garanti edilmez.</p>
		</td>
	</tr>
	<tr>
		<td>Erişim Hatası</td>
		<td>
			<p>S&uuml;r&uuml;c&uuml; iletişimi hataları s&uuml;r&uuml;c&uuml;n&uuml;n sistemden bağlantısının kopmasına veya ciddi okuma-yazma arızasına neden olmuş olabilir. Bu sağlık durumu genellikle ciddi sorunların ortaya &ccedil;ıkmış olduğunu g&ouml;sterir.</p>
		</td>
	</tr>
</table>



<div class="section">
<h4>Not:</h4>
<ul>
<li>SAS s&uuml;r&uuml;c&uuml;lerde t&uuml;m S.M.A.R.T. &ouml;zellikleri desteklenmez.</li>
</ul>
</div>

<h4>Disk uyarı durumunu modifiye etmek i&ccedil;in:</h4>
<P>DSM s&uuml;r&uuml;c&uuml;lerinizin sağlık durumunu s&uuml;rekli olarak izler ve sorunlar algılandığında sizi uyarır. Bazı sorunlar diğerlerinden daha ciddi olabilir. <strong>Uyarı</strong> sağlık durumunda oluşan belirli sorunlar i&ccedil;in (<strong>Sağlık Bilgisi</strong> &gt; <strong>Genel Bakış</strong> &ouml;ğesinde), uyarı aşağıdakiler yapılarak modifiye edilebilir:</P>
<ol>
 <li><strong>HDD/SSD</strong> sekmesine gidin.</li>
 <li>Uyarı durumundaki s&uuml;r&uuml;c&uuml;y&uuml; se&ccedil;in ve <strong>Sağlık Bilgisi</strong> &uuml;zerine tıklayın.</li> 
 <li><strong>Disk Uyarısını Değiştir</strong> &uuml;zerine tıklayın.</li>
 <li><strong>Uyarıyı Baskıla</strong> veya <strong>Uyarıyı Devre Dışı Bırak</strong> se&ccedil;eneğine tıklayın (sorunun t&uuml;r&uuml;ne bağlı olarak, bu iki se&ccedil;enek size sunulabilir): 
  <ul>
   <li><strong>Uyarıyı Baskıla:</strong> Kapasitesi d&uuml;şen alanın izlenmesi s&uuml;rd&uuml;r&uuml;lecektir; ancak, uyarılar sadece değeri d&uuml;şmeye devam ettik&ccedil;e tetiklenecektir.</li> 
   <li><strong>Uyarıyı Devre Dışı Bırak:</strong> S.M.A.R.T. alanının izlenmesi kalıcı olarak devre dışı bırakılacaktır.</li>
  </ul>
 </li>
</ol>

<div class="section">
<h4>Not:</h4>
<ul>
<li>Disk uyarı durumunun değiştirilmesi bir s&uuml;r&uuml;c&uuml; &uuml;zerinde oluşan sorunları &ccedil;&ouml;zmeyecek ve tekrarlanmasını &ouml;nlemeyecektir; bu y&uuml;zden, bu eylem uzun d&ouml;nemli bir &ccedil;&ouml;z&uuml;m olarak g&ouml;r&uuml;lmemelidir.</li>
<li>S.M.A.R.T. sorunları ile ilgili bir uyarının genellikle s&uuml;r&uuml;c&uuml; &uuml;zerinde ger&ccedil;ekleşmiş olan bir sorunu bildirdiğini unutmayın. Uyarının g&ouml;z ardı edilmesi veri kaybına neden olabilir.</li>
<li>Belirli S.M.A.R.T. alanları kritik olarak belirlenmiştir ve baskılanamaz veya devre dışı bırakılamaz.</li>
</div>


	<h4>S.M.A.R.T. testini başlatmak i&ccedil;in:</h4>
	<P>S.M.A.R.T. Testi, olası s&uuml;r&uuml;c&uuml; arızalarının uyarısını vermek amacıyla s&uuml;r&uuml;c&uuml;lerinizin durumunu inceler ve rapor eder. Herhangi bir hatanın saptanması durumunda s&uuml;r&uuml;c&uuml;n&uuml;z&uuml;n hemen değiştirilmesi &ouml;nerilir. </P>
    <ol>
      <li><strong>HDD/SSD</strong> sekmesine gidin.</li>
      <li>Bir s&uuml;r&uuml;c&uuml; se&ccedil;in.</li>
      <li><b>S.M.A.R.T. Testi</b> &ouml;ğesine tıklayın.</li>
      <li>Bir test tipini se&ccedil;in ve testi başlatmak i&ccedil;in <strong>Başlat</strong> &uuml;zerine tıklayın.</li>
      <li>En son test sonu&ccedil;ları <b>Test Sonucu</b> b&ouml;l&uuml;m&uuml;nde g&ouml;r&uuml;nt&uuml;lenir.</li>
      <li><strong>Ge&ccedil;miş</strong> sekmesine giderek &ouml;nceki test sonu&ccedil;larını g&ouml;r&uuml;nt&uuml;leyin.</li>
    </ol>
<div class="section">
<h4>Not:</h4>
    <ul>
     <li>Bir S.M.A.R.T. testinin &ccedil;alıştırılması i&ccedil;in gerekli zaman sistem kullanımına ve s&uuml;r&uuml;c&uuml; kapasitesine bağlı olarak değişebilir.</li> 
     <li>Test &ccedil;ıkışı ya <strong>Normal</strong> ya da <strong>Arızalanıyor</strong> olur.</li>
    </ul>
</div>

    <h4>S.M.A.R.T. testlerini programlamak i&ccedil;in:</h4>
    <p>S.M.A.R.T. testleri s&uuml;r&uuml;c&uuml;ler &uuml;zerinde otomatik olarak &ccedil;alışmak &uuml;zere programlanabilir.</p>
    <ol>
      <li><strong>Test Zamanlayıcısı</strong> sekmesine gidin.</li>
      <li><strong>Oluştur</strong> d&uuml;ğmesine tıklayarak yeni bir g&ouml;rev oluşturun.</li>
      <li>Aşağıdaki ayarları <strong>Genel</strong> sekmesinde değiştirin:</li>
      <ul>
        <li><strong>G&ouml;rev Adı:</strong> G&ouml;rev i&ccedil;in bir ad girin.</li>
        <li><strong>S.M.A.R.T. Test T&uuml;r&uuml;:</strong> Hızlı bir test veya genişletilmiş bir test yapmayı tercih edin.</li>
        <li><strong>S.M.A.R.T. Test Serisi:</strong> S.M.A.R.T. testinin her yapılışında hangi HDD/SSD'lerin test edileceğini se&ccedil;in.</li>
      </ul>
      <li><strong>Program</strong> sekmesinde, aşağıdaki ayarları modifiye edin:</li>
      <ul>
        <li><strong>Tarih:</strong> S.M.A.R.T. testinin yapılacağı tarihi belirtin. Bu test haftanın belirli g&uuml;nlerinde (&ouml;r. g&uuml;nl&uuml;k, haftasonları veya her Pazar) veya belirli tarihlerde (&ouml;r. 21/11/2016) yapılacak şekilde programlanabilir.</li>
        <li><strong>Zaman:</strong> S&uuml;r&uuml;c&uuml;lerde &ccedil;alıştırılacak S.M.A.R.T. test i&ccedil;in sıklığı ve bunun yanında birinci ve sonunca &ccedil;alışma zamanını belirleyin.</li>
      </ul>
      <li>Bitirmek i&ccedil;in <strong>Tamam</strong>'a tıklayın.</li>
    </ol>

<div class="section">
<h4>Not:</h4>
   <ul>
    <li>S.M.A.R.T. testi belirli bir s&uuml;r&uuml;c&uuml; &uuml;zerinde &ccedil;alışacak şekilde programlanmazsa, <strong>S.M.A.R.T. Testlerini Programla</strong> d&uuml;ğmesi o s&uuml;r&uuml;c&uuml;n&uuml;n <strong>Sağlık Bilgisi</strong> &gt; <strong>Genel Bakış</strong> se&ccedil;eneğinde belirir.</li> 
   </ul> 
</div>

<h4>Bozuk sekt&ouml;r uyarı desteğini etkinleştirmek i&ccedil;in*:</h4>
<ol>
	<li><b>Genel</b> sekmesine gidin.</li>
	<li><b>Bozuk sekt&ouml;r uyarısını etkinleştir</b> se&ccedil;eneğini işaretleyin. Varsayılan olarak bu işlev etkinleştirilmiştir.</li>
	<li><b>Bozuk sekt&ouml;rlerin sayısı</b> alanında limiti belirleyin. Bozuk sekt&ouml;rlerin sayısı burada belirtilen değere eriştiğinde bir sabit s&uuml;r&uuml;c&uuml;n&uuml;n durumu <b>Uyarı</b> olarak değişir.</li>
	<li><b>Uygula</b>'ya tıklayın.</li>
</ol>

<h4>Disk &ouml;mr&uuml; uyarı desteğini etkinleştirmek i&ccedil;in*: </h4>
<ol>
	<li><b>Genel</b> sekmesine gidin.</li>
	<li><b>Disk yaşam s&uuml;resi uyarısını etkinleştir</b> se&ccedil;eneğini işaretleyin. Varsayılan olarak bu işlev etkinleştirilmiştir.</li>
	<li>Limiti <b>Yaşam s&uuml;resi y&uuml;zdesi (%)</b> alanında belirleyin. Hesaplanan yaşam s&uuml;resi burada belirtilen değerin altında olduğunda bir SSD'nin durumu <b>Uyarı</b> olarak değişir.</li>
	<li><b>Uygula</b>'ya tıklayın.</li>
</ol>

<div class="section">
<h4>Not:</h4>
<ul>
<li>Disk &ouml;mr&uuml; sadece SSD'ler &uuml;zerinde desteklenir.</li>
<li>Disk &ouml;mr&uuml;n&uuml;n değeri S.M.A.R.T. bilgilerinden doğrudan oluşturulur. Disk S.M.A.R.T. niteliğini desteklemiyorsa, bu &ouml;zellik desteklenmez.</li>
</ul>
</div>

<h4>Benchmark yapmak i&ccedil;in*:</h4>
<ol>
	<li><b>HDD/SSD</b> sekmesine gidin.</li>
	<li>Bir s&uuml;r&uuml;c&uuml; se&ccedil;in ve <b>Benchmark</b> &uuml;zerine tıklayın.</li>
	<li>Beliren pencerede, performans testini başlatmak i&ccedil;in <b>Testi Şimdi &Ccedil;alıştır</b> &uuml;zerine tıklayın. Sonu&ccedil;lar test tamamlandığında burada g&ouml;r&uuml;nt&uuml;lenecektir.</li>
	<li>Sonucu &ouml;nceki testlerle karşılaştırmak i&ccedil;in, istenilen g&uuml;nl&uuml;ğ&uuml; se&ccedil;mek &uuml;zere <b>Kıyaslanan test</b> alanında <b>Se&ccedil;</b> &uuml;zerine tıklayın.</li>
</ol>

<div class="section">
<h4>Not:</h4>
<ul>
	<li>Sıralı &ccedil;ıkış, rastgele IOPS ve bekleme s&uuml;resi yaklaşık 18 dakika s&uuml;ren performans testinde bulunmaktadır.</li>
	<li>İki test t&uuml;r&uuml; vardır: <b>temel</b> ve <b>uzatılmış</b>.
	<ul>
		<li>RAID i&ccedil;in kullanılan diskler i&ccedil;in, sadece temel testleri yapabilirsiniz ve disklerin &uuml;zerindeki veriler etkilenmez. Ancak, RAID i&ccedil;in kullanılan HDD'ler i&ccedil;in yazma performansını test edemezsiniz.</li>
		<li>Kalan durumlarda, uzatılan testler doğruluğu artırmak i&ccedil;in yapılacaktır. Ancak, performans testleri veri doğruluğunu garanti etmez. Dolayısıyla, Benchmark yapmadan &ouml;nce disklerde &ouml;nemli veriler bulunmadığından emin olun.</li>
	</ul>
    </li>
	<li>Sistemin kullanılabilirliğini temin etmek i&ccedil;in, bir anda &uuml;&ccedil;ten fazla disk &uuml;zerinde veya sadece bir disk olduğunda test yapamazsınız. Ayrıca, disk kullanımı %5'i aştığında, sistem test doğruluğunu sağlamak i&ccedil;in performans testine ge&ccedil;meden &ouml;nce tekrar teyit etmenizi isteyecektir.</li>
	<li>Benchmark sonu&ccedil;ları &ouml;nceki testlerle karşılaştırılabilir. Fark %5'den fazla olduğunda, uyarılacaksınız.</li>
    <li>Disk Benchmark, &ccedil;alışırken diğer hizmetlere en az d&uuml;zeyde etkide bulunmak i&ccedil;in DSM'de d&uuml;ş&uuml;k &ouml;ncelikle &ccedil;alışır. Sunulan değerler sistem y&uuml;k&uuml;ne ve yapılandırmaya bağlı olarak değişkenlik g&ouml;sterebilir. Bu değerler sadece s&uuml;r&uuml;c&uuml; işlevselliğini belirlemek i&ccedil;in referans amacıyla kullanılmalıdır ve farklı modeller veya DSM s&uuml;r&uuml;mleri arasında mukayese edilebilir değildir.</li>
</ul>
</div>


<h4>Secure Erase yapmak i&ccedil;in:</h4>
<ol>
<li><b>HDD/SSD</b> sekmesine gidin.</li>
<li>Bir s&uuml;r&uuml;c&uuml; se&ccedil;in ve <b>Secure Erase</b> &uuml;zerine tıklayın.</li>
</ol>


<div class="section">
<h4>Not:</h4>
<ul>
<li>Secure Erase genişleme &uuml;nitelerindeki s&uuml;r&uuml;c&uuml;lerde yapılamaz.</li>
<li>Secure Erase s&uuml;r&uuml;c&uuml;n&uuml;z &uuml;zerindeki t&uuml;m verileri tamamen silecektir. Se&ccedil;ilen s&uuml;r&uuml;c&uuml;n&uuml;z&uuml;n kullanımda olmadığından ya da bunu yapmadan &ouml;nce verilerin yedeklenmiş olduğundan l&uuml;tfen emin olun.</li>
<li>Sistem Secure Erase yaparken, se&ccedil;ilen s&uuml;r&uuml;c&uuml; ge&ccedil;ici olarak kilitlenir ve ardından işlem tamamlandığında otomatik olarak kilidi a&ccedil;ılır.</li>
<li>İşlem sırasında Secure Erase durdurulursa, Secure Erase'i doğrudan kullanıcı aray&uuml;z&uuml;nde yeniden &ccedil;alıştırabilirsiniz. Halen kilitli halde s&uuml;r&uuml;c&uuml;ler &ccedil;ıkartılır veya başka yerde kullanılırsa, s&uuml;r&uuml;c&uuml;lerin kilidini a&ccedil;mak i&ccedil;in l&uuml;tfen &quot;synology&quot; şifresini girin.</li>
</ul>
</div>

<h4>S.M.A.R.T. Veritabanını g&uuml;ncellemek i&ccedil;in:</h4>
<p>S.M.A.R.T. Veritabanı bir s&uuml;r&uuml;c&uuml;n&uuml;n g&uuml;venli &ccedil;alışma sıcaklığı ve S.M.A.R.T. alan adlarına ilişkin bilgileri i&ccedil;erir. Veritabanı periyodik olarak g&uuml;ncellenir ve bir s&uuml;r&uuml;c&uuml; değiştirildikten sonra otomatik olarak g&uuml;ncellenir. Bu işlem sadece periyodik veya otomatik veritabanı g&uuml;ncellemesi başarısız olduğunda &ccedil;alıştırılmalıdır.</p>

<ol>
<li><strong>Genel</strong> sekmesine gidin.</li>
<li><strong>S.M.A.R.T. Veritabanı</strong> b&ouml;l&uuml;m&uuml;ne gidin.</li>
<li><strong>Şimdi G&uuml;ncelle</strong>'ye tıklayın.</li>
</ol>

<div class="section">
<h4>Not:</h4>
<ul>
<li>S.M.A.R.T. Veritabanı sadece her 24 saatte bir g&uuml;ncellenebilir.</li>
<li>S.M.A.R.T. Veritabanı yeni bir s&uuml;r&uuml;c&uuml; Synology NAS sunucunuza takıldığında otomatik olarak g&uuml;ncellenecektir.</li>
<li>S.M.A.R.T. Veritabanının g&uuml;ncellenmesi s&uuml;r&uuml;c&uuml;n&uuml; uyumunu ve performansını etkilemez ve iyileştirmez.</li>
<li>Bu işlemi sadece S.M.A.R.T. Bilgisi i&ccedil;indeki birden &ccedil;ok değer tanımlanmamış olduğunda veya Synology Destek Ekibi b&ouml;yle yapmanızı istediğinde yapın.</li>
</ul>
</div>


	<h3>HDD i&ccedil;in Yazma &Ouml;nbellek Desteğini Etkinleştirme</h3>
	<p>Yazma &ouml;nbelleği desteğini etkinleştirmek Synology NAS &uuml;r&uuml;n&uuml;n&uuml;z&uuml;n performansını arttırır. Sadece belirli HDD modelleri bu &ouml;zelliği destekler. Yazma &ouml;nbellek desteğini kullanırken, veri korumasını garantilemek i&ccedil;in bir UPS cihazının kullanılması &ouml;nemle tavsiye edilir. Aynı zamanda her kullanımdan sonra sistemin gereği gibi kapatılmasını da &ouml;neririz. Yazma &ouml;nbelleğinin devre dışı bırakılması anormal g&uuml;&ccedil; kesintileri tarafından neden olunan veri kaybı ihtimalini azaltır ancak sistem performansı d&uuml;şer.</p>

	<h4>Yazma &ouml;nbelleği desteğini etkinleştirmek i&ccedil;in: </h4>
	<ol>
		<li><b>&Ouml;nbellek Y&ouml;netimi</b> sekmesine gidin.</li>
		<li><b>Yazma &ouml;nbelleğini etkinleştir</b>'i işaretleyin. Varsayılan olarak bu işlev etkinleştirilmiştir.</li>
		<li><b>Uygula</b>'ya tıklayın.</li>
	</ol>


    
    
<p>____<br> * Sadece belirli modellerde mevcuttur. </p>

</body>
</html>
