<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>SSD &Ouml;nbellek*</h2>
<p>SSD &ouml;nbellek, SSD &ouml;nbellek &uuml;zerine sık erişilen verileri kaydederek rastgele erişim performansını iyileştirebilir. SSD &ouml;nbellek bir birim veya iSCSI LUN (Blok-Seviyesi) &uuml;zerine takılabilir. İki t&uuml;r SSD &ouml;nbellek vardır:</p>
<ul>
<li><strong>Salt okunur &ouml;nbellek</strong> tanıtıldığı depolama alanının rastgele okuma performansını arttırmak i&ccedil;in temel veya bir RAID 0 yapılandırmasında tanıtılabilen 1 ila 12 SSD'den oluşur.
<div class="section"><h4>Not:</h4>
	<p>SSD salt okunur &ouml;nbellek birimden gelen verilerin kopyalarını saklar; b&ouml;ylece, salt okunur bellek &ccedil;&ouml;kse bile hi&ccedil;bir veri kaybı olmaz.</p>
	</div>
</li>
<li><strong>Okuma-yazma &ouml;nbelleği</strong> tanıtıldığı depolama alanının rastgele okuma ve yazma performansını arttırmak i&ccedil;in, SSD'lerin sayısına (12 adet SSD'ye kadar) bağlı olarak, bir RAID 1 / RAID 5 / RAID 6 yapılandırmasında tanıtılabilir.</li>
</ul>

<p>Her iki tip SSD &ouml;nbelleği de &ouml;nbellekteki verileri değiştirmek i&ccedil;in bir LRU (En Az Yeni Kullanılan) algoritması uygular.</p>

<div class="section">
<h4>&Ouml;nemli:</h4>
<p>Bir &ouml;nbellek olarak kullanmak &uuml;zere herhangi bir SSD kurmadan &ouml;nce, l&uuml;tfen aşağıdaki notları inceleyin:</p>
<ul>
<li>SSD &ouml;nbelleğinin etkinleştirilmesinin amacı, depolama alanında sıklıkla erişilen verilerin k&uuml;&ccedil;&uuml;k bir kısmına rastgele erişim performansını artırmaktır. &Ouml;rneğin, hem b&uuml;y&uuml;k sıralı okuma hem de yazma işlemleri (&ouml;r. HD video yayını) ve tamamen rastgele veri okuma d&uuml;zenleri tekrar okuma d&uuml;zenlerini i&ccedil;ermediklerinden, SSD &ouml;nbelleğe alma işleminden ciddi miktarda faydalanmazlar. Genel uygulamalar i&ccedil;in, sıralı I/O'nun depolama alanı s&uuml;r&uuml;c&uuml;lerinden ge&ccedil;ebilmesi amacıyla <b>Sıralı I/O Atla</b>'nın etkinleştirilmesi &ouml;nerilir.</li>
<li>Synology NAS &uuml;r&uuml;n&uuml;n&uuml;zde &ouml;nbellek olarak kullanılacak SSD'yi se&ccedil;mek i&ccedil;in <a href="http://www.synology.com/" target=_blank>Synology web sitesi</a>'ndeki uyumluluk listesine bakın.</li>
<li class="disable-alpine">SSD &ouml;nbellek, &ouml;nbellek boyutuna g&ouml;re belirli bir sistem belleği gerektirdiğinden, daha b&uuml;y&uuml;k SSD &ouml;nbellek tanıtmak Synology NAS belleğinin y&uuml;kseltilmesini gerektirebilir. Sistemi kararlı ve hızlı tutmak amacıyla, SSD &ouml;nbellek i&ccedil;in &ouml;ny&uuml;kl&uuml; sistem hafızasının sadece 1/4'&uuml; kullanılabilir. Her 1 GB'lık SSD &ouml;nbelleği, yaklaşık 416 KB sistem belleği gerektirir (genişletilebilir bellek de sayılabilir)**. Bu nedenle, salt okunur &ouml;nbellek yapılandırması 2 x 128 GB SSD ise toplam &ouml;nbellek boyutu 256 GB olacaktır ve en az 104 MB bellek gerektirecektir, eğer salt okunur &ouml;nbellek yapılandırması 2 x 128 GB SSD ise toplam &ouml;nbellek boyutu 128 GB olacaktır ve en az 52 MB bellek gerektirecektir. Bellek yetersiz ise, SSD &ouml;nbellek oluşumu kısıtlanır veya SSD &ouml;nbellek boyutu sınırlandırılır.</li>
<li class="enable-alpine">Her 1 GB'lik SSD &ouml;nbelleği, yaklaşık 416 KB sistem belleği gerektirir (genişletilebilir bellek de sayılabilir) ve maksimum &ouml;nbellek boyutu 930 GB'dir. Bu nedenle, salt okunur &ouml;nbellek yapılandırması 2 x 128 GB SSD ise toplam &ouml;nbellek boyutu 256 GB olacaktır ve en az 104 MB bellek gerektirecektir, eğer salt okunur &ouml;nbellek yapılandırması 2 x 128 GB SSD ise toplam &ouml;nbellek boyutu 128 GB olacaktır ve en az 52 MB bellek gerektirecektir. Bellek yetersiz ise, SSD &ouml;nbellek oluşumu kısıtlanır veya SSD &ouml;nbellek boyutu sınırlandırılır.</li>
<li>Synology NAS &uuml;r&uuml;n&uuml;n&uuml;zde izin verilen maksimum SSD &ouml;nbellek boyutu i&ccedil;in <a href="http://www.synology.com/" target=_blank>Synology web sitesi</a>'ndeki modellerinizin &uuml;r&uuml;n &ouml;zelliklerine bakın.</li>
<li>Bir okuma-yazma SSD &ouml;nbelleğinin kapasitesi d&uuml;şt&uuml;ğ&uuml;nde, &ouml;nbelleğe alma &ouml;zelliği devre dışı bırakılır ve sistem SSD'den HDD'lere &ouml;nbelleğe alınan verileri yazmaya (&ouml;r. senkronize etme) başlar. Veri senkronizasyonu tamamlandıktan sonra, okuma-yazma &ouml;nbelleğinin kapasitesi d&uuml;şse bile hi&ccedil;bir veri kaybı olmaz.</li>
<li>İlgili SSD'lerini &ccedil;ıkartmadan &ouml;nce okuma-yazma SSD &ouml;nbelleğini uygun şekilde &ccedil;ıkartığınızdan emin olun. SSD'lerin uygunsuz şekilde &ccedil;ıkartılması (&ouml;r. bir &ouml;nbellek kullanımda iken veya sistem kapatıldığında) hedef birim veya iSCSI LUN'da saklanan verilerin &ccedil;&ouml;kmesine neden olur.
</li>
<li>Okuma-yazma &ouml;nbelleği Time Backup ile birlikte kullanılamaz. &Ouml;rneğin, bir okuma-yazma SSD &ouml;nbelleği oluşturduğunuzda, Time Backup &ccedil;alıştıramazsınız. Tam tersine, Time Backup &ccedil;alıştırıyorsanız, bir okuma-yazma SSD &ouml;nbelleği oluşturamazsınız.</li>
</ul>
</div>

<h4>SSD &ouml;nbellek bağlama:</h4>
<ol>
  <li>Synology NAS &uuml;r&uuml;n&uuml;n&uuml;ze SSD'leri kurun. L&uuml;tfen &ouml;nce yukarıdaki notlara bakın.</li>
  <li><strong>Depolama Y&ouml;neticisi</strong> &gt; <strong>SSD &Ouml;nbelleği</strong>'ne gidin. <b>Oluştur</b>'a tıklayın.</li>
<li>&Ouml;nbellek modunu se&ccedil;in (sadece okuma-yazma &ouml;nbelleğini destekleyen modeller i&ccedil;in mevcut).</li>
<li>A&ccedil;ılır men&uuml;den SSD &ouml;nbelleği monte etmek istediğiniz b&ouml;l&uuml;m veya iSCSI LUN (Blok-Seviyesi) se&ccedil;imi yapın.</li>
<li>SSD'leri listeden se&ccedil;in. SSD'lerdeki veriler silineceğinden, l&uuml;tfen &ouml;nemli verilerin silinmeyeceğinden emin olun.</li>
<li><b>Uygula</b>'ya tıklayın.</li>
</ol>

<h4>Sıralı I/O &ouml;nbelleğe almayı durdurmak i&ccedil;in: </h4>
<p>Hedef biriminiz veya iSCSI LUN (Blok Seviyesi) m&uuml;kemmel sıralı I/O performansına sahipse, daha y&uuml;ksek hız ve daha iyi performans i&ccedil;in SSD &ouml;nbelleğinin sıralı I/O &ouml;nbelleğe almayı durdurmasını ve verilere doğrudan s&uuml;r&uuml;c&uuml;lerinizden erişmesini sağlayabilirsiniz. </p>
<ol>
<li>Yapılandırma penceresini a&ccedil;mak i&ccedil;in <strong>Yapılandır</strong> &uuml;zerine tıklayın.</li>
<li><strong>Sıralı I/O Atla</strong> &ouml;ğesini işaretleyin. </li>
</ol>


<h4>SSD &ouml;nbelleği kaldırmak i&ccedil;in:</h4>
<ol>
<li>Synology NAS i&ccedil;indeki SSD &ouml;nbelleğini kalıcı olarak kaldırmak i&ccedil;in <b>Kaldır</b> se&ccedil;eneğine tıklayın.</li>
<li>Okuma-yazma &ouml;nbelleği i&ccedil;in bu prosed&uuml;r aracılığıyla kaldırmanız gerekir (Synology NAS kapalı olsa bile), aksi takdirde kısmi veriler sadece &ouml;nbellekte yer aldıklarından birim &ccedil;&ouml;kecektir.</li>
</ol>

<div class="section">
<h4>Not:</h4>
<ul>
<li>SSD &ouml;nbelleği bağlarken veya kaldırırken, sistem t&uuml;m ilgili hizmetleri durdurur (paylaşılan klas&ouml;rler, kurulu paketler, mevcut bağlantılar vb. gibi)</li>
<li>Bir depolama alanındaki bir okuma yazma &ouml;nbelleği başlatma sırasında algılanmazsa, sistem o depolama alanını bağlamaz. L&uuml;tfen Synology NAS sunucusundaki SSD'leri bulun veya yeniden kurun ve depolama alanını bağlamak i&ccedil;in yeniden başlatın. SSD'leri bulamazsanız, depolama alanını zorla tanıtmanız gerekebilir. L&uuml;tfen <a href="space.html">Birim</a> veya <a href="iscsilun.html">iSCSI LUN</a> &ouml;ğesine bakın.</li>
</ul>
</div>

<h4>SSD &ouml;nbelleği onarmak i&ccedil;in:</h4>
<ul>
<li><strong>Okuma-yazma &ouml;nbelleği i&ccedil;in:</strong> SSD'lerden bir tanesi &ccedil;&ouml;km&uuml;ş ise, onarmak i&ccedil;in aşağıdaki adımları izleyin.
  <ol>
<li>Arızalı SSD'yi yenisiyle değiştirin. (Yeni SSD eskisiyle aynı model ve boyutta olmalıdır).</li>
<li><b>Onar</b> d&uuml;ğmesine tıklayın.</li>
<li>SSD'yi listeden se&ccedil;in.</li>
<li><b>Uygula</b>'ya tıklayın.</li>
</ol>
</li>
<li><strong>Salt okunur &ouml;nbellek i&ccedil;in:</strong> SSD'lerden bir tanesi &ccedil;&ouml;km&uuml;ş ise, l&uuml;tfen &ouml;nbelleği kaldırın ve arızalı SSD'yi değiştirin. Ardından yeni bir &ouml;nbellek yapılandırması yapmak i&ccedil;in <strong>Oluştur</strong>'a tıklayın.</li>
</ul>


<h3>SSD &Ouml;nbellek Danışmanı</h3>
<p>Bu işlev belirli bir birimdeki yeni erişilen dosyaların toplam sayısını ve b&uuml;y&uuml;kl&uuml;ğ&uuml;n&uuml; hesaplamanızı ve g&ouml;r&uuml;nt&uuml;lemenizi sağlar. Se&ccedil;ili birimde hen&uuml;z SSD &ouml;nbelleği oluşturmadıysanız, bu bilgiye sisteminiz i&ccedil;in ne kadar SSD &ouml;nbelleğinin uygun olduğu değerlendirilirken başvurulabilir.  Se&ccedil;ili birimde daha &ouml;nce SSD &ouml;nbelleği oluşturduysanız, &ouml;nbelleğin analizi ve kullanım oranı da burada g&ouml;r&uuml;nt&uuml;lenecektir.</p>

<h4>SSD &Ouml;nbellek Danışmanını kullanmak i&ccedil;in:</h4>

<ol>
<li>Sihirbazı a&ccedil;mak i&ccedil;in <b>SSD &Ouml;nbellek Danışmanı</b>'na tıklayın.</li>
<li>Hesaplama i&ccedil;in bir birim se&ccedil;ip <b>İleri</b>'ye tıklayın.</li>
<li>Sihirbaz otomatik olarak se&ccedil;ilen bir birimde yeni erişilen dosyaların sayısını ve b&uuml;y&uuml;kl&uuml;ğ&uuml;n&uuml; toplamaya başlar. Hesaplama zamanı sizin ortamınıza bağlı olarak değişir.</li>
</ol>
<p>_____<br> *SSD &ouml;nbellek yalnızca belirli modellerde kullanılabilir.<br> <span class="disable-alpine">** Bu, DSM 5.1 veya daha eski s&uuml;r&uuml;mlerde oluşturulan okuma-yazma SSD &ouml;nbellekleri i&ccedil;in ge&ccedil;erli değildir. Yani, DSM 5.2'den &ouml;nce oluşturulan SSD &ouml;nbelleğin her 1 GB'ı DSM 5.2 ortamında kullanıldığında bile 4 MB sistem belleği gerektirecektir.</span>
  </p>
</body>
</html>
