<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Hot Spare*</h2>
<p>Hot spare diskler, arızalı bir diski otomatik olarak değiştirerek kapasitesi d&uuml;şm&uuml;ş bir birimi/Disk Grubunu/iSCSI LUN'u onarabilen yedek sabit disklerdir. Hot spare diskler, birim/Disk Grubu/iSCSI LUN aşağıdaki kriterle uyuştuğu s&uuml;rece Synology NAS &uuml;r&uuml;n&uuml;n&uuml;zdeki herhangi bir birimi/Disk Grubunu/iSCSI LUN'ı korumak i&ccedil;in genel olarak atanabilir:</p>
<ul>
	<li>Birimin/Disk Grubunun/iSCSI LUN'ın RAID tipi veri korumasına (RAID 1, RAID 5, RAID 6, RAID 10<span class="enable-grantley">, RAID F1</span> gibi) sahip olan t&uuml;rde olmalıdır.</li>
	<li>Hot spare disk boyutu, birim/Disk Grubu/iSCSI LUN'daki en k&uuml;&ccedil;&uuml;k diskin boyutuna eşit veya ondan daha y&uuml;ksek olmalıdır.</li>
</ul>

<h4>Hot spare diskleri kurmak i&ccedil;in:</h4>
<ol>
<li><strong>Y&ouml;net</strong>'e tıklayın.</li>
<li>Kullanılabilir disklerin yanı sıra, her bir birimin/Disk Grubunun/iSCSI LUN'ın hot spare durumunu g&ouml;r&uuml;nt&uuml;leyen bir iletişim kutusu a&ccedil;ılır. Birim/Disk Grubu/iSCSI LUN durumu aşağıdakileri i&ccedil;erir:</li>
<ul>
<li><strong>Atanmış:</strong> Birim/Disk Grubu/iSCSI LUN, en az bir tane atanmış hot spare disk tarafından korunur.</li>
<li><strong>Kalan:</strong> Birimi/Disk Grubunu/iSCSI LUN'ı koruyabilecek diskler var ama hen&uuml;z hi&ccedil; hot spare atanmamış.</li>
<li><strong>Mevcut değil:</strong> Birimi/Disk Grubunu/iSCSI LUN'ı koruyabilecek hi&ccedil; hot spare disk yok.</li>
</ul>
<li><strong>Mevcut Diskler</strong> kısmı, hot spare diskler olarak atanabilecek sabit diskleri g&ouml;r&uuml;nt&uuml;ler. Bir hot spare disk atamak i&ccedil;in, hot spare olarak atamak istediğiniz diskin yanındaki kutuyu işaretleyin.</li>
<li>Ayarları kaydetmek i&ccedil;in <strong>Uygula</strong>'ya tıklayın.</li>
</ol>
<div class="section">
<h4>Not:</h4> 
<ul>
<li>Bir sabit disk hot spare disk olarak atandığında, diskteki t&uuml;m veriler silinir. Bir hot spare diski atamadan evvel, diskin &uuml;zerinde &ouml;nemli veri bulunmadığından emin olun.</li>
<li>HDD'ler tarafından monte edilen bir RAID, SSD hot spare diskler tarafından otomatik olarak onarılmaz.</li>
</ul>
</div>

<h4>Birim/Disk Grubu/iSCSI LUN i&ccedil;in hot spare ayarlarını yapılandırmak i&ccedil;in:</h4>
<ol>
<li><strong>Yapılandır</strong> &uuml;zerine tıklayın.</li>
<li><strong>Hot Spare Hedefleri</strong> sekmesinde, hot spare diskler tarafından korunabilen birimler/Disk Grupları/iSCSI LUN'lar listelenecektir. Kutuların işaretini kaldırırsanız, ilgili birimler/Disk Grupları/iSCSI LUN'lar kapasiteleri d&uuml;şt&uuml;ğ&uuml;nde hot spare diskler tarafından otomatik olarak onarılmaz.</li>
<li><strong>Cihaz arası Hot Spare</strong> sekmesinde, farklı bir cihazda bulunan kapasitesi d&uuml;şm&uuml;ş bir RAID'i onarmak i&ccedil;in bir cihaz &uuml;zerinde hot spare disklere izin verebilirsiniz.</li>
<li><strong>Tamam</strong> &uuml;zerine tıklayarak ayarları kaydedin.</li>
</ol>



<p>____<br />*Yalnızca bazı modellerde mevcuttur.</p>

</body>
</html>
