<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Birim</h2>
<p>Birimler kullanıcının paylaşımlı klas&ouml;r, iSCSI LUN (normal dosya) oluşturabileceği, verileri kaydedebileceği veya paketleri kurabileceği temel depolama alanlarıdır. Herhangi bir birimi oluşturmadan &ouml;nce, l&uuml;tfen bir RAID Group oluşturmuş olduğunuzdan emin olun. RAID Group'lar hakkında daha fazla bilgi i&ccedil;in, l&uuml;tfen <a href="raid.html">RAID Group</a> kısmına bakın.
</p>

<h4>Bir birim oluşturmak i&ccedil;in:</h4>
<ol>
	<li>Synology NAS sunucunuzun tahsis edilebilir alana sahip mevcut bir RAID Group'u olduğundan emin olun.</li>
	<li><strong>Oluştur</strong> d&uuml;ğmesine tıklayın.</li>
	<li>&Uuml;zerinde birimi oluşturacağınız bir RAID Group se&ccedil;in.</li>
	<li>İstenilen ayarları değiştirin.</li>
	<li>Birim i&ccedil;in boyut yerleşimini ayarlayın. (Boyut yerleşimini ayarlama Tek Birimler veya iSCSI LUN i&ccedil;in RAID Group &uuml;zerinde oluşturulan birimler i&ccedil;in mevcut değildir.)</li>
    <li>Dosya erişim zamanının kaydedilip kaydedilmeyeceğini se&ccedil;in:</li>
	  <ul>
      <li><strong>Dosya Erişim Zamanını Kaydet</strong> se&ccedil;eneğinin etkinleştirilmesi Linux sistemlerinde relatime bağlantı se&ccedil;eneğinin kullanılmasına eşdeğerdir. Dosya erişim zamanı sadece, son erişim zamanı (atime) mevcut değişiklik zamanı (mtime) veya değişim zamanı (ctime) &ouml;ncesinde iken g&uuml;ncellenir. Erişim zamanı son erişim zamanının bir g&uuml;nden daha eski olması halinde de g&uuml;ncellenir.</li>
      <li><strong>Dosya Erişim Zamanını Kaydet</strong> se&ccedil;eneğinin devre dışı bırakılması Linux sistemlerinde noatime bağlantı se&ccedil;eneğinin kullanılmasına eşdeğerdir. Dosyaların ve klas&ouml;rlerin erişim zamanı g&uuml;ncellenmez, azalan dosya sistemi kullanımına neden olur. Bazı uygulamaların uygun şekilde işlev yapmak &uuml;zere dosya erişim zamanına bağlı olabileceğine dikkat edin.</li>
      </ul>
    <li>Ayarları onaylamak i&ccedil;in <strong>Uygula</strong> d&uuml;ğmesine tıklayın.</li>


</ol>

<div class="section"><h4>Not:</h4>
<ul>
	<li>Azami birim boyutu 200 TB olarak tahsis edilebilir.</li>
	<li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Bir Btrfs birimine tahsis edilen minimum boyut en az 10 GB olmalıdır.</li>
    <li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Btrfs birimleri metaveri i&ccedil;in alanın %4'&uuml;n&uuml; rezerve eder.</li>
</ul>
</div>

<h4>Bir birimi kaldırmak i&ccedil;in:</h4>
<ol>
	<li>Kaldırmak istediğiniz birimi se&ccedil;in.</li>
	<li><strong>Kaldır</strong> d&uuml;ğmesine tıklayın ve sihirbazı izleyerek s&uuml;reci tamamlayın.</li>
</ol>

<div class="section"><h4>Not:</h4>
<ul>
	<li>Bir b&ouml;l&uuml;m&uuml;n kaldırılması ilgili b&ouml;l&uuml;mdeki t&uuml;m veriyi siler.</li>
</ul>
</div>

<h4>Bir b&ouml;l&uuml;m&uuml; zorla tanıtmak i&ccedil;in:</h4>
<p>Bir birim &uuml;zerindeki &ouml;nbellek kayıp ise, sistem &ouml;ny&uuml;kleme sırasında birimi bağlamaz. &Ouml;nbellek kurtarılabilir değilse ve birime erişmek istiyorsanız, <strong>Zorla tanıt</strong> &uuml;zerine tıklayabilirsiniz. </p>

<div class="section"><h4>Not:</h4>
<ul>
	<li>Bu işlev yalnızca belirli modellerde kullanılabilir.</li>
</ul>
</div>

<h4>B&ouml;l&uuml;m&uuml; onarmak i&ccedil;in:</h4>
<p>B&ouml;l&uuml;m durumunda <strong>Kapasitesi D&uuml;şm&uuml;ş</strong> yazıyorsa, l&uuml;tfen <strong>RAID Group</strong> sekmesine gidin ve uygun RAID Group'u bulun. Ardından onarmak i&ccedil;in &ouml;nerilen talimatları izleyin.</p>

<h4>Bir b&ouml;l&uuml;m&uuml;n boyutunu genişletmek i&ccedil;in</h4>
<ul>
	<li>&Ccedil;ok Sayıda Birim veya iSCSI LUN&rsquo;lar (Blok-Seviyesi) i&ccedil;in RAID Group &uuml;zerinde oluşturulan birimler i&ccedil;in. 
		<ol>
			<li>Genişletmek istediğiniz birimi se&ccedil;in.</li>
			<li><strong>D&uuml;zenle</strong>'ye tıklayın.</li>
			<li>Yeni boyutu girin ve genişletmek i&ccedil;in <strong>TAMAM</strong>'a tıklayın.</li>
		</ol>
	</li>
	<li>Tek bir birim veya iSCSI LUN (Blok-Seviyesi) i&ccedil;in bir RAID Group &uuml;zerinde oluşturulan birimler i&ccedil;in, l&uuml;tfen <strong>Bir RAID Group'un boyutunu genişletmek i&ccedil;in</strong>, <a href="raid.html">RAID Group</a> kısmına bakın, birim boyutu RAID GROUP'un genişletildiği vurgulandıktan sonra genişletilecektir.</li>
</ul>

<h3>SSD TRIM</h3>
<p>Eğer bir birim tamamen SSD'lerden (Solid State S&uuml;r&uuml;c&uuml;ler) oluşuyorsa, SSD TRIM'in etkinleştirilmesini &ouml;neririz. Bu &ouml;zellik SSD'lerde oluşturulan birimlerin okuma veya yazma performansını iyileştirerek verimliliği arttırmanın yanında SSD'lerinizin &ouml;mr&uuml;n&uuml; de uzatır.</p>

<h4>SSD TRIM'i etkinleştirmek i&ccedil;in:</h4>
<ol>
	<li><strong>Depolama Y&ouml;neticisi</strong> &ouml;ğesini a&ccedil;ın ve <strong>Birim</strong> &ouml;ğesine gidin.</li>
	<li>Tamamen SSD'lerden oluşan bir birim se&ccedil;in ve ardından <strong>Yapılandır</strong> d&uuml;ğmesine tıklayın.</li>
	<li>Beliren pencerede, <strong>SSD TRIM</strong> sekmesine gidin ve <strong>TRIM'i etkinleştir</strong> adlı kutuyu işaretleyin.</li>
	<li>Sistemin ne zaman SSD TRIM yapacağını belirlemek i&ccedil;in <strong>Program ayarlama</strong> d&uuml;ğmesine tıklayın.</li>
	<li><strong>Tamam</strong>'a tıklayın.</li>
</ol>

<div class="section"><h4>Not:</h4>
<ul>
	<li>SSD TRIM sadece belirli Synology NAS modellerinde ve RAID t&uuml;rlerinde mevcuttur. </li>
	<li>Bazı SSD modelleri RAID 5<span class="enable-grantley"></span> <span class="disable-grantley"> ve </span>RAID 6<span class="enable-grantley"> ve RAID F1</span> birimlerinde SSD TRIM yapamaz. Synology <a href="https://www.synology.com/" target="_blank">resmi web sitesinde</a> uyumluluk listesine bakınız.</li>
	<li>SSD TRIM aşağıdaki durumlarda etkinleştirilemez:
		<ul>
			<li>Birim SSD &ouml;nbellek ile tanıtılmış.</li>
			<li><strong>Time Backup</strong> paketi kurulmuş.</li>
		</ul>
	</li>
	<li>SSD TRIM, Blok Seviyesi iSCSI LUN'larda etkinleştirilemez.</li>
	<li>Sistem performansı SSD TRIM yapılırken etkilenir. TRIM tamamlama i&ccedil;in gerekli s&uuml;re birim boyutuna ve SSD modeline bağlı olarak değişir.</li>
	<li>Bir birim &uuml;zerinde TRIM etkinleştirildiğinde, aynı Disk Group veya RAID Group &uuml;zerinde oluşturulan diğer birimlerde de etkinleştirilecektir.</li>
</ul>
</div>


<h3>Dosya Sistemi D&uuml;zeltmesi*</h3>
<p>Dosya sistemi d&uuml;zeltmesi birimleri inceleyen bir veri bakımı &ouml;zelliğidir. Kontrol toplamı ile tutarsız bir veri saptandığında, dosya yolu G&uuml;nl&uuml;k Merkezi'ne kaydedilir ve verileri onarmak i&ccedil;in bir yedekleme kullanmanız &ouml;nerilir.</p>

<p>Veri tutarlılığını sağlamak i&ccedil;in d&uuml;zenli olarak dosya sistemi d&uuml;zeltmesi &ouml;neririz.</p>

<h4>Dosya sistemi d&uuml;zeltmesi yapmak i&ccedil;in:</h4>
<ol>
	<li><strong>Depolama Y&ouml;neticisi</strong> &ouml;ğesini a&ccedil;ın ve <strong>Birim</strong> &ouml;ğesine gidin.</li>
	<li>&Uuml;zerinde dosya sistemi d&uuml;zeltmesi yapacağınız birimi se&ccedil;in.</li>
	<li><strong>Y&ouml;net</strong>'e tıklayın.</li>
	<li><strong>Dosya sistemi d&uuml;zeltmesi</strong> &ouml;ğesini se&ccedil;in.</li>
</ol>

<div class="section"><h4>Not:</h4>
<ul>
	<li>Dosya sistemi d&uuml;zeltmesi sadece <strong>Btrfs</strong> dosya sistemindeki birimlerde yapılabilir.</li>
	<li>Dosya sistemi d&uuml;zeltmesi sadece birimin durumu <strong>Normal</strong> olduğunda yapılabilir.</li>
	<li>L&uuml;tfen dosya sistemi d&uuml;zeltmesi tamamlanmadan &ouml;nce sistemi kapatmayın. Tamamlanmadan sistem kapatılırsa, dosya sistemi d&uuml;zeltmesini manuel olarak baştan başlatmanız gerekir.</li>
</ul>
</div>

<h3>Dosya Sistemi Defragmentasyonu*</h3>
<p>Verileriniz s&uuml;rekli olarak değiştiriliyorsa, par&ccedil;alara ayrılmış dosyaların miktarı dosya sisteminde artar ve bu da sabit disklerdeki dosyalara erişme hızınızın d&uuml;şmesine neden olur. Dosya sistemi defragmentasyonunun yapılması performansı artırabilir.</p>

<h4>Dosya sistemi defragmentasyonu yapmak i&ccedil;in:</h4>
<ol>
	<li><strong>Depolama Y&ouml;neticisi</strong> &ouml;ğesini a&ccedil;ın ve <strong>Birim</strong> &ouml;ğesine gidin.</li>
	<li>&Uuml;zerinde dosya sistemi defragmentasyonu yapılacak birimi se&ccedil;in.</li>
	<li><strong>Y&ouml;net</strong>'e tıklayın.</li>
	<li><strong>Dosya sistemi defragmentasyonu</strong>'nu se&ccedil;in.</li>
</ol>

<div class="section"><h4>Not:</h4>
<ul>
	<li>Dosya sistemi defragmentasyonu sadece <strong>Btrfs</strong> dosya sistemindeki birimlerde yapılabilir.</li>
	<li>Dosya sistemi defragmentasyonu sadece birimin durumu <strong>Normal</strong> olduğunda yapılabilir.</li>
	<li>L&uuml;tfen dosya sistemi defragmentasyonu tamamlanmadan &ouml;nce sistemi kapatmayın. Tamamlanmadan sistem kapatılırsa, dosya sistemi defragmentasyonunu manuel olarak baştan başlatmanız gerekir.</li>
	<li>Birim kullanımı birimin paylaşımlı klas&ouml;rlere ait anlık g&ouml;r&uuml;nt&uuml;ler i&ccedil;ermesi halinde artabilir.</li>
</ul>
</div>

<p>____<br />*Yalnızca bazı modellerde mevcuttur.</p>

</body>
</html>