<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>RAID Group*</h2>

<p>Synology NAS ile, &ccedil;ok sayıda sabit diski RAID Group adı verilen tek bir depolama &uuml;nitesine kombine edebilirsiniz. Birimler veya iSCSI LUN'lar (Blok-Seviyesi) RAID Group'ların &uuml;st&uuml;nde oluşturulabilir. B&ouml;l&uuml;mler veya iSCSI LUN'lar bir RAID Group yerleştirilebilir alana sahipse genişletilebilir. Farklı RAID tipleri &ccedil;eşitli d&uuml;zeylerde veri koruması sunar. Synology NAS sunucunuz tarafından desteklenen RAID tiplerinin genel bir listesi i&ccedil;in l&uuml;tfen <a href="general.html">Genel</a> &ouml;ğesine gidin.</p>

<h4>Bir RAID Group oluşturmak i&ccedil;in:</h4>
<ol>
	<li><strong>Oluştur</strong> d&uuml;ğmesine tıklayın.</li>
	<li>Aşağıdaki se&ccedil;eneklerden birini se&ccedil;in: 
		<ul>
			<li>Tek Birim veya iSCSI LUN (Blok-Seviyesi) i&ccedil;in RAID Group: Daha iyi performans sağlar.</li>
			<li>&Ccedil;ok Sayıda B&ouml;l&uuml;m veya iSCSI LUN&rsquo;lar (Blok-Seviyesi) i&ccedil;in RAID Group: Daha iyi y&ouml;netim esnekliği sağlar.</li>
		</ul>
	</li>
	<li>S&uuml;reci tamamlamak i&ccedil;in sihirbazı izleyin.</li>
</ol>

<div class="section"><h4>Not: </h4>
<ul>
	<li>Bir RAID Group aynı sabit disk tipindeki sabit disklerden oluşmalıdır. RAID oluşturmak i&ccedil;in ne SSD ve SAS sabit diskleri ne de SSD ve HDD sabit diskleri eş zamanlı olarak kullanamazsınız.</li>
	<li><strong>RAID 5</strong><span class="enable-grantley"></span> <span class="disable-grantley"> veya </span><strong>RAID 6</strong><span class="enable-grantley"> veya <strong>RAID F1</strong></span> kullanan Birden &Ccedil;ok Birim veya iSCSI LUN'lar (Blok Seviyesi) i&ccedil;in bir RAID Group birden &ccedil;ok <strong>RAID Dizisi</strong> i&ccedil;erebilir. Aynı RAID Group'a ait olan her RAID Dizisi aynı RAID tipinde olacaktır (RAID 5<span class="enable-grantley"></span> <span class="disable-grantley"> veya </span>RAID 6<span class="enable-grantley"> ya da RAID F1</span> gibi). Her RAID Dizisi i&ccedil;in azami disk sayısı 6, 12 veya 24 olabilir. RAID Group oluştururken azami disk sayısını belirleyebilirsiniz ve sayı daha sonra değiştirilemez. Bir RAID Dizisine azami disk sayısı atandığında, RAID Group'a eklenen sonraki disk yeni bir RAID Dizisine atanabilir. Yeni RAID Dizisi ilgili RAID tipi i&ccedil;in gerekli minimum s&uuml;r&uuml;c&uuml; sayısını i&ccedil;ermelidir (RAID 5<span class="enable-grantley"> ve RAID F1</span> i&ccedil;in &uuml;&ccedil; s&uuml;r&uuml;c&uuml; ve RAID 6 i&ccedil;in d&ouml;rt s&uuml;r&uuml;c&uuml; gibi).</li>
	<li>Belirli bir sabit disk ile bir RAID Group oluşturmak istiyor ancak disk <strong>RAID Group Oluşturma Sihirbazı</strong>'nda g&ouml;remiyorsanız, l&uuml;tfen sabit diskin durumunu <strong>HDD Y&ouml;netimi</strong>'nde kontrol edin.</li>
</ul>
</div>

<h4>Bir RAID Group'u kaldırmak i&ccedil;in:</h4>
<ol>
	<li>Kaldırmak istediğiniz RAID Group'u se&ccedil;in.</li>
	<li><strong>Kaldır</strong> d&uuml;ğmesine tıklayın ve sihirbazı izleyerek s&uuml;reci tamamlayın.</li>
</ol>

<div class="section"><h4>Not:</h4>
<ul>
	<li>RAID Group'u kaldırdığınızda RAID Group'daki birimler ve iSCSI LUN'lar silinecektir. Hi&ccedil;bir &ouml;nemli verinin silinmediğinden emin olun.</li>
</ul>
</div>

<h4>Bir RAID Group'u onarmak i&ccedil;in:</h4>
<p>RAID Group aşağıdaki tiplerden birisi ise surumu <strong>Kapasitesi D&uuml;şm&uuml;ş</strong> olan bir RAID Group onarılabilir: RAID 1, RAID 5, RAID 6 <span class="disable-grantley">ve </span>RAID 10<span class="enable-grantley"> ve RAID F1</span>. RAID Group &uuml;zerindeki mevcut veriler silinmeyecektir.</p>

<p>RAID Group'unuzu onarmak i&ccedil;in l&uuml;tfen aşağıdaki adımları izleyin:</p>
<ol>
	<li>Synology NAS &uuml;r&uuml;n&uuml;n&uuml;z&uuml; kapatın. (Modeliniz &ccedil;alışırken değiştirmeyi destekliyorsa, bu adımı atlayabilirsiniz.)</li>
	<li>RAID Group durumunda yer alan Disk Bilgisi i&ccedil;inde belirtilen şekilde arızalı sabit diski değiştirin.</li>
	<li><strong>Y&ouml;net</strong>'e tıklayın.</li>
	<li><strong>Onar</strong> se&ccedil;imini yapın.</li>
	<li>S&uuml;reci tamamlamak i&ccedil;in sihirbazı izleyin.</li>
</ol>
        
<div class="section"><h4>Not:</h4>
<ul>
	<li>Değiştirilecek sabit disk boyutu RAID Group i&ccedil;indeki en k&uuml;&ccedil;&uuml;k diskin boyutuna eşit veya daha b&uuml;y&uuml;k olmalıdır.</li>
	<li>Değiştirilecek sabit diskin durumu &quot;İlk Kullanıma Hazırlandı&quot; veya &quot;İlk Kullanıma Hazırlanmadı&quot; olmalıdır.</li>
</ul>
</div>

<h4>Bir RAID Group'un RAID tipini değiştirmek</h4>
<p>Bir RAID Group'un RAID tipini değiştirmek i&ccedil;in, Synology NAS &uuml;zerinde kurulu kullanılabilir sabit diskler bulunmalıdır. Halihazırda aşağıdaki RAID değiştirme t&uuml;rleri desteklenmektedir:</p>
<ul>
	<li>Basic'den RAID 1 veya RAID 5'e</li>
	<li>RAID 1'den RAID 5'e</li>
	<li>RAID 5'den RAID 6'e</li>
	<li>RAID 1'e ikizlenmiş disk ekleme</li>
</ul>

<p>L&uuml;tfen aşağıdaki adımları izleyerek RAID Group'unuzun RAID tipini değiştirin:</p>
<ol>
	<li>Değiştirmek istediğiniz RAID Group'u se&ccedil;in.</li>
	<li><strong>Y&ouml;net</strong>'e tıklayın.</li>
	<li><strong>RAID tipini değiştir</strong> se&ccedil;imini yapın.</li>
	<li>S&uuml;reci tamamlamak i&ccedil;in sihirbazı izleyin.</li>
</ol>

<div class="section"><h4>Not: </h4>
<ul>
	<li>RAID tipi değiştirilmeden &ouml;nce bir RAID Group'un durumu <strong>Normal</strong> olmalıdır. Aksi taktirde veri kaybı ger&ccedil;ekleşir. RAID Group <strong>Kapasitesi d&uuml;şm&uuml;ş</strong> durumunda ise, l&uuml;tfen ilk &ouml;nce bunu onarın.</li>
	<li>Bir RAID Group'unun RAID tipini değiştirmek i&ccedil;in, Synology NAS'a yeterli sabit disk kurulmalı ve yeni diskin boyutu RAID Group i&ccedil;indeki en k&uuml;&ccedil;&uuml;k diskten b&uuml;y&uuml;k olmalıdır.</li>
	<li>Yeni diskin durumu &quot;İlk Kullanıma Hazırlandı&quot; veya &quot;İlk Kullanıma Hazırlanmadı&quot; olmalıdır.</li>
	<li>&Ccedil;ok sayıda RAID Dizisine sahip bir RAID Group'un RAID tipi değiştirilemez.</li>
</ul>
</div>

<h4>Bir RAID Group'un boyutunu genişletmek i&ccedil;in</h4>
<p>Mevcut sabit diskleri daha b&uuml;y&uuml;kleri ile değiştirerek ya da sabit diskler ekleyerek RAID Group'unuzun boyutunu genişletebilirsiniz.</p>

<div class="section"><h4>Not: </h4>
<ul>
	<li>3 TB veya daha b&uuml;y&uuml;k disklerle bir RAID Group'u genişletmek i&ccedil;in, RAID Group'unuzun DSM 3.0 veya sonrası kullanılarak oluşturulduğundan emin olun.</li>
</ul>
</div>

<h4>Daha b&uuml;y&uuml;k boyuttaki mevcut sabit diskler ile değiştirerek bir RAID Group'u artırabilirsiniz:</h4>
<p>Mevcut sabit diskleri aşağıdaki RAID tiplerinden birinde daha b&uuml;y&uuml;k bir sabit disk ile değiştirerek bir RAID Group'u genişletebilirsiniz: RAID 1, RAID 5 <span class="disable-grantley">ve </span>RAID 6<span class="enable-grantley"> ve RAID F1</span>. İlişkili birimler veya tek birim i&ccedil;in RAID Group &uuml;zerindeki iSCSI LUN&nbsp;veya iSCSI LUN&nbsp;otomatik olarak genişletilir. L&uuml;tfen aşağıdaki adımları izleyin:</p>
<ol>
	<li>Synology NAS &uuml;r&uuml;n&uuml;n&uuml;z&uuml; kapatın. Modeliniz &ccedil;alışırken değiştirmeyi destekliyorsa, bu adımı atlayabilirsiniz.</li>
	<li>Bir sabit diski daha b&uuml;y&uuml;k bir sabit disk ile değiştirin.</li>
	<li>Synology NAS &uuml;r&uuml;n&uuml;n&uuml; a&ccedil;ın ve RAID Group'u onarın.</li>
	<li>T&uuml;m sabit diskler daha b&uuml;y&uuml;ğ&uuml; ile değiştirilinceye kadar 1'den 3'e kadar olan adımları tekrarlayın.</li>
	<li>Sistem, RAID Group'u otomatik olarak genişletecektir.</li>
</ol>

<div class="section"><h4>Not: </h4>
<ul>
	<li>Storage Manager'in t&uuml;m hizmetleri genişletme s&uuml;recinde ge&ccedil;ici olarak durdurulacaktır.</li> 
	<li>Sadece RAID Group <strong>Normal</strong> durumda iken sabit diski genişletebilirsiniz; aksi halde veri kaybına sebep olacaktır. RAID Group <strong>Kapasitesi d&uuml;şm&uuml;ş</strong> durumunda ise, l&uuml;tfen ilk &ouml;nce bunu onarın.</li>
</ul>
</div>

<h4>Sabit diskler ilave ederek bir RAID Group'u genişletmek i&ccedil;in:</h4>
<p>Bu işlev JBOD, RAID 5 <span class="disable-grantley">ve </span>RAID 6<span class="enable-grantley"> ve RAID F1</span> t&uuml;r&uuml; RAID i&ccedil;in ge&ccedil;erlidir. Bunu yapmak i&ccedil;in:</p>
<ol>
	<li>Genişletmek istediğiniz RAID Group'u se&ccedil;in.</li>
	<li><strong>Y&ouml;net</strong>'e tıklayın.</li>
	<li><strong>Disk Ekle</strong> se&ccedil;imini yapın.</li>
	<li>Kurulumu tamamlamak i&ccedil;in sihirbazı izleyin.</li>
</ol>

<div class="section"><h4>Not: </h4>
<ul>
	<li>RAID Group durumu <strong>Normal</strong> olmalıdır.</li>
	<li>RAID 5<span class="enable-grantley"></span> <span class="disable-grantley">ve </span>RAID 6<span class="enable-grantley"> ve RAID F1</span> RAID Group t&uuml;rleri i&ccedil;in, sabit disk boyutu RAID Group i&ccedil;indeki en k&uuml;&ccedil;&uuml;k diskten daha b&uuml;y&uuml;k olmalıdır.</li>
	<li>Se&ccedil;ilen sabit diskin durumu &quot;İlk Kullanıma Hazırlandı&quot; veya &quot;İlk Kullanıma Hazırlanmadı&quot; olmalıdır.</li>
</ul>
</div>

<h4>RAID Group tanımını d&uuml;zenlemek i&ccedil;in:</h4>
<ol>
	<li>D&uuml;zenlemek istediğiniz RAID Group'u se&ccedil;in.</li>
	<li><strong>Y&ouml;net</strong>'e tıklayın.</li>
	<li><strong>A&ccedil;ıklama d&uuml;zenle</strong> &ouml;ğesini se&ccedil;in.</li>
	<li>A&ccedil;ıklamayı d&uuml;zenleyin ve sonucu kaydetmek i&ccedil;in <strong>TAMAM</strong>'a tıklayın.</li>
</ol>

<h3>RAID D&uuml;zeltme</h3>
<p>RAID d&uuml;zeltme, RAID Group'larını inceleyen ve belirlenen veri tutarsızlıklarını onaran bir veri bakımı işlevidir. Bu işlev, RAID 5<span class="enable-grantley"></span> <span class="disable-grantley"> veya </span>RAID 6<span class="enable-grantley"> ya da RAID F1</span> uygulayan RAID Gruplarıyla kullanılabilir.</p>

<p>Veri tutarlılığını korumak ve disk hatası durumunda verilerin kaybedilmesini &ouml;nlemek i&ccedil;in d&uuml;zenli olarak RAID d&uuml;zeltme ger&ccedil;ekleştirilmesini &ouml;neririz.</p>

<h4>RAID d&uuml;zeltme ger&ccedil;ekleştirmek i&ccedil;in:</h4>
<ol>
	<li>&Uuml;zerinde RAID d&uuml;zeltme ger&ccedil;ekleştirilecek RAID Grubunu se&ccedil;in.</li>
	<li><strong>Y&ouml;net</strong>'e tıklayın.</li>
	<li><strong>RAID d&uuml;zeltme</strong>'yi se&ccedil;in.</li>
</ol>

<div class="section"><h4>Not:</h4>
<ul>
	<li>RAID d&uuml;zeltme yalnızca RAID Grubunun durumu <strong>Normal</strong> olduğunda ger&ccedil;ekleştirilebilir.</li>
	<li>L&uuml;tfen RAID d&uuml;zeltme tamamlanmadan &ouml;nce sistemi kapatmayın. Tamamlanmadan &ouml;nce sistem kapatılırsa, RAID d&uuml;zeltme baştan başlatılmalıdır.</li>
</ul>
</div>
    
<p>____<br />*Yalnızca bazı modellerde mevcuttur.</p>

</body>
</html>