
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>iSCSI Manager</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_setting"></a>Configuraci&oacute;n</h2>

<h3>iSNS</h3>
<p>iSNS (Internet Storage Name Service) ofrece el mecanismo de administraci&oacute;n centralizada. Puede registrar todos los iSCSI Target con un servidor iSNS.</p>
<h4>Para registrar iSCSI Targets con un servidor iSNS:</h4><ol>
<li>Haga clic en <b>iSNS</b> y marque <b>Habilitar iSNS</b>.</li>
<li>Escriba la direcci&oacute;n IP del servidor iSNS. Haga clic en <b>OK</b> para aplicar la configuraci&oacute;n.</li>
</ol>

<h3>Profundidad de la cola de E/S</h3>
<p>El valor predeterminado es&nbsp;16, pero puede modificar la profundidad de la cola de E/S de todos destinos si lo necesita.</p>

<h3>Escritura con capacidad baja</h3>
<p>Cuando quede menos de 1 GB de espacio disponible en un volumen, los LUN del volumen pasar&aacute;n a estar protegidos por el sistema para evitar que se bloquee el sistema de archivos y los usuarios no podr&aacute;n escribir datos en ellos. La escritura de baja capacidad permitir&aacute; a los usuarios continuar escribiendo datos en los LUN cuando el volumen se est&eacute; quedando sin espacio libre. Sin embargo, se recomienda deshabilitar esta opci&oacute;n cuando se resuelva el problema de espacio insuficiente.</p>
<div class="section">
	<h4>Observaci&oacute;n:</h4>
	<ul>
		<li>Aunque tenga esta funci&oacute;n habilitada, evite seguir escribiendo datos en el LUN.</li>
	</ul></div>	

<h3>Modo recuperaci&oacute;n de espacio</h3>
<p>A continuaci&oacute;n, se muestran tres modos de recuperaci&oacute;n de espacio. Al ajustar la velocidad, puede controlar el impacto de la recuperaci&oacute;n de espacio en el rendimiento del LUN.</p>
<ul>
	<li><strong>Priorizar la coherencia de E/S</strong>: Al dar prioridad a la coherencia de E/S, se reduce el impacto en el rendimiento mientras el sistema recupera espacio utilizado de un LUN avanzado heredado. Si se produce E/S entrante de manera continua, la velocidad se reduce. Cuando se reciben comandos de recuperaci&oacute;n de espacio consecutivos, el proceso de recuperaci&oacute;n se retrasa hasta que no haya ning&uacute;n otro comando de recuperaci&oacute;n de espacio.</li>
	<li><strong>Equilibrado</strong>: El modo de recuperaci&oacute;n predeterminado. Este modo mantiene un equilibrio entre la velocidad de E/S y la de recuperaci&oacute;n.</li>
	<li><strong>Priorizar la recuperaci&oacute;n</strong>: Al dar prioridad a la recuperaci&oacute;n, la E/S entrante tiene escasa influencia en la velocidad de recuperaci&oacute;n. La recuperaci&oacute;n se realiza a su m&aacute;xima velocidad sin renunciar a la coherencia de E/S.</li>
</ul>
</body>
</html>
