<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>iSCSI Manager</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="leaf_snapshot"></a>Instant&aacute;nea</h2>

<h4>Para tomar una instant&aacute;nea de LUN:</h4>
<p>Una instant&aacute;nea de un LUN es una copia puntual de solo lectura de un LUN.</p>
<ol>
	<li>Seleccione el LUN del que desea sacar instant&aacute;neas.</li>
	<li>Haga clic en <strong>Instant&aacute;nea</strong> y elija <strong>Tomar una instant&aacute;nea</strong>.</li>
	<li>Introduzca una descripci&oacute;n para esta instant&aacute;nea.</li>
	<li>Elija uno de los siguientes tipos de instant&aacute;neas de acuerdo con sus necesidades:<ul>
			<li><strong>Coherente con la aplicaci&oacute;n</strong>: este tipo de instant&aacute;nea solo se puede tomar cuando se ha instalado Synology Storage Console o Synology Snapshot Manager en su servidor Windows o VMware vCenter Server, seg&uacute;n su entorno operativo para comunicarse con DSM. Cuando se activan instant&aacute;neas coherentes con aplicaciones en DSM, las aplicaciones recibir&aacute;n una notificaci&oacute;n y pasar&aacute;n todos los datos de la memoria al LUN en el que se toma la instant&aacute;nea para garantizar la coherencia de los mismos.</li>
			<li><strong>Coherente frente a bloqueos</strong>: si no se ha instalado Storage Console o Snapshot Manager en ninguno de sus clientes, solo podr&aacute; capturar instant&aacute;neas consistentes con aver&iacute;as de los LUN. Cuando se activan, las aplicaciones no recibir&aacute;n notificaciones para pasar los datos de la memoria al LUN y por tanto no se garantizar&aacute; la consistencia de los datos.</li>
		</ul>
	</li>
	<li>Haga clic en <strong>OK</strong>.</li>
</ol>
<div class="section">
	<h4>Observaci&oacute;n:</h4>
	<ul>
		<li>Se recomienda instalar <b>Synology Storage Console</b> o <b>Snapshot Manager</b> para evitar posibles inconsistencias en los datos.</li>
	</ul>
</div>
<div class="section">
	<h4>Terminolog&iacute;a:</h4>
	<ul>
	<li><b>Synology Storage Console:</b> Synology Storage Console es un complemento de gesti&oacute;n de almacenamiento en VMware vSphere Client o Windows Server que simplifica la gesti&oacute;n y la supervisi&oacute;n de varios sistemas de almacenamiento de Synology. Tambi&eacute;n le permite tomar instant&aacute;neas de aplicaciones consistentes directamente desde DSM.<ul>
			<li>Para entornos VMware, el complemento solo es compatible con VMware vCenter Server Appliance 6.5 U2 o versiones posteriores.</li>
			<li>Puede descargar el complemento en el <a href="https://www.synology.com/support/download" target="_blank">Centro de descargas</a>; consulte <a href="https://www.synology.com/knowledgebase/DSM/help/StorageConsoleforVMware/storageconsoleforvmware" target="_blank">Synology Storage Console for VMware</a> y <a href="https://www.synology.com/knowledgebase/DSM/help/StorageConsoleforWindows/storageconsoleforwindows" target="_blank">Synology Storage Console for Windows</a> para obtener m&aacute;s informaci&oacute;n.</li>
		</ul></li>
	<li><b>Synology Snapshot Manager:</b> Synology Snapshot Manager es un complemento de software que permite tomar instant&aacute;neas de aplicaciones consistentes directamente desde DSM.<ul>
			<li>Para entornos VMware, este complemento solo es compatible con VMware vCenter Server 6.0 o versiones anteriores.</li>
		</ul>
	</li>
</ul>
</div>

<h4>Para eliminar una instant&aacute;nea:</h4>
<ol>
	<li>Seleccione el LUN del que ha tomado instant&aacute;neas.</li>
	<li>Haga clic en <b>Instant&aacute;nea</b> &gt; <b>Lista de instant&aacute;neas</b>.</li>
	<li>Seleccione la instant&aacute;nea que desea eliminar y haga clic en <b>Eliminar</b>.</li>
</ol>
<div class="section">
	<h4>Observaci&oacute;n:</h4>
	<ul>
		<li>La recuperaci&oacute;n de espacio tarda tiempo en procesarse despu&eacute;s de eliminar las instant&aacute;neas.</li>
	</ul>
</div>

<h4>Para restaurar un LUN:</h4>
<p>Seleccione una instant&aacute;nea puntual para restaurar los datos de un LUN.</p>
<ol>
	<li>Seleccione el LUN que desea restaurar.</li>
	<li>Haga clic en <strong>Instant&aacute;nea</strong> y elija <strong>Lista de instant&aacute;neas</strong>.</li>
	<li>Seleccione la instant&aacute;nea que desea restaurar y haga clic en <strong>Restaurar</strong>.</li>
</ol>

<h4>Para clonar un LUN a partir de instant&aacute;neas:</h4>
<p>realice una copia grabable del LUN o la instant&aacute;nea del LUN.</p>
<ul>
	<li>Seleccione una instant&aacute;nea de LUN de <strong>Lista de instant&aacute;neas</strong> y haga clic en <strong>Clonar</strong>.</li>
</ul>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>Las funciones de instant&aacute;nea, restauraci&oacute;n y clonaci&oacute;n de LUN solo est&aacute;n disponibles en LUN con comandos de aceleraci&oacute;n de almacenamiento.</li>
	<li>Si ha tomado una instant&aacute;nea o ha creado un clon, y el estado ha pasado a ser <strong>Anormal</strong>/<strong>Averiado</strong>, elimine dicha instant&aacute;nea/clon y cree otra/o.</li>
	<li>Todos los cambios realizados en un LUN hasta despu&eacute;s de crear una instant&aacute;nea se perder&aacute;n si restaura el LUN en esta instant&aacute;nea.</li>
	<li>Las funciones para restaurar los LUN, clonar los LUN y tomar y clonar instant&aacute;neas de LUN no est&aacute;n disponibles cuando un volumen tiene menos de 1 GB de espacio libre.</li>
</ul>
</div>
<div class="section"><h4><a id="smart_retention"></a>Pol&iacute;tica de retenci&oacute;n</h4>
<p>Esta opci&oacute;n proporciona una soluci&oacute;n ideal para ayudarle a especificar las cantidades m&aacute;ximas de versiones de instant&aacute;neas y ahorrar espacio en el volumen, pero es posible que necesite retener las instant&aacute;neas durante periodos de tiempo m&aacute;s largos. Debe tener en cuenta algunas cuestiones acerca de la pol&iacute;tica de retenci&oacute;n:</p>
<ul>
<li>Synology utiliza la pol&iacute;tica de retenci&oacute;n GFS (abuelo-padre-hijo). Puede configurar las cantidades m&aacute;ximas de versiones de instant&aacute;neas que se pueden retener para los siguientes rangos de tiempo respectivamente: <strong>horario</strong>, <strong>diario</strong>, <strong>semanal</strong>, <strong>mensual</strong> y <strong>anual</strong>.</li>
<li>Una instant&aacute;nea puede cumplir varias reglas de retenci&oacute;n al mismo tiempo. Por ejemplo, una instant&aacute;nea puede cumplir las reglas diarias, semanales y mensuales.</li>
<li>Las instant&aacute;neas m&aacute;s antiguas se conservar&aacute;n si toma muchas instant&aacute;neas dentro de un periodo determinado. Por ejemplo, si establece una regla de retenci&oacute;n de <strong>10&nbsp;instant&aacute;neas semanales</strong> y su programaci&oacute;n de instant&aacute;neas est&aacute; establecida para tomar 1&nbsp;instant&aacute;nea al d&iacute;a, Snapshot Replication conservar&aacute; la instant&aacute;nea m&aacute;s antigua de cada semana durante las &uacute;ltimas 10&nbsp;semanas.</li>
<li>Si no ha tomado instant&aacute;neas durante un periodo determinado, el sistema conservar&aacute; las instant&aacute;neas m&aacute;s recientes. Por ejemplo, si la regla de instant&aacute;neas diarias est&aacute; establecida en 15 y no se han tomado instant&aacute;neas durante los &uacute;ltimos 30&nbsp;d&iacute;as, el sistema conservar&aacute; las instant&aacute;neas tomadas hace entre 30 y 45&nbsp;d&iacute;as.</li>
<li>Todas las versiones de instant&aacute;neas tomadas en el periodo de una hora antes de la instant&aacute;nea m&aacute;s reciente se conservar&aacute;n de manera predeterminada, para que le resulte m&aacute;s f&aacute;cil encontrar y restaurar desde versiones recientes de instant&aacute;neas. Tambi&eacute;n puede bloquear una instant&aacute;nea para evitar que la eliminen autom&aacute;ticamente las reglas de retenci&oacute;n.</li>
</ul>

<p>Ejemplo 1:<br/> Si desea conservar instant&aacute;neas diarias de los &uacute;ltimos 3&nbsp;meses, instant&aacute;neas semanales de los &uacute;ltimos 4-6&nbsp;meses e instant&aacute;neas mensuales de los &uacute;ltimos 7-9&nbsp;meses, debe introducir 0 para las instant&aacute;neas cada hora, 90 para las instant&aacute;neas diarias, 24 para las instant&aacute;neas semanales, 9 para las instant&aacute;neas mensuales y 0 para las instant&aacute;neas anuales.</p>

<p>Ejemplo 2:<br/> Si desea conservar instant&aacute;neas cada hora de los &uacute;ltimos 2&nbsp;d&iacute;as, instant&aacute;neas diarias de la &uacute;ltima semana, instant&aacute;neas semanales del &uacute;ltimo mes e instant&aacute;neas mensuales del &uacute;ltimo a&ntilde;o, debe introducir 48 para las instant&aacute;neas cada hora, 7 para las instant&aacute;neas diarias, 4 para las instant&aacute;neas semanales, 12 para las instant&aacute;neas mensuales y 0 para las instant&aacute;neas anuales.</p><img class="help_image" src="../../images/iSCSIManager/retention_policy.png"></div>
</body>
</html>