<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>DSM mobile</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>DSM mobile</h1>

<p>DSM mobile permite al usuario <strong>admin</strong> de DSM (o a un usuario que pertenezca al grupo <strong>administrators</strong>) administrar la configuraci&oacute;n de DSM y comprobar la informaci&oacute;n de DSM con un dispositivo iOS<sup>®</sup> (iPhone<sup>®</sup>, iPad<sup>®</sup> o iPod touch<sup>®</sup>) o Android<sup>®</sup>. Esta Ayuda de DSM mobile le proporciona los siguientes temas y recursos para ayudarle a comenzar.</p>

<div class="section">
<h4>Observaci&oacute;n:</h4>
<p>Dispositivos y exploradores m&oacute;viles compatibles actualmente:</p>
	<ul>
		<li>Dispositivos m&oacute;viles: iPhone, iPad y iPod con iOS 10 o posterior; dispositivos con Android 6.0 o posterior</li>
		<li>Navegadores: Chrome, Safari</li>
	</ul>
</div>

<h2>Inicio y cierre de sesi&oacute;n</h2>

<div name="contents" id="login">
<p>Despu&eacute;s de conectarse a DSM con el explorador web en su dispositivo iOS o Android, ver&aacute; la pantalla de conexi&oacute;n, donde puede especificar su informaci&oacute;n de cuenta de DSM.</p>

<h4>Para iniciar sesi&oacute;n en DSM mobile:</h4>
<p>Introduzca sus credenciales de usuario de DSM y toque <strong>Iniciar sesi&oacute;n</strong>. Si desea guardar su informaci&oacute;n de conexi&oacute;n y conectarse autom&aacute;ticamente la pr&oacute;xima vez, active el interruptor <strong>Recordarme</strong> antes de conectarse.</p>

<h4>Para cerrar sesi&oacute;n en DSM mobile:</h4>
<ol>
  <li>Toque el bot&oacute;n de opci&oacute;n situado en la esquina superior derecha de la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o en el panel izquierdo (iPad o tableta Android).</li>
  <li>Toque <strong>Configuraci&oacute;n</strong> y, a continuaci&oacute;n, <strong>Cerrar sesi&oacute;n</strong>.</li>
</ol>
</div>

<h2>Administrar usuarios de DSM</h2>

<div name="contents" id="user">
<p>Toque en <strong>Usuario y grupo</strong> en la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o en el panel izquierdo (iPad o tableta Android) para ver la lista de usuarios.</p>

<h4>Para crear un usuario:</h4>
<ol>
  <li>Toque <strong>+</strong> y escriba el nombre de usuario y la contrase&ntilde;a, y la direcci&oacute;n de correo electr&oacute;nico del nuevo usuario.</li>
  <li>Habilite <strong>Enviar notificaci&oacute;n</strong> para enviar un correo de notificaci&oacute;n a la direcci&oacute;n de correo electr&oacute;nico del usuario cuando se creen sus cuentas de usuario de DSM.<br><span class="note_head">Nota: </span>Antes de enviar la notificaci&oacute;n, aseg&uacute;rese de que la configuraci&oacute;n de notificaci&oacute;n se ha completado en su Synology NAS. Con&eacute;ctese a la edici&oacute;n de escritorio de DSM con el explorador web de su equipo y vaya a <strong>Men&uacute; principal</strong> &gt; <strong>Panel de control</strong> &gt; <strong>Notificaci&oacute;n</strong> &gt; <strong>Correo electr&oacute;nico</strong> para modificar la configuraci&oacute;n.</li>
  <li>Toque <strong>Finalizado</strong> para confirmar o toque la flecha izquierda para cancelar.</li>
</ol>

<h4>Para buscar r&aacute;pidamente un usuario:</h4>
<p>Escriba el nombre del usuario en el campo de b&uacute;squeda.</p>

<h4>Para modificar la informaci&oacute;n de un usuario:</h4>
<ol>
  <li>Toque el nombre del usuario y elija una de las siguientes opciones:<ul>
      <li>Modifique el nombre o la contrase&ntilde;a del usuario en el campo <strong>Nombre</strong> o <strong>Contrase&ntilde;a</strong>.</li>
    <li>Active <strong>Deshabilitar</strong> para deshabilitar al usuario. Puede habilitar el usuario m&aacute;s tarde sin perder su configuraci&oacute;n.</li>
    <li>Active <strong>Administrador</strong> para a&ntilde;adir al usuario al grupo <strong>admin</strong>. A cualquier usuario que pertenezca al grupo <strong>admin</strong> se le otorgar&aacute;n privilegios administrativos para modificar la configuraci&oacute;n de DSM con DSM mobile o con el navegador web de su equipo.</li>
    </ul>
  </li>
  <li>En <strong>Privilegios</strong>, realice alguna de las siguientes opciones y toque <strong>Anterior</strong>:<ul>
      <li>Toque <strong>Carpeta compartida</strong> y toque el nombre de una carpeta compartida para modificar el privilegio de acceso del usuario: <strong>Lectura/Escritura</strong>: el usuario puede acceder a los archivos y subcarpetas de la carpeta compartida y hacerles cambios; <strong>S&oacute;lo lectura</strong>: el usuario puede acceder a los archivos y subcarpetas de la carpeta compartida, pero no puede hacerles cambios; <strong>Sin acceso</strong>: el usuario no puede acceder a los archivos y subcarpetas de la carpeta compartida.<br><span class="note_head">Nota: </span>Si hubiera conflictos de privilegios, la prioridad ser&aacute; la siguiente: <span class="note_content">Sin acceso &gt; Lectura/Escritura &gt; S&oacute;lo lectura</span>.</li>
      <li>Toque <strong>Aplicaci&oacute;n</strong> para modificar el privilegio de acceso del usuario a las aplicaciones DSM.</li>
    </ul>
  </li>
  <li>Toque <strong>Finalizado</strong> para confirmar o toque la flecha izquierda para cancelar.</li>
</ol>
</div>

<h2>Administrar carpetas compartidas</h2>

<div name="contents" id="shared">
<p>Toque <strong>Carpeta compartida</strong> en la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o en el panel izquierdo (iPad o tableta Android) para ver la lista de carpetas compartidas en su Synology NAS.</p>

<h4>Para crear una carpeta compartida:</h4>
<ol>
  <li>Toque <strong>+</strong> y escriba el nombre de la nueva carpeta.</li>
  <li>Toque <strong>Finalizado</strong> para confirmar o toque la flecha izquierda para cancelar.</li>
</ol>

<h4>Para modificar una carpeta compartida:</h4>
<p>Toque el nombre de la carpeta compartida y elija una de las siguientes opciones:</p>
<ul>
  <li>Modifique el nombre de la carpeta compartida en el campo <strong>Nombre</strong>.</li>
  <li>Toque <strong>Permisos de usuario</strong> y seleccione un usuario para modificar su privilegio de acceso a la carpeta compartida: <strong>Lectura/Escritura</strong>: el usuario puede acceder a los archivos y subcarpetas de la carpeta compartida y hacerles cambios; <strong>S&oacute;lo lectura</strong>: el usuario puede acceder a los archivos y subcarpetas de la carpeta compartida, pero no puede hacerles cambios; <strong>Sin acceso</strong>: el usuario no puede acceder a los archivos y subcarpetas de la carpeta compartida.<br><span class="note_head">Nota: </span>Si hubiera conflictos de privilegios, la prioridad ser&aacute; la siguiente: <span class="note_content">Sin acceso &gt; Lectura/Escritura &gt; S&oacute;lo lectura</span>.</li>
  <li>Tambi&eacute;n puede tocar <strong>Permisos de grupo</strong> para configurar privilegios por grupos.<br><span class="note_head">Nota: </span>Los permisos de grupo tienen mayor prioridad que los permisos de usuario.</li>
</ul>
</div>

<h2>Habilitar servicios</h2>

<div name="contents" id="services">
<p>Toque <strong>Servicio</strong> en la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o en el panel izquierdo (iPad o tableta Android) para habilitar o deshabilitar los servicios del Synology NAS.</p>

<h4>Para administrar los servicios LAN del Synology NAS:</h4>
<ul>
  <li>Habilite o deshabilite cualquiera de las siguientes opciones:<ul>
      <li><strong>AFP</strong> permite que su Synology NAS se convierta en un servidor de archivos Mac dentro de una red LAN.</li>
		<li><strong>Transmisi&oacute;n de impresora Bonjour</strong> permite que los clientes de Mac impriman en impresoras USB conectadas al Synology NAS.</li>
		<li><strong>Servicio NFS</strong> permite que el cliente Linux dentro de la red LAN acceda a datos de Synology NAS.</li>
      <li><strong>SMB</strong> permite que los clientes de Windows, Mac, y Linux y Linux compatibles con SMB/CIFS accedan a los datos almacenados en su Synology NAS dentro de la red LAN.</li>
      <li><strong>SSH/Telnet</strong> permite que su Synology NAS admita servicios de interfaz de l&iacute;nea de comandos de Telnet y SSH.</li>
     
    </ul>
  </li>
</ul>

<h4>Para administrar los servicios de Internet del Synology NAS:</h4>
<ul>
  <li>Habilite o deshabilite cualquiera de las siguientes opciones:<ul>
      <li><strong>FTP/FTPS</strong> permite que su Synology NAS se convierta en un servidor FTP.</li>
		<li><strong>Servicio NTP</strong> permite hacer que su Synology NAS funcione como un servidor de hora de red para sincronizar la hora entre los distintos dispositivos de red y el Synology NAS a trav&eacute;s de la red.</li>
		<li><strong>rsync</strong> le permite realizar copias de seguridad de sus datos mediante rsync desde un Synology NAS o clientes compatibles con rsync a su Synology NAS.</li>
		<li><strong>SFTP</strong> ofrece una transferencia de archivos segura a los usuarios de DSM sin la necesidad de contrase&ntilde;as y reduce el riesgo de filtraci&oacute;n de credenciales de usuario.</li>
	    </ul>
  </li>
</ul>

<div class="section">
<h4>Observaci&oacute;n:</h4>
<p>Para obtener m&aacute;s informaci&oacute;n acerca de los anteriores servicios, consulte cualquiera de lo siguiente:</p>
	<ul>
		<li><strong>Ayuda de DSM</strong> (disponible si inicia sesi&oacute;n en la edici&oacute;n de escritorio de DSM con el navegador web del equipo y accede a <strong>Men&uacute; principal</strong> &gt; <strong>Ayuda de DSM</strong>)</li>
		<li><strong>Gu&iacute;a del usuario de Synology DSM</strong> (disponible en el <a href="http://www.synology.com/support/download.php" target="_blank">Centro de descargas</a> de Synology)</li>
	</ul>
</div>

<h2>Supervisar recursos del sistema</h2>

<div name="contents" id="resourcemonitor">
<p>Toque <strong>Monitor de recursos</strong> en la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o en el panel izquierdo (iPad o tableta Android) para supervisar el uso de la CPU y la memoria de su Synology NAS.</p>
</div>

<h2>Ver informaci&oacute;n del sistema</h2>

<div name="contents" id="sysinfo">
<p>Toque <strong>Informaci&oacute;n del sistema</strong> en la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o en el panel izquierdo (iPad o tableta Android) para obtener una informaci&oacute;n general del estado de su Synology NAS.</p>

<h4>Para ver la informaci&oacute;n del sistema de Synology NAS:</h4>
<ol>
  <li>Realice cualquiera de las siguientes operaciones:<ul>
      <li>Toque <strong>General</strong> para ver informaci&oacute;n b&aacute;sica acerca de su Synology NAS, incluido el n&uacute;mero de serie, el nombre del modelo, la cantidad de memoria f&iacute;sica, la versi&oacute;n de DSM e informaci&oacute;n sobre hora y estado t&eacute;rmico.</li>
      <li>Toque <strong>Red</strong> para ver la configuraci&oacute;n de red de su Synology NAS y el estado de cada interfaz de red.</li>
      <li>Toque <strong>Almacenamiento</strong> para ver el uso de volumen del Synology NAS.</li>
    </ul>
  </li>
  <li>Toque el bot&oacute;n <strong>Actualizar</strong> en la esquina superior derecha para mantener actualizada la informaci&oacute;n del sistema.</li>
</ol>
</div>

<h2>Firmware</h2>

<div name="contents" id="firmware">
<p>Toque <strong>Firmware</strong> para ver y actualizar su versi&oacute;n de DSM.</p>

<h4>Para configurar los par&aacute;metros de actualizaci&oacute;n de DSM:</h4>
<ol>
  <li>Toque <strong>Actualizaci&oacute;n de DSM</strong>.</li>
  <li>Elija alguna opci&oacute;n de las siguientes:<ul>
      <li>Solo actualizaciones importantes</li>
      <li>DSM m&aacute;s reciente y todas las actualizaciones</li>
    </ul>
  </li>
  <li>Toque <strong>Finalizado</strong>.</li>
</ol>

<h4>Para descargar las actualizaciones disponibles:</h4>
<ol>
  <li>Compruebe la versi&oacute;n de DSM en <strong>Estado</strong>.</li>
  <li>Si su versi&oacute;n de DSM no est&aacute; actualizada, toque el bot&oacute;n <strong>Descargar</strong> que aparece bajo la secci&oacute;n <strong>Estado</strong> para actualizar su DSM.</li>
</ol>
</div>

<h2>Administrar bloqueo IP</h2>

<div name="contents" id="block">
<p>Toque <strong>Bloqueo IP</strong> en la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o en el panel izquierdo (iPad o tableta Android) para impedir conexiones no autorizadas.</p>

<h4>Para administrar el bloqueo IP:</h4>
<ol>
  <li>Toque en el bot&oacute;n de configuraci&oacute;n de la esquina superior derecha.</li>
  <li>Active <strong>Habilitar bloqueo autom&aacute;tico</strong> para habilitar Bloqueo IP.</li>
  <li>Introduzca un n&uacute;mero en <strong>Intentos de conexi&oacute;n</strong> y <strong>En (minutos)</strong> para bloquear una direcci&oacute;n IP al cabo de un n&uacute;mero definido de intentos de conexi&oacute;n fallidos en un n&uacute;mero de minutos especificado.</li>
  <li>Puede activar <strong>Habilitar caducidad del bloqueo</strong> y especificar <strong>Desbloquear al cabo de (d&iacute;as)</strong> para desbloquear una direcci&oacute;n IP despu&eacute;s de un n&uacute;mero de d&iacute;as determinado. Si introduce aqu&iacute; &quot;0&quot;, la direcci&oacute;n IP bloqueada permanecer&aacute; as&iacute; indefinidamente hasta que la elimine de la lista de bloqueados.</li>
  <li>Toque <strong>Finalizado</strong>.</li>
</ol>

<h4>Para agregar direcciones IP a la lista de permiso/bloqueo:</h4>
<ol>
  <li>Si desea a&ntilde;adir la IP a la lista de permiso/bloqueo, toque el bot&oacute;n de a&ntilde;adir de la esquina superior derecha y seleccione <strong>Lista de permiso</strong> o <strong>Lista de bloqueo</strong>.</li>
  <li>Despu&eacute;s de introducir la direcci&oacute;n IP, toque <strong>Finalizado</strong></li>
</ol>
</div>

<h2>Administrar Centro de paquetes</h2>

<div name="contents" id="package">

<p>Synology ha integrado aplicaciones dise&ntilde;adas por Synology o terceros en paquetes que pueden instalarse y habilitarse f&aacute;cilmente en el Synology NAS.</p>

<h4>Para administrar el Centro de paquetes:</h4>
<p>Toque <strong>Centro de paquetes</strong> en la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o el panel de la izquierda (iPad o tableta Android) para ver la informaci&oacute;n del paquete, ejecutar o detener paquetes, o actualizar a las versiones m&aacute;s recientes.</p>


<h4>Para ejecutar o detener los paquetes instalados:</h4>
<p>Toque el interruptor que aparece junto a un paquete para ejecutarlo o detenerlo.</p>

<h4>Para ver paquetes:</h4>
<p>Toque un paquete para ver su informaci&oacute;n.</p>
     
<h4>Para actualizar paquetes:</h4>
<ol>
	<li>Toque la pesta&ntilde;a <strong>Actualizar</strong> para ver las versiones de actualizaci&oacute;n disponibles actualmente.</li>
    <li>Toque el bot&oacute;n que aparece a la derecha del paquete para actualizar a la versi&oacute;n m&aacute;s reciente.</li>   
</ol>
</div>    

<h2>Ver registros o conexiones actuales</h2>

<div name="contents" id="log">
<p>Toque en <strong>Registro</strong> en la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o en el panel izquierdo (iPad o tableta Android) para supervisar las conexiones actuales o ver los registros de los servicios del Synology NAS.</p>

<h4>Para supervisar las conexiones actuales:</h4>
<ul>
  <li>Toque <strong>[n&uacute;mero] registros m&aacute;s recientes</strong> en la secci&oacute;n <strong>Visi&oacute;n general</strong> para ver la lista de usuarios que han accedido &uacute;ltimamente a los servicios del Synology NAS.</li>
</ul>

<h4>Para ver los registros de un servicio espec&iacute;fico:</h4>
<ul>
  <li>Toque en cualquier elemento en la secci&oacute;n <strong>Registros de eventos</strong> o <strong>Registros de transferencia de archivos</strong> para ver la lista de los correspondientes registros.</li>
</ul>

</div>
<h2>Iniciar aplicaciones m&oacute;viles</h2>
<div name="contents" id="launch">

<p>DSM mobile proporciona un pr&aacute;ctico lugar para que inicie las aplicaciones m&oacute;viles de Synology instaladas en su dispositivo iOS o Android.</p>

<h4>Para iniciar las aplicaciones m&oacute;viles de Synology con DSM mobile:</h4>
<p>Toque cualquiera de las siguientes aplicaciones en la secci&oacute;n inferior de la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o en el panel izquierdo (iPad o tableta Android):</p>
<ul>
	<li><strong>DS audio</strong></li>
	<li><strong>DS cam</strong></li>
	<li><strong>DS cloud</strong></li>
	<li><strong>DS get</strong></li>
	<li><strong>DS file</strong></li>
	<li><strong>DS note</strong></li>
	<li><strong>DS photo</strong></li>
	<li><strong>DS video</strong></li>
	<li><strong>Chat</strong></li>
	<li><strong>MailPlus</strong></li>
	
    
	
	
	
</ul>

<div class="section">
<h4>Observaci&oacute;n:</h4>
	<ul>
		<li>Para obtener m&aacute;s informaci&oacute;n acerca de estas aplicaciones, consulte los archivos de Ayuda incluidos con las aplicaciones.</li>
     </ul> 
</div>

<h2>Poner el Synology NAS en marcha<br><span style="font-size:80%;">(reinicio, apagado o pitido)</span></h2>

<div name="contents" id="restart">
<p>DSM mobile le permite reiniciar o apagar su Synology NAS con su iOS o dispositivo Android. Adem&aacute;s, si tiene varios Synology NAS cerca, podr&aacute; identificar r&aacute;pidamente el suyo solicitando que emita sonidos.</p>

<h4>Para poner su Synology NAS en marcha:</h4>
<ol>
  <li>Toque el bot&oacute;n de opci&oacute;n situado en la esquina superior derecha de la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o en el panel izquierdo (iPad o tableta Android).</li>
  <li>Realice cualquiera de las siguientes operaciones:<ul>
      <li>Toque <strong>Reiniciar</strong> y, a continuaci&oacute;n, toque <strong>S&iacute;</strong> para reiniciar su Synology NAS.</li>
      <li>Toque <strong>Apagar</strong> y, a continuaci&oacute;n, toque <strong>S&iacute;</strong> para apagar su Synology NAS.</li>
      <li>Toque <strong>Buscarme</strong> para solicitar al Synology NAS que emita pitidos. Toque <strong>OK</strong> para detener el pitido.</li>
    </ul>
  </li>
</ol>
</div>

<h2>Cambiar al modo de escritorio de DSM</h2>

<div name="contents" id="desktopedition">

<p>Toque el icono de configuraci&oacute;n y seleccione <strong>Modo de escritorio</strong> para cambiar al modo de escritorio de DSM.</p>
</div>



<h2>C&oacute;mo utilizar Storage Manager</h2>
<div name="contents" id="contents12">
<p>El <strong>Administrador de almacenamiento</strong> le permite ver r&aacute;pidamente el uso y el estado de los vol&uacute;menes del sistema y las unidades.</p>

<h4>Para visualizar la informaci&oacute;n del volumen:</h4>
	<ol>
		<li>Toque <strong>Administrador de almacenamiento</strong> en la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o en el panel izquierdo (iPad o tableta Android).</li>
		<li>Toque la ficha <strong>Volumen</strong>.</li> 
		<li>Toque un volumen de la lista para obtener informaci&oacute;n detallada.</li>
	</ol>

<h4>Para ver informaci&oacute;n de la unidad:</h4>
	<ol>
		<li>Toque <strong>Administrador de almacenamiento</strong> en la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o en el panel izquierdo (iPad o tableta Android).</li>
		<li>Toque la pesta&ntilde;a <strong>HDD/SDD</strong>.</li>
		<li>Toque una unidad de la lista para ver la informaci&oacute;n de estado y S.M.A.R.T.</li>
	</ol>

<h4>Para iniciar o detener una prueba de S.M.A.R.T.:</h4>
	<ol>
		<li>Toque <strong>Administrador de almacenamiento</strong> en la p&aacute;gina de inicio (iPhone/iPod touch o tel&eacute;fono Android) o en el panel izquierdo (iPad o tableta Android).</li>
		<li>Toque la pesta&ntilde;a <strong>HDD/SDD</strong>.</li>
		<li>Toque una unidad de la lista para ver su p&aacute;gina de informaci&oacute;n.</li>
		<li>Toque <strong>S.M.A.R.T. Toque Probar</strong> para iniciar una prueba de S.M.A.R.T. o <strong>Detener</strong> para pausarla.</li>
     </ol>
     
</div>




<h2>M&aacute;s informaci&oacute;n</h2>

<div name="contents" id="contents11">
<p>Si necesita informaci&oacute;n para solucionar problemas o desea conocer m&aacute;s acerca de Synology, toque los siguientes v&iacute;nculos para conocer los recursos en l&iacute;nea de Synology:</p>
<ul>
  <li><a href="https://www.synology.com/support" target="_blank">Base de conocimiento</a></li>
  <li><a href="https://community.synology.com/" target="_blank">Comunidad</a></li>
  <li><a href="http://www.synology.com/support/download.php" target="_blank">Centro de descargas</a></li>
  <li><a href="https://account.synology.com/support/create/ticket" target="_blank">Soporte t&eacute;cnico</a></li>
</ul>
</div>

</body>
</html>
