
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Moniteur de ressources</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1><a name="leaf_update"></a>Moniteur de ressources</h1>
<p class="disable-dockerx64">Le moniteur de ressources vous permet de surveiller l'utilisation du processeur, de la m&eacute;moire de l'utilisation du disque et du flux r&eacute;seau. Vous pouvez choisir de surveiller en temps r&eacute;el ou d'afficher les donn&eacute;es pr&eacute;c&eacute;dentes.</p>
<p class="enable-dockerx64">Le moniteur de ressources vous permet de surveiller l'utilisation du processeur, de la m&eacute;moire et le flux r&eacute;seau. Vous pouvez choisir de surveiller en temps r&eacute;el ou d'afficher les donn&eacute;es pr&eacute;c&eacute;dentes.</p>
<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Les donn&eacute;es pr&eacute;c&eacute;dentes sont uniquement affich&eacute;es si <strong>Activer l'historique d'utilisation</strong> est coch&eacute; dans l'onglet <strong>Param&egrave;tres</strong>.</li>
<li class="enable-dockerx64">Pour Docker DSM, <strong>Processeur et m&eacute;moire</strong> fournit les informations d'utilisation relative &agrave; l'<strong>h&ocirc;te Docker</strong>.</li>
</ul>
</div>
<h2>Performances</h2>
<p>Cliquez sur l'onglet <strong>Performances</strong> pour afficher les donn&eacute;es d'utilisation des ressources. La date d&eacute;taill&eacute;e, l'heure et les informations du tableau seront affich&eacute;es en passant la souris.</p>

<h3>Processeur</h3>
<p>Vous pouvez contr&ocirc;ler l'utilisation globale de la CPU pour <strong>Utilisateur</strong>, <strong>Syst&egrave;me</strong> et <strong>Atte E/S</strong>. La charge du CPU peut &ecirc;tre &eacute;lev&eacute;e lorsque vous lancez le Moniteur de ressources car le syst&egrave;me r&eacute;colte les donn&eacute;es tout en chargeant la page de l'interface.</p>
<p><strong>Utilisateur</strong> affiche le pourcentage du CPU utilis&eacute; pour les applications utilisateur. <strong>Syst&egrave;me</strong> affiche le pourcentage du CPU utilis&eacute; dans le c&oelig;ur du syst&egrave;me, IRQ de niveau mat&eacute;riel/logiciel. <strong>Atte E/S</strong> affiche le pourcentage du CPU pass&eacute; sur l'attente d'E/S.</p>
<p><strong>Utilisation</strong> est la somme de l'utilisation du CPU pour l'<strong>Utilisateur</strong> et le <strong>Syst&egrave;me</strong>.</p>
<p>La charge moyenne pour 1, 5 et 15 minutes est affich&eacute;e, indiquant la longueur de la file d'attente d'ex&eacute;cution (soit la somme du nombre de processus qui sont actuellement en cours d'ex&eacute;cution ainsi que le nombre qui sont en attente d'ex&eacute;cution). </p>
<div class="section">
<h4>Explication des termes</h4>
<ul>
<li><b>Atte E/S</b>: L'attente E/S indique que la CPU est inactive et n'est utilis&eacute;e par aucun programme. </li>
<p>L'attente E/S est un comportement normal. La vitesse du processeur &eacute;tant bien plus rapide que celle de l'E/S, il est commun pour le processeur attende la fin de la transmission de disques ou de r&eacute;seau. Cependant, si le pourcentage d'attente E/S est extr&ecirc;mement grand, cela signifie que le CPU passe la plupart du temps en attente E/S et peut ne pas &ecirc;tre bien utilis&eacute;. Vous pouvez utiliser des configurations de groupe de disques (par exemple SHR ou RAID 5) ou des configurations r&eacute;seau plus efficaces (par exemple agr&eacute;gation) pour r&eacute;aliser de meilleures performances syst&egrave;me.</p> 
</ul>
</div>
<h3>M&eacute;moire</h3>
<p>L'utilisation m&eacute;moire globale de la m&eacute;moire physique et l'espace d'&eacute;change seront affich&eacute;s. L'utilisation m&eacute;moire reste &eacute;lev&eacute;e car le syst&egrave;me stocke les donn&eacute;es &agrave; acc&egrave;s fr&eacute;quent dans le cache pour acc&eacute;l&eacute;rer leur disponibilit&eacute; sans acc&eacute;der au disque dur. La m&eacute;moire cache est lib&eacute;r&eacute;e lorsque la m&eacute;moire totale est insuffisante.</p>
<p>Une forte utilisation de l'espace d'&eacute;change indique une m&eacute;moire syst&egrave;me insuffisante, et affecte &eacute;galement les performances du syst&egrave;me. Vous pouvez afficher le taux d'&eacute;change entrant et d'&eacute;change sortant en choisissant <strong>&Eacute;changer</strong> dans le menu d&eacute;roulant en haut. </p>

<h3>R&eacute;seau</h3>
<p>Le graphe de flux r&eacute;seau affiche les taux d'envoi et de r&eacute;ception de donn&eacute;es en Ko par seconde. Si PPPoE est connect&eacute;, le taux de transfert est &eacute;galement affich&eacute; sur le graphe.</p>

<h3 class="disable-dockerx64">Disque</h3>
<p class="disable-dockerx64">Vous pouvez choisir d'afficher l'utilisation globale du disque, le taux de transfert ou E/S disque par seconde en cliquant sur le menu d&eacute;roulant en haut du tableau. Vous pouvez cliquer sur <strong>Afficher tout</strong> au bas pour s&eacute;lectionner plus de disques en cochant les cases pour ajouter leurs donn&eacute;es au tableau.</p>


<h3 class="disable-eds14 disable-dockerx64">Volume</h3>
<p class="disable-eds14 disable-dockerx64">Cette page affiche l'&eacute;tat g&eacute;n&eacute;ral du transfert des volumes. Cliquez sur le menu d&eacute;roulant au-dessus du tableau pour afficher utilisation du transfert, taux de transfert ou IOPS. Cliquez sur le bouton <strong>Afficher tout</strong> pour s&eacute;lectionner les volumes individuels et les ajouter au tableau.</p>

<h3 class="disable-eds14 disable-dockerx64">iSCSI</h3>
<p class="disable-eds14 dixable-dockerx64">Cette page affiche l'&eacute;tat g&eacute;n&eacute;ral des iSCSI LUN en cours de fonctionnement. Cliquez sur le menu d&eacute;roulant au-dessus du tableau pour s&eacute;lectionner un LUN et consulter son &eacute;tat. Trois graphiques sont affich&eacute;s par d&eacute;faut, <strong>D&eacute;bit</strong>, <strong>IOPS</strong> and <strong>Latence</strong>. Pour des informations plus d&eacute;taill&eacute;es, cliquez sur le bouton <strong>Choisir les graphiques</strong> et s&eacute;lectionner d'autres graphiques que vous souhaitez consulter.</p>


<h2>Processus</h2>
<p>Cliquez sur l'onglet <strong>Processus</strong> pour afficher l'utilisation globale du CPU et la part de chaque processus par ordre d&eacute;croissant de charge CPU.</p>
<p>L'<strong>&Eacute;tat</strong> du processus comprend <strong>En cours d'ex&eacute;cution</strong>, <strong>En veille</strong> et <strong>Arr&ecirc;t&eacute;</strong>. Les &eacute;quivalents Linux de l'&eacute;tat du processus sont <strong>en cours d'ex&eacute;cution</strong>, <strong>arr&ecirc;t&eacute;/tra&ccedil;age en cours</strong>, <strong>en veille</strong>. </p>
<p><strong>En veille</strong> peut &ecirc;tre suivi par une lettre pour des informations d&eacute;taill&eacute;es, p.ex. 'D' pour veille du disque, 'Z' pour zombie, 'X' pour mort.</p>

<h2>Utilisateurs connect&eacute;s</h2>
<p> Sur cet onglet, vous pouvez voir et g&eacute;rer les clients qui sont actuellement connect&eacute;s au syst&egrave;me et acc&egrave;dent aux ressources. Cette section affiche les clients qui sont connect&eacute;s via HTTP, TELNET, SSH, SMB/CIFS, AFP, FTP et NFS.</p>
<h4>Pour g&eacute;rer les connexions actuelles, effectuez l'une des op&eacute;rations suivantes&nbsp;:</h4>
<ul>
<li>Cliquez sur <b>Enregistrer</b> pour exporter la liste actuelle dans un fichier HTML.</li>
<li>Cliquez sur <b>Actualiser</b> pour actualiser la liste.</li>
<li>Cliquez sur <b>Tuer la connexion</b> pour emp&ecirc;cher l'utilisateur d'acc&eacute;der &agrave; la ressource. L'utilisateur d&eacute;connect&eacute; devra &ecirc;tre autoris&eacute; &agrave; nouveau pour obtenir 'acc&egrave;s &agrave; la ressource.</li>
<li>Cliquez sur <b>D&eacute;sactiver l'utilisateur</b> pour d&eacute;sactiver l'utilisateur. Pour activer l'utilisateur &agrave; nouveau, acc&eacute;dez &agrave; <b>Menu principal</b> &gt; <b>Panneau de configuration</b> &gt; <b>Utilisateur</b>.</li>
</ul>
<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>L'option <strong>Tuer la connexion</strong> ne fonctionne pas avec les clients NFS.</li>
<li>Si les clients NFS ne d&eacute;montent pas correctement les dossiers partag&eacute;s, ils peuvent toujours appara&icirc;tre dans la liste des utilisateurs connect&eacute;s.</li>
<li>Si le Synology NAS red&eacute;marre, les clients NFS qui &eacute;taient connect&eacute;s pr&eacute;c&eacute;demment n'appara&icirc;tront pas dans la liste des utilisateurs connect&eacute;s.</li>
</ul>
</div>


<h2>Limite de vitesse</h2>
<p>Sous l'onglet <strong>Limite de vitesse</strong>, vous pouvez afficher et g&eacute;rer la liste des processus de transfert de fichier qui appliquent la limite de vitesse sur Synology NAS.</p>
<h4>Pour actualiser la liste&nbsp;:</h4>
<p>Cliquez sur <strong>Actualiser</strong> pour recharger la page et obtenir les derni&egrave;res mises &agrave; jour des enregistrements.</p>
<h4>Pour arr&ecirc;ter un processus de transfert de fichiers&nbsp;:</h4>
<p>Cliquez sur <b>Tuer la connexion</b> pour arr&ecirc;ter le transfert de fichiers. Vous devrez red&eacute;marrer le transfert de fichiers pour terminer le processus avec succ&egrave;s.</p>


<h2>Param&egrave;tres</h2>
<p>Cliquez sur <strong>Param&egrave;tres</strong> pour configurer les options suivantes&nbsp;:</p>
<ul>
<li>Choisissez la <strong>Dur&eacute;e en temps r&eacute;el</strong> en minutes dans le menu d&eacute;roulant.</li>
<li>Cochez <strong>Activer l'historique d'utilisation</strong> si vous voulez afficher les donn&eacute;es pr&eacute;c&eacute;dentes. Quand il est connect&eacute;, vous pouvez permuter entre <strong>Temps r&eacute;el</strong>, <strong>1 jour</strong>, <strong>1 semaine</strong>, <strong>1 mois</strong> et <strong>1 an</strong> dans le menu d&eacute;roulant du coin sup&eacute;rieur droit lorsque vous afficher les tableaux des performances.</li> 
<li>Cochez <strong>Activer l'&eacute;v&eacute;nement des performances</strong> si vous souhaitez surveiller les performances du syst&egrave;me.</li>
</ul>

<p>Cliquez sur <strong>Appliquer</strong> pour enregistrer les param&egrave;tres.</p>

<h2>Alarmes des performances</h2>
<h4>Pour cr&eacute;er une alarme de performances&nbsp;:</h4>
<ol>
<li>Acc&eacute;dez &agrave; <strong>Param&egrave;tres</strong> &gt; <strong>R&egrave;gle de l'alarme des performances</strong>.</li>
<li>Cliquez sur le bouton <b>Cr&eacute;er</b>.</li>
<li>Les param&egrave;tres de r&egrave;gle suivants sont disponibles&nbsp;:</li>
<ul>
<li><strong>Resources</strong>&nbsp;: Choisissez de ressources auxquelles vous souhaitez appliquer la r&egrave;gle.</li>
<li><strong>Type</strong>&nbsp;: Choisissez le type r&egrave;gle que vous souhaitez cr&eacute;er.</li>
<li><strong>Niveau </strong>: Choisissez le niveau d'alarme.</li>
<li><strong>Plus grand que</strong>&nbsp;: D&eacute;finissez le pourcentage maximum de votre type de r&egrave;gles lorsque le syst&egrave;me vous avertit en cas de d&eacute;passement.</li>
</ul>
<li>Cochez <strong>Activ&eacute;</strong> souhaitez activer imm&eacute;diatement r&egrave;gle.</li>
<li>Cliquez sur <strong>OK</strong> pour ajouter la r&egrave;gle.</li>
</ol>


<div class="section">
<h4>M&eacute;canisme pour les alarmes de performances&nbsp;:</h4>
<p>Les alarmes de performance fonctionnent via le m&eacute;canisme suivant pour r&eacute;duire les fausses alarmes et &eacute;viter une consommation excessive des ressources syst&egrave;me sur une courte p&eacute;riode.</p>
<ol>
	<li>Le service des alarmes de performance v&eacute;rifie toutes les r&egrave;gles toutes les cinq minutes. Aucune action n'est d&eacute;clench&eacute;e si toutes les valeurs surveill&eacute;es tombent sous les seuils que vous avez d&eacute;finis.</li>
	<li>Lorsqu'une valeur surveill&eacute;e d&eacute;passe son seuil, l'alarme n'est pas d&eacute;clench&eacute;e imm&eacute;diatement. Au lieu de cela, le syst&egrave;me v&eacute;rifie la r&egrave;gle cinq fois de plus &agrave; des intervalles de 30&nbsp;secondes.</li>
	<li>Apr&egrave;s la modification de la longueur de l'intervalle, si la valeur surveill&eacute;e d&eacute;passe le seuil cinq fois cons&eacute;cutives, une alarme est alors d&eacute;clench&eacute;e&nbsp;; toutefois, si la valeur surveill&eacute;e tombe sous le seuil pendant l'une de ces cinq v&eacute;rifications, la longueur de l'intervalle revient &agrave; cinq minutes.</li>
</ol>
<p>Par cons&eacute;quent, pour un &eacute;v&egrave;nement unique, une alarme sera d&eacute;clench&eacute;e au plus tard 450&nbsp;secondes apr&egrave;s la premi&egrave;re d&eacute;tection de l'&eacute;v&eacute;nement.</p>

<h4>Niveaux d'alarme&nbsp;:</h4>
<p>Les alarmes de performance d&eacute;clenchent diff&eacute;rentes actions selon les niveau d'alarme.</p>
<ul>
	<li><strong>Avertissement</strong>&nbsp;: G&eacute;n&egrave;re un message d'avertissement dans le journal syst&egrave;me, mais ne d&eacute;clenche aucune notification syst&egrave;me.</li>
	<li><strong>Critique</strong>: G&eacute;n&egrave;re non seulement un message dans le journal syst&egrave;me, mais d&eacute;clenche &eacute;galement des notifications syst&egrave;me.</li>
</ul>
<p>Les journaux des alarmes de performance sont visibles dans l'onglet <strong>Alarme des performances</strong> ou le <strong>Centre des journaux</strong> de DSM.</p>
</div>


<h4>Pour consulter les alarmes de performances&nbsp;:</h4>
<ul>
<li>Cliquez sur l'onglet <strong>Alarme des performances</strong> pour afficher toutes les alarmes de performance d&eacute;clench&eacute;es.</li> 
<li>Cliquez sur <strong>Actualiser</strong> pour obtenir les derni&egrave;res alarmes.</li>
</ul>

<h4>Pour exporter les alarmes de performances&nbsp;:</h4>
<ol>
<li>Cliquez sur la fl&egrave;che &agrave; c&ocirc;t&eacute; du bouton <strong>Export</strong>.</li>
<li>Vous pouvez choisir d'exporter vos alarmes dans <strong>HTML</strong> ou <strong>CSV</strong>.</li>
</ol>
<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
<li>La prise en charge des <strong>Alarmes des performances</strong> varie selon les mod&egrave;les de Synology NAS. Pour plus d'informations, reportez-vous &agrave; <a href="http://www.synology.com/" target="_b +lank">www.synology.com</a>.</li>
</ul>
</div>
</body>
</html>
