<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Freigegebener Ordner</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Verschl&uuml;sselten Ordner bearbeiten</h2>
<p>Nachdem ein Ordner verschl&uuml;sselt wurde, k&ouml;nnen Sie das Dropdown-Men&uuml; <b>Verschl&uuml;sselung</b> benutzen, um den Ordner zu bearbeiten.</p>
<h4>Die Elemente, die im Men&uuml; angezeigt werden, sind abh&auml;ngig vom Status der ausgew&auml;hlten gemeinsamen Ordner:</h4>
<ul>
<li>Wenn Sie einen unverschl&uuml;sselten gemeinsamen Ordner w&auml;hlen, ist das Dropdown-Men&uuml; <b>Verschl&uuml;sselung</b> deaktiviert.</li>
<li>Wenn Sie einen verschl&uuml;sselten gemeinsamen Ordner ausw&auml;hlen, der angeh&auml;ngt wurde, k&ouml;nnen Sie <b>Trennen</b> im Dropdown-Men&uuml; <b>Verschl&uuml;sselung</b> w&auml;hlen, um den Ordner zu trennen, oder Sie w&auml;hlen <b>Exportschl&uuml;ssel</b>, um den Schl&uuml;ssel f&uuml;r die Verschl&uuml;sselung zu speichern.</li>
<li>Wenn Sie einen verschl&uuml;sselten gemeinsamen Ordner ausw&auml;hlen, der getrennt wurde, k&ouml;nnen Sie <b>Anh&auml;ngen</b> (Mounten) im Drop-down-Men&uuml; <b>Verschl&uuml;sselung</b> w&auml;hlen. Geben Sie dann den Schl&uuml;ssel f&uuml;r die Verschl&uuml;sselung ein, um den Ordner anzuh&auml;ngen, damit darauf zugegriffen werden kann.</li>
<li>Wenn Sie mehrere verschl&uuml;sselte gemeinsame Ordner ausw&auml;hlen, die getrennt werden, und wenn deren Schl&uuml;ssel vom <strong>Schl&uuml;ssel-Manager</strong> verwaltet werden, k&ouml;nnen Sie <b>Mount (einh&auml;ngen)</b> aus dem Drop-Down-Men&uuml; <b>Verschl&uuml;sselung</b> ausw&auml;hlen und dann die Passphrase des Key Manager eingeben, um diese Ordner f&uuml;r den Zugriff einzuh&auml;ngen.</li>
</ul>

<ol>
<span class="note_head">Anmerkung:</span>
<li><span  class="note_content">Es ist sehr wichtig, dass Sie den Schl&uuml;ssel f&uuml;r die Verschl&uuml;sselung behalten.</span> Wir empfehlen Ihnen dringend, diesen Schl&uuml;ssel zu exportieren und zu speichern. Wenn Sie den Schl&uuml;ssel vergessen oder verloren haben, gibt es keine M&ouml;glichkeit, die verschl&uuml;sselten Daten zu retten.</li>
<li>Wenn ein verschl&uuml;sselter Ordner eingeh&auml;ngt ist, k&ouml;nnen Sie ihn weder umbenennen noch seine Volumeposition &auml;ndern. Sie k&ouml;nnen ihn erst dann &auml;ndern, nachdem Sie ihn getrennt haben.</li>
</ol>
</body>
</html>
