
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Resurssk&auml;rm</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Prestandalarm*</h2>
<h4>Att skapa en regel f&ouml;r prestandalarm:</h4>
<ol>
<li>G&aring; till <strong>Inst&auml;llningar</strong> &gt; <strong>Inst&auml;llningar</strong> och kontrollera att du har bockat f&ouml;r <strong>Aktivera prestandalarm</strong>.</li>
<li>G&aring; till <strong>Inst&auml;llningar</strong> &gt; <strong>Prestandalarmregel</strong>.</li>
<li>Klicka p&aring; knappen <b>Skapa</b>.</li>
<li>F&ouml;ljande regelinst&auml;llningar finns tillg&auml;ngliga:</li>
<ul>
<li><strong>Resurs</strong>: V&auml;lj den resurs du vill till&auml;mpa regeln f&ouml;r.</li>
<li><strong>Typ</strong>: V&auml;lj den typ av regel du vill skapa.</li>
<li><strong>Niv&aring;</strong>: V&auml;lj larmniv&aring;n.</li>
<li><strong>St&ouml;rre &auml;n</strong>: St&auml;ll in den maximala procenten f&ouml;r din regeltyp d&auml;r systemet ska meddela dig om den &ouml;verskrids.</li>
</ul>
<li>Bocka f&ouml;r <strong>Aktiverad</strong> om du vill aktivera den h&auml;r regeln omedelbart.</li>
<li>Klicka p&aring; <strong>OK</strong> f&ouml;r att l&auml;gga till regeln.</li>
</ol>


<div class="section">
<h4>Mekanism f&ouml;r prestandalarm:</h4>
<p>Prestandalarm fungerar med f&ouml;ljande mekanism f&ouml;r att minimera falsklarm och f&ouml;r att f&ouml;rhindra &ouml;verdriven konsumtion av systemresurser inom en kort tidsperiod.</p>
<ol>
	<li>Tj&auml;nsten prestandalarm kontrollerar alla regler var femte minut. Ingen &aring;tg&auml;rd utl&ouml;ses om alla de &ouml;vervakade v&auml;rdena befinner sig under det tr&ouml;skelv&auml;rde som du har st&auml;llt in.</li>
	<li>N&auml;r ett &ouml;vervakat v&auml;rde &ouml;verskrider sitt tr&ouml;skelv&auml;rde utl&ouml;ser det inte ett larm omedelbart. I st&auml;llet kontrollerar systemet regeln ytterligare fem g&aring;nger i intervaller om 30 sekunder.</li>
	<li>Efter att l&auml;ngden p&aring; intervallet &auml;ndrats och det &ouml;vervakade v&auml;rdet &ouml;verskrider tr&ouml;skelv&auml;rdet fem g&aring;nger i f&ouml;ljd blir ett larm utl&ouml;st; skulle det &ouml;vervakade v&auml;rdet dock falla under tr&ouml;skelv&auml;rdet vid n&aring;gon av dessa fem kontroller &auml;ndras l&auml;ngden p&aring; intervallet tillbaka till fem minuter.</li>
</ol>
<p>Av den anledningen blir ett larm f&ouml;r en enskild h&auml;ndelse utl&ouml;st senast 450 sekunder efter att h&auml;ndelsen f&ouml;rst uppt&auml;cktes.</p>

<h4>Larmniv&aring;er:</h4>
<p>Prestandalarm utl&ouml;ser olika &aring;tg&auml;rder beroende p&aring; larmniv&aring;erna.</p>
<ul>
	<li><strong>Varning</strong>: Skapar ett varningsmeddelande i systemloggen men utl&ouml;ser inte n&aring;got systemmeddelande.</li>
	<li><strong>Kritisk</strong>: Skapar inte bara ett meddelande i systemloggen utan utl&ouml;ser &auml;ven systemmeddelande.</li>
</ul>
<p>Loggfiler f&ouml;r prestandalarm kan visas p&aring; fliken <strong>Prestandalarm</strong> eller DSM:s <strong>Loggcentral</strong>.</p>
</div>


<h4>Att visa prestandalarm:</h4>
<ul>
<li>G&aring; till <strong>Prestandalarm</strong> f&ouml;r att visa alla utl&ouml;sta prestandalarm.</li>
<li>Klicka p&aring; <strong>Uppdatera</strong> f&ouml;r att f&aring; de mest uppdaterade larmen.</li>
</ul>

<h4>Att exportera prestandalarm:</h4>
<ol>
<li>G&aring; till <strong>Prestandalarm</strong>.</li>
<li>Klicka p&aring; pilen bredvid knappen <strong>Exportera</strong>.</li>
<li>Du kan v&auml;lja att exportera dina larm som antingen <strong>HTML</strong> eller <strong>CSV</strong>.</li>
</ol>
<div class="section"><h4>Obs:</h4>
<ul>
<li>St&ouml;d f&ouml;r <strong>Prestandalarm</strong> skiljer sig &aring;t mellan modeller av Synology NAS. F&ouml;r mer information, v&auml;nligen se <a href="http://www.synology.com/" target="_blank">www.synology.com</a>.</li>
</ul>
</div>

<p>____<br /> * Endast tillg&auml;ngligt f&ouml;r vissa modeller.</p>

</body>
</html>
