
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Resurssk&auml;rm</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1><a name="leaf_update"></a>Resurssk&auml;rm</h1>
<p class="disable-dockerx64">Resurssk&auml;rmen ger dig m&ouml;jlighet att &ouml;vervaka anv&auml;ndningen av processorn, minnet, diskutnyttjande och n&auml;tverksfl&ouml;det. Du kan v&auml;lja att &ouml;vervaka i realtid eller titta p&aring; tidigare data.</p>
<p class="enable-dockerx64">Resurssk&auml;rm ger dig m&ouml;jlighet att &ouml;vervaka anv&auml;ndningen av processorn, minnet och n&auml;tverksfl&ouml;det. Du kan v&auml;lja att &ouml;vervaka i realtid eller titta p&aring; tidigare data.</p>
<div class="section">
<h4>Obs:</h4>
<ul>
<li>Tidigare data visas bara om <strong>Aktivera anv&auml;ndningshistorik</strong> &auml;r f&ouml;rbockat p&aring; fliken <strong>Inst&auml;llningar</strong>.</li>
<li class="enable-dockerx64">F&ouml;r Docker DSM &auml;r <strong>CPU och minne</strong> det som visar information om anv&auml;ndning f&ouml;r <strong>Docker V&auml;rd</strong>.</li>
</ul>
</div>
<h2>Prestanda</h2>
<p>Klicka p&aring; fliken <strong>Prestanda</strong> f&ouml;r att visa data om resursanv&auml;ndning. Detaljerad information f&ouml;r datum tid och diagram visas n&auml;r du h&aring;ller musen &ouml;ver.</p>

<h3>CPU</h3>
<p>Du kan se &ouml;vergripande CPU-anv&auml;ndning f&ouml;r <strong>Anv&auml;ndare</strong>,&nbsp;<strong>System</strong>&nbsp;och <strong>I/O v&auml;nta</strong>. Processorbelastningen kan vara h&ouml;g n&auml;r Resurssk&auml;rm f&ouml;rst k&ouml;rs eftersom systemet m&aring;ste h&auml;mta sina resursdata och ladda anv&auml;ndargr&auml;nssnittssidan samtidigt.</p>
<p><strong>Anv&auml;ndare</strong> visar procentsats av CPU som anv&auml;nds f&ouml;r att k&ouml;ra anv&auml;ndarapplikationer. <strong>Systemet</strong> visar procentsats av CPU som anv&auml;nds f&ouml;r systemets k&auml;rna, h&aring;rdvaras/mjukvaras IRQ. <strong>I/O v&auml;nta</strong> visar procentsats av CPU som anv&auml;nds f&ouml;r I/O v&auml;nta.</p>
<p><strong>Utnyttjande</strong> &auml;r total CPU-anv&auml;ndning f&ouml;r <strong>Anv&auml;ndare</strong> och <strong>System</strong>.</p>
<p>Medelbelastningen inom 1, 5 och 15 minuter visas, och du kan se k&ouml;r-k&ouml;l&auml;ngd (dvs. summan av antalet processer som f&ouml;r n&auml;rvarande k&ouml;rs plus det antal som v&auml;ntar p&aring; att f&aring; k&ouml;ra). </p>
<div class="section">
<h4>F&ouml;rklaring av termer</h4>
<ul>
<li><b>I/O v&auml;nta</b>: I/O v&auml;nta visar att CPU &auml;r inaktiv och inte anv&auml;nds av n&aring;got program. </li>
<p>I/O v&auml;nta &auml;r ett normalt tillst&aring;nd. Eftersom CPU:s hastighet &auml;r mycket snabbare den f&ouml;r I/O, s&aring; &auml;r det vanligt att CPU f&aring;r v&auml;nta p&aring; att &ouml;verf&ouml;ringen av h&aring;rddiskar eller n&auml;tverk ska slutf&ouml;ras. Om procentandelen f&ouml;r I/O &auml;r mycket stor och CPU oftast &auml;r i l&auml;get I/O v&auml;nta s&aring; kanske den inte korrekt utnyttjad. D&auml;rf&ouml;r kan du anv&auml;nda effektivare konfigurationer av h&aring;rddiskgrupper (t.ex. SHR eller RAID 5) eller n&auml;tverkskonfigurationer (t.ex. Bonding) f&ouml;r att uppn&aring; b&auml;ttre systemprestanda.</p> 
</ul>
</div>
<h3>Minne</h3>
<p>Den totala minnesanv&auml;ndningen f&ouml;r fysiskt minne och swap space visas. Minnesanv&auml;ndningen f&ouml;rblir h&ouml;g eftersom systemet lagrar ofta f&ouml;rekommande data i cachen s&aring; att data snabbt kan erh&aring;llas utan att komma &aring;t h&aring;rddisken. Cacheminnet anv&auml;nds n&auml;r det totala minnet inte r&auml;cker till.</p>
<p>H&ouml;g swap space pekar p&aring; f&ouml;r lite systemminne och p&aring;verkar &auml;ven systemets prestanda. Du kan visa hastigheten vid swap in och swap ut genom att v&auml;lja <strong>Swap</strong> fr&aring;n rullgardinsmenyn h&ouml;gst upp. </p>

<h3>N&auml;tverk</h3>
<p>N&auml;tverksfl&ouml;desdiagrammet visar data som skickas och tas emot i KB per sekund. Om PPPoE &auml;r ansluten visas dess &ouml;verf&ouml;ringshastighet ocks&aring; p&aring; diagrammet.</p>

<h3 class="disable-dockerx64">H&aring;rddisk</h3>
<p class="disable-dockerx64">Du kan v&auml;lja att visa total diskanv&auml;ndning, &ouml;verf&ouml;ringshastighet eller IOPS genom att klicka p&aring; rullgardinsmenyn h&ouml;gst upp i diagrammet. Du kan klicka p&aring; <strong>Visa alla</strong> l&auml;ngst ned f&ouml;r att v&auml;lja fler h&aring;rddiskar genom att markera kryssrutorna f&ouml;r att l&auml;gga till dess data till diagrammet.</p>


<h3 class="disable-eds14 disable-dockerx64">Volym</h3>
<p class="disable-eds14 disable-dockerx64">Den h&auml;r sidan visar den &ouml;vergripande &ouml;verf&ouml;ringsstatusen f&ouml;r volymer. Klicka p&aring; rullgardinsmenyn ovanf&ouml;r grafen f&ouml;r att visa &ouml;verf&ouml;ringsutnyttjande, &ouml;verf&ouml;ringshastighet eller IOPS. Klicka p&aring; knappen <strong>Visa alla</strong> f&ouml;r att v&auml;lja enskilda volymer och l&auml;gg till dem i diagrammet.</p>

<h3 class="disable-eds14 disable-dockerx64">iSCSI</h3>
<p class="disable-eds14 dixable-dockerx64">Den h&auml;r sidan visar den &ouml;vergripande statusen f&ouml;r de iSCSI LUNs som f&ouml;r n&auml;rvarande k&ouml;rs. Klicka p&aring; rullgardinsmenyn ovanf&ouml;r diagrammet f&ouml;r att v&auml;lja en LUN och se dess status. Tre diagram visas som standard, de &auml;r <strong>Datakapacitet</strong>, <strong>IOPS</strong> och <strong>F&ouml;rdr&ouml;jning</strong>. F&ouml;r mer detaljerad information, klicka p&aring; knappen <strong>V&auml;lj diagram</strong> f&ouml;r att v&auml;lja andra diagram som du vill visa.</p>


<h2>Process</h2>
<p>Klicka p&aring; fliken <strong>Process</strong> f&ouml;r att visa CPU- och minnesanv&auml;ndning f&ouml;r varje process i sjunkande ordning baserat p&aring; CPU-belastning.</p>
<p>Proces<strong>status</strong> omfattar <strong>K&ouml;rs</strong>, <strong>Sover</strong> och <strong>Stoppad</strong>. Motsvarande processtatus f&ouml;r Linux &auml;r <strong>k&ouml;rs</strong>, <strong>stoppad/sp&aring;rning</strong> och <strong>sover</strong>. </p>
<p><strong>Sover</strong> kan f&ouml;ljas av en bokstav med detaljerad information, t.ex. 'D' f&ouml;r h&aring;rddisk i vilol&auml;ge, 'Z' f&ouml;r zombie och 'X' f&ouml;r d&ouml;d.</p>

<h2>Anslutna anv&auml;ndare</h2>
<p> P&aring; denna flik kan du visa och hantera de klienter som f&ouml;r n&auml;rvarande &auml;r anslutna till systemet och anv&auml;nder resurser. Detta avsnitt visar klienter som &auml;r anslutna via HTTP, TELNET, SSH, SMB/CIFS, AFP, FTP och NFS.</p>
<h4>G&ouml;r n&aring;got av f&ouml;ljande f&ouml;r att hantera aktuella anslutningar:</h4>
<ul>
<li>Klicka p&aring; <b>Spara</b> f&ouml;r att exportera den aktuella listan till en HTML-fil.</li>
<li>Klicka p&aring; <b>Uppdatera</b> f&ouml;r att uppdatera listan.</li>
<li>Klicka p&aring; <b>Avsluta anslutning</b> f&ouml;r att f&ouml;rhindra anv&auml;ndaren fr&aring;n att komma &aring;t resursen. Den fr&aring;nkopplade anv&auml;ndaren m&aring;ste auktorisera p&aring; nytt f&ouml;r att g&aring; tillg&aring;ng till resursen.</li>
<li>Klicka p&aring; <b>Inaktivera anv&auml;ndare</b> f&ouml;r att inaktivera anv&auml;ndaren. F&ouml;r att aktivera anv&auml;ndaren igen, g&aring; till <b>Huvudmeny</b> &gt; <b>Kontrollpanel</b> &gt; <b>Anv&auml;ndare</b>.</li>
</ul>
<div class="section">
<h4>Obs:</h4>
<ul>
<li>Alternativet <strong>Avsluta anslutning</strong> fungerar inte med NFS-klienter.</li>
<li>Om NFS-klienter inte avmonterar delade mappar ordentligt kan de fortfarande visas i listan &ouml;ver anslutna anv&auml;ndare.</li>
<li>Om Synology NAS startar om kommer inte NFS-klienter som tidigare var anslutna att visas i listan &ouml;ver ansluta anv&auml;ndare.</li>
</ul>
</div>


<h2>Hastighetsbegr&auml;nsning</h2>
<p>Under fliken <strong>Hastighetsbegr&auml;nsning</strong> kan du visa och hantera listan &ouml;ver fil&ouml;verf&ouml;ringsprocesser som till&auml;mpar hastighetsbegr&auml;nsning p&aring; Synology NAS.</p>
<h4>G&ouml;r s&aring; h&auml;r f&ouml;r att uppdatera listan:</h4>
<p>Klicka p&aring; <strong>Uppdatera</strong> f&ouml;r att ladda om sidan och f&aring; de senaste posterna.</p>
<h4>G&ouml;r s&aring; h&auml;r f&ouml;r att stoppa en fil&ouml;verf&ouml;ringsprocess:</h4>
<p>Klicka p&aring; <b>Avsluta anslutning</b> f&ouml;r att stoppa fil&ouml;verf&ouml;ringen. Du m&aring;ste starta om fil&ouml;verf&ouml;ringen f&ouml;r att framg&aring;ngsrikt avsluta processen.</p>


<h2>Inst&auml;llningar</h2>
<p>Klicka p&aring; <strong>Inst&auml;llningar</strong> f&ouml;r att st&auml;lla in f&ouml;ljande alternativ:</p>
<ul>
<li>V&auml;lj <strong>Realtidsl&auml;ngd i minuter</strong> fr&aring;n rullgardinsmenyn.</li>
<li>Bocka f&ouml;r <strong>Aktivera anv&auml;ndningshistorik</strong> om du vill se tidigare data. N&auml;r det &auml;r anslutet kan du v&auml;xla mellan <strong>Realtid</strong>, <strong>1 dag</strong>, <strong>1 vecka</strong>, <strong>1 M&aring;nad</strong> och <strong>1 &aring;r</strong> i rullgardinsmenyn i det &ouml;vre h&ouml;gra h&ouml;rnet n&auml;r du tittar p&aring; prestandadiagram.</li> 
<li>Bocka f&ouml;r <strong>Aktivera prestandah&auml;ndelse</strong> om du vill &ouml;vervaka systemets prestanda.</li>
</ul>

<p>Klicka p&aring; <strong>Till&auml;mpa</strong> f&ouml;r att spara inst&auml;llningarna.</p>

<h2>Prestandalarm</h2>
<h4>Att skapa ett prestandalarm:</h4>
<ol>
<li>G&aring; till <strong>Inst&auml;llningar</strong> &gt; <strong>Prestandalarmregel</strong>.</li>
<li>Klicka p&aring; knappen <b>Skapa</b>.</li>
<li>F&ouml;ljande regelinst&auml;llningar finns tillg&auml;ngliga:</li>
<ul>
<li><strong>Resurs</strong>: V&auml;lj den resurs du vill till&auml;mpa regeln f&ouml;r.</li>
<li><strong>Typ</strong>: V&auml;lj den typ av regel du vill skapa.</li>
<li><strong>Niv&aring;</strong>: V&auml;lj larmniv&aring;n.</li>
<li><strong>St&ouml;rre &auml;n</strong>: St&auml;ll in den maximala procenten f&ouml;r din regeltyp d&auml;r systemet ska meddela dig om den &ouml;verskrids.</li>
</ul>
<li>Bocka f&ouml;r <strong>Aktiverad</strong> om du vill aktivera den h&auml;r regeln omedelbart.</li>
<li>Klicka p&aring; <strong>OK</strong> f&ouml;r att l&auml;gga till regeln.</li>
</ol>


<div class="section">
<h4>Mekanism f&ouml;r prestandalarm:</h4>
<p>Prestandalarm fungerar med f&ouml;ljande mekanism f&ouml;r att minimera falsklarm och f&ouml;r att f&ouml;rhindra &ouml;verdriven konsumtion av systemresurser inom en kort tidsperiod.</p>
<ol>
	<li>Tj&auml;nsten prestandalarm kontrollerar alla regler var femte minut. Ingen &aring;tg&auml;rd utl&ouml;ses om alla de &ouml;vervakade v&auml;rdena befinner sig under det tr&ouml;skelv&auml;rde som du har st&auml;llt in.</li>
	<li>N&auml;r ett &ouml;vervakat v&auml;rde &ouml;verskrider sitt tr&ouml;skelv&auml;rde utl&ouml;ser det inte ett larm omedelbart. I st&auml;llet kontrollerar systemet regeln ytterligare fem g&aring;nger i intervaller om 30 sekunder.</li>
	<li>Efter att l&auml;ngden p&aring; intervallet &auml;ndrats och det &ouml;vervakade v&auml;rdet &ouml;verskrider tr&ouml;skelv&auml;rdet fem g&aring;nger i f&ouml;ljd blir ett larm utl&ouml;st; skulle det &ouml;vervakade v&auml;rdet dock falla under tr&ouml;skelv&auml;rdet vid n&aring;gon av dessa fem kontroller &auml;ndras l&auml;ngden p&aring; intervallet tillbaka till fem minuter.</li>
</ol>
<p>Av den anledningen blir ett larm f&ouml;r en enskild h&auml;ndelse utl&ouml;st senast 450 sekunder efter att h&auml;ndelsen f&ouml;rst uppt&auml;cktes.</p>

<h4>Larmniv&aring;er:</h4>
<p>Prestandalarm utl&ouml;ser olika &aring;tg&auml;rder beroende p&aring; larmniv&aring;erna.</p>
<ul>
	<li><strong>Varning</strong>: Skapar ett varningsmeddelande i systemloggen men utl&ouml;ser inte n&aring;got systemmeddelande.</li>
	<li><strong>Kritisk</strong>: Skapar inte bara ett meddelande i systemloggen utan utl&ouml;ser &auml;ven systemmeddelande.</li>
</ul>
<p>Loggfiler f&ouml;r prestandalarm kan visas p&aring; fliken <strong>Prestandalarm</strong> eller DSM:s <strong>Loggcentral</strong>.</p>
</div>


<h4>Att visa prestandalarm:</h4>
<ul>
<li>Klicka p&aring; fliken <strong>Prestandalarm</strong> f&ouml;r att visa alla utl&ouml;sta prestandalarm.</li> 
<li>Klicka p&aring; <strong>Uppdatera</strong> f&ouml;r att f&aring; de mest uppdaterade larmen.</li>
</ul>

<h4>Att exportera prestandalarm:</h4>
<ol>
<li>Klicka p&aring; pilen bredvid knappen <strong>Exportera</strong>.</li>
<li>Du kan v&auml;lja att exportera dina larm som antingen <strong>HTML</strong> eller <strong>CSV</strong>.</li>
</ol>
<div class="section"><h4>Obs:</h4>
<ul>
<li>St&ouml;d f&ouml;r <strong>Prestandalarm</strong> skiljer sig &aring;t mellan modeller av Synology NAS. F&ouml;r mer information, v&auml;nligen se <a href="http://www.synology.com/" target="_b +lank">www.synology.com</a>.</li>
</ul>
</div>
</body>
</html>
