
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Resurssk&auml;rm</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Prestanda</h2>
<p>Klicka p&aring; fliken <strong>Prestanda</strong> f&ouml;r att visa data om resursanv&auml;ndning. Detaljerad information f&ouml;r datum tid och diagram visas n&auml;r du h&aring;ller musen &ouml;ver.</p>

<h3>CPU</h3>
<p>Du kan se &ouml;vergripande CPU-anv&auml;ndning f&ouml;r <strong>Anv&auml;ndare</strong>,&nbsp;<strong>System</strong>&nbsp;och <strong>I/O v&auml;nta</strong>. CPU-belastningen kan vara h&ouml;g n&auml;r Resurssk&auml;rm f&ouml;rst k&ouml;rs eftersom systemet m&aring;ste h&auml;mta sina resursdata och ladda anv&auml;ndargr&auml;nssnittssidan samtidigt.</p>
<p><strong>Anv&auml;ndare</strong> visar procentsats av CPU som anv&auml;nds f&ouml;r att k&ouml;ra anv&auml;ndarapplikationer. <strong>Systemet</strong> visar procentsats av CPU som anv&auml;nds f&ouml;r systemets k&auml;rna, h&aring;rdvaras/mjukvaras IRQ. <strong>I/O v&auml;nta</strong> visar procentsats av CPU som anv&auml;nds f&ouml;r I/O v&auml;nta.</p>
<p><strong>Utnyttjande</strong> &auml;r total CPU-anv&auml;ndning f&ouml;r <strong>Anv&auml;ndare</strong> och <strong>System</strong>.</p>
<p>Medelbelastningen inom 1, 5 och 15 minuter visas, och du kan se k&ouml;r-k&ouml;l&auml;ngd (dvs. summan av antalet processer som f&ouml;r n&auml;rvarande k&ouml;rs plus det antal som v&auml;ntar p&aring; att f&aring; k&ouml;ra). </p>
<div class="section">
<h4>F&ouml;rklaring av termer</h4>
<ul>
<li><b>I/O v&auml;nta</b>: I/O v&auml;nta visar att CPU &auml;r inaktiv och inte anv&auml;nds av n&aring;got program. </li>
<p>I/O v&auml;nta &auml;r ett normalt tillst&aring;nd. Eftersom CPU:s hastighet &auml;r mycket snabbare den f&ouml;r I/O, s&aring; &auml;r det vanligt att CPU f&aring;r v&auml;nta p&aring; att &ouml;verf&ouml;ringen av h&aring;rddiskar eller n&auml;tverk ska slutf&ouml;ras. Om procentandelen f&ouml;r I/O &auml;r mycket stor och CPU oftast &auml;r i l&auml;get I/O v&auml;nta s&aring; kanske den inte korrekt utnyttjad. D&auml;rf&ouml;r kan du anv&auml;nda effektivare konfigurationer av h&aring;rddiskgrupper (t.ex. SHR eller RAID 5) eller n&auml;tverkskonfigurationer (t.ex. Bonding) f&ouml;r att uppn&aring; b&auml;ttre systemprestanda.</p> 
</ul>
</div>
<h3>Minne</h3>
<p>Den totala minnesanv&auml;ndningen f&ouml;r fysiskt minne och swap space visas. Minnesanv&auml;ndningen f&ouml;rblir h&ouml;g eftersom systemet lagrar ofta f&ouml;rekommande data i cachen s&aring; att data snabbt kan erh&aring;llas utan att komma &aring;t h&aring;rddisken. Cacheminnet anv&auml;nds n&auml;r det totala minnet inte r&auml;cker till.</p>
<p>H&ouml;g swap space pekar p&aring; f&ouml;r lite systemminne och p&aring;verkar &auml;ven systemets prestanda. Du kan visa hastigheten vid swap in och swap ut genom att v&auml;lja <strong>Swap</strong> fr&aring;n rullgardinsmenyn h&ouml;gst upp. </p>

<h3>N&auml;tverk</h3>
<p>N&auml;tverksfl&ouml;desdiagrammet visar data som skickas och tas emot i KB per sekund. Om PPPoE &auml;r ansluten visas dess &ouml;verf&ouml;ringshastighet ocks&aring; p&aring; diagrammet.</p>

<h3 class="disable-dockerx64">H&aring;rddisk</h3>
<p class="disable-dockerx64">Du kan v&auml;lja att visa total diskanv&auml;ndning, &ouml;verf&ouml;ringshastighet eller IOPS genom att klicka p&aring; rullgardinsmenyn h&ouml;gst upp i diagrammet. Du kan klicka p&aring; <strong>Visa alla</strong> l&auml;ngst ned f&ouml;r att v&auml;lja fler h&aring;rddiskar genom att markera kryssrutorna f&ouml;r att l&auml;gga till dess data till diagrammet.</p>


<h3 class="disable-eds14 disable-dockerx64">Volym</h3>
<p class="disable-eds14 disable-dockerx64">Den h&auml;r sidan visar den &ouml;vergripande &ouml;verf&ouml;ringsstatusen f&ouml;r volymer. Klicka p&aring; rullgardinsmenyn ovanf&ouml;r grafen f&ouml;r att visa &ouml;verf&ouml;ringsutnyttjande, &ouml;verf&ouml;ringshastighet eller IOPS. Klicka p&aring; knappen <strong>Visa alla</strong> f&ouml;r att v&auml;lja enskilda volymer och l&auml;gg till dem i diagrammet.</p>

<h3 class="disable-eds14 disable-dockerx64">iSCSI</h3>
<p class="disable-eds14 dixable-dockerx64">Den h&auml;r sidan visar den &ouml;vergripande statusen f&ouml;r de iSCSI LUNs som f&ouml;r n&auml;rvarande k&ouml;rs. Klicka p&aring; rullgardinsmenyn ovanf&ouml;r diagrammet f&ouml;r att v&auml;lja en LUN och se dess status. Tre diagram visas som standard, de &auml;r <strong>Datakapacitet</strong>, <strong>IOPS</strong> och <strong>F&ouml;rdr&ouml;jning</strong>. F&ouml;r mer detaljerad information, klicka p&aring; knappen <strong>V&auml;lj diagram</strong> f&ouml;r att v&auml;lja andra diagram som du vill visa.</p>

</body>
</html>
