
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Spr&aacute;vce iSCSI</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_setting"></a>Nastaven&iacute;</h2>

<h3>iSNS</h3>
<p>Služba iSNS (Internet Storage Name Service) poskytuje mechanismus pro centralizovanou spr&aacute;vu. Pomoc&iacute; serveru iSNS je možn&eacute; zaregistrovat v&scaron;echny c&iacute;le iSCSI Target.</p>
<h4>Registrace c&iacute;lů iSCSI Target pomoc&iacute; serveru iSNS:</h4><ol>
<li>Klikněte na možnost <b>iSNS</b> a za&scaron;krtněte položku <b>Povolit iSNS</b>.</li>
<li>Zadejte IP adresu serveru iSNS. Nastaven&iacute; použijete kliknut&iacute;m na tlač&iacute;tko <b>OK</b>.</li>
</ol>

<h3>Hloubka fronty I/O</h3>
<p>V&yacute;choz&iacute; nastaven&iacute; je 16, hloubku fronty I/O v&scaron;ech c&iacute;lů ale můžete měnit podle potřeby.</p>

<h3>Z&aacute;pis při n&iacute;zk&eacute; kapacitě</h3>
<p>Pokud dostupn&eacute; m&iacute;sto ve svazku poklesne pod 1&nbsp;GB, začne syst&eacute;m chr&aacute;nit jednotky LUN v&nbsp;tomto svazku, aby nedo&scaron;lo ke zhroucen&iacute; souborov&eacute;ho syst&eacute;mu a uživatel&eacute; by do nich nemohli zapisovat data. Z&aacute;pis při n&iacute;zk&eacute; kapacitě umožňuje uživatelům zapisovat data do jednotek LUN i tehdy, když doch&aacute;z&iacute; voln&eacute; m&iacute;sto ve svazku. Po vyře&scaron;en&iacute; probl&eacute;mu s&nbsp;nedostatkem m&iacute;sta doporučujeme tuto možnost zak&aacute;zat.</p>
<div class="section">
	<h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>I&nbsp;když je tato funkce povolen&aacute;, nepokračujte v&nbsp;z&aacute;pisu dat do jednotky LUN.</li>
	</ul></div>	

<h3>Režim recyklace m&iacute;sta</h3>
<p>N&iacute;že jsou uvedeny tři režimy recyklace m&iacute;sta. &Uacute;pravou rychlosti můžete ovl&aacute;dat vliv recyklace m&iacute;sta na v&yacute;kon jednotky LUN.</p>
<ul>
	<li><strong>Nastaven&iacute; priority konzistence V/V</strong>: Nastaven&iacute; priority konzistence V/V minimalizuje vliv na v&yacute;kon, když syst&eacute;m recykluje m&iacute;sta využit&eacute; star&scaron;&iacute; roz&scaron;&iacute;řenou jednotkou LUN. V&nbsp;př&iacute;padě nepřetržit&eacute;ho př&iacute;choz&iacute;ho V/V dojde ke sn&iacute;žen&iacute; rychlosti. V&nbsp;př&iacute;padě obdržen&iacute; po sobě n&aacute;sleduj&iacute;c&iacute;ch př&iacute;kazů k&nbsp;recyklaci m&iacute;sta dojde k&nbsp;pozastaven&iacute; procesu recyklace až do okamžiku, kdy př&iacute;kazy k&nbsp;recyklaci m&iacute;sta přestanou přich&aacute;zet.</li>
	<li><strong>Vyv&aacute;žen&yacute;</strong>: V&yacute;choz&iacute; režim recyklace. Tento režim zachov&aacute;v&aacute; rovnov&aacute;hu mezi rychlost&iacute; V/V a rychlost&iacute; recyklace.</li>
	<li><strong>Nastaven&iacute; priority recyklace</strong>: Nastaven&iacute; priority recyklace znamen&aacute;, že př&iacute;choz&iacute; V/V bude m&iacute;t na rychlost recyklace mal&yacute; vliv. Recyklace proběhne maxim&aacute;ln&iacute; rychlost&iacute;, aniž by byla obětov&aacute;na konzistence V/V.</li>
</ul>
</body>
</html>
