<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Spr&aacute;vce iSCSI</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="leaf_snapshot"></a>Sn&iacute;mek</h2>

<h4>Vytvořen&iacute; sn&iacute;mku jednotky LUN:</h4>
<p>Sn&iacute;mek jednotky LUN je konkr&eacute;tn&iacute; časov&yacute; okamžik, kter&yacute; představuje kopii jednotky LUN určenou pouze pro čten&iacute;.</p>
<ol>
	<li>Vyberte jednotku LUN, jej&iacute;ž sn&iacute;mek chcete vytvořit.</li>
	<li>Klikněte na možnost <strong>Sn&iacute;mek</strong> a&nbsp;vyberte možnost <strong>Poř&iacute;dit sn&iacute;mek</strong>.</li>
	<li>Zadejte popis tohoto sn&iacute;mku.</li>
	<li>Podle sv&yacute;ch potřeb vyberte někter&yacute; z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch typů sn&iacute;mků:<ul>
			<li><strong>Konzistentn&iacute; s&nbsp;aplikac&iacute;</strong>: Tento typ sn&iacute;mku lze vytvořit pouze tehdy, je-li na serveru Windows nebo VMware vCenter Server, v&nbsp;z&aacute;vislosti na provozn&iacute;m prostřed&iacute;, ke komunikaci se syst&eacute;mem DSM nainstalov&aacute;na aplikace Synology Storage Console nebo n&aacute;stroj Synology Snapshot Manager. Pokud jsou v&nbsp;syst&eacute;mu&nbsp;DSM aktivov&aacute;ny sn&iacute;mky konzistentn&iacute; s&nbsp;aplikac&iacute;, aplikace obdrž&iacute; upozorněn&iacute; a přesune ve&scaron;ker&aacute; data z&nbsp;paměti na jednotku&nbsp;LUN, na kter&eacute; byl sn&iacute;mek vytvořen, aby byla zaručena konzistence dat.</li>
			<li><strong>Konzistentn&iacute; v&nbsp;př&iacute;padě poruch</strong>: Pokud na ž&aacute;dn&eacute;m z&nbsp;klientů nen&iacute; nainstalov&aacute;na aplikace Storage Console ani n&aacute;stroj Snapshot Manager, můžete vytv&aacute;řet pouze sn&iacute;mky jednotek LUN konzistentn&iacute; v&nbsp;př&iacute;padě poruch. Po aktivaci neobdrž&iacute; aplikace upozorněn&iacute; k&nbsp;přesunu dat z&nbsp;paměti na jednotku&nbsp;LUN a&nbsp;konzistence dat tak nen&iacute; zaručena.</li>
		</ul>
	</li>
	<li>Klikněte na možnost <strong>OK</strong>.</li>
</ol>
<div class="section">
	<h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Aby nedoch&aacute;zelo k&nbsp;nekonzistenc&iacute;m dat, doporučujeme nainstalovat aplikaci <b>Synology Storage Console</b> nebo n&aacute;stroj <b>Snapshot Manager</b>.</li>
	</ul>
</div>
<div class="section">
	<h4>Vysvětlen&iacute; pojmů:</h4>
	<ul>
	<li><b>Synology Storage Console:</b> Synology Storage Console je modul plugin pro spr&aacute;vu &uacute;loži&scaron;tě ve službě VMware vSphere Client nebo Windows Server, kter&yacute; zjednodu&scaron;uje spr&aacute;vu a sledov&aacute;n&iacute; v&iacute;ce syst&eacute;mů &uacute;loži&scaron;tě Synology. Umožňuje tak&eacute; pořizovat sn&iacute;mky konzistentn&iacute; s&nbsp;aplikacemi př&iacute;mo ze syst&eacute;mu DSM.<ul>
			<li>V&nbsp;prostřed&iacute;ch VMware je modul plugin kompatibiln&iacute; pouze s&nbsp;verz&iacute; VMware vCenter Server Appliance 6.5 U2 nebo nověj&scaron;&iacute;mi verzemi.</li>
			<li>Modul plugin lze st&aacute;hnout v&nbsp;<a href="https://www.synology.com/support/download" target="_blank">Centru pro stahov&aacute;n&iacute;</a>. Dal&scaron;&iacute; informace jsou uvedeny v&nbsp;čl&aacute;nc&iacute;ch <a href="https://www.synology.com/knowledgebase/DSM/help/StorageConsoleforVMware/storageconsoleforvmware" target="_blank">Synology Storage Console for VMware</a> a <a href="https://www.synology.com/knowledgebase/DSM/help/StorageConsoleforWindows/storageconsoleforwindows" target="_blank">Synology Storage Console for Windows</a>.</li>
		</ul></li>
	<li><b>Synology Snapshot Manager:</b> Synology Snapshot Manager je softwarov&yacute; modul plug-in, kter&yacute; umožňuje pořizovat sn&iacute;mky konzistentn&iacute; s&nbsp;aplikacemi př&iacute;mo ze syst&eacute;mu DSM.<ul>
			<li>V&nbsp;prostřed&iacute;ch VMware je modul plugin kompatibiln&iacute; pouze s&nbsp;verz&iacute; VMware vCenter Server 6.0 nebo star&scaron;&iacute;mi verzemi.</li>
		</ul>
	</li>
</ul>
</div>

<h4>Odstraněn&iacute; sn&iacute;mku:</h4>
<ol>
	<li>Vyberte jednotku LUN, jej&iacute;ž sn&iacute;mky jste poř&iacute;dili.</li>
	<li>Klikněte na možnost <b>Sn&iacute;mek</b> &gt; <b>Seznam sn&iacute;mků</b>.</li>
	<li>Vyberte sn&iacute;mek, kter&yacute; chcete odstranit, a klikněte na možnost <b>Odebrat</b>.</li>
</ol>
<div class="section">
	<h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Recyklace m&iacute;sta po odstraněn&iacute; sn&iacute;mků bude chv&iacute;li trvat.</li>
	</ul>
</div>

<h4>Obnoven&iacute; jednotky LUN:</h4>
<p>Vyberte sn&iacute;mek časov&eacute;ho bodu, ze kter&eacute;ho chcete obnovit data jednotky LUN.</p>
<ol>
	<li>Vyberte jednotku LUN, kterou chcete obnovit.</li>
	<li>Klikněte na možnost <strong>Sn&iacute;mek</strong> a&nbsp;vyberte možnost <strong>Seznam sn&iacute;mků</strong>.</li>
	<li>Vyberte sn&iacute;mek, kter&yacute; chcete použ&iacute;t při obnoven&iacute;, a&nbsp;klikněte na možnost <strong>Obnovit</strong>.</li>
</ol>

<h4>Vytvořen&iacute; klonu jednotky LUN ze sn&iacute;mků:</h4>
<p>Vytvořte zapisovatelnou kopii jednotky LUN nebo sn&iacute;mek LUN.</p>
<ul>
	<li>V&nbsp;č&aacute;sti <strong>Seznam sn&iacute;mků</strong> vyberte sn&iacute;mek jednotky LUN a&nbsp;klikněte na možnost <strong>Klonovat</strong>.</li>
</ul>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Funkce sn&iacute;mku, obnoven&iacute; a&nbsp;klonov&aacute;n&iacute; jednotky LUN jsou dostupn&eacute; pouze u&nbsp;jednotek LUN s&nbsp;př&iacute;kazy akcelerace &uacute;loži&scaron;tě.</li>
	<li>Pokud vytvoř&iacute;te sn&iacute;mek nebo klon a&nbsp;stav vykazuje hodnotu <strong>Nenorm&aacute;ln&iacute;</strong>/<strong>Zhroucen&iacute;</strong>, tento sn&iacute;mek či klon odstraňte a&nbsp;vytvořte nov&yacute;.</li>
	<li>Pokud obnov&iacute;te jednotku&nbsp;LUN z&nbsp;tohoto sn&iacute;mku, budou v&scaron;echny změny jednotky&nbsp;LUN po vytvořen&iacute; sn&iacute;mku ignorov&aacute;ny.</li>
	<li>Funkce jako obnoven&iacute; jednotek LUN, klonov&aacute;n&iacute; jednotek LUN a&nbsp;pořizov&aacute;n&iacute; či klonov&aacute;n&iacute; sn&iacute;mků jednotek LUN nejsou dostupn&eacute;, pokud je ve svazku m&eacute;ně než 1&nbsp;GB voln&eacute;ho m&iacute;sta.</li>
</ul>
</div>
<div class="section"><h4><a id="smart_retention"></a>Z&aacute;sady uchov&aacute;v&aacute;n&iacute; informac&iacute;</h4>
<p>Tato možnost představuje ide&aacute;ln&iacute; ře&scaron;en&iacute;, jak pomoci stanovit maxim&aacute;ln&iacute; počet verz&iacute; sn&iacute;mků a co nejv&iacute;ce &scaron;etřit m&iacute;sto na svazku; může se ale st&aacute;t, že sn&iacute;mky bude potřeba uchov&aacute;vat po del&scaron;&iacute; časov&eacute; obdob&iacute;. Před zah&aacute;jen&iacute;m pr&aacute;ce se z&aacute;sadami uchov&aacute;v&aacute;n&iacute; informac&iacute; je nutn&eacute; zv&aacute;žit několik věc&iacute;:</p>
<ul>
<li>Zař&iacute;zen&iacute; Synology využ&iacute;v&aacute; pravidla uchov&aacute;v&aacute;n&iacute; GFS (neboli Grandfather-Father-Son). Maxim&aacute;ln&iacute; množstv&iacute; uchov&aacute;van&yacute;ch verz&iacute; sn&iacute;mků je možn&eacute; nastavit pro tyto časov&eacute; intervaly: <strong>po hodině</strong>, <strong>denně</strong>, <strong>t&yacute;dně</strong>, <strong>měs&iacute;čně</strong> a <strong>ročně</strong>.</li>
<li>Jeden sn&iacute;mek může současně splňovat několik pravidel uchov&aacute;v&aacute;n&iacute; informac&iacute;. Jeden sn&iacute;mek může např&iacute;klad splňovat denn&iacute;, t&yacute;denn&iacute; a měs&iacute;čn&iacute; pravidla.</li>
<li>Pokud v&nbsp;určit&eacute;m obdob&iacute; poř&iacute;d&iacute;te mnoho sn&iacute;mků, zachovaj&iacute; se ty nejstar&scaron;&iacute; sn&iacute;mky. Pokud např&iacute;klad nastav&iacute;te pravidlo uchov&aacute;v&aacute;n&iacute; <strong>10 t&yacute;denn&iacute;ch sn&iacute;mků</strong> a pl&aacute;n sn&iacute;mků je nastaven na pořizov&aacute;n&iacute; 1 sn&iacute;mku za den, bude funkce Snapshot Replication uchov&aacute;vat nejstar&scaron;&iacute; sn&iacute;mek z&nbsp;každ&eacute;ho t&yacute;dne za obdob&iacute; posledn&iacute;ch 10 t&yacute;dnů.</li>
<li>Pokud po určitou dobu nepoř&iacute;d&iacute;te ž&aacute;dn&eacute; sn&iacute;mky, bude syst&eacute;m uchov&aacute;vat posledn&iacute; sn&iacute;mky. Pokud je např&iacute;klad pravidlo každodenn&iacute;ch sn&iacute;mků nastaveno na hodnotu 15 a za posledn&iacute;ch 30 dn&iacute; nedojde k&nbsp;poř&iacute;zen&iacute; ž&aacute;dn&yacute;ch sn&iacute;mků, zachov&aacute; syst&eacute;m sn&iacute;mky poř&iacute;zen&eacute; v&nbsp;obdob&iacute; před 30 až 45 dny.</li>
<li>Podle v&yacute;choz&iacute;ho nastaven&iacute; se budou uchov&aacute;vat v&scaron;echny verze sn&iacute;mků v&nbsp;rozmez&iacute; jedn&eacute; hodiny od poř&iacute;zen&iacute; nejnověj&scaron;&iacute;ho sn&iacute;mku, což v&aacute;m usnadn&iacute; vyhled&aacute;v&aacute;n&iacute; a obnovu z&nbsp;nejnověji poř&iacute;zen&yacute;ch verz&iacute; sn&iacute;mků. Sn&iacute;mek je možn&eacute; tak&eacute; zamknout, aby ho pravidla pro uchov&aacute;v&aacute;n&iacute; automaticky neodstranila.</li>
</ul>

<p>Př&iacute;klad 1:<br/> Chcete-li zachovat denn&iacute; sn&iacute;mky za posledn&iacute; 3 měs&iacute;ce, t&yacute;denn&iacute; sn&iacute;mky za posledn&iacute; 4 až 6 měs&iacute;ců a měs&iacute;čn&iacute; sn&iacute;mky za posledn&iacute;ch 7 až 9 měs&iacute;ců, mus&iacute;te zadat hodnotu 0 pro hodinov&eacute; sn&iacute;mky, hodnotu 90 pro denn&iacute; sn&iacute;mky, hodnotu 24 pro t&yacute;denn&iacute; sn&iacute;mky, hodnotu 9 pro měs&iacute;čn&iacute; sn&iacute;mky a hodnotu 0 pro ročn&iacute; sn&iacute;mky.</p>

<p>Př&iacute;klad 2:<br/> Chcete-li zachovat hodinov&eacute; sn&iacute;mky za posledn&iacute; 2 dny, denn&iacute; sn&iacute;mky za posledn&iacute; t&yacute;den, t&yacute;denn&iacute; sn&iacute;mky za posledn&iacute; měs&iacute;c a měs&iacute;čn&iacute; sn&iacute;mky za posledn&iacute; rok, mus&iacute;te zadat hodnotu 48 pro hodinov&eacute; sn&iacute;mky, hodnotu 7 pro denn&iacute; sn&iacute;mky, hodnotu 4 pro t&yacute;denn&iacute; sn&iacute;mky, hodnotu 12 pro měs&iacute;čn&iacute; sn&iacute;mky a hodnotu 0 pro ročn&iacute; sn&iacute;mky.</p><img class="help_image" src="../../images/iSCSIManager/retention_policy.png"></div>
</body>
</html>