
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" charset="utf-8">

<title>Spr&aacute;vce iSCSI</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_target"></a>C&iacute;l</h2>

<p>V&nbsp;z&aacute;vislosti na modelu podporuje zař&iacute;zen&iacute; Synology NAS vytv&aacute;řen&iacute; v&iacute;ce c&iacute;lů, do kter&yacute;ch lze mapovat jednotky LUN.</p>
<p><span class="note_head">Pozn&aacute;mka: </span>Počet podporovan&yacute;ch c&iacute;lů se u&nbsp;jednotliv&yacute;ch modelů Synology NAS li&scaron;&iacute;.</p>

<h4>Vytvořen&iacute; c&iacute;le:</h4>
<ol>
	<li>Klikněte na tlač&iacute;tko <b>Vytvořit</b>.</li>
	<li>Zadejte informace o&nbsp;c&iacute;li, včetně položek <b>N&aacute;zev</b> a <b>IQN</b>, a rozhodněte se, zda chcete povolit <b>ověřen&iacute; CHAP</b>.</li>
	<li>Klikněte na možnost <b>Dal&scaron;&iacute;</b>.</li>
	<li>Nastavte namapov&aacute;n&iacute; jednotek iSCSI LUN. Vyberte možnost <b>Vytvořit novou jednotku iSCSI LUN</b> nebo <b>Namapovat st&aacute;vaj&iacute;c&iacute; jednotky LUN</b>.</li>
	<li>Klikněte na možnost <b>Dal&scaron;&iacute;</b>.</li>
	<li>Pokud chcete nastaven&iacute; změnit, klikněte na možnost <b>Zpět</b>, jinak nastaven&iacute; potvrďte kliknut&iacute;m na možnost <b>Použ&iacute;t</b>.</li>
</ol>

<div class="section">
<h4>Vysvětlen&iacute; pojmů</h4>
<ul>
<li><b>IQN</b>: IQN (iSCSI Qualified Name) je jedinečn&yacute; n&aacute;zev c&iacute;le. Neměl by b&yacute;t v&nbsp;konfliktu s&nbsp;IQN na jin&yacute;ch serverech. IQN mus&iacute; b&yacute;t krat&scaron;&iacute; než 128&nbsp;znaků a může obsahovat p&iacute;smena (rozli&scaron;uj&iacute; se mal&aacute; a velk&aacute; p&iacute;smena), č&iacute;sla, dvojtečky, pomlčky a tečky. Doporučen&yacute; form&aacute;t pojmenov&aacute;n&iacute; je iqn.[datum].[dom&eacute;na]:[identifik&aacute;tor zař&iacute;zen&iacute;]; např&iacute;klad: <i>iqn.2000-04.com.synology:uloziste.diskovepole.1</i>.</li>
<li><b>Vz&aacute;jemn&eacute; ověřen&iacute; CHAP</b>: V&nbsp;režimu <b>Vz&aacute;jemn&yacute; CHAP</b> prob&iacute;h&aacute; vz&aacute;jemn&eacute; ověřen&iacute; klienta i&nbsp;serveru. Jak&eacute;koli heslo CHAP použit&eacute; k&nbsp;ověřen&iacute; klienta nen&iacute; možn&eacute; konfigurovat pro ověřen&iacute; jak&eacute;hokoli serveru a jak&eacute;koli heslo CHAP použit&eacute; k&nbsp;ověřen&iacute; serveru nen&iacute; možn&eacute; konfigurovat pro ověřen&iacute; jak&eacute;hokoli klienta.</li>
<p><span class="note_head">Pozn&aacute;mka: </span>Pokud je povolen&eacute; ověřen&iacute; CHAP na zař&iacute;zen&iacute; NAS, může doj&iacute;t k&nbsp;selh&aacute;n&iacute; procesu zji&scaron;ťov&aacute;n&iacute; na inici&aacute;toru iSCSI. Před připojen&iacute;m k&nbsp;c&iacute;li nejprve dokončete zji&scaron;ťov&aacute;n&iacute; a teprve pot&eacute; povolte ověřen&iacute; CHAP. Př&iacute;padně se můžete k&nbsp;c&iacute;li připojit pomoc&iacute; IP a IQN.</p>
</ul></div>

<h4>Odebr&aacute;n&iacute; c&iacute;le:</h4>
<p>Můžete odebrat c&iacute;l a ve&scaron;ker&eacute; namapovan&eacute; jednotky LUN. Pokud odeberete jednotku iSCSI LUN, odstran&iacute; se z&nbsp;jednotky iSCSI LUN v&scaron;echna data.</p>
	<ol>
	<li>Vyberte c&iacute;l, kter&yacute; chcete odebrat.</li>
	<li>Klikněte na možnost <b>Odebrat</b>.</li>
	<li>Pokud chcete odebrat namapovan&eacute; jednotky LUN, vyberte možnost <b>Odstranit tak&eacute; namapovan&eacute; jednotky LUN</b> a vyberte jednotky, kter&eacute; chcete odebrat.</li>
	<li>Klikněte na možnost <b>OK</b>.</li>
	</ol>

<h4>&Uacute;prava c&iacute;le:</h4>
	<ol>
	<li>Vyberte c&iacute;l, kter&yacute; chcete upravit.</li>
	<li>V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce <b>Akce</b> vyberte možnost <b>Upravit</b>.</li>
	<li>Upravte nastaven&iacute; podle sv&yacute;ch představ. Změny ulož&iacute;te kliknut&iacute;m na možnost <b>OK</b>.</li>
	</ol>


<div class="section">
<h4>Vysvětlen&iacute; pojmů</h4>
<ul>
<li><b>Kontroln&iacute; součet CRC</b>: Pokud povol&iacute;te kontroln&iacute; součet CRC, bude se kontrolovat, zda během přenosu dat nedo&scaron;lo k&nbsp;chyb&aacute;m.</li>
<li><b>V&iacute;ce relac&iacute;</b>: Povolen&iacute; v&iacute;ce relac&iacute; od v&iacute;ce než jednoho inici&aacute;toru, kter&eacute; se budou moci současně připojit ke stejn&eacute;mu c&iacute;li. Kvůli ochraně souborů před po&scaron;kozen&iacute;m a ochraně proti nečekan&eacute; ztr&aacute;tě dat se důrazně doporučuje použ&iacute;vat sd&iacute;len&yacute; souborov&yacute; syst&eacute;m nebo clusterov&yacute; syst&eacute;m, jako je VMware Virtual Machine File System (VMFS) nebo Oracle Cluster File System (OCFS).</li>
<li><b>Maskov&aacute;n&iacute;</b>: Maskov&aacute;n&iacute; umožňuje exkluzivn&iacute; př&iacute;stup k&nbsp;c&iacute;li ze strany specifikovan&yacute;ch IQN inici&aacute;toru iSCSI.</li>
</ul></div>

<h4>Povolen&iacute; nebo z&aacute;kaz c&iacute;le:</h4>
<ol>
<li>Vyberte c&iacute;l , kter&yacute; chcete povolit nebo zak&aacute;zat.</li>
<li>V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce <b>Akce</b> zvolte možnost <b>Povolit</b> nebo <b>Zak&aacute;zat</b>.</li>
</ol>


</body>
</html>
