<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>HDD/SSD</h2>
<p>V&nbsp;t&eacute;to č&aacute;sti se vysvětluje, jak sledovat a ch&aacute;pat stavy disků intern&iacute;ho &uacute;loži&scaron;tě nainstalovan&yacute;ch v&nbsp;zař&iacute;zen&iacute; Synology NAS. Tyto možnosti je možn&eacute; spravovat v&nbsp;č&aacute;sti <b>Spr&aacute;vce &uacute;loži&scaron;tě</b> &gt; <b>HDD/SSD</b>.</p>


<ul>
	<li><a href="#Statuses">Informace o&nbsp;disku a stavy disku</a></li>
	<li><a href="#Analytics">Testy a anal&yacute;za disku</a></li>
	<li><a href="#Tests">Pl&aacute;nov&aacute;n&iacute; a spr&aacute;va testů disku</a></li>
	<li><a href="#Settings">Nastaven&iacute; a stav upozorněn&iacute; disku</a></li>
	<li><a href="#Erase">Secure Erase</a></li>
	<li><a href="#Drive">Aktivace nebo deaktivace disku</a></li>
	<li><a href="#Status">Stav kontrolky LED disku</a></li>
	<li><a href="#Cache">Mezipaměť pro z&aacute;pis</a></li>
	<li><a href="#Database">Datab&aacute;ze disků</a></li>
</ul>


<h3><a name="Statuses"></a>Informace o&nbsp;disku a stavy disku</h3>
<p>Dal&scaron;&iacute; informace o jednotliv&yacute;ch disc&iacute;ch a jejich stavy jsou uvedeny v&nbsp;č&aacute;sti <b>Spr&aacute;vce &uacute;loži&scaron;tě</b> &gt; <b>HDD/SSD</b>.</p>

<h4>Kontrola informac&iacute; o&nbsp;disku HDD/SSD:</h4>
	<ol>
		<li>Přejděte na kartu <b>HDD/SSD</b>.</li>
		<li>Vyberte v&nbsp;seznamu disk a rozbalte ho. Zde se uv&aacute;d&iacute; stav, informace o&nbsp;fondu &uacute;loži&scaron;tě, n&aacute;zev modelu, s&eacute;riov&eacute; č&iacute;slo, verze firmwaru, teplota a dal&scaron;&iacute; informace.</li>
	</ol>	
	
<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Aby nedoch&aacute;zelo k&nbsp;ž&aacute;dn&yacute;m probl&eacute;mům, důrazně doporučujeme použ&iacute;vat disky uveden&eacute; v&nbsp;<a href="https://www.synology.com/compatibility?search_by=category&category=hdds&p=1" target=blank>seznamu kompatibiln&iacute;ch produktů Synology</a>. Použ&iacute;v&aacute;n&iacute; nekompatibiln&iacute;ch disků může sn&iacute;žit v&yacute;kon syst&eacute;mu nebo dokonce způsobit ztr&aacute;tu dat v&nbsp;zař&iacute;zen&iacute; Synology NAS.</li>
	</ul>
</div>

<h4>Kontrola informac&iacute; o&nbsp;stavu:</h4>
	<ol>
		<li>Přejděte na kartu <b>HDD/SSD</b>.</li>
		<li>Vyberte disk.</li>
		<li>Klikněte na možnost <b>Informace o&nbsp;stavu</b>.</li>
		<li>Na kartě <b>Přehled</b> zjist&iacute;te, kolik hodin byl disk nap&aacute;jen, aktu&aacute;ln&iacute; teplotu, počet opakovan&yacute;ch připojen&iacute;/identifikac&iacute; a počet vadn&yacute;ch sektorů.</li>
		<li>Na kartě <b>S.M.A.R.T.</b> můžete prov&aacute;dět diagnostick&eacute; testy podporovan&eacute;ho disku a prohl&iacute;žet si atributy S.M.A.R.T. V&nbsp;č&aacute;sti <b>Test S.M.A.R.T. </b>můžete okamžitě spustit test S.M.A.R.T. a prohl&iacute;žet si v&yacute;sledky testu a pl&aacute;n; v&nbsp;č&aacute;sti <b>Atribut S.M.A.R.T. </b> si můžete prohl&iacute;žet podrobnosti hodnot atributů S.M.A.R.T.</li>
		<li>Na kartě <b>IronWolf Health</b> je možn&eacute; na podporovan&eacute;m disku prov&aacute;dět diagnostick&eacute; testy.</li>
		<li>Na kartě <b>Historie</b> si můžete prohl&iacute;žet a exportovat v&yacute;sledky diagnostiky stavu a prohl&iacute;žet si historii hlavn&iacute;ch atributů S.M.A.R.T.</li>
	</ol>

	<table>
		<tr>
			<th>Stav disku</th>
			<th>Zdravotn&iacute; stav</th>
		</tr>
		<tr>
			<td>V&nbsp;poř&aacute;dku</td>
			<td>Disk je v&nbsp;dobr&eacute;m stavu nebo bylo upozorněn&iacute; na tento disk potlačeno či zak&aacute;z&aacute;no.</td>
		</tr>
		<tr>
			<td>Upozorněn&iacute;</td>
			<td>Na tomto disku byly zji&scaron;těny probl&eacute;my nebo se zv&yacute;&scaron;il počet vadn&yacute;ch sektorů. Doporučujeme disk sledovat, přestože st&aacute;le funguje spr&aacute;vně.</td>
		</tr>
		<tr>
			<td>Nal&eacute;hav&eacute;</td>
			<td>Na disku byl zji&scaron;těn kritick&yacute; probl&eacute;m nebo několik probl&eacute;mů. Důrazně doporučujeme tento disk okamžitě vyměnit.</td>
		</tr>
		<tr>
			<td>Selh&aacute;v&aacute;</td>
			<td>Na disku bylo zji&scaron;těno několik kritick&yacute;ch probl&eacute;mů. U&nbsp;disků v&nbsp;tomto zdravotn&iacute;m stavu nelze zaručit integritu disku.</td>
		</tr>
		<tr>
			<td>Chyba př&iacute;stupu</td>
			<td>Chyby v&nbsp;komunikaci s&nbsp;diskem způsobily odpojen&iacute; disku od syst&eacute;mu nebo z&aacute;važnou chybu čten&iacute; nebo z&aacute;pisu. Tento zdravotn&iacute; stav obvykle signalizuje v&yacute;skyt z&aacute;važn&yacute;ch probl&eacute;mů.</td>
		</tr>
	</table>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Na disc&iacute;ch SAS nebo NVMe SSD nejsou podporov&aacute;ny v&scaron;echny funkce S.M.A.R.T.</li>
		<li>Test IronWolf Health je podporov&aacute;n pouze na někter&yacute;ch disc&iacute;ch Seagate.</li>
	</ul>
</div>



<h3><a name="Analytics"></a>Testy a anal&yacute;za disku</h3>
<p>Pokud model disku a model zař&iacute;zen&iacute; Synology NAS podporuj&iacute; odpov&iacute;daj&iacute;c&iacute; funkce, lze na nainstalovan&yacute;ch disc&iacute;ch prov&aacute;dět n&aacute;sleduj&iacute;c&iacute; testy a anal&yacute;zy.</p>

<h4>Spu&scaron;těn&iacute; testu S.M.A.R.T.:</h4>
<p>Č&aacute;st Test S.M.A.R.T. prozkoum&aacute; a nahl&aacute;s&iacute; stav pevn&yacute;ch disků a upozorn&iacute; na možn&eacute; z&aacute;vady disku. V&nbsp;př&iacute;padě nezdaru testu doporučujeme disky okamžitě vyměnit.</p>
	<ol>
		<li>Přejděte na kartu <b>HDD/SSD</b>.</li>
		<li>Vyberte disk.</li>
		<li>Klikněte na možnost <b>Informace o&nbsp;stavu</b>.</li>
		<li>Přejdete na kartu <b>S.M.A.R.T.</b></li>
		<li>Vyberte typ testu a kliknut&iacute;m na možnost <b>Spustit</b> test zahajte.</li>
		<li>V&yacute;sledky posledn&iacute;ho testu jsou uvedeny v&nbsp;č&aacute;sti <b>V&yacute;sledek testu</b>.</li>
		<li>Na kartě <b>Historie</b> se nach&aacute;zej&iacute; předchoz&iacute; v&yacute;sledky testů.</li>
	</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Doba potřebn&aacute; k&nbsp;proveden&iacute; testu S.M.A.R.T. se li&scaron;&iacute; podle využit&iacute; syst&eacute;mu a kapacity disku.</li> 
		<li>V&yacute;stup tohoto testu je buď <b>Norm&aacute;ln&iacute;</b> nebo <b>Selh&aacute;v&aacute;</b>.</li>
		<li>Disky NVMe SSD jsou vybaveny vestavěn&yacute;m monitorovac&iacute;m mechanismem a nebudou proto podporovat test S.M.A.R.T. ani upozorněn&iacute; na &scaron;patn&yacute; sektor.</li>
	</ul>
</div>

<h4>Spu&scaron;těn&iacute; testu IronWolf Health:</h4>
<p>Aplikace Seagate IronWolf Health Management využ&iacute;v&aacute; dal&scaron;&iacute; telemetrick&eacute; &uacute;daje disku obsahuj&iacute;c&iacute; v&iacute;ce informac&iacute; než test S.M.A.R.T. Doporučujeme ř&iacute;dit se pokyny uveden&yacute;mi v&nbsp;jednotliv&yacute;ch stavech v&yacute;sledku testu. Dostupn&eacute; jen u někter&yacute;ch modelů.</p>
	<ol>
		<li>Přejděte na kartu <b>HDD/SSD</b>.</li>
		<li>Vyberte disk.</li>
		<li>Klikněte na možnost <b>Informace o&nbsp;stavu</b>.</li> 
		<li>Přejděte na kartu <b>IronWolf Health</b>.</li>
		<li>Kliknut&iacute;m na možnost <b>Spustit</b> zah&aacute;j&iacute;te test. V&yacute;sledky posledn&iacute;ho testu se zobraz&iacute; v&nbsp;č&aacute;sti <b>V&yacute;sledek testu</b>.</li>
		<li>Na kartě <b>Historie</b> se nach&aacute;zej&iacute; předchoz&iacute; v&yacute;sledky testů.</li>
	</ol>
	
<p>V&nbsp;n&aacute;sleduj&iacute;c&iacute; tabulce se nach&aacute;z&iacute; přehled v&yacute;stupn&iacute;ch k&oacute;dů testu IronWolf Health.</p>
	<table>
		<tr>
			<th>V&yacute;stupn&iacute; k&oacute;dy n&aacute;stroje IronWolf Health Management</th>
			<th>Definice</th>
		</tr>
		<tr>
			<td>100</td>
			<td>Byla zji&scaron;těna neobvykle vysok&aacute; provozn&iacute; teplota. Přesvědčte se, že zadn&iacute; ventilačn&iacute; otvory nejsou ucpan&eacute;, a pokuste se sn&iacute;žit okoln&iacute; teplotu. Pokud je teplota st&aacute;le vysok&aacute;, přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>Hardware a&nbsp;nap&aacute;jen&iacute;</b> &gt; <b>Režim ot&aacute;ček ventil&aacute;toru</b> a zvy&scaron;te ot&aacute;čky ventil&aacute;toru. Pokud probl&eacute;m přetrv&aacute;v&aacute;, obraťte se na t&yacute;m podpory Synology.</td>
		</tr>
		<tr>
			<td>101</td>
			<td>Na rozhran&iacute; zař&iacute;zen&iacute; Synology NAS a&nbsp;pevn&eacute;ho disku byl zji&scaron;těn probl&eacute;m s&nbsp;připojen&iacute;m. Přesvědčte se, jestli je disk v&nbsp;&scaron;asi nebo v&nbsp;přihr&aacute;dce pevn&eacute;ho disku spr&aacute;vně nainstalov&aacute;n a jestli je přihr&aacute;dka spr&aacute;vně nainstalov&aacute;na v&nbsp;zař&iacute;zen&iacute; Synology NAS. Pokud probl&eacute;m přetrv&aacute;v&aacute;, obraťte se na t&yacute;m podpory Synology.</td>
		</tr>
		<tr>
			<td>102</td>
			<td>Byl zji&scaron;těn nadměrn&yacute; fyzick&yacute; otřes disku. Přesvědčte se, jestli jsou pevn&yacute; disk a&nbsp;zař&iacute;zen&iacute; Synology NAS um&iacute;stěn&eacute; na stabiln&iacute;m povrchu. Pokud probl&eacute;m přetrv&aacute;v&aacute;, obraťte se na t&yacute;m podpory Synology.</td>
		</tr>
		<tr>
			<td>105</td>
			<td>Byla zji&scaron;těna nadměrn&aacute; vibrace. Přesvědčte se, jestli je zař&iacute;zen&iacute; Synology NAS um&iacute;stěno na stabiln&iacute;m povrchu. Pokud probl&eacute;m přetrv&aacute;v&aacute;, obraťte se na t&yacute;m podpory Synology.</td>
		</tr>
		<tr>
			<td>106</td>
			<td>Byl zji&scaron;těn nadměrn&yacute; počet resetov&aacute;n&iacute; hostitelů. Přesvědčte se, zda je disk spr&aacute;vně nainstalov&aacute;n v&nbsp;&scaron;asi nebo v&nbsp;přihr&aacute;dce na disk. Doporučujeme prov&eacute;st vypnut&iacute; a opětovn&eacute; zapnut&iacute;. Pokud probl&eacute;m přetrv&aacute;v&aacute;, obraťte se na t&yacute;m podpory Synology.</td>
		</tr>
		<tr>
			<td>200, 201, 202 a 203</td>
			<td>Chcete-li zkontrolovat stav disku, doporučujeme na tomto disku spustit roz&scaron;&iacute;řen&yacute; test S.M.A.R.T. Pokud probl&eacute;m přetrv&aacute;v&aacute;, obraťte se na prodejce nebo v&yacute;robce disku.</td>
		</tr>
	</table>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Doba potřebn&aacute; k&nbsp;proveden&iacute; testu IronWolf Health se může li&scaron;it podle využit&iacute; syst&eacute;mu.</li>
		<li>Po dobu prov&aacute;děn&iacute; testu IronWolf Health se může dočasně sn&iacute;žit v&yacute;kon syst&eacute;mu.</li>
		<li>V&yacute;stupn&iacute; k&oacute;dy z&nbsp;testu IronWolf Health se zobraz&iacute; společně s&nbsp;doporučen&yacute;mi opatřen&iacute;mi. V&nbsp;budouc&iacute;ch aktualizac&iacute;ch syst&eacute;mu DSM mohou b&yacute;t přid&aacute;ny nov&eacute; v&yacute;stupn&iacute; k&oacute;dy.</li>
	</ul>
</div>


<h4>Proveden&iacute; srovn&aacute;vac&iacute;ho testu:</h4>
<p>Tento test je k&nbsp;dispozici pouze u&nbsp;někter&yacute;ch modelů zař&iacute;zen&iacute; Synology NAS řad <b>XS</b> a <b>XS+</b>. Test můžete na disku spustit t&iacute;mto způsobem:</p>
<ol>
	<li>Přejděte na kartu <b>HDD/SSD</b>.</li>
	<li>Vyberte disk a klikněte na možnost <b>Srovn&aacute;vac&iacute; test</b>.</li>
	<li>V&nbsp;zobrazen&eacute;m okně spusťte test v&yacute;konu kliknut&iacute;m na možnost <b>Spustit test</b>. Zde se po dokončen&iacute; testu zobraz&iacute; v&yacute;sledky.</li>
	<li>Chcete-li porovnat v&yacute;sledek s&nbsp;předchoz&iacute;mi testy, klikněte v&nbsp;poli <b>Porovnan&yacute; test</b> na položku <b>Vybrat</b> a vyberte požadovan&yacute; protokol.</li>
</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Test v&yacute;konu zahrnuje sekvenčn&iacute; propustnost, n&aacute;hodn&eacute; IOPS a latenci a trv&aacute; přibližně 18 minut.</li>
		<li>Existuj&iacute; dva typy tohoto testu: <b>z&aacute;kladn&iacute;</b> a <b>roz&scaron;&iacute;řen&yacute;</b>.<ul>
				<li>U&nbsp;disků ve svazc&iacute;ch RAID je možn&eacute; prov&eacute;st pouze z&aacute;kladn&iacute; testy, data na disc&iacute;ch to nijak neovlivn&iacute;. U pevn&yacute;ch disků HDD ve svazku RAID nen&iacute; ale možn&eacute; testovat v&yacute;kon z&aacute;pisu.</li>
				<li>V&nbsp;ostatn&iacute;ch př&iacute;padech se provedou roz&scaron;&iacute;řen&eacute; testy zvy&scaron;uj&iacute;c&iacute; přesnost v&yacute;sledků. Testy v&yacute;konu ale nezaručuj&iacute; integritu dat. Před proveden&iacute;m srovn&aacute;vac&iacute;ho testu se proto přesvědčte, že se na disc&iacute;ch nenach&aacute;zej&iacute; ž&aacute;dn&aacute; důležit&aacute; data.</li>
			</ul>
		</li>
		<li>Z&nbsp;důvodu zaji&scaron;těn&iacute; dostupnosti syst&eacute;mu nelze prov&aacute;dět testy současně na v&iacute;ce než třech disc&iacute;ch nebo pokud u&nbsp;modelů xs/xs+ zb&yacute;v&aacute; pouze jeden disk. Pokud nav&iacute;c využit&iacute; disku překračuje 5&nbsp;%, pož&aacute;d&aacute; v&aacute;s syst&eacute;m kvůli zaji&scaron;těn&iacute; přesnosti testu před jeho spu&scaron;těn&iacute;m o&nbsp;potvrzen&iacute; tohoto kroku.</li>
		<li>V&yacute;sledky srovn&aacute;vac&iacute;ho testu lze porovn&aacute;vat s&nbsp;předchoz&iacute;mi testy. Pokud je rozd&iacute;l vět&scaron;&iacute; než 5&nbsp;%, zobraz&iacute; se v&yacute;straha.</li>
		<li>Srovn&aacute;vac&iacute; test disku se v&nbsp;syst&eacute;mu DSM spou&scaron;t&iacute; s&nbsp;n&iacute;zkou prioritou, aby měl jen minim&aacute;ln&iacute; vliv na dal&scaron;&iacute; služby. Zobrazen&eacute; hodnoty se mohou li&scaron;it podle zat&iacute;žen&iacute; a konfigurace syst&eacute;mu. Tyto hodnoty slouž&iacute; pouze jako reference ke stanoven&iacute; odhadu funkčnosti disku a nelze je použ&iacute;t k&nbsp;porovn&aacute;n&iacute; různ&yacute;ch modelů ani verz&iacute; syst&eacute;mu DSM.</li>
	</ul>
</div>



<h3><a name="Tests"></a>Pl&aacute;nov&aacute;n&iacute; a spr&aacute;va testů disku</h3>
<p>Na disc&iacute;ch lze napl&aacute;novat automatick&eacute; spou&scaron;těn&iacute; testu S.M.A.R.T. a testu IronWolf Health. Tyto testy jsou podporov&aacute;ny pouze u&nbsp;někter&yacute;ch modelů. Př&iacute;slu&scaron;n&eacute; informace jsou uvedeny v&nbsp;č&aacute;sti <a href="#Analytics">Testy a anal&yacute;za disku</a>. Pl&aacute;nov&aacute;n&iacute; a spr&aacute;vu testů lze prov&aacute;dět n&aacute;sleduj&iacute;c&iacute;m způsobem.</p>

<h4>Napl&aacute;nov&aacute;n&iacute; testů S.M.A.R.T.:</h4>
<p>Spou&scaron;těn&iacute; testů S.M.A.R.T. na disc&iacute;ch je možn&eacute; napl&aacute;novat automaticky.</p>
	<ol>
		<li>Přejděte na kartu <b>Pl&aacute;novač testů</b>.</li>
		<li>Kliknut&iacute;m na možnost <b>Vytvořit</b> nastav&iacute;te novou &uacute;lohu.</li>
		<li>Na kartě <b>Obecn&eacute;</b> upravte n&aacute;sleduj&iacute;c&iacute; nastaven&iacute;:<ul>
				<li><b>N&aacute;zev &uacute;lohy:</b> Zadejte n&aacute;zev &uacute;lohy.</li>
				<li><b>Typ testu S.M.A.R.T.:</b> Vyberte proveden&iacute; rychl&eacute;ho nebo roz&scaron;&iacute;řen&eacute;ho testu.</li>
				<li><b>Rozsah testu S.M.A.R.T.:</b> Vyberte, kter&yacute; disk HDD/SSD při každ&eacute;m proveden&iacute; testu S.M.A.R.T. otestovat.</li>
			</ul>
		</li>
		<li>Na kartě <b>Pl&aacute;n</b> upravte n&aacute;sleduj&iacute;c&iacute; nastaven&iacute;:<ul>
				<li><b>Datum:</b> Zadejte datum proveden&iacute; testu S.M.A.R.T. Ten je možn&eacute; pl&aacute;novat na určit&eacute; dny v&nbsp;t&yacute;dnu (např. denně, o&nbsp;v&iacute;kendech nebo každou neděli) nebo ke konkr&eacute;tn&iacute;mu datu (např. 21.&nbsp;11.&nbsp;2016).</li>
				<li><b>Čas:</b> Zadejte frekvenci spou&scaron;těn&iacute; testu S.M.A.R.T. na disc&iacute;ch, a&nbsp;to včetně času prvn&iacute;ho a&nbsp;posledn&iacute;ho spu&scaron;těn&iacute;.</li>
			</ul>
		</li>
		<li>Postup dokonč&iacute;te kliknut&iacute;m na možnost <b>OK</b>.</li>
	</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Pokud nen&iacute; pro určit&yacute; disk spu&scaron;těn&iacute; testu S.M.A.R.T. napl&aacute;nov&aacute;no, zobraz&iacute; se tlač&iacute;tko <b>Napl&aacute;novat testy S.M.A.R.T.</b> v&nbsp;okně <b>Informace o&nbsp;stavu</b> &gt; <b>Přehled</b> př&iacute;slu&scaron;n&eacute;ho disku.</li> 
		<li>Pokud nen&iacute; u někter&eacute;ho disku napl&aacute;nov&aacute;no spou&scaron;těn&iacute; testu IronWolf Health ani S.M.A.R.T., zobraz&iacute; se v&nbsp;okně <b>Informace o&nbsp;stavu</b> &gt; <b>Přehled</b> tohoto disku tlač&iacute;tko <b>Napl&aacute;novat test disku</b>.</li>
		<li>Disky NVMe SSD jsou vybaveny vestavěn&yacute;m monitorovac&iacute;m mechanismem a nebudou proto podporovat test S.M.A.R.T. ani upozorněn&iacute; na &scaron;patn&yacute; sektor.</li>
	</ul>
</div>

<h4>Napl&aacute;nov&aacute;n&iacute; testů IronWolf Health:</h4>
<p>Spou&scaron;těn&iacute; testů IronWolf Health na disc&iacute;ch je možn&eacute; napl&aacute;novat automaticky.</p>
	<ol>
		<li>Přejděte na kartu <b>Pl&aacute;novač testů</b>.</li>
		<li>Kliknut&iacute;m na možnost <b>Vytvořit</b> nastav&iacute;te novou &uacute;lohu.</li>
		<li>Na kartě <b>Obecn&eacute;</b> je možn&eacute; upravit n&aacute;sleduj&iacute;c&iacute; nastaven&iacute;:<ul>
				<li><b>N&aacute;zev &uacute;lohy:</b> Zadejte n&aacute;zev &uacute;lohy.</li>
				<li><b>Test IronWolf Health:</b> Vyberte disk HDD/SSD, na kter&eacute;m chcete test spustit, nebo v&yacute;běrem v&scaron;ech podporovan&yacute;ch disků napl&aacute;nujte spu&scaron;těn&iacute; testu na v&scaron;ech těchto disc&iacute;ch.</li>
			</ul>
		</li>
		<li>Na kartě <b>Pl&aacute;n</b> je možn&eacute; upravit n&aacute;sleduj&iacute;c&iacute; nastaven&iacute;:<ul>
				<li><b>Datum:</b> Zadejte datum proveden&iacute; testu IronWolf Health. Ten je možn&eacute; pl&aacute;novat na určit&eacute; dny v&nbsp;t&yacute;dnu (např. denně, o&nbsp;v&iacute;kendech nebo každou neděli) nebo ke&nbsp;konkr&eacute;tn&iacute;mu datu (např. 21.&nbsp;11.&nbsp;2016).</li>
				<li><b>Čas:</b> Zadejte frekvenci spou&scaron;těn&iacute; testu IronWolf Health na disc&iacute;ch, a&nbsp;to včetně času prvn&iacute;ho a&nbsp;posledn&iacute;ho spu&scaron;těn&iacute;.</li>
			</ul>
		</li>
		<li>Postup dokonč&iacute;te kliknut&iacute;m na možnost <b>OK</b>.</li>
	</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Pokud nen&iacute; pro určit&yacute; disk napl&aacute;nov&aacute;no spou&scaron;těn&iacute; testu IronWolf Health, zobraz&iacute; se v&nbsp;okně <b>Informace o&nbsp;stavu</b> &gt; <b>Přehled</b> tohoto disku tlač&iacute;tko <b>Napl&aacute;novat test IronWolf Health</b>.</li>
		<li>Pokud nen&iacute; u někter&eacute;ho disku napl&aacute;nov&aacute;no spou&scaron;těn&iacute; testu IronWolf Health ani S.M.A.R.T., zobraz&iacute; se v&nbsp;okně <b>Informace o&nbsp;stavu</b> &gt; <b>Přehled</b> tohoto disku tlač&iacute;tko <b>Napl&aacute;novat test disku</b>.</li>
		<li>Test IronWolf Health je dostupn&yacute; pouze u pevn&yacute;ch disků řady Seagate IronWolf.</li>
	</ul>
</div>



<h3><a name="Settings"></a>Nastaven&iacute; a stav upozorněn&iacute; disku</h3>
<p>V&nbsp;př&iacute;padě potřeby můžete povolit nebo zak&aacute;zat př&iacute;slu&scaron;n&aacute; nastaven&iacute; upozorněn&iacute;. Podrobn&eacute; pokyny jsou uvedeny v&nbsp;n&aacute;sleduj&iacute;c&iacute;ch č&aacute;stech:</p>

<h4>Změna stavu upozorněn&iacute; na disk:</h4>
<p>Syst&eacute;m DSM nepřetržitě sleduje zdravotn&iacute; stav va&scaron;ich disků a v&nbsp;př&iacute;padě zji&scaron;těn&iacute; probl&eacute;mů v&aacute;s upozorn&iacute;. Někter&eacute; probl&eacute;my mohou b&yacute;t z&aacute;važněj&scaron;&iacute; než jin&eacute;. U&nbsp;někter&yacute;ch probl&eacute;mů vyvol&aacute;vaj&iacute;c&iacute;ch stav <b>Upozorněn&iacute;</b> (nab&iacute;dka <b>Informace o&nbsp;stavu</b> &gt; <b>Přehled</b>) lze toto upozorněn&iacute; upravit n&aacute;sleduj&iacute;c&iacute;m způsobem:</p>
	<ol>
		<li>Přejděte na kartu <b>HDD/SSD</b>.</li>
		<li>Vyberte disk ve stavu upozorněn&iacute; a klikněte na možnost <b>Informace o&nbsp;stavu</b>.</li> 
		<li>Klikněte na možnost <b>Změnit upozorněn&iacute; disku</b>.</li>
		<li>Klikněte na možnost <b>Potlačit upozorněn&iacute;</b> nebo <b>Zak&aacute;zat upozorněn&iacute;</b> (podle typu probl&eacute;mu se mohou zobrazit tyto dvě možnosti):<ul>
				<li><b>Potlačit upozorněn&iacute;:</b> Bude pokračovat monitorov&aacute;n&iacute; pole v&nbsp;omezen&eacute;m režimu, upozorněn&iacute; se ale budou aktivovat pouze v&nbsp;př&iacute;padě, že dojde k&nbsp;dal&scaron;&iacute;mu zhor&scaron;ov&aacute;n&iacute; jeho hodnoty.</li> 
				<li><b>Zak&aacute;zat upozorněn&iacute;:</b> Monitorov&aacute;n&iacute; pole S.M.A.R.T. bude trvale zak&aacute;z&aacute;no.</li>
			</ul>
		</li>
	</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Změna stavu upozorněn&iacute; na disk nevyře&scaron;&iacute; probl&eacute;my, ke kter&yacute;m na disku do&scaron;lo, ani nezabr&aacute;n&iacute; jejich opakov&aacute;n&iacute;, proto nelze tuto akci považovat za dlouhodob&eacute; ře&scaron;en&iacute;.</li>
		<li>Upozorněn&iacute; t&yacute;kaj&iacute;c&iacute; se probl&eacute;mů S.M.A.R.T. obvykle znamenaj&iacute;, že na disku do&scaron;lo k&nbsp;probl&eacute;mu. Ignorov&aacute;n&iacute; tohoto upozorněn&iacute; může v&eacute;st ke ztr&aacute;tě dat.</li>
		<li>Někter&aacute; pole S.M.A.R.T. jsou označena jako důležit&aacute; a nelze je potlačit ani zak&aacute;zat.</li>
	</ul>
</div>

<h4>Povolen&iacute; podpory upozorněn&iacute; na chybn&eacute; sektory:</h4>
<p>Povolen&iacute;m upozorněn&iacute; na chybn&eacute; sektory umožn&iacute;te syst&eacute;mu, aby v&aacute;s upozornil v&nbsp;př&iacute;padě zji&scaron;těn&iacute; chybn&yacute;ch sektorů na disku a vy mohli okamžitě prov&eacute;st odpov&iacute;daj&iacute;c&iacute; kroky. Tato možnost je podle v&yacute;choz&iacute;ho nastaven&iacute; povolena, ale dostupn&aacute; je pouze u&nbsp;někter&yacute;ch modelů.</p>
	<ol>
		<li>Přejděte na kartu <b>Nastaven&iacute;</b>.</li>
		<li>Za&scaron;krtněte možnost <b>Povolit upozorněn&iacute; na chybn&eacute; sektory</b>. Podle v&yacute;choz&iacute;ho nastaven&iacute; je tato funkce povolena.</li>
		<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
	</ol>

<h4>Povolen&iacute; upozorněn&iacute; na životnost disku SSD:</h4>
<p>Upozorněn&iacute; na životnost disku SSD v&aacute;s upozorn&iacute;, když odhadovan&aacute; životnost disku SSD dos&aacute;hne zadan&eacute; hodnoty a umožn&iacute; okamžitě prov&eacute;st odpov&iacute;daj&iacute;c&iacute; akce. Tato možnost je podle v&yacute;choz&iacute;ho nastaven&iacute; povolena, ale je podporov&aacute;na pouze u&nbsp;někter&yacute;ch disků SSD.</p>
	<ol>
		<li>Přejděte do č&aacute;sti <b>HDD/SSD</b> &gt; <b>Nastaven&iacute;</b>.</li>
		<li>Přejděte do č&aacute;sti <b>Upozorněn&iacute; na odhadovanou životnost disku SSD</b> a povolte upozorněn&iacute; na životnost.<ul>
				<li>Za&scaron;krtněte pol&iacute;čko <b>Povolit upozorněn&iacute; na odhadovanou životnost</b> a zadejte hodnotu do pole <b>Životnost (%)</b>. Když odhadovan&aacute; životnost disku SSD dos&aacute;hne zadan&eacute; hodnoty, po&scaron;le v&aacute;m syst&eacute;m upozorněn&iacute; s&nbsp;v&yacute;strahou.</li>
				<li>Za&scaron;krtněte pol&iacute;čko <b>Povolit upozorněn&iacute; na životnost disku (podle času) pro disky SSD Synology</b> a zadejte hodnotu do pole <b>Životnost (měs&iacute;ce)</b>. Když odhadovan&aacute; životnost disku SSD dos&aacute;hne zadan&eacute; hodnoty, po&scaron;le v&aacute;m syst&eacute;m upozorněn&iacute; s&nbsp;v&yacute;strahou. Tato funkce se vztahuje pouze na disky Synology SSD.</li>
			</ul>
		</li>
		<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
	</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Hodnota životnosti disku SSD se generuje př&iacute;mo z&nbsp;informac&iacute; S.M.A.R.T. Pokud disk SSD odpov&iacute;daj&iacute;c&iacute; atribut S.M.A.R.T. nepodporuje, nebude tato funkce podporov&aacute;na.</li>
		<li>Životnost disku Synology SSD se odhaduje podle z&aacute;těže vstupu/v&yacute;stupu v&nbsp;posledn&iacute; době. U&nbsp;nov&eacute;ho disku SSD může syst&eacute;mu vygenerov&aacute;n&iacute; v&yacute;sledku trvat až 24 hodin.</li>
		<li>Životnost disku Synology SSD se zobraz&iacute; na kartě <b>HDD/SSD</b> a v&nbsp;č&aacute;sti <b>Informace o&nbsp;stavu</b> pouze tehdy, když odhadovan&aacute; životnost disku SSD (podle času) poklesne na stanovenou hodnotu.</li>
	</ul>
</div>



<h3><a name="Erase"></a>Secure Erase</h3>
<p>Chcete-li z&nbsp;někter&eacute; disku vymazat v&scaron;echna data, můžete použ&iacute;t funkci Secure Erase. Funkce Secure Erase ale trvale odebere ve&scaron;ker&aacute; data uložen&aacute; na disku. Přesvědčte se, že se vybran&yacute; disk nepouž&iacute;v&aacute; a že data byla před použit&iacute;m funkce Secure Erase z&aacute;lohov&aacute;na.</p>

<h4>Proveden&iacute; funkce Secure Erase:</h4>
	<ol>
		<li>Přejděte na kartu <b>HDD/SSD</b>.</li>
		<li>Vyberte disk a klikněte na možnost <b>Akce</b> &gt; <b>Secure Erase</b>.</li>
	</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Funkci Secure Erase nen&iacute; možn&eacute; prov&eacute;st u disků na roz&scaron;iřovac&iacute;ch jednotk&aacute;ch.</li>
		<li>Funkce Secure Erase trvale odebere ve&scaron;ker&aacute; data uložen&aacute; na disku. Přesvědčte se, že se vybran&yacute; disk nepouž&iacute;v&aacute; nebo že data byla před vymaz&aacute;n&iacute;m z&aacute;lohov&aacute;na.</li>
		<li>Když syst&eacute;m prov&aacute;d&iacute; funkci Secure Erase, vybran&yacute; disk se dočasně uzamkne a po dokončen&iacute; operace zase automaticky odemkne.</li>
		<li>Jestliže se funkce Secure Erase během prov&aacute;děn&iacute; ukonč&iacute; nespr&aacute;vně, je možn&eacute; funkci Secure Erase znovu spustit př&iacute;mo na uživatelsk&eacute;m rozhran&iacute;. Jestliže se disky odeberou nebo použij&iacute; někde jinde, i když jsou st&aacute;le zamknut&eacute;, použijte k&nbsp;jejich odemknut&iacute; heslo &bdquo;synology&ldquo;.</li>
	</ul>
</div>



<h3><a name="Drive"></a>Aktivace nebo deaktivace disku</h3>
<p>Disk přidělen&yacute; do fondu &uacute;loži&scaron;tě lze v&nbsp;př&iacute;padě potřeby deaktivovat a odebrat ho tak z&nbsp;přidružen&eacute;ho fondu &uacute;loži&scaron;tě, svazku a syst&eacute;mov&eacute;ho odd&iacute;lu.</p>

<h4>Deaktivace disku:</h4>
	<ol>
		<li>Přejděte na kartu <b>HDD/SSD</b>.</li>
		<li>Vyberte disk a klikněte na možnost <b>Akce</b> &gt; <b>Deaktivovat</b>.</li>
	</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Deaktivovat lze pouze disky použ&iacute;van&eacute; ve fondech &uacute;loži&scaron;tě. Po deaktivaci budou disky odebr&aacute;ny z&nbsp;fondů &uacute;loži&scaron;tě.</li>
		<li>Po deaktivaci disku se stav odpov&iacute;daj&iacute;c&iacute;ch kontrolek LED disku změn&iacute; na &bdquo;V&yacute;straha&ldquo;.</li>
	</ul>
</div>

<h4>Aktivace disku:</h4>
<p>Stav přidělen&iacute; deaktivovan&eacute;ho disku se změn&iacute; na <b>Nen&iacute; inicializov&aacute;no</b>, což znamen&aacute;, že na tomto disku nen&iacute; nainstalov&aacute;n syst&eacute;m DSM a disk lze přidělit do fondu &uacute;loži&scaron;tě. Disk můžete aktivovat někter&yacute;m z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch způsobů:</p>
	<ul>
		<li>Vyjměte disk ze slotu na disky a pot&eacute; ho znovu do tohoto slotu zasuňte.</li>
		<li>Restartujte syst&eacute;m.</li>
	</ul>



<h3><a name="Status"></a>Stav kontrolky LED disku</h3>
<p>Chcete-li odebrat disk ze zař&iacute;zen&iacute; Synology NAS, můžete dočasně změnit barvu kontrolky disku ze zelen&eacute; barvy na oranžovou. Okamžitě tak pozn&aacute;te, ve kter&eacute;m slotu na disky se disk nach&aacute;z&iacute;, a předejdete ne&uacute;mysln&eacute;mu odebr&aacute;n&iacute; nespr&aacute;vn&eacute;ho disku.</p>

<h4>Chcete-li vyhledat slot na disky, ve kter&eacute;m je disk zasunut&yacute;:</h4>
	<ol>
		<li>Přejděte na kartu <b>HDD/SSD</b>.</li>
		<li>Vyberte disk a klikněte na možnost <b>Lokalizovat disk</b>.</li>
		<li>Klikněte na rozev&iacute;rac&iacute; nab&iacute;dku a vyberte, jak dlouho m&aacute; kontrolka disku sv&iacute;tit oranžovou barvou.</li>
		<li>Kliknut&iacute;m na možnost <b>Vyhledat</b> změn&iacute;te barvu kontrolky hledan&eacute;ho disku na oranžovou. <br><span class="note_head">Pozn&aacute;mka:</span> Kliknut&iacute;m na možnost <b>Obnovit</b> můžete obnovit barvu kontrolky disku zpět na trvale sv&iacute;t&iacute;c&iacute; zelenou.</li>
	</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Zde zmiňovan&yacute; stav kontrolky se net&yacute;k&aacute; slotu karty adapt&eacute;ru na modelech zař&iacute;zen&iacute; Synology NAS s&nbsp;podporou přid&aacute;v&aacute;n&iacute; karet adapt&eacute;ru (např. DS1816+). Je to kvůli tomu, že proveden&iacute; těchto slotů nepouž&iacute;v&aacute; odpov&iacute;daj&iacute;c&iacute; stav kontrolky.</li>
	</ul>
</div>



<h3><a name="Cache"></a>Mezipaměť pro z&aacute;pis</h3>
<p>Zapnut&iacute;m podpory mezipaměti pro z&aacute;pis optimalizujete v&yacute;kon syst&eacute;mu zař&iacute;zen&iacute; Synology NAS. Tuto funkci podporuj&iacute; jen někter&eacute; modely pevn&yacute;ch disků HDD. Kvůli zaji&scaron;těn&iacute; ochrany dat při použ&iacute;v&aacute;n&iacute; podpory mezipaměti pro z&aacute;pis se důrazně doporučuje použ&iacute;vat z&aacute;ložn&iacute; zdroj. Po každ&eacute;m použit&iacute; tak&eacute; doporučujeme syst&eacute;m ř&aacute;dně vypnout. Z&aacute;kazem mezipaměti pro z&aacute;pis sn&iacute;ž&iacute;te pravděpodobnost ztr&aacute;ty dat v&nbsp;důsledku v&yacute;padku nap&aacute;jen&iacute;.</p>

<h4>Povolen&iacute; podpory mezipaměti pro z&aacute;pis:</h4>
<p>Mezipaměť pro z&aacute;pis můžete povolit n&aacute;sleduj&iacute;c&iacute;m způsobem:</p>
	<ol>
		<li>Přejděte na kartu <b>HDD/SSD</b>.</li>
		<li>Vyberte disk a klikněte na možnost <b>Akce</b> &gt; <b>Konfigurovat</b>.</li>
		<li>Za&scaron;krtněte možnost <b>Povolit mezipaměť pro z&aacute;pis</b> a klikněte na možnost <b>Použ&iacute;t</b>. Podle v&yacute;choz&iacute;ho nastaven&iacute; je tato funkce povolena.</li>
	</ol>



<h3><a name="Database"></a>Datab&aacute;ze disků</h3>
<p>S.M.A.R.T. Datab&aacute;ze S.M.A.R.T. obsahuje informace t&yacute;kaj&iacute;c&iacute; se bezpečn&eacute; provozn&iacute; teploty a n&aacute;zvy pol&iacute; S.M.A.R.T. disku. Datab&aacute;ze se aktualizuje pravidelně a po v&yacute;měně disku automaticky. Tuto operaci prov&aacute;dějte pouze v&nbsp;př&iacute;padě chyby pravideln&eacute; nebo automatick&eacute; aktualizace datab&aacute;ze.</p>

<h4>Aktualizace datab&aacute;ze S.M.A.R.T.:</h4>
<p>Datab&aacute;zi disků můžete aktualizovat n&aacute;sleduj&iacute;c&iacute;m způsobem:</p>
	<ol>
		<li>Přejděte na kartu <b>Nastaven&iacute;</b>.</li>
		<li>Přejděte dolů do č&aacute;sti <b>Datab&aacute;ze S.M.A.R.T.</b></li>
		<li>Klikněte na možnost <b>Aktualizovat</b>.</li>
	</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>S.M.A.R.T. Datab&aacute;zi S.M.A.R.T. lze aktualizovat maxim&aacute;lně jednou za 24 hodin</li>
		<li>S.M.A.R.T. S.M.A.R.T. se bude automaticky aktualizovat po vložen&iacute; nov&eacute;ho disku do zař&iacute;zen&iacute; Synology NAS.</li>
		<li>Aktualizace datab&aacute;ze S.M.A.R.T. neovlivňuje ani nezlep&scaron;uje kompatibilitu či v&yacute;kon disku.</li>
		<li>Tuto operaci prov&aacute;dějte pouze v&nbsp;př&iacute;padě, že nebylo identifikov&aacute;no v&iacute;ce hodnot v&nbsp;poli Informace S.M.A.R.T. nebo pokud v&aacute;m to doporuč&iacute; t&yacute;m podpory společnosti Synology.</li>
	</ul>
</div>



</body>
</html>