<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Obecn&eacute;</h2>

<p>Spr&aacute;vce &uacute;loži&scaron;tě umožňuje uživatelům spravovat cel&yacute; prostor &uacute;loži&scaron;tě v&nbsp;jejich produktech Synology. Aby se spr&aacute;va &uacute;loži&scaron;tě a vytvořen&iacute; flexibiln&iacute;ch prostorů &uacute;loži&scaron;ť s&nbsp;ochranou dat zjednodu&scaron;ilo, podporuje syst&eacute;m Synology DSM několik typů fondů &uacute;loži&scaron;tě.</p>

<h4><a href="storage_pool.html">Fond &uacute;loži&scaron;tě</a></h4>
<p>Pomoc&iacute; zař&iacute;zen&iacute; Synology NAS je možn&eacute; spojit v&iacute;ce disků do jedin&eacute; jednotky &uacute;loži&scaron;tě zvan&eacute; fond &uacute;loži&scaron;tě. Zař&iacute;zen&iacute; Synology NAS nab&iacute;z&iacute; n&aacute;sleduj&iacute;c&iacute; typy fondů &uacute;loži&scaron;tě:</p>
<ul>
	<li><strong>Fond &uacute;loži&scaron;tě zaji&scaron;ťuj&iacute;c&iacute; lep&scaron;&iacute; v&yacute;kon</strong>:<ul>
			<li>Přiděl&iacute; ve&scaron;kerou dostupnou kapacitu do jednoho svazku.</li>
			<li>Poskytuje vy&scaron;&scaron;&iacute; v&yacute;kon, ale men&scaron;&iacute; flexibilitu spr&aacute;vy &uacute;loži&scaron;tě.</li>
			<li>Umožňuje ve svazc&iacute;ch vytvořit několik jednotek iSCSI LUN (běžn&eacute; soubory).</li>
			<li>Podporuje maxim&aacute;lně jedno pole RAID.</li>
		</ul>
	</li>
	<li><strong>Fond &uacute;loži&scaron;tě zaji&scaron;ťuj&iacute;c&iacute; vy&scaron;&scaron;&iacute; flexibilitu</strong>:<ul>
			<li>Podporuje vytv&aacute;řen&iacute; v&iacute;ce svazků ve fondu &uacute;loži&scaron;tě.</li>
			<li>Poskytuje vět&scaron;&iacute; flexibilitu při spr&aacute;vě &uacute;loži&scaron;tě.</li>
			<li>Umožňuje ve svazc&iacute;ch vytvořit několik jednotek iSCSI LUN (běžn&eacute; soubory).</li>
			<li>Podporuje sloučen&iacute; několika pol&iacute; RAID do jednoho fondu &uacute;loži&scaron;tě (při konfiguraci jako RAID 5, RAID 6 nebo RAID F1).</li>
		</ul>
	</li>
</ul>

<h4>Typ RAID</h4>    
<p>Při vytv&aacute;řen&iacute; fondu &uacute;loži&scaron;tě je nutn&eacute; nejprve zvolit typ pole RAID. Různ&eacute; typy pol&iacute; RAID nab&iacute;zej&iacute; různ&eacute; &uacute;rovně ochrany dat, funkce &uacute;loži&scaron;tě a v&yacute;kon. Zař&iacute;zen&iacute; Synology NAS v&nbsp;současnosti podporuje n&aacute;sleduj&iacute;c&iacute; typy RAID:</p>
<ul>
	<li><strong>Z&aacute;kladn&iacute;</strong>: K&nbsp;vytvořen&iacute; fondu &uacute;loži&scaron;tě použije jeden disk. Fondy &uacute;loži&scaron;tě Basic nenab&iacute;zej&iacute; redundanci dat.</li>
	<li><strong>JBOD*</strong>: Vytvoř&iacute; fond &uacute;loži&scaron;tě kombinac&iacute; minim&aacute;lně dvou disků. Fondy &uacute;loži&scaron;tě JBOD nenab&iacute;zej&iacute; redundanci dat. Dostupn&aacute; kapacita fondu &uacute;loži&scaron;tě JBOD odpov&iacute;d&aacute; celkov&eacute; kapacitě v&scaron;ech disků zahrnut&yacute;ch do fondu &uacute;loži&scaron;tě. Typ JBOD podporuje spojov&aacute;n&iacute; disků různ&yacute;ch velikost&iacute;.</li>
	<li><strong>RAID 0*</strong>: Vytvoř&iacute; fond &uacute;loži&scaron;tě kombinac&iacute; minim&aacute;lně dvou disků. Typ RAID 0 nenab&iacute;z&iacute; redundanci dat. Pokud dojde k&nbsp;selh&aacute;n&iacute; jednoho člensk&eacute;ho disku, dojde ve fondu &uacute;loži&scaron;tě ke ztr&aacute;tě dat. Dostupn&aacute; kapacita fondu &uacute;loži&scaron;tě RAID 0 odpov&iacute;d&aacute; celkov&eacute; kapacitě v&scaron;ech člensk&yacute;ch disků. Typ RAID 0 podporuje spojov&aacute;n&iacute; disků různ&yacute;ch velikost&iacute;.</li>
	<li><strong>RAID 1*</strong>: Vytvoř&iacute; fond &uacute;loži&scaron;tě spojen&iacute;m 2&ndash;4 disků. Syst&eacute;m zapisuje totožn&aacute; data současně na v&scaron;echny disky. Typ RAID 1 poskytuje ochranu dat, dokud funguje norm&aacute;lně alespoň jeden disk. Dostupn&aacute; kapacita fondu &uacute;loži&scaron;tě RAID 1 odpov&iacute;d&aacute; velikosti nejmen&scaron;&iacute;ho člensk&eacute;ho disku.</li>
	<li><strong>RAID 5*</strong>: Vytvoř&iacute; fond &uacute;loži&scaron;tě kombinac&iacute; minim&aacute;lně tř&iacute; disků a rozkl&aacute;d&aacute; data i&nbsp;informace o&nbsp;paritě na v&scaron;echny člensk&eacute; disky. Typ RAID 5 zaji&scaron;ťuje redundanci dat. V&nbsp;př&iacute;padě selh&aacute;n&iacute; jednoho člensk&eacute;ho disku lze pomoc&iacute; informac&iacute; o&nbsp;paritě na ostatn&iacute;ch člensk&yacute;ch disc&iacute;ch syst&eacute;m přebudovat. Podporuje kombinaci v&iacute;ce pol&iacute; RAID, pokud jsou vytvořena ve fondu &uacute;loži&scaron;tě pro v&iacute;ce svazků. Dostupn&aacute; kapacita fondu &uacute;loži&scaron;tě RAID 5 = <span class="note_content">Celkov&aacute; kapacita spojen&yacute;ch pol&iacute; RAID. Kapacita pole RAID = (počet disků - 1) x (kapacita nejmen&scaron;&iacute;ho disku)</span></li>
	<li><strong>RAID 6*</strong>: Vytvoř&iacute; fond &uacute;loži&scaron;tě kombinac&iacute; minim&aacute;lně čtyř disků a rozkl&aacute;d&aacute; data i&nbsp;informace o&nbsp;paritě na v&scaron;echny člensk&eacute; disky. Typ RAID 6 zaji&scaron;ťuje redundanci dat. Syst&eacute;m je možn&eacute; přebudovat pomoc&iacute; informac&iacute; o&nbsp;paritě na ostatn&iacute;ch člensk&yacute;ch disc&iacute;ch i&nbsp;v&nbsp;př&iacute;padě selh&aacute;n&iacute; dvou člensk&yacute;ch disků. Podporuje kombinaci v&iacute;ce pol&iacute; RAID, pokud jsou vytvořena ve fondu &uacute;loži&scaron;tě pro v&iacute;ce svazků. Dostupn&aacute; kapacita fondu &uacute;loži&scaron;tě RAID 6 = <span class="note_content">Celkov&aacute; kapacita spojen&yacute;ch pol&iacute; RAID. Kapacita pole RAID = (počet disků - 2) x (kapacita nejmen&scaron;&iacute;ho disku)</span></li>
	<li><strong>RAID 10*</strong>: Vytvoř&iacute; fond &uacute;loži&scaron;tě spojen&iacute;m minim&aacute;lně čtyř disků. Počet disků mus&iacute; b&yacute;t sud&yacute;. Typ RAID 10 nab&iacute;z&iacute; v&yacute;kon typu RAID 0 a nav&iacute;c stejnou &uacute;roveň ochrany dat jako u typu RAID 1. Dostupn&aacute; kapacita fondu &uacute;loži&scaron;tě RAID 10 = <span class="note_content">(kapacita nejmen&scaron;&iacute;ho disku) X (počet disků / 2)</span></li>
	<li><strong>RAID F1*</strong>: Tento typ pole RAID je určen pro disky SSD (solid-state drive). Vytvoř&iacute; fond &uacute;loži&scaron;tě kombinac&iacute; minim&aacute;lně tř&iacute; disků SSD, data i&nbsp;informace o&nbsp;paritě rozkl&aacute;d&aacute; na v&scaron;echny člensk&eacute; disky a z&aacute;pisem v&iacute;ce paritn&iacute;ch bitů do konkr&eacute;tn&iacute;ho disku SSD br&aacute;n&iacute; současn&eacute;mu selh&aacute;n&iacute; několika disků SSD. Typ RAID F1 poskytuje redundanci dat. V&nbsp;př&iacute;padě selh&aacute;n&iacute; jednoho člensk&eacute;ho disku SSD lze pomoc&iacute; informac&iacute; o&nbsp;paritě na ostatn&iacute;ch člensk&yacute;ch disc&iacute;ch SSD syst&eacute;m přebudovat. Podporuje kombinaci v&iacute;ce pol&iacute; RAID, pokud jsou vytvořena ve fondu &uacute;loži&scaron;tě pro v&iacute;ce svazků. Dostupn&aacute; kapacita fondu &uacute;loži&scaron;tě RAID F1 = <span class="note_content">Celkov&aacute; kapacita spojen&yacute;ch pol&iacute; RAID. Kapacita pole RAID = (počet disků - 1) x (kapacita nejmen&scaron;&iacute;ho disku)</span></li>
</ul>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Typy pol&iacute; RAID označen&eacute; hvězdičkou (<strong>*</strong>) jsou dostupn&eacute; pouze u&nbsp;modelů NAS s&nbsp;dostatečn&yacute;m počtem &scaron;achet na disky. Chcete-li pochopit, kter&eacute; typy svazků RAID v&aacute;&scaron; model podporuje, přejděte na web <a href="https://www.synology.com" target="_blank">www.synology.com</a> a projděte si specifikace sv&eacute;ho modelu.</li>
</ul>
</div>

</body>
</html>