<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Mezipaměť SSD</h2>
<p>Mezipaměť SSD může vylep&scaron;it v&yacute;kon n&aacute;hodn&eacute;ho př&iacute;stupu ukl&aacute;d&aacute;n&iacute;m často použ&iacute;van&yacute;ch dat v&nbsp;mezipaměti SSD. Mezipaměť SSD je možn&eacute; připojit na svazek nebo na jednotku iSCSI LUN (&uacute;roveň bloku).</p>

<p>C&iacute;lem povolen&iacute; mezipaměti SSD je zv&yacute;&scaron;en&iacute; v&yacute;konu n&aacute;hodn&eacute;ho př&iacute;stupu k&nbsp;mal&yacute;m d&aacute;vk&aacute;m dat, ke kter&yacute;m se v&nbsp;prostoru &uacute;loži&scaron;tě přistupuje často. Např&iacute;klad rozs&aacute;hl&eacute; operace čten&iacute; i z&aacute;pisu (např. datov&yacute; proud HD videa) i zcela n&aacute;hodn&eacute; vzory čten&iacute; dat postr&aacute;daj&iacute; vzory pro znovunač&iacute;t&aacute;n&iacute;, takže použit&iacute; mezipaměti SSD ž&aacute;dn&eacute; v&yacute;znamn&eacute; v&yacute;hody nepřin&aacute;&scaron;&iacute;. U obecn&yacute;ch aplikac&iacute; se doporučuje povolit možnost <b>Přeskočit sekvenčn&iacute; vstup/v&yacute;stup</b>, aby mohl k&nbsp;diskům prostoru &uacute;loži&scaron;tě st&aacute;le proch&aacute;zet sekvenčn&iacute; vstup/v&yacute;stup.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Mezipaměť SSD je dostupn&aacute; jen u&nbsp;někter&yacute;ch modelů. Chcete-li zjistit, jestli v&aacute;&scaron; model mezipaměť SSD podporuje, přečtěte si <a href="https://www.synology.com/knowledgebase/DSM/tutorial/General/Which_Synology_NAS_models_support_SSD_cache" target="_blank">tento čl&aacute;nek</a>.</li>
	<li>Aby na zař&iacute;zen&iacute; Synology NAS nedoch&aacute;zelo k&nbsp;ž&aacute;dn&yacute;m probl&eacute;mům, doporučujeme použ&iacute;t jako mezipaměť SSD kompatibiln&iacute; disky.</li>
	<li>V&nbsp;technick&yacute;ch parametrech na&scaron;ich modelů na <a href="http://www.synology.com/" target=_blank>webov&yacute;ch str&aacute;nk&aacute;ch Synology</a> zjist&iacute;te maxim&aacute;ln&iacute; možnou velikost mezipaměti SSD pro va&scaron;e zař&iacute;zen&iacute; Synology NAS.</li>
</ul>
</div>

<h3>Typy mezipaměti SSD</h3>
<p>Existuj&iacute; dva typy mezipaměti SSD. Oba implementuj&iacute; při v&yacute;měně dat v&nbsp;mezipaměti algoritmus LRU (Least Recently Used):</p>
<ul>
	<li><strong>Mezipaměť jen pro čten&iacute;</strong> se může skl&aacute;dat z&nbsp;jedn&eacute; až dvan&aacute;cti mezipamět&iacute; SSD, kter&eacute; lze připojit v&nbsp;z&aacute;kladn&iacute; konfiguraci nebo v&nbsp;konfiguraci RAID 0 a&nbsp;zv&yacute;&scaron;it tak v&yacute;kon n&aacute;hodn&eacute;ho čten&iacute; z&nbsp;připojen&eacute;ho &uacute;loži&scaron;tě.</li>
	<li><strong>Mezipaměť pro čten&iacute;-z&aacute;pis</strong> lze v&nbsp;z&aacute;vislosti na počtu mezipamět&iacute; SSD (až 12 mezipamět&iacute; SSD) připojit ke konfiguraci&nbsp;RAID 1&nbsp;/ RAID 5&nbsp;/ RAID 6 a&nbsp;zv&yacute;&scaron;it tak v&yacute;kon n&aacute;hodn&eacute;ho čten&iacute; a&nbsp;z&aacute;pisu &uacute;loži&scaron;tě, ke kter&eacute;mu je připojena.</li>
</ul>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Mezipaměť SSD jen pro čten&iacute; ukl&aacute;d&aacute; kopie dat ze svazku, takže ani v&nbsp;př&iacute;padě zhroucen&iacute; mezipaměti jen pro čten&iacute; nedojde k&nbsp;ž&aacute;dn&eacute; ztr&aacute;tě dat.</li>
	<li>V&nbsp;př&iacute;padě přechodu mezipaměti SSD pro čten&iacute;-z&aacute;pis do omezen&eacute;ho režimu se aktivuje <b>Automatick&yacute; mechanismus ochrany</b>. Ten zastav&iacute; ukl&aacute;d&aacute;n&iacute; nov&yacute;ch IO do mezipaměti a zah&aacute;j&iacute; zapisov&aacute;n&iacute; (tj. synchronizaci) st&aacute;vaj&iacute;c&iacute;ch nov&yacute;ch dat z&nbsp;disku SSD na disky HDD. Po dokončen&iacute; synchronizace dat nedojde k&nbsp;ž&aacute;dn&eacute; ztr&aacute;tě dat, ani kdyby se mezipaměť pro čten&iacute;-z&aacute;pis zhroutila.</li>
	<li>Za norm&aacute;ln&iacute; situace obsahuje mezipaměť SSD pro čten&iacute;-z&aacute;pis nov&aacute; data, kter&aacute; je&scaron;tě nebyla synchronizov&aacute;na na disky HDD. Nevyj&iacute;mejte disky SSD ze zař&iacute;zen&iacute; Synology NAS (a to ani po vypnut&iacute; syst&eacute;mu) dř&iacute;ve, než odeberete mezipaměť v&nbsp;n&aacute;stroji Spr&aacute;vce &uacute;loži&scaron;tě. Jinak může doj&iacute;t ke zhroucen&iacute; svazku.</li>
</ul>
</div>

<h3>Požadavky na paměť</h3>
<p>Požadavky na paměť z&aacute;vis&iacute; na procesoru CPU zař&iacute;zen&iacute; Synology NAS. Chcete-li zjistit, jak&yacute; procesor CPU va&scaron;e zař&iacute;zen&iacute; Synology NAS použ&iacute;v&aacute;, nahl&eacute;dněte do <a href="https://www.synology.com/knowledgebase/DSM/tutorial/General/What_kind_of_CPU_does_my_NAS_have" target="_blank">tohoto čl&aacute;nku</a>.</p> 

<h4>Pro modely s&nbsp;procesory CPU Alpine:</h4>
	<p>Každ&yacute; 1&nbsp;GB mezipaměti SSD vyžaduje přibližně 416&nbsp;KB syst&eacute;mov&eacute; paměti (lze započ&iacute;tat roz&scaron;iřitelnou paměť) a&nbsp;maxim&aacute;ln&iacute; velikost mezipaměti je 930&nbsp;GB. Pokud je tedy konfigurace mezipaměti jen pro čten&iacute; nastavena na 2 x disk SSD 128&nbsp;GB, bude celkov&aacute; velikost mezipaměti 256&nbsp;GB a&nbsp;bude vyžadovat alespoň 104&nbsp;MB paměti; pokud je konfigurace mezipaměti pro čten&iacute;-z&aacute;pis nastavena na 2 x disk SSD 128&nbsp;GB, bude celkov&aacute; velikost mezipaměti 128&nbsp;GB a&nbsp;bude vyžadovat alespoň 52&nbsp;MB paměti. Pokud nen&iacute; k&nbsp;dispozici dostatek paměti, bude tvorba mezipaměti SSD zak&aacute;z&aacute;na, př&iacute;padně bude omezena velikost mezipaměti SSD.</p>

<h4>Pro v&scaron;echny ostatn&iacute; modely:</h4>
	<p>V&nbsp;z&aacute;vislosti na velikosti mezipaměti vyžaduje mezipaměť SSD určit&eacute; množstv&iacute; syst&eacute;mov&eacute; paměti. Při připojen&iacute; mezipaměti SSD s&nbsp;vět&scaron;&iacute; kapacitou bude pravděpodobně nutn&eacute; paměť zař&iacute;zen&iacute; Synology NAS upgradovat. Aby syst&eacute;m zůstal stabiln&iacute; a&nbsp;rychl&yacute;, lze pro mezipaměť SSD využ&iacute;t pouze 1/4&nbsp;předinstalovan&eacute; syst&eacute;mov&eacute; paměti.</p>
	
	<p>Každ&yacute; 1&nbsp;GB mezipaměti SSD vyžaduje přibližně 416&nbsp;KB syst&eacute;mov&eacute; paměti (započ&iacute;tat lze roz&scaron;iřitelnou paměť).<br><span class="note_head">Pozn&aacute;mka: </span>Toto se net&yacute;k&aacute; mezipamět&iacute; SSD pro čten&iacute;-z&aacute;pis vytvořen&yacute;ch v&nbsp;syst&eacute;mu DSM verze 5.1 nebo star&scaron;&iacute;ch. To znamen&aacute;, že každ&yacute; 1&nbsp;GB mezipaměti SSD vytvořen&yacute; v&nbsp;dř&iacute;věj&scaron;&iacute; verzi než DSM 5.2 bude i při použit&iacute; v&nbsp;prostřed&iacute; syst&eacute;mu DSM 5.2 vyžadovat 4&nbsp;MB syst&eacute;mov&eacute; paměti.</p>
	
	<p>Pokud je tedy konfigurace mezipaměti jen pro čten&iacute; nastavena na 2 x disk SSD 128&nbsp;GB, bude celkov&aacute; velikost mezipaměti 256&nbsp;GB a&nbsp;bude vyžadovat alespoň 104&nbsp;MB paměti; pokud je konfigurace mezipaměti pro čten&iacute;-z&aacute;pis nastavena na 2 x disk SSD 128&nbsp;GB, bude celkov&aacute; velikost mezipaměti 128&nbsp;GB a&nbsp;bude vyžadovat alespoň 52&nbsp;MB paměti. Pokud nen&iacute; k&nbsp;dispozici dostatek paměti, bude tvorba mezipaměti SSD zak&aacute;z&aacute;na, př&iacute;padně bude omezena velikost mezipaměti SSD.</p>

<h3>Statistika využit&iacute; mezipaměti</h3>
<p>Podle v&yacute;choz&iacute;ho nastaven&iacute; mezipaměť SSD urychluje pouze n&aacute;hodn&eacute; vstupy/v&yacute;stupy, neurychluje v&scaron;ak sekvenčn&iacute; vstupy/v&yacute;stupy. M&iacute;ru využit&iacute; mezipaměti SSD lze vypoč&iacute;tat podle n&aacute;sleduj&iacute;c&iacute;ho vzorce:</p>
<ul>
	<li>M&iacute;ra využit&iacute; mezipaměti SSD jen pro čten&iacute; = Počet zrychlen&yacute;ch n&aacute;hodn&yacute;ch čten&iacute; / Celkov&yacute; počet zrychlen&yacute;ch čten&iacute; * 100&nbsp;%</li>
	<li>M&iacute;ra využit&iacute; mezipaměti SSD pro čten&iacute; a z&aacute;pis = Počet zrychlen&yacute;ch n&aacute;hodn&yacute;ch čten&iacute; a z&aacute;pisů / Celkov&yacute; počet zrychlen&yacute;ch čten&iacute; a z&aacute;pisů * 100&nbsp;%</li>
</ul>

<h3>Spr&aacute;va mezipaměti SSD</h3>
<h4>Připojen&iacute; mezipaměti SSD:</h4>
	<ol>
	  <li>Nainstalujte do zař&iacute;zen&iacute; Synology NAS disky SSD. Nejdř&iacute;ve si přečtěte pozn&aacute;mky uveden&eacute; v&yacute;&scaron;e.</li>
	  <li>Spr&aacute;va těchto nastaven&iacute; se prov&aacute;d&iacute; v&nbsp;č&aacute;sti <strong>Spr&aacute;vce &uacute;loži&scaron;tě</strong> &gt; <strong>Mezipaměť SSD</strong>. Klikněte na možnost <b>Vytvořit</b>.</li>
	<li>Vyberte režim mezipaměti (k&nbsp;dispozici pouze u&nbsp;modelů s&nbsp;podporou mezipaměti pro čten&iacute;-z&aacute;pis).</li>
	<li>Vyhledejte rozev&iacute;rac&iacute; nab&iacute;dku a&nbsp;vyberte svazek nebo jednotku iSCSI LUN (&uacute;roveň bloku), ke kter&eacute; chcete mezipaměť SSD připojit.</li>
	<li>Vyberte ze seznamu disky SSD. Data uložen&aacute; na disc&iacute;ch SSD budou vymaz&aacute;na. Dejte pozor, aby nebyla odstraněna ž&aacute;dn&aacute; důležit&aacute; data.</li>
	<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
	</ol>

<h4>Ukončen&iacute; sekvenčn&iacute;ho vstupu/v&yacute;stupu:</h4>
	<p>Pokud m&aacute; v&aacute;&scaron; c&iacute;lov&yacute; svazek nebo jednotka iSCSI LUN (&uacute;roveň bloku) vynikaj&iacute;c&iacute; sekvenčn&iacute; v&yacute;kon vstupu/v&yacute;stupu, můžete zař&iacute;dit, aby mezipaměť SSD ukončila ukl&aacute;d&aacute;n&iacute; sekvenčn&iacute;ho vstupu/v&yacute;stupu a&nbsp;z&iacute;skat ze sv&yacute;ch disků př&iacute;m&yacute; př&iacute;stup k&nbsp;datům a t&iacute;m i vy&scaron;&scaron;&iacute; rychlost a&nbsp;lep&scaron;&iacute; v&yacute;kon.</p>
	<ol>
	<li>Kliknut&iacute;m na možnost <strong>Konfigurovat</strong> otevřete okno konfigurace.</li>
	<li>Za&scaron;krtněte možnost <strong>Přeskočit sekvenčn&iacute; vstup/v&yacute;stup</strong>.</li>
	</ol>

<h4>Odebr&aacute;n&iacute; mezipaměti SSD:</h4>
	<ol>
	<li>Kliknut&iacute;m na možnost <b>Odebrat</b> tuto mezipaměť SSD ze zař&iacute;zen&iacute; Synology NAS trvale odeberete.</li>
	</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
    <li>V&nbsp;př&iacute;padě mezipaměti pro čten&iacute;-z&aacute;pis je nutn&eacute; ji odebrat podle tohoto postupu (i&nbsp;pokud je zař&iacute;zen&iacute; Synology NAS vypnut&eacute;). Jinak dojde k&nbsp;zhroucen&iacute; svazku, protože č&aacute;st dat bude uložena pouze v&nbsp;mezipaměti.</li>
	<li>Při připojov&aacute;n&iacute; nebo odeb&iacute;r&aacute;n&iacute; mezipaměti SSD ukonč&iacute; syst&eacute;m v&scaron;echny souvisej&iacute;c&iacute; služby (např. sd&iacute;len&eacute; složky, instalovan&eacute; bal&iacute;čky, aktu&aacute;ln&iacute; připojen&iacute; atd.)</li>
	<li>Pokud nen&iacute; během spou&scaron;těn&iacute; zji&scaron;těna na &uacute;loži&scaron;ti mezipaměť pro čten&iacute;-z&aacute;pis, &uacute;loži&scaron;tě se nepřipoj&iacute;. Vyhledejte a&nbsp;přeinstalujte disky SSD zař&iacute;zen&iacute; Synology NAS a&nbsp;&uacute;loži&scaron;tě připojte opětovn&yacute;m spu&scaron;těn&iacute;m.</li>
	<li>Před odpojen&iacute;m př&iacute;slu&scaron;n&yacute;ch disků SSD nezapomeňte spr&aacute;vně odebrat mezipaměť SSD pro čten&iacute;-z&aacute;pis. Nespr&aacute;vn&eacute; odpojen&iacute; disků SSD (např&iacute;klad pokud se st&aacute;le je&scaron;tě použ&iacute;v&aacute; mezipaměť nebo když je syst&eacute;m vypnut&yacute;), způsob&iacute; zhroucen&iacute; dat uložen&yacute;ch v&nbsp;c&iacute;lov&eacute;m svazku nebo na jednotce iSCSI LUN.</ul>
</div>
 
<h4>Zru&scaron;en&iacute; odebr&aacute;n&iacute; mezipaměti SSD:</h4> 
<ol>
    <li>Chcete-li zru&scaron;it akci odebr&aacute;n&iacute; mezipaměti, klikněte na možnost <b>Zru&scaron;it odebr&aacute;n&iacute;</b>.</li>
    </ol>    

<h4>Oprava mezipaměti SSD:</h4>
	<ul>
		<li><strong>Mezipaměť pro čten&iacute;-z&aacute;pis:</strong> Pokud do&scaron;lo k&nbsp;poru&scaron;e někter&eacute;ho z&nbsp;disků&nbsp;SSD, můžete jej opravit podle n&iacute;že uveden&eacute;ho postupu.<ol>
			<li>Vadn&yacute; disk SSD nahraďte nov&yacute;m. (Nov&yacute; disk SSD mus&iacute; m&iacute;t stejnou velikost jako původn&iacute; disk a&nbsp;mus&iacute; se jednat o&nbsp;stejn&yacute; model).</li>
			<li>Klikněte na tlač&iacute;tko <b>Opravit</b>.</li>
			<li>Vyberte disk SSD ze seznamu.</li>
			<li>Klikněte na možnost <b>Použ&iacute;t</b>.</li>
			</ol></li>
		<li><strong>Mezipaměť jen pro čten&iacute;:</strong> Dojde-li k&nbsp;poru&scaron;e jednoho z&nbsp;disků&nbsp;SSD, odeberte mezipaměť a&nbsp;vadn&yacute; disk&nbsp;SSD vyměňte. Pot&eacute; kliknut&iacute;m na možnost <strong>Vytvořit</strong> vytvořte novou konfiguraci mezipaměti.</li>
	</ul>

<h3>Průvodce pamět&iacute; SSD</h3>
<p>Tato funkce umožňuje na konkr&eacute;tn&iacute;m svazku v&yacute;počet a&nbsp;zobrazen&iacute; celkov&eacute; velikosti a&nbsp;počtu souborů, ke kter&yacute;m se ned&aacute;vno přistupovalo. Pokud jste je&scaron;tě na vybran&eacute;m svazku ž&aacute;dn&eacute; mezipaměti SSD nevytvořili, lze tyto informace využ&iacute;t při posouzen&iacute;, jak velk&aacute; mezipaměť SSD se hod&iacute; pro v&aacute;&scaron; syst&eacute;m. Pokud jste na vybran&eacute;m svazku mezipaměť SSD už vytvořili, budou se zde zobrazovat anal&yacute;za a &uacute;daje o využit&iacute; mezipaměti.</p>

<h4>Použ&iacute;v&aacute;n&iacute; funkce Průvodce pamět&iacute; SSD:</h4>
	<ol>
	<li>Kliknut&iacute;m na možnost <b>Průvodce pamět&iacute; SSD</b> otevřete průvodce.</li>
	<li>Vyberte svazek, pro kter&yacute; chcete v&yacute;počet prov&eacute;st, a&nbsp;pot&eacute; klikněte na možnost <b>Dal&scaron;&iacute;</b>.</li>
	<li>Průvodce začne na vybran&eacute;m svazku automaticky vypoč&iacute;t&aacute;vat celkovou velikost a&nbsp;počet souborů, ke kter&yacute;m se ned&aacute;vno přistupovalo. Doba v&yacute;počtu se li&scaron;&iacute; v&nbsp;z&aacute;vislosti na va&scaron;em konkr&eacute;tn&iacute;m prostřed&iacute;.</li>
	</ol>
