<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Hot Spare</h2>
<p>Disky Hot Spare jsou pohotovostn&iacute; disky, kter&eacute; dok&aacute;žou opravit po&scaron;kozen&yacute; fond &uacute;loži&scaron;tě automatick&yacute;m nahrazen&iacute;m po&scaron;kozen&eacute;ho disku. Disky Hot Spare lze glob&aacute;lně přidělovat jako ochranu libovoln&eacute;ho fondu &uacute;loži&scaron;tě v&nbsp;zař&iacute;zen&iacute; Synology NAS, pokud takov&yacute; fond &uacute;loži&scaron;tě odpov&iacute;d&aacute; n&aacute;sleduj&iacute;c&iacute;m krit&eacute;ri&iacute;m:</p>
<ul>
	<li>Typem svazku RAID dan&eacute;ho fondu &uacute;loži&scaron;tě mus&iacute; b&yacute;t typ s&nbsp;ochranou dat (např. RAID 1, RAID 5, RAID 6, RAID 10, RAID F1</span>).</li>
	<li>Velikost disku Hot Spare mus&iacute; b&yacute;t stejn&aacute; nebo vět&scaron;&iacute; než velikost nejmen&scaron;&iacute;ho disku ve fondu &uacute;loži&scaron;tě.</li>
</ul>

<h4>Nastaven&iacute; disků Hot Spare:</h4>
<ol>
<li>Klikněte na možnost <strong>Spr&aacute;va</strong>.</li>
<li>Zobraz&iacute; se dialogov&eacute; okno zobrazuj&iacute;c&iacute; stav Hot Spare v&scaron;ech fondů &uacute;loži&scaron;tě i&nbsp;dostupn&yacute;ch disků. Stav fondu &uacute;loži&scaron;tě obsahuje n&aacute;sleduj&iacute;c&iacute; informace:</li>
<ul>
<li><strong>Přiděleno:</strong> Fond &uacute;loži&scaron;tě je chr&aacute;něn minim&aacute;lně jedn&iacute;m přidělen&yacute;m diskem Hot Spare.</li>
<li><strong>K&nbsp;dispozici:</strong> Jsou k&nbsp;dispozici disky, kter&eacute; mohou chr&aacute;nit fond &uacute;loži&scaron;tě, nebyl přidělen ale je&scaron;tě ž&aacute;dn&yacute; disk Hot Spare.</li>
<li><strong>Nen&iacute; k&nbsp;dispozici:</strong> Nejsou k&nbsp;dispozici ž&aacute;dn&eacute; disky Hot Spare, kter&eacute; by mohly chr&aacute;nit fond &uacute;loži&scaron;tě.</li>
</ul>
<li>V&nbsp;č&aacute;sti <strong>Dostupn&eacute; disky</strong> jsou uvedeny disky, kter&eacute; lze přidělit jako disky Hot Spare. Disk Hot Spare přiděl&iacute;te za&scaron;krtnut&iacute;m pol&iacute;čka vedle disku, kter&yacute; chcete přidělit jako disk Hot Spare.</li>
<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <strong>Použ&iacute;t</strong>.</li>
</ol>
<div class="section">
<h4>Pozn&aacute;mka:</h4> 
<ul>
<li>Po přidělen&iacute; disku jako disku Hot Spare se v&scaron;echna data na tomto disku vymažou. Před přidělen&iacute;m disku Hot Spare zajistěte, aby se na tomto disku nenach&aacute;zela ž&aacute;dn&aacute; důležit&aacute; data.</li>
<li>Svazek RAID sestaven&yacute; z&nbsp;pevn&yacute;ch disků HDD nebude automaticky opraven disky SSD Hot Spare a opačně.</li>
<li>Aby na zař&iacute;zen&iacute; Synology NAS nedoch&aacute;zelo k&nbsp;ž&aacute;dn&yacute;m probl&eacute;mům, doporučujeme jako disky Hot Spare použ&iacute;t kompatibiln&iacute; disky.</li>
</ul>
</div>

<h4>Konfigurace nastaven&iacute; disků Hot Spare pro fond &uacute;loži&scaron;tě:</h4>
<ol>
<li>Klikněte na možnost <strong>Konfigurovat</strong>.</li>
<li>Na kartě <strong>Fond &uacute;loži&scaron;tě</strong> jsou uvedeny fondy &uacute;loži&scaron;tě, kter&eacute; lze pomoc&iacute; disků Hot Spare chr&aacute;nit. Zru&scaron;&iacute;te-li za&scaron;krtnut&iacute; těchto pol&iacute;ček, nebudou př&iacute;slu&scaron;n&eacute; fondy &uacute;loži&scaron;tě v&nbsp;př&iacute;padě po&scaron;kozen&iacute; pomoc&iacute; disků Hot Spare automaticky opraveny.</li>
<li>Na kartě <strong>Disky Hot Spare pro různ&aacute; zař&iacute;zen&iacute;</strong> je možn&eacute; povolit, aby disky Hot Spare na jednom zař&iacute;zen&iacute; opravily po&scaron;kozen&yacute; svazek RAID nach&aacute;zej&iacute;c&iacute; se na jin&eacute;m zař&iacute;zen&iacute;.</li>
<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <strong>OK</strong>.</li>
</ol>

</body>
</html>
