<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
	<h2>Přehled</h2>
	<p>V&nbsp;přehledu se zobrazuje celkov&yacute; stav prostorů &uacute;loži&scaron;ť, včetně celkov&eacute;ho stavu v&scaron;ech prostorů, stavu svazku, stavu fondu &uacute;loži&scaron;tě a informac&iacute; o&nbsp;disku.</p>

		<h4>Stav &uacute;loži&scaron;tě</h4>
        <p>Existuj&iacute; tři typy stavů:</p>
	  	<ul>
				<li><b>V&nbsp;poř&aacute;dku</b>: V&scaron;echny prostory &uacute;loži&scaron;tě (svazek nebo fond &uacute;loži&scaron;tě) jsou norm&aacute;ln&iacute;.</li>
				<li><B>Pozor</B>: Prostor &uacute;loži&scaron;tě (svazek nebo fond &uacute;loži&scaron;tě) pře&scaron;el do omezen&eacute;ho režimu, do&scaron;lo ke zhroucen&iacute; mezipaměti SSD nebo k&nbsp;selh&aacute;n&iacute; syst&eacute;mov&eacute;ho odd&iacute;lu.</li>
				<li><b>V&yacute;straha</b>: Do&scaron;lo ke zhroucen&iacute; prostoru &uacute;loži&scaron;tě (svazku nebo fondu &uacute;loži&scaron;tě).</li>
			</ul>
			<p>Pokud se současně vyskytne v&iacute;ce neobvykl&yacute;ch chov&aacute;n&iacute;, zobraz&iacute; se stav v&nbsp;n&aacute;sleduj&iacute;c&iacute;m pořad&iacute;: 1) Prostory &uacute;loži&scaron;tě (svazek nebo fond &uacute;loži&scaron;tě), 2) Mezipaměť SSD a 3) Syst&eacute;mov&yacute; odd&iacute;l. Vyskytne-li se probl&eacute;m, postupujte podle pokynů uveden&yacute;ch pod stavem.</p>
		
		<h4>Přep&iacute;nač fondu &uacute;loži&scaron;tě</h4>
	<p>Přep&iacute;nač fondu &uacute;loži&scaron;tě uv&aacute;d&iacute; seznam v&scaron;ech fondů &uacute;loži&scaron;tě. Vyberte fond &uacute;loži&scaron;tě a prohl&eacute;dněte si podrobnosti.</p>
		
		<h4>Stav svazku</h4>
	<p>V&nbsp;t&eacute;to č&aacute;sti se zobrazuje využit&aacute; kapacita svazků ve zvolen&eacute;m fondu &uacute;loži&scaron;tě. Pokud celkov&eacute; využit&iacute; dos&aacute;hne kritick&eacute; hodnoty svazku, zbarv&iacute; se v&yacute;sečov&yacute; graf červeně, v&nbsp;př&iacute;padě dosažen&iacute; v&yacute;stražn&eacute; hodnoty se zbarv&iacute; oranžově a jinak bude modr&yacute;. Kritick&eacute; a v&yacute;stražn&eacute; hodnoty lze změnit v&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Upozorněn&iacute;</strong> &gt; <strong>Roz&scaron;&iacute;řen&eacute;</strong> &gt; <strong>Intern&iacute; &uacute;loži&scaron;tě</strong> &gt; <strong>Pln&yacute; svazek</strong>.</p>
		
	<h4>Fond &uacute;loži&scaron;tě / svazek</h4>
	<p>Pokud nen&iacute; vybran&yacute; ž&aacute;dn&yacute; konkr&eacute;tn&iacute; fond &uacute;loži&scaron;tě, zobraz&iacute; se podrobnosti o&nbsp;v&scaron;ech fondech &uacute;loži&scaron;tě. Pokud je vybran&yacute; konkr&eacute;tn&iacute; fond &uacute;loži&scaron;tě, zobraz&iacute; se podrobnosti a svazek tohoto fondu &uacute;loži&scaron;tě.</p>
		
		<h4>Informace o&nbsp;disku</h4>
        <p>V&nbsp;t&eacute;to č&aacute;sti se zobraz&iacute; informace o&nbsp;disku a o&nbsp;hardwaru. Je zde uvedeno, kolik disků je použ&iacute;v&aacute;no určit&yacute;mi prostory &uacute;loži&scaron;tě, počet n&aacute;hradn&iacute;ch disků a počet dostupn&yacute;ch slotů pro disky.</p>
        
</body>
</html>
