<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Svazek</h2>
<p>Svazky představuj&iacute; z&aacute;kladn&iacute; &uacute;ložn&eacute; prostory, na kter&yacute;ch může uživatel vytv&aacute;řet sd&iacute;len&eacute; složky, jednotky iSCSI LUN (běžn&eacute; soubory), ukl&aacute;dat data nebo instalovat bal&iacute;čky. Před vytvořen&iacute;m jak&eacute;hokoli svazku ověřte, zda již byla vytvořena skupina RAID Group. Dal&scaron;&iacute; informace o&nbsp;skupin&aacute;ch RAID Group se nach&aacute;zej&iacute; v&nbsp;č&aacute;sti <a href="raid.html">Skupina RAID Group</a>.</p>

<h4>Vytvořen&iacute; svazku:</h4>
<ol>
	<li>Ověřte, jestli zař&iacute;zen&iacute; Synology NAS obsahuje skupinu RAID Group s&nbsp;přiděliteln&yacute;m prostorem.</li>
	<li>Klikněte na tlač&iacute;tko <strong>Vytvořit</strong>.</li>
	<li>Vyberte skupinu RAID Group, ve kter&eacute; chcete svazek vytvořit.</li>
	<li>Upravte požadovan&aacute; nastaven&iacute;.</li>
	<li>Nastavte přidělov&aacute;n&iacute; velikosti svazku. (Nastaven&iacute; přidělov&aacute;n&iacute; velikosti nen&iacute; k&nbsp;dispozici u&nbsp;svazků vytvořen&yacute;ch na skupině RAID Group pro jednotliv&eacute; svazky nebo jednotku iSCSI LUN.)</li>
    <li>Nastaven&iacute; potvrďte kliknut&iacute;m na tlač&iacute;tko <strong>Použ&iacute;t</strong>.</li>


</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Maxim&aacute;ln&iacute; velikost svazku, kterou je možn&eacute; přidělit, je 200&nbsp;TB.</li>
	<li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Minim&aacute;ln&iacute; velikost přidělen&aacute; svazku Btrfs mus&iacute; b&yacute;t alespoň 10&nbsp;GB.</li>
    <li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Svazky Btrfs budou rezervovat 4&nbsp;% prostoru na metadata.</li>
</ul>
</div>

<h4>Odebr&aacute;n&iacute; svazku:</h4>
<ol>
	<li>Vyberte svazek, kter&yacute; chcete odebrat.</li>
	<li>Klikněte na tlač&iacute;tko <strong>Odebrat</strong> a&nbsp;postup dokončete pomoc&iacute; průvodce.</li>
</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Odebr&aacute;n&iacute;m svazku vymažete ve&scaron;ker&aacute; st&aacute;vaj&iacute;c&iacute; data na svazku.</li>
</ul>
</div>

<h4>Vynucen&iacute; připojen&iacute; svazku:</h4>
<p>Pokud sch&aacute;z&iacute; mezipaměť svazku, svazek se při spu&scaron;těn&iacute; syst&eacute;mu nepřipoj&iacute;. Pokud mezipaměť nelze obnovit a&nbsp;chcete z&iacute;skat př&iacute;stup ke svazku, klikněte na možnost <strong>Vynutit připojen&iacute;</strong>.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Tato funkce je k&nbsp;dispozici pouze u&nbsp;někter&yacute;ch modelů.</li>
</ul>
</div>

<h4>Oprava svazku:</h4>
<p>Pokud stav svazku vykazuje hodnotu <strong>Omezen&yacute; režim</strong>, přejděte na kartu <strong>RAID Group</strong> a&nbsp;př&iacute;slu&scaron;nou skupinu RAID Group vyhledejte. Potom proveďte opravu podle navrhovan&eacute;ho postupu.</p>

<h4>Roz&scaron;&iacute;řen&iacute; velikosti svazku</h4>
<ul>
	<li>U svazků vytvořen&yacute;ch ve skupině RAID Group pro vět&scaron;&iacute; počet svazků nebo jednotek iSCSI LUN (na &uacute;rovni bloků).<ol>
			<li>Vyberte svazek, kter&yacute; chcete roz&scaron;&iacute;řit.</li>
			<li>Klikněte na možnost <strong>Upravit</strong>.</li>
			<li>Zadejte novou velikost a&nbsp;kliknut&iacute;m na tlač&iacute;tko <strong>OK</strong> proveďte roz&scaron;&iacute;řen&iacute;.</li>
		</ol>
	</li>
	<li>U svazků vytvořen&yacute;ch ve skupině RAID Group pro jeden svazek nebo jednotku iSCSI LUN (na &uacute;rovni bloku) přejděte do č&aacute;sti <strong>Roz&scaron;&iacute;řen&iacute; velikosti skupiny RAID Group</strong> a&nbsp;<a href="raid.html">RAID Group</a>. Velikost svazku bude roz&scaron;&iacute;řena po roz&scaron;&iacute;řen&iacute; kapacity př&iacute;slu&scaron;n&eacute; skupiny RAID Group.</li>
</ul>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Pokud se svazky použ&iacute;vaj&iacute; jako replikovan&eacute; c&iacute;le aplikace <strong>Snapshot Replication</strong>, je možn&eacute; v&yacute;kon replikace po vytvořen&iacute; svazků zv&yacute;&scaron;it &uacute;pravou nastaven&iacute; v&nbsp;okně <strong>Upravit</strong> v&nbsp;č&aacute;sti <strong>Frekvence z&aacute;znamu času př&iacute;stupu k&nbsp;souboru</strong>:</p>
<ul>
	<li><strong>Denně</strong>: Čas př&iacute;stupu k&nbsp;souboru se bude aktualizovat denně nebo v&nbsp;okamžiku změny souboru, podobně jako u&nbsp;vět&scaron;iny operačn&iacute;ch syst&eacute;mů. Funkce někter&yacute;ch aplikac&iacute; na přesnost času př&iacute;stupu k&nbsp;souborům spol&eacute;haj&iacute;. Možnost <strong>Denně</strong> m&aacute; vliv na v&yacute;kon replikace, ale doporučujeme ji, pokud často použ&iacute;v&aacute;te některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch funkc&iacute; nebo aplikac&iacute;:<ul>
			<li><strong>Nejvzd&aacute;leněj&scaron;&iacute; čas př&iacute;stupu</strong> ve službě <strong>Storage Analyzer</strong></li>
			<li><strong>Průvodce pamět&iacute; SSD</strong> v&nbsp;n&aacute;stroji <strong>Spr&aacute;vce &uacute;loži&scaron;tě</strong></li>
			<li>V&scaron;echny aplikace jin&yacute;ch v&yacute;robců využ&iacute;vaj&iacute;c&iacute; hodnotu <strong>Čas př&iacute;stupu k&nbsp;souboru z&aacute;znamu</strong>.</li>
		</ul>
	<li><strong>Měs&iacute;čně</strong>: Čas př&iacute;stupu k&nbsp;souboru se aktualizuje měs&iacute;čně nebo v&nbsp;okamžiku změny souboru. Tato možnost způsob&iacute; mal&eacute; zlep&scaron;en&iacute; v&yacute;konu replikace a aplikace použ&iacute;vaj&iacute;c&iacute; hodnotu <strong>Čas př&iacute;stupu k&nbsp;souboru z&aacute;znamu</strong> budou i&nbsp;nad&aacute;le fungovat, nicm&eacute;ně s&nbsp;niž&scaron;&iacute; přesnost&iacute;.</li>
	<li><strong>Nikdy</strong>: Doporučen&eacute; nastaven&iacute;, pokud požadujete nejvy&scaron;&scaron;&iacute; v&yacute;kon replikace a nepotřebujete při každodenn&iacute; pr&aacute;ci aplikace využ&iacute;vaj&iacute;c&iacute; hodnotu <strong>Čas př&iacute;stupu k&nbsp;souboru z&aacute;znamu</strong>.</li>
</ul>
</div>

<h3>SSD TRIM</h3>
<p>Pokud někter&yacute; ze svazků sest&aacute;v&aacute; pouze z&nbsp;disků SSD (Solid State Drive), doporučujeme povolit funkci SSD TRIM. Tato funkce zvy&scaron;uje v&yacute;kon čten&iacute; svazků a&nbsp;z&aacute;pisu na svazky vytvořen&eacute; v&nbsp;r&aacute;mci ře&scaron;en&iacute; SSD, takže doch&aacute;z&iacute; ke zv&yacute;&scaron;en&iacute; efektivity a&nbsp;prodloužen&iacute; životnosti disků SSD.</p>

<h4>Povolen&iacute; funkce SSD TRIM:</h4>
<ol>
	<li>Otevřete <strong>Spr&aacute;vce &uacute;loži&scaron;tě</strong> a přejděte na možnost <strong>Svazek</strong>.</li>
	<li>Vyberte svazek, kter&yacute; se skl&aacute;d&aacute; pouze z&nbsp;disků SSD, a pot&eacute; klikněte na tlač&iacute;tko <strong>Konfigurovat</strong>.</li>
	<li>V&nbsp;zobrazen&eacute;m okně přejděte na kartu <strong>SSD TRIM</strong> a za&scaron;krtněte pol&iacute;čko <strong>Povolit funkci TRIM</strong>.</li>
	<li>Kliknut&iacute;m na tlač&iacute;tko <strong>Nastavit pl&aacute;n</strong> zadejte, kdy m&aacute; syst&eacute;m funkci SSD TRIM prov&aacute;dět.</li>
	<li>Klikněte na možnost <strong>OK</strong>.</li>
</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Funkce SSD TRIM je k&nbsp;dispozici pouze u&nbsp;někter&yacute;ch modelů Synology NAS a&nbsp;typů pole RAID.</li>
	<li>Někter&eacute; modely disků SSD nepodporuj&iacute; funkci SSD TRIM u&nbsp;svazků&nbsp;RAID 5<span class="enable-grantley">,</span><span class="disable-grantley"> </span>RAID 6<span class="enable-grantley"> a RAID F1</span>. Viz seznam kompatibiln&iacute;ch zař&iacute;zen&iacute; na <a href="https://www.synology.com/" target="_blank">ofici&aacute;ln&iacute;ch webov&yacute;ch str&aacute;nk&aacute;ch</a> společnosti Synology.</li>
	<li>Funkci SSD TRIM nelze povolit v&nbsp;n&aacute;sleduj&iacute;c&iacute;ch situac&iacute;ch:<ul>
			<li>Ke svazku je připojena mezipaměť SSD.</li>
			<li>Je nainstalov&aacute;n bal&iacute;ček <strong>Time Backup</strong>.</li>
		</ul>
	</li>
	<li>Funkci SSD TRIM nelze povolit na jednotk&aacute;ch iSCSI LUN na &uacute;rovni bloků.</li>
	<li>Prov&aacute;děn&iacute; funkce SSD TRIM bude m&iacute;t vliv na v&yacute;kon syst&eacute;mu. Čas dokončen&iacute; operace TRIM z&aacute;vis&iacute; na velikosti svazku a&nbsp;modelu&nbsp;SSD.</li>
	<li>Pokud je na svazku povolena funkce TRIM, bude povolena tak&eacute; na dal&scaron;&iacute;ch svazc&iacute;ch vytvořen&yacute;ch ve stejn&eacute; skupině disků nebo skupině RAID Group.</li>
</ul>
</div>


<h3>Scrubbing souborov&eacute;ho syst&eacute;mu*</h3>
<p>Scrubbing souborov&eacute;ho syst&eacute;mu je funkce &uacute;držby dat, kter&aacute; kontroluje svazky. V&nbsp;př&iacute;padě zji&scaron;těn&iacute; rozd&iacute;lu v&nbsp;kontroln&iacute;m součtu dat se cesta souboru zaznamen&aacute; do centra protokolů a doporučuje se opravit data pomoc&iacute; z&aacute;lohy.</p>

<p>Scrubbing syst&eacute;mu souborů doporučujeme prov&aacute;dět pravidelně, aby se zajistila konzistence dat.</p>

<h4>Proveden&iacute; scrubbingu souborov&eacute;ho syst&eacute;mu:</h4>
<ol>
	<li>Otevřete <strong>Spr&aacute;vce &uacute;loži&scaron;tě</strong> a přejděte na možnost <strong>Svazek</strong>.</li>
	<li>Vyberte svazek, na kter&eacute;m se m&aacute; scrubbing souborov&eacute;ho syst&eacute;mu prov&eacute;st.</li>
	<li>Klikněte na možnost <strong>Spr&aacute;va</strong>.</li>
	<li>Vyberte možnost <strong>Scrubbing souborov&eacute;ho syst&eacute;mu</strong>.</li>
</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Scrubbing souborov&eacute;ho syst&eacute;mu je možn&eacute; prov&eacute;st pouze na svazc&iacute;ch v&nbsp;souborov&eacute;m syst&eacute;mu <strong>Btrfs</strong>.</li>
	<li>Scrubbing souborov&eacute;ho syst&eacute;mu lze prov&eacute;st pouze tehdy, když je stav svazku <strong>Norm&aacute;ln&iacute;</strong>.</li>
	<li>Nevyp&iacute;nejte syst&eacute;m, dokud se scrubbing souborov&eacute;ho syst&eacute;mu nedokonč&iacute;. Jestliže se syst&eacute;m před dokončen&iacute;m vypne, bude nutn&eacute; scrubbing souborov&eacute;ho syst&eacute;mu spustit znovu ručně od zač&aacute;tku.</li>
</ul>
</div>

<h3>Defragmentace souborov&eacute;ho syst&eacute;mu*</h3>
<p>Pokud se data průběžně upravuj&iacute;, zvy&scaron;uje se v&nbsp;syst&eacute;mu počet fragmentovan&yacute;ch souborů, což vede k&nbsp;pomalej&scaron;&iacute;mu př&iacute;stupu k&nbsp;souborům na disc&iacute;ch. Proveden&iacute; defragmentace syst&eacute;mu souborů může zlep&scaron;it v&yacute;kon.</p>

<h4>Proveden&iacute; defragmentace syst&eacute;mu souborů:</h4>
<ol>
	<li>Otevřete <strong>Spr&aacute;vce &uacute;loži&scaron;tě</strong> a přejděte na možnost <strong>Svazek</strong>.</li>
	<li>Vyberte svazek, na kter&eacute;m se m&aacute; defragmentace syst&eacute;mu souborů prov&eacute;st.</li>
	<li>Klikněte na možnost <strong>Spr&aacute;va</strong>.</li>
	<li>Vyberte možnost <strong>Defragmentace syst&eacute;mu souborů</strong>.</li>
</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Defragmentaci syst&eacute;mu souborů je možn&eacute; prov&eacute;st pouze na svazc&iacute;ch v&nbsp;syst&eacute;mu souborů <strong>Btrfs</strong>.</li>
	<li>Defragmentaci syst&eacute;mu souborů lze prov&eacute;st pouze tehdy, když je stav svazku <strong>Norm&aacute;ln&iacute;</strong>.</li>
	<li>Nevyp&iacute;nejte syst&eacute;m dř&iacute;v, než se defragmentace syst&eacute;mu souborů dokonč&iacute;. Jestliže se syst&eacute;m před dokončen&iacute;m vypne, bude nutn&eacute; defragmentaci syst&eacute;mu souborů spustit znovu ručně od zač&aacute;tku.</li>
	<li>Pokud svazek obsahuje sn&iacute;mky sd&iacute;len&yacute;ch složek, může se využit&iacute; svazku zv&yacute;&scaron;it.</li>
</ul>
</div>

<p>____<br />*K&nbsp;dispozici pouze u&nbsp;někter&yacute;ch modelů.</p>

</body>
</html>