 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Vytvořen&iacute; nov&eacute;ho fondu &uacute;loži&scaron;tě &ndash; N&aacute;pověda Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article walks you through the steps to create a Storage Pool on Synology NAS using Storage Manager.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Vytvořen&iacute; nov&eacute;ho fondu &uacute;loži&scaron;tě</h2>
<div class="section"><h4>Důležit&eacute; upozorněn&iacute;:</h4>
<ul>
	<li>Před zah&aacute;jen&iacute;m se přesvědčte, že se na disc&iacute;ch, na kter&yacute;ch dojde k&nbsp;vytvořen&iacute; fondu &uacute;loži&scaron;tě, nenach&aacute;zej&iacute; ž&aacute;dn&aacute; důležit&aacute; data. Během procesu vytv&aacute;řen&iacute; se v&scaron;echna st&aacute;vaj&iacute;c&iacute; data odstran&iacute;.</li>
	<li>Přejděte na str&aacute;nku <strong>HDD/SSD</strong> a přesvědčte se, jestli je stav v&scaron;ech disků <strong>Inicializov&aacute;no</strong> nebo <strong>Nen&iacute; inicializov&aacute;no</strong>.</li>
	<li>Aby nedoch&aacute;zelo k&nbsp;ž&aacute;dn&yacute;m probl&eacute;mům, doporučujeme použ&iacute;vat disky uveden&eacute; v&nbsp;<a href="https://www.synology.com/compatibility" target=blank>seznamu kompatibiln&iacute;ch produktů Synology</a>. Použ&iacute;v&aacute;n&iacute; nekompatibiln&iacute;ch disků může sn&iacute;žit v&yacute;kon syst&eacute;mu nebo dokonce způsobit ztr&aacute;tu dat v&nbsp;zař&iacute;zen&iacute; Synology NAS.</li>
</ul>
</div>

<h4>Vytvořen&iacute; fondu &uacute;loži&scaron;tě:</h4>
<ol>
	<li>Otevřete <strong>Spr&aacute;vce &uacute;loži&scaron;tě</strong>.</li>
	<li>Přejděte do č&aacute;sti <strong>Fond &uacute;loži&scaron;tě</strong> a klikněte na tlač&iacute;tko <strong>Vytvořit</strong>.</li>
	<li>Vyberte typ fondu &uacute;loži&scaron;tě:<ul>
			<li><strong>Lep&scaron;&iacute; v&yacute;kon</strong>: Tento typ fondu &uacute;loži&scaron;tě podporuje pouze jeden svazek, ale nab&iacute;z&iacute; lep&scaron;&iacute; v&yacute;kon.</li>
			<li><strong>Vy&scaron;&scaron;&iacute; flexibilita</strong>: Tento typ fondu &uacute;loži&scaron;tě podporuje v&iacute;ce svazků a funkce Synology Hybrid RAID (SHR) a RAID Group.</li>
		</ul>
	</li>
	<li>Konfigurace vlastnost&iacute; fondu &uacute;loži&scaron;tě:<ul>
			<li>Popis fondu &uacute;loži&scaron;tě: Popis tohoto fondu &uacute;loži&scaron;tě.</li>
			<li>Typ RAID: Různ&eacute; typy pol&iacute; RAID nab&iacute;zej&iacute; různ&eacute; &uacute;rovně ochrany dat. Dal&scaron;&iacute; informace se nach&aacute;zej&iacute; v&nbsp;č&aacute;sti <a href="general.html">Obecn&eacute;</a>.</li>
			<li>Minim&aacute;ln&iacute; počet disků ve svazku RAID: Minim&aacute;ln&iacute; počet disků požadovan&yacute; pro vybran&yacute; typ RAID.</li>
			<li>Maxim&aacute;ln&iacute; počet disků ve svazku RAID: Vy&scaron;&scaron;&iacute; počet disků ve svazku RAID zvy&scaron;uje pravděpodobnost selh&aacute;n&iacute; svazku RAID. Doporučujeme upravit počet jednotek v&nbsp;jednom svazku RAID a pomoc&iacute; skupiny RAID Group vytvořit rovnov&aacute;hu mezi zabezpečen&iacute;m dat a kapacitou fondu &uacute;loži&scaron;tě.</li>
			<li>Funkce skupiny RAID Group: Jestli je skupina RAID Group vybran&yacute;m typem svazku RAID podporovan&aacute;. Zat&iacute;mco v&nbsp;samostatn&eacute;m svazku RAID je počet disků omezen, funkce RAID Group umožňuje vytvořit blok &uacute;loži&scaron;tě skl&aacute;daj&iacute;c&iacute; se z&nbsp;v&iacute;ce svazků RAID a zvy&scaron;uje tak jeho kapacitu a redundanci disků. Skupina RAID Group je podporov&aacute;na svazky RAID 5, RAID 6 a RAID F1.</li>
		</ul>
	</li>
	<li>Pomoc&iacute; zb&yacute;vaj&iacute;c&iacute;ch kroků průvodce dokončete vytvořen&iacute; fondu &uacute;loži&scaron;tě.</li>
</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Funkce SHR (Synology Hybrid RAID) je k&nbsp;dispozici pouze u&nbsp;vybran&yacute;ch modelů. Dal&scaron;&iacute; informace se nach&aacute;zej&iacute; na <a href="https://www.synology.com/" target="_blank">webov&yacute;ch str&aacute;nk&aacute;ch Synology</a>.</li>
	<li>Maxim&aacute;ln&iacute; počet disků ve svazku RAID a funkce skupiny RAID Group jsou dostupn&eacute; pouze u vybran&yacute;ch modelů. Dal&scaron;&iacute; informace se nach&aacute;zej&iacute; na <a href="https://www.synology.com/" target="_blank">webov&yacute;ch str&aacute;nk&aacute;ch Synology</a>.</li>
	<li>Maxim&aacute;ln&iacute; počet disků ve svazku RAID lze změnit pouze v&nbsp;př&iacute;padě, že vybran&yacute; typ svazku RAID podporuje funkci RAID Group.</li>
	<li>Pokud je typem RAID fondu &uacute;loži&scaron;tě RAID 5, RAID 6, RAID F1, SHR (v&iacute;ce než tři disky) nebo SHR-2, použije syst&eacute;m na fondu &uacute;loži&scaron;tě resynchronizaci RAID, kter&yacute; zv&yacute;&scaron;&iacute; př&iacute;stupovou rychlost a zlep&scaron;&iacute; odolnost dat.</li>
</ul>
</div>

</body>
</html>