<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Fond &uacute;loži&scaron;tě</h2>

<p>Jeden nebo několik disků lze sdružit do jedn&eacute; jednotky &uacute;loži&scaron;tě, kter&aacute; se naz&yacute;v&aacute; fond &uacute;loži&scaron;tě a kterou lze chr&aacute;nit pomoc&iacute; technologie RAID. Různ&eacute; typy pol&iacute; RAID nab&iacute;zej&iacute; různ&eacute; &uacute;rovně ochrany dat. Obecn&yacute; seznam typů RAID podporovan&yacute;ch zař&iacute;zen&iacute;m Synology NAS se nach&aacute;z&iacute; v&nbsp;č&aacute;sti <a href="general.html">Obecn&eacute;</a>. Po vytvořen&iacute; fondu &uacute;loži&scaron;tě v&nbsp;něm lze vytvořit jeden nebo několik svazků. Svazek je jednotka &uacute;loži&scaron;tě dat a pokud přidružen&yacute; fond &uacute;loži&scaron;tě obsahuje přiděliteln&yacute; prostor, lze svazek roz&scaron;&iacute;řit. Před zah&aacute;jen&iacute;m ukl&aacute;d&aacute;n&iacute; dat do zař&iacute;zen&iacute; Synology NAS je nutn&eacute; vytvořit alespoň jeden svazek.</p>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Aby nedoch&aacute;zelo k&nbsp;ž&aacute;dn&yacute;m probl&eacute;mům s&nbsp;kompatibilitou, doporučujeme použ&iacute;vat disky uveden&eacute; v&nbsp;<a href="https://www.synology.com/compatibility?search_by=category&category=hdds&p=1" target=blank>seznamu kompatibiln&iacute;ch produktů Synology</a>. Použ&iacute;v&aacute;n&iacute; nekompatibiln&iacute;ch disků může sn&iacute;žit v&yacute;kon syst&eacute;mu a dokonce způsobit ztr&aacute;tu dat.</li>
	<li>Fond &uacute;loži&scaron;tě se mus&iacute; skl&aacute;dat z&nbsp;disků stejn&eacute;ho typu. Fond &uacute;loži&scaron;tě tedy nelze vytvořit z&nbsp;kombinace disků SATA a SAS.</li>
	<li>U&nbsp;modelů Synology NAS podporuj&iacute;c&iacute;ch skupinu RAID Group mohou fondy &uacute;loži&scaron;tě <b>RAID 5</b>, <b>RAID 6</b> nebo <b>RAID F1</b> s&nbsp;podporou v&iacute;ce svazků obsahovat v&iacute;ce <b>pol&iacute; RAID</b>. Každ&eacute; pole RAID patř&iacute;c&iacute; do stejn&eacute;ho fondu &uacute;loži&scaron;tě bude m&iacute;t stejn&yacute; typ RAID (např. RAID 5 nebo RAID 6 nebo RAID F1). Maxim&aacute;ln&iacute; počet disků u&nbsp;každ&eacute;ho pole RAID může b&yacute;t 6, 12 nebo 24. Maxim&aacute;ln&iacute; počet disků je možn&eacute; nastavit při vytv&aacute;řen&iacute; fondu &uacute;loži&scaron;tě a později tento počet nelze změnit. Když byl do pole RAID přiřazen maxim&aacute;ln&iacute; počet disků, může se dal&scaron;&iacute; disk přidan&yacute; do fondu &uacute;loži&scaron;tě přiřadit do nov&eacute;ho pole RAID. Nov&eacute; pole RAID mus&iacute; obsahovat minim&aacute;ln&iacute; počet disků nutn&yacute; pro dan&yacute; typ RAID (tj. tři disky u&nbsp;svazku RAID 5 a RAID F1 a čtyři disky u&nbsp;svazku RAID 6).</li>
	<li>Chcete-li k&nbsp;vytvořen&iacute; fondu &uacute;loži&scaron;tě použ&iacute;t určit&yacute; disk, ale tento disk se nezobrazil v&nbsp;č&aacute;sti <strong>Průvodce vytvořen&iacute;m fondu &uacute;loži&scaron;tě</strong>, přejděte na str&aacute;nku <strong>HDD/SSD</strong> a zkontrolujte stav disku.</li>
</ul>
</div>

</body>
</html>


	