 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Vytvořen&iacute; svazku&nbsp;&ndash; N&aacute;pověda Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article walks you through the steps to create a volume on Synology NAS using Storage Manager.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Vytvořen&iacute; svazku</h2>

<p>Jelikož se svazek vytv&aacute;ř&iacute; ve fondu &uacute;loži&scaron;tě, mus&iacute;te vytvořit nejprve fond &uacute;loži&scaron;tě a teprve pot&eacute; svazek. Pokud ale v&aacute;&scaron; model podporuje režim rychl&eacute;ho vytvořen&iacute;, můžete vytvořit svazek a fond &uacute;loži&scaron;tě současně a průvodce vytvořen&iacute;m svazku provede automatickou optimalizaci kapacity a v&yacute;konu &uacute;loži&scaron;tě, aniž byste se museli starat o&nbsp;technick&eacute; z&aacute;ležitosti. Režim rychl&eacute;ho vytvořen&iacute; je dostupn&yacute; pouze u&nbsp;modelů podporuj&iacute;c&iacute;ch funkci SHR (Synology Hybrid RAID). Dal&scaron;&iacute; informace se nach&aacute;zej&iacute; na <a href="https://www.synology.com/" target="_blank">webov&yacute;ch str&aacute;nk&aacute;ch Synology</a>.</p>
		
<h4>Vytvořen&iacute; svazku na modelech podporuj&iacute;c&iacute;ch režim rychl&eacute;ho vytvořen&iacute;:</h4>
<p>Současně lze vytvořit svazek i fond &uacute;loži&scaron;tě. Při vytv&aacute;řen&iacute; nov&eacute;ho svazku si můžete vybrat jeden z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch způsobů:</p>

<ul>
	  <li><b>Rychl&eacute;</b>: Toto je nejlep&scaron;&iacute; možnost pro zač&aacute;tečn&iacute;ky. Tento režim zvolte, pokud chcete automaticky optimalizovat kapacitu a v&yacute;kon &uacute;loži&scaron;tě, aniž byste se museli starat o&nbsp;technick&eacute; z&aacute;ležitosti, např. typy RAID.</li>
		<li><b>Vlastn&iacute;</b>: Pro uživatele, kteř&iacute; chtěj&iacute; konfigurovat roz&scaron;&iacute;řen&eacute; možnosti vytv&aacute;řen&iacute; svazku, např&iacute;klad typy RAID a přidělen&iacute; kapacity. (postup konfigurace fondu &uacute;loži&scaron;tě se nach&aacute;z&iacute; <a href="storage_pool_create_storage_pool.html">pod t&iacute;mto odkazem</a>.)</li>
</ul>

<p>Pomoc&iacute; n&iacute;že uveden&yacute;ch kroků můžete vytvořit svazek v&nbsp;režimu rychl&eacute;ho vytvořen&iacute;.</p>
	<ol>
		<li>Otevřete <b>Spr&aacute;vce &uacute;loži&scaron;tě</b>.</li><img style="display:none;" src="../../../online_img/common/open_storagemanager.png" class="help_image" /><li>Přejděte do č&aacute;sti <b>Svazek</b> a klikněte na možnost <b>Vytvořit</b>.</li><img style="display:none;" src="../../../online_img/dsm/StorageManager/volume_create_volume/volume_create.png" class="help_image" /><li>Zobraz&iacute; se průvodce vytvořen&iacute;m svazku. Podle sv&yacute;ch potřeb vyberte možnost <strong>Rychl&yacute;</strong> nebo <strong>Vlastn&iacute;</strong>. Pot&eacute; dokončete vytvořen&iacute; svazku podle pokynů v&nbsp;průvodci.</li><img style="display:none;" src="../../../online_img/dsm/StorageManager/volume_create_volume/choose_mode.png" class="help_image" /></ol>
	
<h4><a name="fast_mode"></a>Vytvořen&iacute; svazku na jin&yacute;ch modelech:</h4>
<ol>
	<li>Přesvědčte se, že zař&iacute;zen&iacute; Synology NAS obsahuje fond &uacute;loži&scaron;tě s&nbsp;přiděliteln&yacute;m prostorem.</li>
	<li>Klikněte na tlač&iacute;tko <strong>Vytvořit</strong>.</li>
	<li>Vyberte fond &uacute;loži&scaron;tě, ve kter&eacute;m bude nov&yacute; svazek vytvořen.</li>
	<li>Nastavte velikost přidělen&iacute; svazku.</li>
    <li>Nastaven&iacute; potvrďte kliknut&iacute;m na možnost <strong>Použ&iacute;t</strong>.</li>
</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul>
	<li>Pokud při vytv&aacute;řen&iacute; fondu &uacute;loži&scaron;tě vyberete jako typ fondu &uacute;loži&scaron;tě možnost <strong>Lep&scaron;&iacute; v&yacute;kon</strong>, nemůžete nastavit velikost přidělen&iacute; u svazků vytvořen&yacute;ch v&nbsp;tomto fondu &uacute;loži&scaron;tě.</li>
	<li>Maxim&aacute;ln&iacute; velikost svazku se na jednotliv&yacute;ch modelech li&scaron;&iacute;. Podrobnosti se nach&aacute;zej&iacute; ve specifikac&iacute;ch modelů.</li>
	<li>Minim&aacute;ln&iacute; velikost přidělen&aacute; na svazku mus&iacute; b&yacute;t alespoň 10&nbsp;GB.</li>
    <li>Svazek Btrfs bude rezervovat 5&nbsp;% prostoru na metadata.</li>
</ul>
</div>
	

</body>
</html>
