<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>High Availability</title>


 </head>
 <body>
<h2>Depolama Durumu</h2>
	<p>Bu sayfa high-availability k&uuml;mesinin aktif ve pasif sunucularındaki depolama birimlerinin ve iSCSI LUN'ların (Blok-Seviyesi) durumuna ilişkin ayrıntıları g&ouml;r&uuml;nt&uuml;ler.</p>
    <p>Aktif ve pasif sunuculardaki ilgili birimlerin ve iSCSI LUN'ların (Blok-Seviyesi) kapasitesi ve yapılandırmalarının benzer olması gerektiğinden, iki sunucu &uuml;zerindeki birimler ve iSCSI LUN (Blok-Seviyesi) birlikte tek &uuml;niteler halinde g&ouml;r&uuml;nt&uuml;lenir. Dolayısıyla, aktif ve pasif sunuculardaki birimlerin ve iSCSI LUN'ların (Blok-Seviyesi) durumunu g&ouml;r&uuml;nt&uuml;lemek isterseniz, <b>Depolama Durumu</b> sayfasına gitmeniz gerekir [bir high-availability k&uuml;mesine erişirken, <b>Depolama Y&ouml;neticisi</b>'nde sadece aktif sunucudaki birimler ve iSCSI LUN'lar g&ouml;r&uuml;nt&uuml;lenebilir].</p>

    <p>Bu sayfa aşağıdaki bilgileri i&ccedil;erir:</p>
		<ul>
			<li><b>İsim:</b> Birimlerin ve iSCSI LUN'ların (Blok-Seviyesi) adlarını g&ouml;r&uuml;nt&uuml;ler.</li>
			<li><b>Kullanılan:</b> Birimlerin ve iSCSI LUN'ların (Blok-Seviyesi) kullanılan kapasite y&uuml;zdesini g&ouml;r&uuml;nt&uuml;ler.</li>
			<li><b>Kullanılan/Toplam Boyut:</b>  Birimlerin ve iSCSI LUN'ların (Blok-Seviyesi) toplam ve kullanılan kapasitesini g&ouml;r&uuml;nt&uuml;ler.</li>
            <li><b>Durum:</b> Birimlerin, iSCSI LUN'ların (Blok-Seviyesi) ve SSD &ouml;nbelleklerin durumunu g&ouml;r&uuml;nt&uuml;ler.</li>
            <li><b>A&ccedil;ıklama:</b> Birime, iSCSI LUN'a (Blok-Seviyesi) ve SSD &ouml;nbelleğe ait hataları ve diğer bilgileri g&ouml;r&uuml;nt&uuml;ler.</li>
		</ul>
<h4>Arızalı bir birim veya iSCSI LUN (Blok-Seviyesi) onarımı i&ccedil;in:</h4>
	<ul>
		<li>Sunuculardan bir tanesindeki bir sabit disk &ccedil;&ouml;km&uuml;şse, hangi sabit diskin &ccedil;&ouml;kt&uuml;ğ&uuml;n&uuml; ve değiştirilmesi gerektiğini belirlemek i&ccedil;in <a href="disk.html">Disk Durumu</a> sayfasına gidebilirsiniz. Bu durumda, l&uuml;tfen aşağıdakini yapın:
        	<ol>
            	<li>&Ccedil;&ouml;km&uuml;ş sabit diski değiştirin (sabit disk kurulumu hakkındaki adımlar i&ccedil;in, l&uuml;tfen Synology &uuml;r&uuml;n&uuml;n&uuml;ze ait <i>Hızlı Kurulum Kılavuzu</i>'na bakın).</li>
                <li><b>Depolama Durumu</b> sayfasına gidin ve <b>Onar</b>'a tıklayın.</li>
            </ol>
        </li>
        <li>Pasif sunucu &ccedil;evrimdışı ise, birimlerin ve iSCSI LUN'ların (Blok-Seviyesi) durumu bir hata oluştuğunu g&ouml;sterir ve pasif sunucudaki disklerin her biri Disk Durumu sayfasında g&ouml;r&uuml;n&uuml;r. Bu durumda, aşağıdakileri yaparak sorunu &ccedil;&ouml;zmeyi deneyebilirsiniz:
        	<ol>
            	<li>Pasif sunucunun a&ccedil;ık olduğundan emin olun.</li>
                <li>T&uuml;m g&uuml;&ccedil; kaynaklarını kontrol edin.</li>
                <li>T&uuml;m bağlantıları inceleyin.</li>
            </ol>
        </li>
        <li>Sunuculardan bir tanesindeki bir birimde veya iSCSI LUN'da (Blok-Seviyesi) bir dosya sistemi hatası olması durumunda, l&uuml;tfen aşağıdakileri yapın:
        	<ul>
            	<li><b>Depolama Durumu</b> sayfasına gidin.</li>
                <li><b>Onar</b> &uuml;zerine tıklayın.</li>
            </ul>
        </li>
	</ul>

<p><span class="note_head">Not:</span>  High-availability k&uuml;mesindeki birimlerin ve iSCSI LUN'ların (Blok-Seviyesi) limiti 64'dir.</p>



<h3>&Ccedil;oğunluk Sunucusu</h3>
<p>&Ccedil;oğunluk sunucuları b&ouml;l&uuml;nm&uuml;ş beyin hataları olasılığını azaltmaya yardımcı olabilirler. B&ouml;l&uuml;nm&uuml;ş beyin ayarlarında, s&uuml;rekli olarak hem aktif hem de pasif sunuculara bağlandığı s&uuml;rece başka bir sunucuyu &ccedil;oğunluk sunucusu olarak atayabilirsiniz. &Ouml;rneğin, bir ağ ge&ccedil;idi sunucusu ya da DNS sunucusu &ccedil;oğunluk sunucusu i&ccedil;in uygun bir tercihtir zira hem aktif hem de pasif sunuculara bağlanabilir. &Ccedil;oğunluk sunucusunun sadece Ping hizmetleri vereceğine ve kurulması gereken hi&ccedil;bir uygulamanın olmadığına l&uuml;tfen dikkat edin. Aşağıda &ccedil;oğunluk sunucusu etkinleştirildiğinde takip edecek durumlar vardır:</p>

<ul>
<li>Pasif sunucu hem aktif hem de &ccedil;oğunluk sunucularına bağlanamazsa, &uuml;stlenme b&ouml;l&uuml;nm&uuml;ş beyin hatalarını &ouml;nlemek i&ccedil;in yapılmaz.</li>
<li>Aktif sunucu, pasif sunucu bağlanabiliyorken &ccedil;oğunluk sunucusuna bağlanamazsa, daha iyi kullanılabilirliği sağlamak &uuml;zere ge&ccedil;iş tetiklenir.</li>
</ul>

 </body>
</html>
