<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" charset="utf-8">
<title>Centro de registros</title>

<link href="../../../../help/help.css" type="text/css" rel="stylesheet" />
<link href="../../../../help/scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../../../help/scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../../../help/scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Configuraci&oacute;n de archivo</h2>

<p>La p&aacute;gina de <strong>Configuraci&oacute;n de archivo</strong> ofrece opciones para configurar c&oacute;mo y d&oacute;nde se archivan los registros recibidos por el Centro de registros. Utilice las opciones siguientes para especificar la ubicaci&oacute;n de almacenamiento y las reglas para crear archivos de registros autom&aacute;ticamente.</p>


<h3>Destino de almacenamiento para archivos</h3>

<p>El destino se refiere a la carpeta donde se almacenan y archivan los registros recibidos por el Centro de registros. Haga clic en <strong>Seleccionar ubicaci&oacute;n</strong> para elegir la carpeta.</p>
<p>Si desea que los registros locales de Synology NAS se archiven en el mismo destino, marque la casilla designada <strong>Archivar registros locales en la ubicaci&oacute;n de almacenamiento especificada anteriormente</strong>. En la mayor&iacute;a de casos, esto proporciona m&aacute;s espacio de almacenamiento para los registros locales, lo que le permite mantener un sistema de registros m&aacute;s completo.</p><!--DSM#61793: Describe how logs are archived in data volume--><div class="section">
<h4>Observaci&oacute;n:</h4>
<p>Los registros locales (registros de sistema, de conexi&oacute;n y de transferencia de archivos) se guardan en una partici&oacute;n del sistema que tiene un almacenamiento limitado. Cuando se habilita <strong>Archivar los registros locales a la ubicaci&oacute;n de almacenamiento indicada anteriormente</strong>, todos los registros se archivan en el destino indicado de acuerdo con las <strong>Reglas de archivo</strong>. Para examinar los registros locales, haga clic en <strong>Abrir archivo de registros</strong> y seleccione <strong>SYNOSYSLOGDB__LOCALARCH.DB</strong>.</p>
</div>


<h3>Reglas de archivo</h3>

<p>Los registros se archivan autom&aacute;ticamente seg&uacute;n los criterios definidos en la secci&oacute;n de <strong>Reglas de archivo</strong>. Los registros se pueden archivar autom&aacute;ticamente cuando el tama&ntilde;o de la base de datos de registros alcance un tama&ntilde;o especificado, el n&uacute;mero de registros individuales alcance un n&uacute;mero espec&iacute;fico o los registros alcancen una antig&uuml;edad espec&iacute;fica.</p>
   
<P>Si no habilit&oacute; la funci&oacute;n del archivo de registro, el registro anterior se eliminar&aacute; cuando el registro acumulado exceda el n&uacute;mero de registro m&aacute;ximo que se puede conservar de la base de datos del registro. Consulte la tabla siguiente para ver los n&uacute;meros de registro m&aacute;ximos que se pueden conservar de cada protocolo.</P> 
    
<table>
     <tr>
      <th width="40%">Protocolo</th>
      <th width="60%">Registro m&aacute;ximo que se puede conservar</th>
     </tr>
     <tr>
      <td align="center"><strong>AFP</strong></td>
      <td align="center">20.000</td>
     </tr>
     <tr>
      <td align="center"><strong>File Station</strong></td>
	  <td align="center">20.000</td>
     </tr>
     <tr>
      <td align="center"><strong>FTP</strong></td>
	  <td align="center">20.000</td>
     </tr>
     <tr>
      <td align="center"><strong>SMB</strong></td>
      <td align="center">100.000</td>
     </tr>
     <tr>
      <td align="center"><strong>WebDAV</strong></td>
      <td align="center">20.000</td>
     </tr>
    </table>    

<h3>Formato de archivo</h3>
<p>Esta secci&oacute;n incluye las siguientes opciones.</p>
<ul>
<li><strong>Archivar registros con formato de texto adem&aacute;s del formato predeterminado:</strong> Guarda archivos como archivos de solo texto, adem&aacute;s de los archivos SQLite predeterminados.</li>
<li><strong>Comprimir registros de archivos:</strong> Guarda archivos de registros como archivos comprimidos en formato ZIP.</li>
<li><strong>Archivar registros de manera separada seg&uacute;n el dispositivo:</strong> Guarda archivos separados para dispositivos cliente individuales que env&iacute;an registros a Synology NAS.</li>
</ul>

</body>
