<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Centre des journaux</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Journaux</h2>
<p>Sur la page <strong>Centre des journaux</strong> &gt; <strong>Journaux</strong>, vous pouvez voir, rechercher et exporter des journaux. </p>

<h4>Pour rechercher des journaux&nbsp;:</h4>

<ol>
<li>Dans le menu d&eacute;roulant de recherche, vous pouvez sp&eacute;cifier les crit&egrave;res suivants selon la situation&nbsp;:
  <ul>
  <li><b>Mot-cl&eacute; </b>: Saisissez un mot cl&eacute; pour rechercher les messages de journal contenant le mot cl&eacute; correspondant.
  	<div class="section">
    <h4>Remarque&nbsp;:</h4>
    <p>Vous pouvez utiliser les caract&egrave;res de remplacement et les op&eacute;rateurs suivants pour une recherche avanc&eacute;e&nbsp;:</p>
    <ul>
      <li>[<span class="note_head">*</span>]&nbsp;: le caract&egrave;re de remplacement repr&eacute;sente z&eacute;ro caract&egrave;re (ou plus), diff&eacute;rent de l'espace. Par exemple, [a*n] peut repr&eacute;senter un mot commen&ccedil;ant par [a] et se terminant par [n], tel que [<span class="note_head">a</span>ctio<span class="note_head">n</span>], [<span class="note_head">a</span>ttentio<span class="note_head">n</span>] ou [<span class="note_head">an</span>].</li>
      <li>[<span class="note_head">?</span>]&nbsp;: le caract&egrave;re de remplacement repr&eacute;sente exactement un caract&egrave;re diff&eacute;rent de l'espace. Par exemple, [ca?] peut repr&eacute;senter un mot commen&ccedil;ant par [ca] et se terminant par un seul caract&egrave;re, tel que [<span class="note_head">ca</span>r], [<span class="note_head">ca</span>t] ou [<span class="note_head">ca</span>p].</li>
      <li>[<span class="note_head">AND</span>]&nbsp;: L'op&eacute;rateur affiche les r&eacute;sultats qui comprennent tous les termes de la recherche. Par exemple&nbsp;: [admin AND root] affiche les r&eacute;sultats du journal qui comprennent &agrave; la fois [admin] et [root].</li>
      <li>[<span class="note_head">OR</span>]&nbsp;: L'op&eacute;rateur affiche les r&eacute;sultats qui comprennent un des termes de la recherche. Par exemple, [admin OR root] affiche les r&eacute;sultats qui contiennent [admin] ou [root].</li>
      <li>[<span class="note_head">NOT</span>]&nbsp;: L'op&eacute;rateur exclut des mots de votre recherche. Par exemple, [NOT admin] affiche les r&eacute;sultats qui ne comprennent pas [admin].</li>
      <li>[<span class="note_head">()</span>]&nbsp;: les parenth&egrave;ses entourent les termes de recherche afin de sp&eacute;cifier l'ordre dans lequel ils sont interpr&eacute;t&eacute;s si AND et OR sont tous deux utilis&eacute;s. Par exemple, [(admin OR root) AND NOT logged] affiche les r&eacute;sultats qui comprennent [admin] ou [root], mais ne comprennent pas [logged].  </li>
  </ul>
    </div>
  </li>
  <li><strong>Plage de date&nbsp;: </strong>Recherche les journaux selon la p&eacute;riode sp&eacute;cifi&eacute;e.
  <li><b>Niveau </b>: Recherche les journaux selon le niveau sp&eacute;cifi&eacute;.</li>
  <li><b>Nom d'h&ocirc;te </b>: Recherche les journaux selon le nom d'h&ocirc;te sp&eacute;cifi&eacute;.</li>
  <li><b>Programme </b>: Recherche les journaux selon le nom de programme sp&eacute;cifi&eacute;.</li>
  <li><b>Cat&eacute;gorie </b>: Recherche les journaux selon le nom de cat&eacute;gorie sp&eacute;cifi&eacute;.</li>
  </ul>
<li>Cliquez sur <strong>Recherche</strong> pour rechercher les journaux correspondant aux crit&egrave;res sp&eacute;cifi&eacute;s.</li>
</ol>

<h4>Pour exporter des journaux&nbsp;:</h4>

<ol>
<li>Cliquez sur la fl&egrave;che &agrave; c&ocirc;t&eacute; du bouton <strong>Export</strong>.</li>
<li>Choisissez <strong>HTML</strong> ou <strong>CSV</strong> pour t&eacute;l&eacute;charger les journaux &agrave; l'aide du format d&eacute;sir&eacute;.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Le cryptage des caract&egrave;res des fichiers journaux export&eacute;s CSV est UTF-8. Vous devez ouvrir le fichier avec un programme qui prend en charge le cryptage UTF-8. </li>
</ul>
</div>

</body></html>
