<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>DSM mobile</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>DSM mobile</h1>

<p>Aplikace DSM mobile umožňuje uživateli <strong>admin</strong> v&nbsp;syst&eacute;mu DSM (nebo uživateli patř&iacute;c&iacute;mu do skupiny <strong>administrators</strong>) spravovat nastaven&iacute; syst&eacute;mu DSM a kontrolovat informace o syst&eacute;mu DSM pomoc&iacute; zař&iacute;zen&iacute; se syst&eacute;mem iOS<sup>®</sup> (iPhone<sup>®</sup>, iPad<sup>®</sup> nebo iPod touch<sup>®</sup>) nebo Android<sup>®</sup>. Tato n&aacute;pověda k&nbsp;aplikaci DSM mobile obsahuje n&aacute;sleduj&iacute;c&iacute; t&eacute;mata a zdroje, kter&eacute; v&aacute;m pomohou s&nbsp;prvn&iacute;mi kroky.</p>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Aktu&aacute;lně podporovan&aacute; mobiln&iacute; zař&iacute;zen&iacute; a prohl&iacute;žeče:</p>
	<ul>
		<li>Mobiln&iacute; zař&iacute;zen&iacute;: iPhone, iPad a iPod se syst&eacute;mem iOS 10 nebo nověj&scaron;&iacute;m; zař&iacute;zen&iacute; se syst&eacute;mem Android 6.0 nebo nověj&scaron;&iacute;m</li>
		<li>Prohl&iacute;žeče: Chrome, Safari</li>
	</ul>
</div>

<h2>Přihl&aacute;&scaron;en&iacute; a&nbsp;odhl&aacute;&scaron;en&iacute;</h2>

<div name="contents" id="login">
<p>Po připojen&iacute; k&nbsp;syst&eacute;mu DSM s&nbsp;webov&yacute;m prohl&iacute;žečem v&nbsp;zař&iacute;zen&iacute; se syst&eacute;mem iOS nebo Android uvid&iacute;te přihla&scaron;ovac&iacute; obrazovku, na kter&eacute; můžete zadat &uacute;daje va&scaron;eho &uacute;čtu v&nbsp;syst&eacute;mu DSM.</p>

<h4>Přihl&aacute;&scaron;en&iacute; do aplikace DSM mobile:</h4>
<p>Zadejte přihla&scaron;ovac&iacute; &uacute;daje syst&eacute;mu DSM a klepněte na možnost <strong>Přihl&aacute;sit</strong>. Pokud chcete přihla&scaron;ovac&iacute; &uacute;daje uložit a př&iacute;&scaron;tě se přihl&aacute;sit automaticky, zapněte před přihl&aacute;&scaron;en&iacute;m přep&iacute;nač <strong>Pamatovat</strong>.</p>

<h4>Odhl&aacute;&scaron;en&iacute; z&nbsp;aplikace DSM mobile:</h4>
<ol>
  <li>Klepněte na tlač&iacute;tko možnost&iacute; v&nbsp;prav&eacute;m horn&iacute;m rohu &uacute;vodn&iacute; str&aacute;nky (zař&iacute;zen&iacute; iPhone / iPod touch nebo telefon se syst&eacute;mem Android) nebo lev&eacute;ho panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android).</li>
  <li>Klepněte na možnost <strong>Nastaven&iacute;</strong> a klepněte na možnost <strong>Odhl&aacute;sit</strong>.</li>
</ol>
</div>

<h2>Spr&aacute;va uživatelů syst&eacute;mu DSM</h2>

<div name="contents" id="user">
<p>Klepnut&iacute;m na možnost <strong>Uživatel a skupina</strong> na &uacute;vodn&iacute; str&aacute;nce (zař&iacute;zen&iacute; iPhone / iPod touch nebo telefon se syst&eacute;mem Android) nebo v&nbsp;lev&eacute;m panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android) zobraz&iacute;te seznam uživatelů.</p>

<h4>Vytvořen&iacute; uživatele:</h4>
<ol>
  <li>Klepněte na symbol <strong>+</strong> a potom zadejte uživatelsk&eacute; jm&eacute;no, heslo a e-mailovou adresu nov&eacute;ho uživatele.</li>
  <li>Pokud povol&iacute;te možnost <strong>Odeslat upozorněn&iacute;</strong>, ode&scaron;le se po vytvořen&iacute; uživatelsk&eacute;ho &uacute;čtu v&nbsp;syst&eacute;mu DSM na e-mailovou adresu uživatele zpr&aacute;va s&nbsp;upozorněn&iacute;m.<br><span class="note_head">Pozn&aacute;mka: </span>Před odesl&aacute;n&iacute;m upozorněn&iacute; se ujistěte, že byla v&nbsp;zař&iacute;zen&iacute; Synology NAS vyplněna nastaven&iacute; upozorněn&iacute;. Pokud chcete změnit nastaven&iacute;, přihlaste se do vyd&aacute;n&iacute; syst&eacute;mu DSM pro stoln&iacute; poč&iacute;tače pomoc&iacute; webov&eacute;ho prohl&iacute;žeče v&nbsp;poč&iacute;tači a přejděte do č&aacute;sti <strong>Hlavn&iacute; nab&iacute;dka</strong> &gt; <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Upozorněn&iacute;</strong> &gt; <strong>E-mail</strong>.</li>
  <li>Klepnut&iacute;m na možnost <strong>Hotovo</strong> nastaven&iacute; potvrďte nebo klepnut&iacute;m na &scaron;ipku vlevo nastaven&iacute; zru&scaron;te.</li>
</ol>

<h4>Rychl&eacute; nalezen&iacute; uživatele:</h4>
<p>Zadejte jm&eacute;no uživatele do pole hled&aacute;n&iacute;.</p>

<h4>&Uacute;prava &uacute;dajů uživatele:</h4>
<ol>
  <li>Klepněte na jm&eacute;no uživatele a proveďte toto:<ul>
      <li>Změňte jm&eacute;no nebo heslo uživatele v&nbsp;pol&iacute;ch <strong>Jm&eacute;no</strong> a <strong>Heslo</strong>.</li>
    <li>Uživatele zak&aacute;žete zapnut&iacute;m možnosti <strong>Zak&aacute;zat</strong>. Uživatele je možn&eacute; povolit později, aniž by do&scaron;lo ke ztr&aacute;tě jejich nastaven&iacute;.</li>
    <li>Pokud chcete přidat uživatele do skupiny <strong>admin</strong>, zapněte možnost <strong>Administrator</strong>. V&scaron;ichni uživatel&eacute; patř&iacute;c&iacute; do skupiny <strong>admin</strong> budou m&iacute;t opr&aacute;vněn&iacute; spr&aacute;vce k&nbsp;&uacute;pravě nastaven&iacute; syst&eacute;mu DSM pomoc&iacute; aplikace DSM mobile nebo přes webov&yacute; prohl&iacute;žeč v&nbsp;poč&iacute;tači.</li>
    </ul>
  </li>
  <li>V&nbsp;č&aacute;sti <strong>Opr&aacute;vněn&iacute;</strong> proveďte libovoln&yacute; z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch postupů a pot&eacute; klepněte na možnost <strong>Zpět</strong>:<ul>
      <li>Klepněte na možnost <strong>Sd&iacute;len&aacute; složka</strong> a klepnut&iacute;m na n&aacute;zev sd&iacute;len&eacute; složky upravte př&iacute;stupov&aacute; opr&aacute;vněn&iacute; uživatele: <strong>Čten&iacute;/z&aacute;pis</strong>: Uživatel může měnit soubory a podsložky sd&iacute;len&eacute; složky; <strong>Jen pro čten&iacute;</strong>: Uživatel m&aacute; př&iacute;stup k&nbsp;souborům a podsložk&aacute;m sd&iacute;len&eacute; složky, ale nemůže v&nbsp;nich prov&aacute;dět změny; <strong>Ž&aacute;dn&yacute; př&iacute;stup</strong>: Uživatel nem&aacute; př&iacute;stup k&nbsp;souborům a podsložk&aacute;m ve sd&iacute;len&eacute; složce.<br><span class="note_head">Pozn&aacute;mka: </span>V&nbsp;př&iacute;padě konfliktu opr&aacute;vněn&iacute; je priorita opr&aacute;vněn&iacute; n&aacute;sleduj&iacute;c&iacute;: <span class="note_content">Ž&aacute;dn&yacute; př&iacute;stup &gt; Čten&iacute;/z&aacute;pis &gt; Jen pro čten&iacute;</span>.</li>
      <li>Pokud chcete změnit př&iacute;stupov&aacute; opr&aacute;vněn&iacute; uživatele k&nbsp;aplikac&iacute;m syst&eacute;mu DSM, klepněte na možnost <strong>Aplikace</strong>.</li>
    </ul>
  </li>
  <li>Klepnut&iacute;m na možnost <strong>Hotovo</strong> nastaven&iacute; potvrďte nebo klepnut&iacute;m na &scaron;ipku vlevo nastaven&iacute; zru&scaron;te.</li>
</ol>
</div>

<h2>Spr&aacute;va sd&iacute;len&yacute;ch složek</h2>

<div name="contents" id="shared">
<p>Klepnut&iacute;m na možnost <strong>Sd&iacute;len&aacute; složka</strong> na &uacute;vodn&iacute; str&aacute;nce (zař&iacute;zen&iacute; iPhone / iPod touch nebo telefon se syst&eacute;mem Android) nebo v&nbsp;lev&eacute;m panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android) zobraz&iacute;te seznam sd&iacute;len&yacute;ch složek v&nbsp;zař&iacute;zen&iacute; Synology NAS.</p>

<h4>Vytvořen&iacute; sd&iacute;len&eacute; složky:</h4>
<ol>
  <li>Klepněte na symbol <strong>+</strong> a potom zadejte n&aacute;zev nov&eacute; složky.</li>
  <li>Klepnut&iacute;m na možnost <strong>Hotovo</strong> nastaven&iacute; potvrďte nebo klepnut&iacute;m na &scaron;ipku vlevo nastaven&iacute; zru&scaron;te.</li>
</ol>

<h4>&Uacute;prava sd&iacute;len&eacute; složky:</h4>
<p>Klepněte na n&aacute;zev sd&iacute;len&eacute; složky a proveďte toto:</p>
<ul>
  <li>Změňte n&aacute;zev sd&iacute;len&eacute; složky v&nbsp;poli <strong>N&aacute;zev</strong>.</li>
  <li>Klepněte na možnost <strong>Opr&aacute;vněn&iacute; uživatele</strong>. Po klepnut&iacute; na uživatele budete moci změnit př&iacute;stupov&aacute; opr&aacute;vněn&iacute; uživatele ke sd&iacute;len&eacute; složce: <strong>Čten&iacute;/z&aacute;pis</strong>: Uživatel může měnit soubory a podsložky sd&iacute;len&eacute; složky; <strong>Jen pro čten&iacute;</strong>: Uživatel m&aacute; př&iacute;stup k&nbsp;souborům a podsložk&aacute;m sd&iacute;len&eacute; složky, ale nemůže v&nbsp;nich prov&aacute;dět změny; <strong>Ž&aacute;dn&yacute; př&iacute;stup</strong>: Uživatel nem&aacute; př&iacute;stup k&nbsp;souborům a podsložk&aacute;m ve sd&iacute;len&eacute; složce.<br><span class="note_head">Pozn&aacute;mka: </span>V&nbsp;př&iacute;padě konfliktu opr&aacute;vněn&iacute; je priorita opr&aacute;vněn&iacute; n&aacute;sleduj&iacute;c&iacute;: <span class="note_content">Ž&aacute;dn&yacute; př&iacute;stup &gt; Čten&iacute;/z&aacute;pis &gt; Jen pro čten&iacute;</span>.</li>
  <li>Můžete tak&eacute; klepnout na možnost <strong>Opr&aacute;vněn&iacute; skupiny</strong> a nakonfigurovat opr&aacute;vněn&iacute; pro skupiny.<br><span class="note_head">Pozn&aacute;mka: </span>Opr&aacute;vněn&iacute; skupiny maj&iacute; vy&scaron;&scaron;&iacute; prioritu než opr&aacute;vněn&iacute; uživatele.</li>
</ul>
</div>

<h2>Povolen&iacute; služeb</h2>

<div name="contents" id="services">
<p>Klepnut&iacute;m na možnost <strong>Služba</strong> na &uacute;vodn&iacute; str&aacute;nce (zař&iacute;zen&iacute; iPhone / iPod touch nebo telefon se syst&eacute;mem Android) nebo v&nbsp;lev&eacute;m panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android) je možn&eacute; zapnout nebo vypnout služby zař&iacute;zen&iacute; Synology NAS.</p>

<h4>Spr&aacute;va s&iacute;ťov&yacute;ch služeb zař&iacute;zen&iacute; Synology NAS:</h4>
<ul>
  <li>Zapněte nebo vypněte n&aacute;sleduj&iacute;c&iacute; služby:<ul>
      <li><strong>Protokol AFP</strong> umožňuje zař&iacute;zen&iacute; Synology NAS fungovat v&nbsp;m&iacute;stn&iacute; s&iacute;ti jako souborov&yacute; server Mac.</li>
		<li><strong>Přenos tisk&aacute;rny Bonjour</strong> umožňuje klientům se syst&eacute;mem Mac tisknout na tisk&aacute;rn&aacute;ch USB připojen&yacute;ch k&nbsp;zař&iacute;zen&iacute; Synology NAS.</li>
		<li><strong>Služba NFS</strong> umožňuje klientům syst&eacute;mu Linux v&nbsp;m&iacute;stn&iacute; s&iacute;ti př&iacute;stup k&nbsp;datům v&nbsp;zař&iacute;zen&iacute; Synology NAS.</li>
      <li><strong>Protokol SMB</strong> umožňuje klientům se syst&eacute;mem Windows, Mac a Linux s&nbsp;podporou protokolu SMB/CIFS př&iacute;stup k&nbsp;datům uložen&yacute;m v&nbsp;zař&iacute;zen&iacute; Synology NAS v&nbsp;r&aacute;mci m&iacute;stn&iacute; s&iacute;tě.</li>
      <li><strong>Protokol SSH/Telnet</strong> umožňuje zař&iacute;zen&iacute; Synology NAS podporovat služby rozhran&iacute; př&iacute;kazov&eacute;ho ř&aacute;dku Telnet a SSH.</li>
     
    </ul>
  </li>
</ul>

<h4>Spr&aacute;va internetov&yacute;ch služeb zař&iacute;zen&iacute; Synology NAS:</h4>
<ul>
  <li>Zapněte nebo vypněte n&aacute;sleduj&iacute;c&iacute; služby:<ul>
      <li><strong>Protokol FTP/FTPS</strong> umožňuje zař&iacute;zen&iacute; Synology NAS fungovat jako server FTP.</li>
		<li><strong>Služba NTP</strong> umožňuje zař&iacute;zen&iacute; Synology NAS fungovat jako s&iacute;ťov&yacute; časov&yacute; server, kter&yacute; může po s&iacute;ti synchronizovat čas mezi různ&yacute;mi s&iacute;ťov&yacute;mi zař&iacute;zen&iacute;mi a zař&iacute;zen&iacute;m Synology NAS.</li>
		<li><strong>Server rsync</strong> umožňuje z&aacute;lohovat data prostřednictv&iacute;m služby rsync ze zař&iacute;zen&iacute; Synology NAS nebo klientů kompatibiln&iacute;ch se službou rsync do zař&iacute;zen&iacute; Synology NAS.</li>
		<li><strong>Protokol SFTP</strong> nab&iacute;z&iacute; uživatelům syst&eacute;mu DSM zabezpečen&yacute; přenos souborů bez nutnosti použ&iacute;vat hesla a snižuje riziko &uacute;niku přihla&scaron;ovac&iacute;ch &uacute;dajů uživatele.</li>
	    </ul>
  </li>
</ul>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Dal&scaron;&iacute; informace o v&yacute;&scaron;e uveden&yacute;ch služb&aacute;ch se nach&aacute;zej&iacute; v&nbsp;n&aacute;sleduj&iacute;c&iacute;ch zdroj&iacute;ch:</p>
	<ul>
		<li><strong>N&aacute;pověda aplikace DSM</strong> (tu naleznete po přihl&aacute;&scaron;en&iacute; do verze syst&eacute;mu DSM pro poč&iacute;tače ve webov&eacute;m prohl&iacute;žeči v&nbsp;č&aacute;sti <strong>Hlavn&iacute; nab&iacute;dka</strong> &gt; <strong>N&aacute;pověda aplikace DSM</strong>)</li>
		<li><strong>Uživatelsk&aacute; př&iacute;ručka Synology&nbsp;DSM</strong> (k&nbsp;dispozici v&nbsp;<a href="http://www.synology.com/support/download.php" target="_blank">Centru pro stahov&aacute;n&iacute;</a> společnosti Synology)</li>
	</ul>
</div>

<h2>Sledov&aacute;n&iacute; syst&eacute;mov&yacute;ch zdrojů</h2>

<div name="contents" id="resourcemonitor">
<p>Klepnut&iacute;m na možnost <strong>Sledov&aacute;n&iacute; zdrojů</strong> na &uacute;vodn&iacute; str&aacute;nce (zař&iacute;zen&iacute; iPhone / iPod touch nebo telefon se syst&eacute;mem Android) nebo v&nbsp;lev&eacute;m panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android) je možn&eacute; sledovat využit&iacute; procesoru CPU a paměti zař&iacute;zen&iacute; Synology NAS.</p>
</div>

<h2>Zobrazen&iacute; informac&iacute; o syst&eacute;mu</h2>

<div name="contents" id="sysinfo">
<p>Klepnut&iacute;m na možnost <strong>Info o syst&eacute;mu</strong> na &uacute;vodn&iacute; str&aacute;nce (zař&iacute;zen&iacute; iPhone / iPod touch nebo telefon se syst&eacute;mem Android) nebo v&nbsp;lev&eacute;m panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android) z&iacute;sk&aacute;te přehled o stavu zař&iacute;zen&iacute; Synology NAS.</p>

<h4>Zobrazen&iacute; syst&eacute;mov&yacute;ch informac&iacute; zař&iacute;zen&iacute; Synology NAS:</h4>
<ol>
  <li>Proveďte někter&yacute; z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch &uacute;konů:<ul>
      <li>Po klepnut&iacute; na možnost <strong>Obecn&eacute;</strong> se zobraz&iacute; z&aacute;kladn&iacute; informace o zař&iacute;zen&iacute; Synology NAS včetně s&eacute;riov&eacute;ho č&iacute;sla, n&aacute;zvu modelu, množstv&iacute; fyzick&eacute; paměti, verze syst&eacute;mu DSM a tak&eacute; informac&iacute; o čase a teplotě.</li>
      <li>Po klepnut&iacute; na možnost <strong>S&iacute;ť</strong> se zobraz&iacute; s&iacute;ťov&aacute; konfigurace zař&iacute;zen&iacute; Synology NAS a stav jednotliv&yacute;ch s&iacute;ťov&yacute;ch rozhran&iacute;.</li>
      <li>Po klepnut&iacute; na možnost <strong>&Uacute;loži&scaron;tě</strong> se zobraz&iacute; využit&iacute; svazku zař&iacute;zen&iacute; Synology NAS.</li>
    </ul>
  </li>
  <li>Klepnut&iacute;m na tlač&iacute;tko <strong>Aktualizovat</strong> v&nbsp;prav&eacute;m horn&iacute;m rohu informace o syst&eacute;mu aktualizujete.</li>
</ol>
</div>

<h2>Firmware</h2>

<div name="contents" id="firmware">
<p>Po klepnut&iacute; na možnost <strong>Firmware</strong> se zobraz&iacute; a aktualizuje verzi syst&eacute;mu DSM.</p>

<h4>Konfigurace nastaven&iacute; upgradu syst&eacute;mu DSM:</h4>
<ol>
  <li>Klepněte na možnost <strong>Upgrade syst&eacute;mu DSM</strong>.</li>
  <li>Zvolte jednu z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;:<ul>
      <li>Pouze důležit&eacute; aktualizace</li>
      <li>Nejnověj&scaron;&iacute; syst&eacute;m&nbsp;DSM a&nbsp;v&scaron;echny aktualizace</li>
    </ul>
  </li>
  <li>Klepněte na možnost <strong>Hotovo</strong>.</li>
</ol>

<h4>Stažen&iacute; dostupn&yacute;ch aktualizac&iacute;:</h4>
<ol>
  <li>V&nbsp;č&aacute;sti <strong>Stav</strong> zkontrolujte verzi syst&eacute;mu DSM.</li>
  <li>Pokud nen&iacute; va&scaron;e verze syst&eacute;mu DSM aktu&aacute;ln&iacute;, klepněte na tlač&iacute;tko <strong>St&aacute;hnout</strong>, kter&eacute; se zobraz&iacute; pod č&aacute;st&iacute; <strong>Stav</strong>, a proveďte aktualizaci syst&eacute;mu DSM.</li>
</ol>
</div>

<h2>Spr&aacute;va blokov&aacute;n&iacute; IP</h2>

<div name="contents" id="block">
<p>Klepnut&iacute;m na možnost <strong>Blokov&aacute;n&iacute; IP</strong> na &uacute;vodn&iacute; str&aacute;nce (zař&iacute;zen&iacute; iPhone / iPod touch nebo telefon se syst&eacute;mem Android) nebo na lev&eacute;m panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android) zabr&aacute;n&iacute;te neopr&aacute;vněn&eacute;mu přihl&aacute;&scaron;en&iacute;.</p>

<h4>Spr&aacute;va blokov&aacute;n&iacute; IP:</h4>
<ol>
  <li>Klepněte na tlač&iacute;tko konfigurace v&nbsp;prav&eacute;m horn&iacute;m rohu.</li>
  <li>Zapnut&iacute;m možnosti <strong>Povolit automatick&yacute; blok</strong> zapněte blokov&aacute;n&iacute; IP.</li>
  <li>Zadejte hodnoty pro položky <strong>Pokusy o přihl&aacute;&scaron;en&iacute;</strong> a&nbsp;<strong>Během (minuty)</strong>. IP adresa se po nastaven&eacute;m počtu ne&uacute;spě&scaron;n&yacute;ch pokusů o přihl&aacute;&scaron;en&iacute; během určit&eacute;ho počtu minut zablokuje.</li>
  <li>Zapnut&iacute;m možnosti <strong>Povolit vypr&scaron;en&iacute; platnosti blokov&aacute;n&iacute;</strong> a zad&aacute;n&iacute;m hodnoty do pole <strong>Odblokovat po (dny)</strong> můžete IP adresu po zadan&eacute;m počtu dn&iacute; odblokovat. Pokud zad&aacute;te hodnotu &bdquo;0&ldquo;, blokovan&aacute; IP adresa bude blokov&aacute;na na neurčitou dobu, dokud ji neodeberete ze seznamu blokovan&yacute;ch položek.</li>
  <li>Klepněte na možnost <strong>Hotovo</strong>.</li>
</ol>

<h4>Přid&aacute;n&iacute; IP adres do seznamu povolen&yacute;ch/blokovan&yacute;ch položek:</h4>
<ol>
  <li>Chcete-li do seznamu přidat povolenou/blokovanou IP adresu, klepněte v&nbsp;prav&eacute;m horn&iacute;m rohu na tlač&iacute;tko pro přid&aacute;n&iacute; a potom na možnost <strong>Seznam povolen&yacute;ch</strong> nebo <strong>Seznam blokov&aacute;n&iacute;</strong>.</li>
  <li>Po zad&aacute;n&iacute; IP adresy klepněte na možnost <strong>Hotovo</strong>.</li>
</ol>
</div>

<h2>Spr&aacute;va Centra bal&iacute;čků</h2>

<div name="contents" id="package">

<p>Společnost Synology integrovala aplikace třet&iacute;ch stran a aplikace vytvořen&eacute; společnost&iacute; Synology do bal&iacute;čků, kter&eacute; lze na zař&iacute;zen&iacute; Synology NAS snadno instalovat a povolit.</p>

<h4>Spr&aacute;va centra bal&iacute;čků:</h4>
<p>Klepnut&iacute;m na možnost <strong>Centrum bal&iacute;čků</strong> na domovsk&eacute; str&aacute;nce (zař&iacute;zen&iacute; iPhone/iPod touch nebo telefon se syst&eacute;mem Android) nebo na lev&eacute;m panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android) je možn&eacute; zobrazit informace o&nbsp;bal&iacute;čku, spustit či pozastavit bal&iacute;čky nebo je aktualizovat na nejnověj&scaron;&iacute; verze.</p>


<h4>Spu&scaron;těn&iacute; nebo pozastaven&iacute; instalovan&yacute;ch bal&iacute;čků:</h4>
<p>Bal&iacute;ček je možn&eacute; pozastavit nebo spustit klepnut&iacute;m na přep&iacute;nač vedle bal&iacute;čku.</p>

<h4>Zobrazen&iacute; bal&iacute;čků:</h4>
<p>Klepnut&iacute;m na bal&iacute;ček zobraz&iacute;te informace o&nbsp;tomto bal&iacute;čku.</p>
     
<h4>Aktualizace bal&iacute;čků:</h4>
<ol>
	<li>Klepnut&iacute;m na kartu <strong>Aktualizovat</strong> zobraz&iacute;te aktu&aacute;lně dostupn&eacute; verze aktualizac&iacute;.</li>
    <li>Klepnut&iacute;m na tlač&iacute;tko na prav&eacute; straně bal&iacute;čku provedete jeho aktualizaci na nejnověj&scaron;&iacute; verzi.</li>   
</ol>
</div>    

<h2>Zobrazen&iacute; protokolů nebo aktu&aacute;ln&iacute;ch připojen&iacute;</h2>

<div name="contents" id="log">
<p>Klepnut&iacute;m na možnost <strong>Protokol</strong> na &uacute;vodn&iacute; str&aacute;nce (zař&iacute;zen&iacute; iPhone / iPod touch nebo telefon se syst&eacute;mem Android) nebo v&nbsp;lev&eacute;m panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android) je možn&eacute; monitorovat aktu&aacute;ln&iacute; připojen&iacute; nebo protokoly služeb zař&iacute;zen&iacute; Synology NAS.</p>

<h4>Monitorov&aacute;n&iacute; aktu&aacute;ln&iacute;ch připojen&iacute;:</h4>
<ul>
  <li>Klepněte na možnost <strong>Počet posledn&iacute;ch protokolů [č&iacute;slo]</strong> v&nbsp;č&aacute;sti <strong>Přehled</strong>. Zobraz&iacute; se seznam uživatelů, kteř&iacute; maj&iacute; v&nbsp;současnosti př&iacute;stup ke služb&aacute;m zař&iacute;zen&iacute; Synology NAS.</li>
</ul>

<h4>Zobrazen&iacute; z&aacute;znamů protokolu určit&eacute; služby:</h4>
<ul>
  <li>Klepněte na některou z&nbsp;položek v&nbsp;č&aacute;sti <strong>Protokoly ud&aacute;lost&iacute;</strong> nebo <strong>Protokoly přenosu souborů</strong>, kde naleznete seznam př&iacute;slu&scaron;n&yacute;ch protokolů.</li>
</ul>

</div>
<h2>Spou&scaron;těn&iacute; mobiln&iacute;ch aplikac&iacute;</h2>
<div name="contents" id="launch">

<p>Aplikace DSM mobile představuje praktick&eacute; m&iacute;sto, odkud můžete spou&scaron;tět mobiln&iacute; aplikace Synology nainstalovan&eacute; v&nbsp;zař&iacute;zen&iacute; se syst&eacute;mem iOS nebo Android.</p>

<h4>Spu&scaron;těn&iacute; mobiln&iacute; aplikace Synology pomoc&iacute; aplikace DSM mobile:</h4>
<p>V&nbsp;doln&iacute; č&aacute;sti &uacute;vodn&iacute; str&aacute;nky (zař&iacute;zen&iacute; iPhone / iPod touch nebo telefon se syst&eacute;mem Android) nebo lev&eacute;ho panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android) klepněte na libovolnou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch aplikac&iacute;:</p>
<ul>
	<li><strong>DS audio</strong></li>
	<li><strong>DS cam</strong></li>
	<li><strong>DS cloud</strong></li>
	<li><strong>DS get</strong></li>
	<li><strong>DS file</strong></li>
	<li><strong>DS note</strong></li>
	<li><strong>DS photo</strong></li>
	<li><strong>DS video</strong></li>
	<li><strong>Chat</strong></li>
	<li><strong>MailPlus</strong></li>
	
    
	
	
	
</ul>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>V&iacute;ce informac&iacute; o těchto aplikac&iacute;ch se nach&aacute;z&iacute; v&nbsp;souborech n&aacute;povědy, kter&eacute; se dod&aacute;vaj&iacute; společně s&nbsp;aplikacemi.</li>
     </ul> 
</div>

<h2>Nastaven&iacute; akce zař&iacute;zen&iacute; Synology NAS<br><span style="font-size:80%;">(restartov&aacute;n&iacute;, vypnut&iacute; nebo zvukov&yacute; sign&aacute;l)</span></h2>

<div name="contents" id="restart">
<p>Aplikace DSM mobile pomoc&iacute; př&iacute;stroje se syst&eacute;mem iOS nebo Android umožňuje restartovat nebo vypnout zař&iacute;zen&iacute; Synology NAS. Pokud se v&nbsp;okol&iacute; nach&aacute;z&iacute; v&iacute;ce zař&iacute;zen&iacute; Synology NAS, můžete sv&eacute; zař&iacute;zen&iacute; Synology NAS rychle rozpoznat vyž&aacute;d&aacute;n&iacute;m zvukov&eacute;ho sign&aacute;lu.</p>

<h4>Nastaven&iacute; akce zař&iacute;zen&iacute; Synology NAS:</h4>
<ol>
  <li>Klepněte na tlač&iacute;tko možnost&iacute; v&nbsp;prav&eacute;m horn&iacute;m rohu &uacute;vodn&iacute; str&aacute;nky (zař&iacute;zen&iacute; iPhone / iPod touch nebo telefon se syst&eacute;mem Android) nebo lev&eacute;ho panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android).</li>
  <li>Proveďte někter&yacute; z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch &uacute;konů:<ul>
      <li>Klepněte na možnost <strong>Restartovat</strong> a&nbsp;pot&eacute; klepnut&iacute;m na možnost <strong>Ano</strong> zař&iacute;zen&iacute; Synology NAS restartujte.</li>
      <li>Klepněte na možnost <strong>Vypnout</strong> a pot&eacute; klepnut&iacute;m na možnost <strong>Ano</strong> zař&iacute;zen&iacute; Synology NAS vypněte.</li>
      <li>Klepnut&iacute;m na možnost <strong>Naj&iacute;t</strong> ode&scaron;lete zař&iacute;zen&iacute; Synology NAS požadavek na přehr&aacute;n&iacute; zvukov&eacute;ho sign&aacute;lu. Zvukov&yacute; sign&aacute;l ukonč&iacute;te klepnut&iacute;m na tlač&iacute;tko <strong>OK</strong>.</li>
    </ul>
  </li>
</ol>
</div>

<h2>Přepnut&iacute; syst&eacute;mu DSM do režimu pro stoln&iacute; poč&iacute;tače</h2>

<div name="contents" id="desktopedition">

<p>Klepnut&iacute;m na ikonu nastaven&iacute; a v&yacute;běrem možnosti <strong>Režim pro stoln&iacute; poč&iacute;tače</strong> přejdete do režimu syst&eacute;mu DSM pro stoln&iacute; poč&iacute;tače.</p>
</div>



<h2>Použit&iacute; Spr&aacute;vce &uacute;loži&scaron;tě</h2>
<div name="contents" id="contents12">
<p><strong>Spr&aacute;vce &uacute;loži&scaron;tě</strong> umožňuje rychle si prohl&eacute;dnout využit&iacute; a stav svazků a disků syst&eacute;mu.</p>

<h4>Zobrazen&iacute; informac&iacute; o&nbsp;svazku:</h4>
	<ol>
		<li>Klepněte na možnost <strong>Spr&aacute;vce &uacute;loži&scaron;tě</strong> na &uacute;vodn&iacute; str&aacute;nce (zař&iacute;zen&iacute; iPhone / iPod touch nebo telefon se syst&eacute;mem Android) nebo na lev&eacute;m panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android).</li>
		<li>Klepněte na kartu <strong>Svazek</strong>.</li> 
		<li>Klepnut&iacute;m na svazek v&nbsp;seznamu se zobraz&iacute; podrobn&eacute; informace o&nbsp;tomto svazku.</li>
	</ol>

<h4>Zobrazen&iacute; informac&iacute; o&nbsp;disku:</h4>
	<ol>
		<li>Klepněte na možnost <strong>Spr&aacute;vce &uacute;loži&scaron;tě</strong> na &uacute;vodn&iacute; str&aacute;nce (zař&iacute;zen&iacute; iPhone / iPod touch nebo telefon se syst&eacute;mem Android) nebo na lev&eacute;m panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android).</li>
		<li>Klepněte na kartu <strong>HDD/SDD</strong>.</li>
		<li>Po klepnut&iacute; na disk v&nbsp;seznamu se zobraz&iacute; informace o&nbsp;jeho stavu a informace S.M.A.R.T.</li>
	</ol>

<h4>Spu&scaron;těn&iacute; nebo zastaven&iacute; testu S.M.A.R.T.:</h4>
	<ol>
		<li>Klepněte na možnost <strong>Spr&aacute;vce &uacute;loži&scaron;tě</strong> na &uacute;vodn&iacute; str&aacute;nce (zař&iacute;zen&iacute; iPhone / iPod touch nebo telefon se syst&eacute;mem Android) nebo na lev&eacute;m panelu (zař&iacute;zen&iacute; iPad nebo tablet se syst&eacute;mem Android).</li>
		<li>Klepněte na kartu <strong>HDD/SDD</strong>.</li>
		<li>Po klepnut&iacute; na disk v&nbsp;seznamu se zobraz&iacute; str&aacute;nka s&nbsp;informacemi o&nbsp;tomto disku.</li>
		<li>Klepnut&iacute;m na možnost <strong>Test S.M.A.R.T. </strong> spust&iacute;te test S.M.A.R.T. a klepnut&iacute;m na možnost <strong>Zastavit</strong> ho zastav&iacute;te.</li>
     </ol>
     
</div>




<h2>Dal&scaron;&iacute; informace</h2>

<div name="contents" id="contents11">
<p>Pokud potřebujete informace pro ře&scaron;en&iacute; probl&eacute;mů nebo m&aacute;te z&aacute;jem o v&iacute;ce informac&iacute; o společnosti Synology, klepněte na n&aacute;sleduj&iacute;c&iacute; odkazy na zdroje společnosti Synology online:</p>
<ul>
  <li><a href="https://www.synology.com/support" target="_blank">Znalostn&iacute; datab&aacute;ze</a></li>
  <li><a href="https://community.synology.com/" target="_blank">Komunita</a></li>
  <li><a href="http://www.synology.com/support/download.php" target="_blank">Centrum pro stahov&aacute;n&iacute;</a></li>
  <li><a href="https://account.synology.com/support/create/ticket" target="_blank">Technick&aacute; podpora</a></li>
</ul>
</div>

</body>
</html>
