
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Monitor de recursos</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Configuraci&oacute;n</h2>
<h3>Configuraci&oacute;n</h3>

<p>Haga clic en <strong>Configuraci&oacute;n</strong> para configurar las siguientes opciones:</p>
<ul>
<li>Elija la <strong>Duraci&oacute;n en tiempo real</strong> en minutos desde el men&uacute; desplegable.</li>
<li>Marque <strong>Habilitar historial de usuario</strong> si desea ver los datos anteriores. Puede alternar entre <strong>Tiempo real</strong>, <strong>1 d&iacute;a</strong>, <strong>1 semana</strong>, <strong>1 mes</strong> y <strong>1 a&ntilde;o</strong> en el men&uacute; desplegable de la esquina superior derecha cuando visualice gr&aacute;ficos de rendimiento.</li> 
<li>Marque <strong>Habilitar alarma de rendimiento</strong> si desea configurar las reglas de alarma de rendimiento.</li></ul>
</ul>

<p>Haga clic en <strong>Aplicar</strong> para guardar la configuraci&oacute;n.</p>

<h3>Reglas de alarma de rendimiento</h3>

<h4>Para crear una regla de alarma de rendimiento:</h4>
<ol>
<li>Vaya a <strong>Configuraci&oacute;n</strong> &gt; <strong>Configuraci&oacute;n</strong> y aseg&uacute;rese de que ha marcado <strong>Habilitar alarma de rendimiento</strong>.</li>
<li>Vaya a <strong>Configuraci&oacute;n</strong> &gt; <strong>Reglas de alarma de rendimiento</strong>.</li>
<li>Haga clic en el bot&oacute;n <b>Crear</b>.</li>
<li>Las configuraciones de reglas disponibles son las siguientes:</li>
<ul>
<li><strong>Recurso</strong>: Seleccione el recurso al que desea aplicar la regla.</li>
<li><strong>Tipo</strong>: Elija el tipo de regla que desea crear.</li>
<li><strong>Nivel</strong>: Elija el nivel de alarma.</li>
<li><strong>Mayor que</strong>: Establezca el porcentaje m&aacute;ximo de su tipo de regla donde el sistema le notificar&aacute; si se supera.</li>
</ul>
<li>Marque <strong>Habilitar</strong> si desea habilitar esta regla inmediatamente.</li>
<li>Haga clic en <strong>OK</strong> para a&ntilde;adir la regla.</li>
</ol>


<div class="section">
<h4>Mecanismo para las alarmas de rendimiento:</h4>
<p>Las alarmas de rendimiento emplean el siguiente mecanismo para minimizar las falsas alarmas y evitar que se consuman excesivos recursos de los sistemas en un breve periodo.</p>
<ol>
	<li>El servicio de alarmas de rendimiento comprobar&aacute; todas las reglas cada cinco minutos. No se activar&aacute; ninguna acci&oacute;n si los valores supervisados se encuentran por debajo de los umbrales establecidos.</li>
	<li>Cuando un valor supervisado supere su umbral, la alarma no se activar&aacute; inmediatamente. En su lugar, el sistema comprobar&aacute; la regla cinco veces m&aacute;s con un intervalo de 30&nbsp;segundos.</li>
	<li>Una vez haya modificado la duraci&oacute;n del intervalo, si el valor supervisado supera el umbral cinco veces consecutivas, la alarma se activar&aacute;. Sin embargo, si el valor supervisado se encuentra por debajo del umbral durante cualquiera de estas cinco comprobaciones, la duraci&oacute;n del intervalo volver&aacute; a cambiarse a cinco minutos.</li>
</ol>
<p>Por lo tanto, para un &uacute;nico evento, la alarma se activar&aacute;, como m&aacute;ximo, a los 450&nbsp;segundos de haberse detectado el evento por primera vez.</p>

<h4>Niveles de alarma:</h4>
<p>Las alarmas de rendimiento activar&aacute;n distintas acciones en funci&oacute;n de los niveles de la alarma.</p>
<ul>
	<li><strong>Advertencia</strong>: genera un mensaje de advertencia en el registro del sistema pero no activa ninguna notificaci&oacute;n del sistema.</li>
	<li><strong>Cr&iacute;tico</strong>: no solo genera un mensaje en el registro del sistema, sino que tambi&eacute;n activa las notificaciones del sistema.</li>
</ul>
<p>Los registros de las alarmas de rendimiento pueden visualizarse desde la pesta&ntilde;a <strong>Alarma de rendimiento</strong> o el <strong>Centro de registros</strong> de DSM.</p>
</div>

</body>
</html>
