
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Monitor de recursos</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Rendimiento</h2>
<p>Haga clic en la pesta&ntilde;a <strong>Rendimiento</strong> para ver los datos de utilizaci&oacute;n de recursos. La fecha, la hora y la informaci&oacute;n del gr&aacute;fico se mostrar&aacute;n al pasar el rat&oacute;n por encima.</p>
<p>En la pesta&ntilde;a Visi&oacute;n general, se muestran gr&aacute;ficos de <strong>CPU</strong>, <strong>GPU</strong>, <strong>Memoria del sistema</strong>, <strong>Memoria de la GPU</strong>, <strong>Red</strong>, <strong>Disco</strong>, <strong>Volumen</strong> e <strong>iSCSI</strong>.</p>

<h3>CPU</h3>
<p>Puede ver el uso general de la CPU del <strong>Usuario</strong>, del <strong>Sistema</strong> y de <strong>Espera de E/S</strong>. La carga de CPU puede ser alta la primera vez que se inicie el Monitor de recursos, pues el sistema debe recopilar sus datos de recursos y cargar la p&aacute;gina de IU al mismo tiempo.</p>
<ul><li><strong>Usuario</strong> muestra el porcentaje de CPU que se utiliza para ejecutar aplicaciones del usuario.</li>
<li><strong>Sistema</strong> muestra el porcentaje de CPU que se usa para el sistema y los IRQ de hardware/software.</li>
<li><strong>Espera de E/S</strong> muestra el porcentaje de CPU invertido en la Espera de E/S.</li>
<li><strong>Utilizaci&oacute;n</strong> es la suma del uso de la CPU del <strong>Usuario</strong> y del <strong>Sistema</strong>.</li>
<li>Se muestra la Media de carga en 1, 5 y 15 minutos, indicando la longitud de la cola de ejecuci&oacute;n (es decir, la suma del n&uacute;mero de procesos que se est&aacute;n ejecutando actualmente m&aacute;s el n&uacute;mero que est&aacute;n esperando para ejecutarse).</li>
</ul>
<div class="section">
<h4>Explicaci&oacute;n de los t&eacute;rminos</h4>
<ul>
<li><b>Espera de E/S</b>: la Espera de E/S indica que la CPU est&aacute; en reposo y no est&aacute; siendo utilizada por ning&uacute;n programa.</li>
<p>La Espera de E/S es un comportamiento normal. Dado que la velocidad de la CPU es mucho m&aacute;s r&aacute;pida que la de la E/S, es normal que la CPU tenga que esperar a la transmisi&oacute;n de discos o red. Sin embargo, si el porcentaje de Espera de E/S es extremadamente grande, significa que la CPU invertir&aacute; la mayor parte del tiempo en la Espera de E/S y es posible que no se utilice bien. Puede usar configuraciones de grupo de discos (por ejemplo, SHR o RAID 5) o configuraciones de red (por ejemplo, Bonding) m&aacute;s eficientes para conseguir un mejor rendimiento del sistema.</p> 
</ul>
</div>

<h3>GPU</h3>
<p>Se mostrar&aacute; el uso de la GPU general. Puede cambiar entre <strong>GPU</strong> y <strong>Memoria de la GPU</strong> en el men&uacute; desplegable.</p>
<ul>
<li><strong>Utilizaci&oacute;n</strong> es la suma del uso de la GPU del <strong>Usuario</strong> y del <strong>Sistema</strong>.</li>
<li>En Memoria de la GPU, puede ver la <strong>Composici&oacute;n de memoria</strong> por los espacios <strong>Usado</strong> y <strong>Libre</strong>.</li>
</ul>

<div class="section">
<h4>Observaci&oacute;n:</h4>
<ul>
<li>Disponible solo en modelos compatibles con GPU.</li>
</ul>
</div>

<h3>Memoria del sistema</h3>
<p>Se mostrar&aacute; el uso de la memoria f&iacute;sica y el espacio de intercambio. El uso de memoria sigue siendo elevado porque el sistema almacena en cach&eacute; los datos de m&aacute;s frecuente acceso, por lo que los datos se pueden obtener r&aacute;pidamente sin acceder al disco duro. La memoria en cach&eacute; se liberar&aacute; si la memoria total es insuficiente.</p>
<p>Un uso alto del espacio de intercambio indica una memoria del sistema insuficiente y tambi&eacute;n afectar&aacute; al rendimiento del sistema. Puede ver la velocidad de intercambio hacia dentro y hacia fuera seleccionando <strong>Intercambio</strong> en el men&uacute; desplegable de la parte superior.</p>

<h3>Red</h3>
<p>El gr&aacute;fico de flujo de red muestra los datos enviados y recibidos en KB por segundo. Si PPPoE est&aacute; conectado, su velocidad de transferencia tambi&eacute;n se mostrar&aacute; en el gr&aacute;fico.</p>

<h3 class="disable-dockerx64">Disco</h3>
<p class="disable-dockerx64">Puede elegir ver el uso del disco general, la tasa de transferencia o el IOPS haciendo clic en el men&uacute; desplegable de la parte superior del gr&aacute;fico. Puede hacer clic en <strong>Ver todo</strong> en la parte inferior para seleccionar m&aacute;s discos marcando las casillas de verificaci&oacute;n para a&ntilde;adir sus datos al gr&aacute;fico.</p>


<h3 class="disable-eds14 disable-dockerx64">Volumen</h3>
<p class="disable-eds14 disable-dockerx64">Esta p&aacute;gina muestra el estado de transferencia general de los vol&uacute;menes. Haga clic en el men&uacute; desplegable de encima del gr&aacute;fico para ver el uso, la tasa de transferencia o el IOPS. Haga clic en el bot&oacute;n <strong>Ver todo</strong> para seleccionar vol&uacute;menes individuales y a&ntilde;adirlos al gr&aacute;fico.</p>

<h3 class="disable-eds14 disable-dockerx64">iSCSI</h3>
<p class="disable-eds14 dixable-dockerx64">Esta p&aacute;gina muestra el estado general de los iSCSI LUN que est&aacute;n en ejecuci&oacute;n. Haga clic en el men&uacute; desplegable que aparece sobre el gr&aacute;fico para seleccionar un LUN y ver su estado. Se muestran los siguientes tres gr&aacute;ficos por defecto: <strong>Rendimiento</strong>, <strong>IOPS</strong> y <strong>Latencia</strong>. Para obtener m&aacute;s informaci&oacute;n, pulse el bot&oacute;n <strong>Seleccionar gr&aacute;ficos</strong> para elegir los gr&aacute;ficos que desee ver.</p>

</body>
</html>
