
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Gestionnaire iSCSI</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_setting"></a>Param&egrave;tres</h2>

<h3>iSNS</h3>
<p>iSNS (Internet Storage Name Service) fournit le m&eacute;canisme pour une gestion centralis&eacute;e. Vous pouvez enregistrer toutes les iSCSI Target avec le serveur iSNS.</p>
<h4>Pour enregistrer les iSCSI Target sur un serveur iSNS&nbsp;:</h4><ol>
<li>Cliquez sur <b>iSNS</b> et cochez <b>Activer iSNS</b>.</li>
<li>Saisissez l&apos;adresse&nbsp;IP du serveur iSNS. Cliquez sur <b>OK</b> pour appliquer le param&egrave;tre.</li>
</ol>

<h3>Profondeur de la file d&apos;E/S</h3>
<p>Le param&egrave;tre par d&eacute;faut est d&eacute;fini sur 16, mais vous pouvez modifier la profondeur de la file d&apos;attente d&apos;E/S de toutes les cibles si n&eacute;cessaire.</p>

<h3>&Eacute;criture de faible capacit&eacute;</h3>
<p>Lorsqu&apos;il y a moins de 1&nbsp;Go d&apos;espace disponible sur un volume, les LUN du volume sont prot&eacute;g&eacute;s par le syst&egrave;me pour emp&ecirc;cher la panne du syst&egrave;me de fichiers, et les utilisateurs ne peuvent pas y &eacute;crire de donn&eacute;es. L&apos;&eacute;criture de faible capacit&eacute; permet aux utilisateurs de continuer &agrave; &eacute;crire des donn&eacute;es sur les LUN lorsque le volume est &agrave; court d&apos;espace libre. Cependant, il est conseill&eacute; de d&eacute;sactiver cette option une fois que vous avez r&eacute;solu le probl&egrave;me d&apos;espace insuffisant.</p>
<div class="section">
	<h4>Remarque&nbsp;:</h4>
	<ul>
		<li>M&ecirc;me si cette fonction est activ&eacute;e, &eacute;vitez de continuer &agrave; &eacute;crire des donn&eacute;es dans le LUN.</li>
	</ul></div>	

<h3>Mode de r&eacute;clamation d&apos;espace</h3>
<p>Les trois modes de r&eacute;clamation d&apos;espace sont pr&eacute;sent&eacute;s ci-apr&egrave;s. En r&eacute;glant la vitesse, vous pouvez contr&ocirc;ler l&apos;impact de la r&eacute;clamation d&apos;espace sur les performances du LUN.</p>
<ul>
	<li><strong>Priorit&eacute; &agrave; la coh&eacute;rence d&apos;E/S</strong>&nbsp;: la priorit&eacute; &agrave; la coh&eacute;rence d&apos;E/S permet de r&eacute;duire l&apos;impact sur les performances lorsque le syst&egrave;me r&eacute;clame l&apos;espace utilis&eacute; d&apos;un LUN avanc&eacute; h&eacute;rit&eacute;. La vitesse est r&eacute;duite en cas d&apos;E/S entrantes en continu. Lors de la r&eacute;ception de commandes cons&eacute;cutives de r&eacute;clamation d&apos;espace, le processus de r&eacute;clamation est retard&eacute; jusqu&apos;&agrave; ce qu&apos;il n&apos;y ait plus de commande de r&eacute;clamation d&apos;espace.</li>
	<li><strong>&Eacute;quilibr&eacute;</strong>&nbsp;: mode de r&eacute;clamation par d&eacute;faut. Ce mode maintient un certain &eacute;quilibre entre la vitesse d&apos;E/S et la vitesse de r&eacute;clamation.</li>
	<li><strong>Priorit&eacute; &agrave; la r&eacute;clamation</strong>&nbsp;: la priorit&eacute; &agrave; la r&eacute;clamation signifie que les E/S entrantes n&apos;auront que peu d&apos;influence sur la vitesse de r&eacute;clamation. La r&eacute;clamation sera effectu&eacute;e &agrave; pleine vitesse, sans sacrifier la coh&eacute;rence d&apos;E/S.</li>
</ul>
</body>
</html>
