<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Gestionnaire iSCSI</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="leaf_snapshot"></a>Instantan&eacute;</h2>

<h4>Pour prendre l&apos;instantan&eacute; d&apos;un LUN&nbsp;:</h4>
<p>L&apos;instantan&eacute; d&apos;un LUN est la copie en lecture seule &agrave; un instant donn&eacute; d&apos;un LUN.</p>
<ol>
	<li>S&eacute;lectionnez le LUN duquel vous souhaitez prendre des instantan&eacute;s.</li>
	<li>Cliquez sur <strong>Instantan&eacute;</strong> et choisissez <strong>Prendre un instantan&eacute;</strong>.</li>
	<li>Saisissez la description de cet instantan&eacute;.</li>
	<li>Choisissez l&apos;un des types d&apos;instantan&eacute;s suivants selon vos besoins&nbsp;:<ul>
			<li><strong>Coh&eacute;rent avec l&apos;application</strong>&nbsp;: Ce type d&apos;instantan&eacute; ne peut &ecirc;tre pris que lorsque Synology Storage Console ou Synology Snapshot Manager est install&eacute; sur votre serveur Windows ou sur VMware vCenter Server selon votre environnement pour communiquer avec DSM. Lorsqu&apos;un instantan&eacute; coh&eacute;rent avec l&apos;application est d&eacute;clench&eacute; sur DSM, les applications sont notifi&eacute;es et transf&egrave;rent toutes les donn&eacute;es depuis la m&eacute;moire vers le LUN sur lequel l&apos;instantan&eacute; est pris pour garantir la coh&eacute;rence des donn&eacute;es.</li>
			<li><strong>Coh&eacute;rent avec le plantage</strong>&nbsp;: Si aucun Storage Console ou Snapshot Manager n&apos;est install&eacute; sur l&apos;un de vos clients, vous ne pouvez capturer que des instantan&eacute;s coh&eacute;rents avec le plantage des LUN. Lorsqu&apos;ils sont d&eacute;clench&eacute;s, les applications ne sont pas notifi&eacute;es de transf&eacute;rer les donn&eacute;es depuis la m&eacute;moire sur les LUN, par cons&eacute;quent cela ne garantit aucune coh&eacute;rence des donn&eacute;es.</li>
		</ul>
	</li>
	<li>Cliquez sur <strong>OK</strong>.</li>
</ol>
<div class="section">
	<h4>Remarque&nbsp;:</h4>
	<ul>
		<li>Il est conseill&eacute; d&apos;installer <b>Synology Storage Console</b> ou <b>Snapshot Manager</b> afin d&apos;&eacute;viter toute incoh&eacute;rence de donn&eacute;es.</li>
	</ul>
</div>
<div class="section">
	<h4>Terminologie&nbsp;:</h4>
	<ul>
	<li><b>Synology Storage Console&nbsp;:</b> Synology Storage Console est un plug-in de gestion du stockage sur VMware&nbsp;vSphere&nbsp;Client ou serveur Windows qui simplifie la gestion et la surveillance de syst&egrave;mes de stockage Synology multiples. Il vous permet &eacute;galement de prendre des instantan&eacute;s coh&eacute;rents avec l&apos;application directement &agrave; partir de DSM.<ul>
			<li>Pour les environnements VMware, le plug-in est uniquement compatible avec VMware vCenter Server Appliance&nbsp;6.5 U2 ou versions ult&eacute;rieures.</li>
			<li>Pour plus d&apos;informations, t&eacute;l&eacute;chargez le plug-in dans le <a href="https://www.synology.com/support/download" target="_blank">Centre de t&eacute;l&eacute;chargements</a> et reportez-vous &agrave; la section <a href="https://www.synology.com/knowledgebase/DSM/help/StorageConsoleforVMware/storageconsoleforvmware" target="_blank">Synology Storage Console for VMware</a> et <a href="https://www.synology.com/knowledgebase/DSM/help/StorageConsoleforWindows/storageconsoleforwindows" target="_blank">Synology Storage Console for Windows</a>.</li>
		</ul></li>
	<li><b>Synology Snapshot Manager&nbsp;:</b> Synology Snapshot Manager est un plug-in logiciel qui vous permet de prendre des instantan&eacute;s coh&eacute;rents avec l&apos;application directement &agrave; partir de DSM.<ul>
			<li>Pour les environnements VMware, ce plug-in est uniquement compatible avec VMware vCenter Server&nbsp;6.0 ou versions ant&eacute;rieures.</li>
		</ul>
	</li>
</ul>
</div>

<h4>Pour supprimer un instantan&eacute;&nbsp;:</h4>
<ol>
	<li>S&eacute;lectionnez le LUN duquel vous avez pris des instantan&eacute;s.</li>
	<li>Cliquez sur <b>Instantan&eacute;</b>&nbsp;&gt; <b>Liste d&apos;instantan&eacute;s</b>.</li>
	<li>S&eacute;lectionnez l&apos;instantan&eacute; que vous souhaitez supprimer et cliquez sur <b>Supprimer</b>.</li>
</ol>
<div class="section">
	<h4>Remarque&nbsp;:</h4>
	<ul>
		<li>Le traitement de la r&eacute;cup&eacute;ration d&apos;espace prend du temps apr&egrave;s la suppression des instantan&eacute;s.</li>
	</ul>
</div>

<h4>Pour restaurer un LUN&nbsp;:</h4>
<p>S&eacute;lectionnez l&apos;instantan&eacute; d&apos;un point dans le temps pour restaurer les donn&eacute;es sur un LUN.</p>
<ol>
	<li>S&eacute;lectionnez le LUN que vous souhaitez restaurer.</li>
	<li>Cliquez sur <strong>Instantan&eacute;</strong> et choisissez <strong>Liste d&apos;instantan&eacute;s</strong>.</li>
	<li>S&eacute;lectionnez l&apos;instantan&eacute; que vous souhaitez restaurer et cliquez sur <strong>Restaurer</strong>.</li>
</ol>

<h4>Pour cr&eacute;er un clone de LUN &agrave; partir d&apos;instantan&eacute;s&nbsp;:</h4>
<p>Effectuez une copie accessible en &eacute;criture d&apos;un LUN ou de l&apos;instantan&eacute; d&apos;un LUN.</p>
<ul>
	<li>S&eacute;lectionnez un instantan&eacute; LUN dans la <strong>Liste d&apos;instantan&eacute;s</strong> et cliquez sur <strong>Cloner</strong>.</li>
</ul>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>Les fonctions instantan&eacute; LUN, restauration et clonage ne sont disponibles que sur les LUN dot&eacute;s de commandes d&apos;acc&eacute;l&eacute;ration de stockage.</li>
	<li>Si vous avez pris un instantan&eacute; ou cr&eacute;&eacute; un clone et que l&apos;&eacute;tat est devenu <strong>Anormal</strong>/<strong>En panne</strong>, veuillez supprimer cet instantan&eacute;/clone et en cr&eacute;er un autre.</li>
	<li>Toutes les modifications apport&eacute;es &agrave; un LUN apr&egrave;s la cr&eacute;ation d&apos;un instantan&eacute; seront perdues si vous restaurez le LUN &agrave; partir de cet instantan&eacute;.</li>
	<li>Les fonctions de restauration et de clonage LUN ainsi que la prise d&apos;instantan&eacute;s et le clonage d&apos;instantan&eacute;s LUN ne sont pas disponibles lorsqu&apos;un volume dispose de moins de 1&nbsp;Go d&apos;espace libre.</li>
</ul>
</div>
<div class="section"><h4><a id="smart_retention"></a>Politique de conservation</h4>
<p>Cette option offre une solution id&eacute;ale pour vous aider &agrave; sp&eacute;cifier le nombre maximal de versions d&apos;instantan&eacute;s pour enregistrer votre espace de volume. Vous pourrez n&eacute;anmoins avoir besoin de conserver vos instantan&eacute;s pendant une p&eacute;riode plus longue. Il y a plusieurs choses &agrave; savoir sur la politique de conservation&nbsp;:</p>
<ul>
<li>Synology utilise la politique de conservation&nbsp;GFS, ou Grandfather-Father-Son (grand-p&egrave;re-p&egrave;re-fils). Vous pouvez configurer le nombre maximal de versions d&apos;instantan&eacute;s &agrave; conserver pour les p&eacute;riodes suivantes, respectivement&nbsp;: <strong>horaire</strong>, <strong>quotidienne</strong>, <strong>hebdomadaire</strong>, <strong>mensuelle</strong> et <strong>annuelle</strong>.</li>
<li>Un instantan&eacute; peut respecter plusieurs r&egrave;gles de conservation en m&ecirc;me temps. Par exemple, un instantan&eacute; peut respecter les r&egrave;gles de conservation quotidienne, hebdomadaire et mensuelle.</li>
<li>Les instantan&eacute;s les plus anciens sont conserv&eacute;s si vous prenez plusieurs instantan&eacute;s au cours d&apos;une certaine p&eacute;riode. Par exemple, si vous d&eacute;finissez une r&egrave;gle de conservation des instantan&eacute;s de <strong>10&nbsp;semaines</strong> et que votre calendrier d&apos;instantan&eacute;s est d&eacute;fini pour prendre 1&nbsp;instantan&eacute; par jour, Snapshot&nbsp;Replication conservera l&apos;instantan&eacute; le plus ancien de chaque semaine pendant les 10&nbsp;derni&egrave;res semaines.</li>
<li>Si vous n&apos;avez pas pris d&apos;instantan&eacute;s pendant une certaine p&eacute;riode, le syst&egrave;me conserve les instantan&eacute;s les plus r&eacute;cents. Par exemple, si la r&egrave;gle de conservation quotidienne d&apos;instantan&eacute; est d&eacute;finie sur&nbsp;15 et qu&apos;aucun instantan&eacute; n&apos;a &eacute;t&eacute; pris au cours des 30&nbsp;derniers jours, le syst&egrave;me conserve les instantan&eacute;s pris il y a 30&nbsp;&agrave; 45&nbsp;jours.</li>
<li>Toutes les versions des instantan&eacute;s prises en une heure, depuis la prise de l&apos;instantan&eacute; le plus r&eacute;cent, sont conserv&eacute;es par d&eacute;faut, pour vous aider &agrave; rechercher et restaurer de mani&egrave;re pratique parmi les versions r&eacute;centes des instantan&eacute;s. Vous pouvez &eacute;galement verrouiller un instantan&eacute; afin d&apos;emp&ecirc;cher sa suppression automatique selon vos r&egrave;gles de conservation.</li>
</ul>

<p>Exemple&nbsp;1&nbsp;:<br/> Si vous souhaitez conserver des instantan&eacute;s quotidiens pour les 3&nbsp;derniers mois, des instantan&eacute;s hebdomadaires pour les 4 &agrave; 6&nbsp;derniers mois et des instantan&eacute;s mensuels pour les 7 &agrave; 9&nbsp;derniers mois, vous devez saisir 0 pour les instantan&eacute;s horaires, 90 pour les instantan&eacute;s quotidiens, 24 pour les instantan&eacute;s hebdomadaires, 9 pour les instantan&eacute;s mensuels et 0 pour les instantan&eacute;s annuels.</p>

<p>Exemple&nbsp;2&nbsp;:<br/> Si vous souhaitez conserver des instantan&eacute;s horaires pour les 2&nbsp;derniers jours, des instantan&eacute;s quotidiens pour la semaine pass&eacute;e, des instantan&eacute;s hebdomadaires pour le mois dernier et des instantan&eacute;s mensuels pour l&apos;ann&eacute;e pass&eacute;e, vous devez saisir 48 pour les instantan&eacute;s horaires, 7 pour les instantan&eacute;s quotidiens, 4 pour les instantan&eacute;s hebdomadaires, 12 pour les instantan&eacute;s mensuels et 0 pour les instantan&eacute;s annuels.</p><img class="help_image" src="../../images/iSCSIManager/retention_policy.png"></div>
</body>
</html>