<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Op&ccedil;&otilde;es</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="leaf_user"></a>Conta</h2>

<p>O separador Conta fornece op&ccedil;&otilde;es de edi&ccedil;&atilde;o de defini&ccedil;&otilde;es b&aacute;sicas da conta, tais como a descri&ccedil;&atilde;o, a palavra-passe, o e-mail e a verifica&ccedil;&atilde;o de 2 passos. Para ver este separador, clique no &iacute;cone em forma de pessoa, na parte superior direita do ambiente de trabalho e selecione <strong>Pessoal</strong>.</p>



<h3>Modificar Defini&ccedil;&otilde;es da Conta</h3>

<p>Podem ser editadas as seguintes defini&ccedil;&otilde;es de conta:</p>
<ul>
<li><strong>Descri&ccedil;&atilde;o:</strong> Introduza uma descri&ccedil;&atilde;o para a sua conta. As descri&ccedil;&otilde;es do utilizador podem incluir at&eacute; 64 caracteres Unicode apresent&aacute;veis.</li>
<li><strong>Nova Palavra-passe:</strong> Se pretende alterar a palavra-passe da sua conta, introduza aqui uma nova e confirme-a no campo <strong>Confirmar palavra-passe</strong> abaixo. As palavras-passe s&atilde;o sens&iacute;veis a mai&uacute;sculas e min&uacute;sculas e est&atilde;o limitadas a 127 caracteres apresent&aacute;veis, incluindo letras, n&uacute;meros, s&iacute;mbolos e espa&ccedil;os.</li>
<li><strong>E-mail:</strong> Introduza um endere&ccedil;o de e-mail (apenas para utilizadores n&atilde;o admin).</li>
<li><strong>Idioma de exibi&ccedil;&atilde;o:</strong> Especifique o idioma de exibi&ccedil;&atilde;o da sua conta. As defini&ccedil;&otilde;es do idioma de exibi&ccedil;&atilde;o que aqui especificar t&ecirc;m prioridade sobre quaisquer outras especificadas em <b>Painel de Controlo</b> &gt; <b>Op&ccedil;&otilde;es Regionais</b> &gt; <b>Idioma</b>.</li>
</ul>
<p>Depois de modificar as defini&ccedil;&otilde;es de conta, clique em <b>OK</b> para guardar as altera&ccedil;&otilde;es.</p>


<h3>Verifica&ccedil;&atilde;o de 2 passos</h3>

<p>A verifica&ccedil;&atilde;o de 2 passos constitui uma seguran&ccedil;a melhorada para a sua conta DSM. Se a verifica&ccedil;&atilde;o de 2 passos estiver ativada, ter&aacute; de introduzir a sua palavra-passe para al&eacute;m de um c&oacute;digo de verifica&ccedil;&atilde;o, uma &uacute;nica vez, quando inicia a sess&atilde;o no DSM. Os c&oacute;digos de verifica&ccedil;&atilde;o s&atilde;o obtidos a partir de aplica&ccedil;&otilde;es de autentica&ccedil;&atilde;o instaladas no seu dispositivo m&oacute;vel. Por isso, caso algu&eacute;m queira aceder &agrave; sua conta, n&atilde;o s&oacute; precisa do seu nome de utilizador e palavra-passe, mas tamb&eacute;m do seu dispositivo m&oacute;vel.</p>

<div class="section">
<h4>Requisitos:</h4>
<p>A verifica&ccedil;&atilde;o de 2 passos requer um dispositivo m&oacute;vel e uma aplica&ccedil;&atilde;o de autentica&ccedil;&atilde;o que suporte o protocolo Time-based One-Time Password (TOTP). Entre as aplica&ccedil;&otilde;es de autentica&ccedil;&atilde;o encontram-se o Google Authenticator (Android/iPhone/BlackBerry) ou Authenticator (Windows Phone).</p>
</div>

<h4>Para ativar a verifica&ccedil;&atilde;o de 2 passos:</h4>

<ol>
<li>Aceda ao separador <strong>Pessoal</strong> &gt; <strong>Conta</strong> e Assinale a caixa <strong>Activar verifica&ccedil;&atilde;o de 2 passos</strong> para abrir o assistente de verifica&ccedil;&atilde;o de 2 passos.</li>
<li>No primeiro ecr&atilde;, introduza um endere&ccedil;o de e-mail. Podem ser enviados para este e-mail c&oacute;digos de verifica&ccedil;&atilde;o de emerg&ecirc;ncia, caso perca o seu dispositivo m&oacute;vel.</li>
<li>Transfira e instale uma aplica&ccedil;&atilde;o autenticadora, como o Google Authenticator (Android/iPhone/BlackBerry) ou Authenticator (Windows Phone).</li>
<li>No ecr&atilde; seguinte, abra a sua aplica&ccedil;&atilde;o autenticadora e digitalize o c&oacute;digo QR. Como alternativa, pode clicar na liga&ccedil;&atilde;o para introduzir manualmente uma chave secreta.</li>
<li>Em seguida, a sua aplica&ccedil;&atilde;o autenticadora gera um c&oacute;digo de verifica&ccedil;&atilde;o de 6 d&iacute;gitos. Introduza este c&oacute;digo no campo de texto do assistente, para confirmar que as configura&ccedil;&otilde;es est&atilde;o corretas. Se ocorrer um erro, certifique-se de que a hora de sistema do seu dispositivo m&oacute;vel est&aacute; sincronizada com a hora de sistema do DSM. Como os c&oacute;digos de verifica&ccedil;&atilde;o s&atilde;o atualizados periodicamente, certifique-se de que o c&oacute;digo introduzido n&atilde;o expirou.</li>
<li>Assim que o assistente de configura&ccedil;&atilde;o terminar, clique em <strong>OK</strong> para guardar as defini&ccedil;&otilde;es.</li>
</ol>



<h4>Para iniciar sess&atilde;o no DSM com a verifica&ccedil;&atilde;o de 2 passos:</h4>

<p>Quando a verifica&ccedil;&atilde;o de 2 passos estiver ativada, ser-lhe-&aacute; pedido que introduza um c&oacute;digo de verifica&ccedil;&atilde;o de 6 d&iacute;gitos quando iniciar sess&atilde;o no DSM.</p>

<ol>
<li>No ecr&atilde; de in&iacute;cio de sess&atilde;o do DSM, introduza o seu nome de utilizador e a palavra-passe, como habitualmente.</li>
<li>Quando lhe for pedido que introduza um c&oacute;digo de verifica&ccedil;&atilde;o, abra a aplica&ccedil;&atilde;o autenticadora no seu dispositivo m&oacute;vel.</li>
<li>Localize e introduza o c&oacute;digo de verifica&ccedil;&atilde;o de 6 d&iacute;gitos para a sua conta. Se perder o seu dispositivo m&oacute;vel, pode clicar na liga&ccedil;&atilde;o <b>Perdeu o telefone?</b> e ser&aacute; enviado para o seu endere&ccedil;o de e-mail um c&oacute;digo de emerg&ecirc;ncia.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li><strong>Defini&ccedil;&otilde;es SMTP:</strong> Para receber c&oacute;digos de emerg&ecirc;ncia por e-mail, as defini&ccedil;&otilde;es do servidor SMTP em <b>Painel de Controlo</b> &gt; <b>Notifica&ccedil;&atilde;o</b> t&ecirc;m de estar devidamente configuradas.</li>
<li><strong>Limite de C&oacute;digos de Emerg&ecirc;ncia:</strong> Cada utilizador tem um limite de 5 c&oacute;digos de emerg&ecirc;ncia. Se ultrapassar o seu limite, ter&aacute; de desativar e reativar a verifica&ccedil;&atilde;o de 2 passos antes de receber mais c&oacute;digos de emerg&ecirc;ncia.</li>
<li>A verifica&ccedil;&atilde;o de 2 passos pode ser solicitada no DSM e todas as aplica&ccedil;&otilde;es Synology m&oacute;veis relacionadas (por ex., DSM mobile e DS file).</li>
<li style="display: none;">A verifica&ccedil;&atilde;o de 2 passos aplica-se tamb&eacute;m a todos os servi&ccedil;os relativos a SSH, como terminal SSH, SFTP e rsync com encripta&ccedil;&atilde;o de transfer&ecirc;ncia SSH. No entanto, uma vez que Hyper Backup e Sincroniza&ccedil;&atilde;o de Pasta Partilhada por rsync com encripta&ccedil;&atilde;o de transfer&ecirc;ncia SSH n&atilde;o suportam verifica&ccedil;&atilde;o de 2 passos, estes dois servi&ccedil;os n&atilde;o funcionar&atilde;o normalmente depois de ativada a verifica&ccedil;&atilde;o de 2 passos.</li>

</ul>
</div>


<h4>Para repor as defini&ccedil;&otilde;es de utilizador da verifica&ccedil;&atilde;o de 2 passos:</h4>

<p>Os utilizadores do grupo <strong>administrators</strong> podem repor as defini&ccedil;&otilde;es de verifica&ccedil;&atilde;o de 2 passos de outros utilizadores. 
<ol>
<li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Utilizador</strong>.</li>
<li>Clique duas vezes no utilizador cuja verifica&ccedil;&atilde;o de 2 passos deseja repor.</li>
<li>No separador <strong>Informa&ccedil;&atilde;o de Utilizador</strong>, clique no bot&atilde;o <strong>Repor Verifica&ccedil;&atilde;o de 2 Passos</strong>.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Se um utilizador do grupo <strong>administrators</strong> n&atilde;o estiver dispon&iacute;vel, pode premir o bot&atilde;o de reposi&ccedil;&atilde;o no seu Synology NAS para repor as defini&ccedil;&otilde;es do DSM e desativar a verifica&ccedil;&atilde;o de 2 passos.</li>
</ul>
</div>


<h3>Atividade da Conta</h3>
<p>A atividade da conta mostra a atividade de in&iacute;cio de sess&atilde;o da sua conta DSM, incluindo liga&ccedil;&otilde;es atuais, dispositivos lembrados e hist&oacute;rico de in&iacute;cio de sess&atilde;o.</p>


<h4>Para verificar a atividade da sua conta:</h4>
<p>Clique no bot&atilde;o <strong>Atividade da Conta</strong>. &Eacute; apresentada uma janela com os seguintes separadores:

<ul>
<li><strong>Utilizadores Ligados:</strong> Este separador mostra as seguintes informa&ccedil;&otilde;es:
  <ul>
<li><strong>Data e Hora:</strong> Quando a conta foi acedida.</li>
<li><strong>Nome e IP cliente:</strong> O nome e endere&ccedil;o IP do dispositivo que acedeu &agrave; conta. O nome cliente apenas aparece quando a conta &eacute; acedida com o protocolo CIFS.</li>
<li><strong>Servi&ccedil;o:</strong> O protocolo utilizado para aceder &agrave; conta.</li>
<li><strong>Recurso:</strong> Os recursos de sistema utilizados pela conta.</li>
</ul></li>

<li><strong>Dispositivos Lembrados:</strong> Este separador mostra a p&aacute;gina de gest&atilde;o de dispositivos lembrados:
   <ul>
<li><strong>O dispositivo atual est&aacute; / n&atilde;o est&aacute; lembrado:</strong> Clique em <strong>Confiar neste dispositivo</strong> se optar por lembrar o dispositivo atual, e n&atilde;o mais ser&aacute; necess&aacute;ria verifica&ccedil;&atilde;o de 2 passos quando inicia a sess&atilde;o no DSM neste dispositivo.</li>

<li><strong>Parar de lembrar outros dispositivos:</strong> Poder&aacute; parar de lembrar outros dispositivos (por ex., outros computadores ou dispositivos m&oacute;veis) que tenha lembrado. Isto significa que a verifica&ccedil;&atilde;o de 2 passos ser&aacute; necess&aacute;ria quando iniciar a sess&atilde;o na DSM nestes dispositivos.</li>
</ul></li>


<li><strong>Hist&oacute;rico de In&iacute;cio de Sess&atilde;o:</strong> Este separador mostra as sess&otilde;es recentes de in&iacute;cio de sess&atilde;o e as seguintes informa&ccedil;&otilde;es:
<ul>
<li><strong>Data e Hora:</strong> Quando a conta foi acedida.</li>
<li><strong>Evento:</strong> Mostra o nome de utilizador e o endere&ccedil;o IP.</li>
</ul>
</li>
</ul>


<div class="section">
<h4>Nota:</h4>
<p>O dispositivo que assinalar como lembrado ser&aacute; recordado apenas quando iniciar a sess&atilde;o na mesma conta e no mesmo navegador. Ter&aacute; ainda de introduzir uma OTP (palavra-passe de utiliza&ccedil;&atilde;o &uacute;nica) para verifica&ccedil;&atilde;o de 2 passos nos cen&aacute;rios que se seguem, mesmo que tenha anteriormente assinalado um dispositivo como recordado:</p>
<ul>
<li>Inicia a sess&atilde;o com a mesma conta, mas num navegador diferente.</li>
<li>Os seus cookies foram removidos do navegador.</li>
<li>Assinala um dispositivo como recordado quando inicia a sess&atilde;o como Utilizador A, e depois assinala o mesmo dispostivo como recordado quando inicia a sess&atilde;o como Utilizador B. Quando inicia a sess&atilde;o novamente como Utilizador A, tem ainda de introduzir uma palavra-passe para a verifica&ccedil;&atilde;o de 2 passos.</li>
</ul>

</div>


</body>
</html>