
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Ressursoverv&aring;ker</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Ytelse</h2>
<p>Klikk p&aring; kategorien <strong>Ytelse</strong> for &aring; vise data for ressursutnyttelse. Detaljert dato, tidspunkt og informasjon i tabellen vises n&aring;r du beveger musen over.</p>

<h3>CPU</h3>
<p>Du kan se det samlede CPU-forbruket for <strong>Bruker</strong>, <strong>System</strong> og <strong>I/O Vent</strong>. CPU-belastningen kan v&aelig;re h&oslash;y n&aring;r ressursoverv&aring;keren f&oslash;rst startes, siden systemet m&aring; samle inn sine ressursdata og laste inn grensesnittsiden samtidig.</p>
<p><strong>Bruker</strong> viser prosentandel av CPU som brukes for &aring; kj&oslash;re programmer. <strong>System</strong> viser prosentandel av CPU som brukes i systemets kjerne, maskinvare-/programvare-IRQ. <strong>I/O Vent</strong> viser prosentandel av CPU som brukes p&aring; I/O Vent.</p>
<p><strong>Utnyttelse</strong> er summen av CPU-forbruk for <strong>Bruker</strong> og <strong>System</strong>.</p>
<p>Belastningsgjennomsnitt innenfor 1, 5 og 15 minutter vises med kj&oslash;rek&oslash;lengde (dvs. summen av antall prosesser som kj&oslash;rer pluss antallet som venter p&aring; &aring; kj&oslash;re). </p>
<div class="section">
<h4>Begrepsforklaring</h4>
<ul>
<li><b>I/O Vent</b>: I/O Vent indikerer at CPU er inaktiv og ikke brukes av noen programmer. </li>
<p>I/O Vent er normalt. Siden hastigheten til CPU er raskere enn hastigheten til I/O, er det normalt at CPU m&aring; vente p&aring; at overf&oslash;ringen av disker eller nettverk skal fullf&oslash;res. Men hvis prosentandelen av I/O Vent er ekstremt h&oslash;y, betyr det at CPU bruker mesteparten av tiden sin p&aring; I/O Vent og er muligens ikke godt utnyttet. Du kan bruke mer effektive diskgruppekonfigurasjoner (for eksempel SHR eller RAID 5) eller nettverkskonfigurasjoner (for eksempel Bonding) for &aring; oppn&aring; bedre systemytelse.</p> 
</ul>
</div>
<h3>Minne</h3>
<p>Det samlede minneforbruket for det fysiske minnet og veksleplass vil bli vist. Minebruken holder seg h&oslash;y fordi systemet lagrer data som det bruker ofte i bufferen, slik at det f&aring;r rask tilgang til dataene uten &aring; bruke harddisken. Bufferminnet frigis hvis det generelle minnet er utilstrekkelig.</p>
<p>H&oslash;yt forbruk av veksleplass indikerer utilstrekkelig systemminne og vil ogs&aring; p&aring;virke systemytelsen. Du kan vise hastigheten for bytt inn og bytt ut ved &aring; velge <strong>Bytt</strong> fra rullegardinmenyen &oslash;verst. </p>

<h3>Nettverk</h3>
<p>Nettverksflyttabellen viser hastighet for sendt og mottatt data i KB per sekund. Hvis PPPoE er tilkoblet, blir ogs&aring; overf&oslash;ringshastigheten vist i tabellen.</p>

<h3 class="disable-dockerx64">Disk</h3>
<p class="disable-dockerx64">Du kan velge &aring; vise den samlede diskutnyttelsen, overf&oslash;ringshastighet eller IOPS ved &aring; klikke p&aring; rullegardinmenyen &oslash;verst i tabellen. Du kan klikke p&aring; <strong>Vis alle</strong> nederst for &aring; velge flere disker ved &aring; merke av for &aring; legge til deres data i tabellen.</p>


<h3 class="disable-eds14 disable-dockerx64">Volum</h3>
<p class="disable-eds14 disable-dockerx64">Denne siden viser volumenes generelle status. Klikk i rullegardinmenyen ovenfor tabellen for &aring; vise overf&oslash;ringsbruk, overf&oslash;ringshastighet eller IOPS. Klikk p&aring; knappen <strong>Vis alle</strong> for &aring; velge enkeltvolum og legge dem til i tabellen.</p>

<h3 class="disable-eds14 disable-dockerx64">iSCSI</h3>
<p class="disable-eds14 dixable-dockerx64">Denne siden viser kj&oslash;rende iSCSI LUN-ers generelle status. Klikk p&aring; rullegardinmenyen ovenfor tabellen for &aring; velge et LUN og se statusen. Tre tabeller vises som standard, nemlig <strong>Gjennomstr&oslash;mming</strong>, <strong>IOPS</strong> og <strong>Ventetid</strong>. For mer detaljert informasjon, kan du klikke p&aring; <strong>Velg tabeller</strong>-knappen for &aring; velge andre tabeller.</p>

</body>
</html>
