
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Ressursoverv&aring;ker</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Ytelsesalarm*</h2>
<h4>Slik oppretter du en ytelsesalarmregel:</h4>
<ol>
<li>G&aring; til <strong>Innstillinger</strong> &gt; <strong>Innstillinger</strong> og kontroller at du har merket av for <strong>Aktiver ytelsesalarm</strong>.</li>
<li>G&aring; til <strong>Innstillinger</strong> &gt; <strong>Regler for ytelsesalarm</strong>.</li>
<li>Klikk p&aring; knappen <b>Opprett</b>.</li>
<li>F&oslash;lgende regelinnstillinger er tilgjengelige:</li>
<ul>
<li><strong>Ressurs</strong>: Velg en ressurs regelen skal brukes p&aring;.</li>
<li><strong>Type</strong>: Velg regeltypen du vil opprette.</li>
<li><strong>Niv&aring;</strong>: Velg alarmniv&aring;.</li>
<li><strong>St&oslash;rre enn</strong>: Angi regeltypens prosentandel som m&aring; overskrides for at systemet skal varsle deg.</li>
</ul>
<li>Merk av for <strong>Aktivert</strong> hvis du vil aktivere denne regelen umiddelbart.</li>
<li>Klikk p&aring; <strong>OK</strong> for &aring; legge til regelen.</li>
</ol>


<div class="section">
<h4>Mekanisme for ytelsesalarm:</h4>
<p>Ytelsesalarmer virker gjennom f&oslash;lgende mekanismer for &aring; minimalisere falske alarmer og unng&aring; overfl&oslash;dig bruk av systemressurser.</p>
<ol>
	<li>Ytelsesalarmtjenesten kontrollerer alle regler hvert femte minutt. Ingen handling blir utl&oslash;st hvis alle overv&aring;kede verdier holder seg under terskelen du har angitt.</li>
	<li>N&aring;r en overv&aring;ket verdi overskrider terskelen, blir ikke alarmen utl&oslash;st umiddelbart. I stedet vil systemet kontrollere regelen fem ganger til med 30 sekunders mellomrom.</li>
	<li>Hvis den overv&aring;kede verdien overskrider terskelen 5 ganger p&aring; rad, blir det utl&oslash;st en alarm; men hvis den overv&aring;kede verdien holder seg under terskelen p&aring; &eacute;n av disse fem kontrollene, blir kontrollintervallet endret tilbake til fem minutter.</li>
</ol>
<p>S&aring; alarmen blir tidligst utl&oslash;st 450 sekunder etter at hendelsen ble registrert f&oslash;rste gang.</p>

<h4>Alarmniv&aring;er:</h4>
<p>Ytelsesalarmer utl&oslash;ser ulike handlinger avhengig av alarmniv&aring;et.</p>
<ul>
	<li><strong>Advarsel</strong>: Genererer en advarselmelding i systemloggen, men vil ikke utl&oslash;se en systemvarsling.</li>
	<li><strong>Kritisk</strong>: Generer en melding i systemloggen, men utl&oslash;ser ogs&aring; systemmeldinger.</li>
</ul>
<p>Logger for ytelsesalarmer kan vises i <strong>Ytelsesalarm</strong>-fanen eller i DSMs <strong>Loggsenter</strong>.</p>
</div>


<h4>Slik viser du ytelsesalarmer:</h4>
<ul>
<li>G&aring; til <strong>Ytelsesalarm</strong>-fanen for &aring; vise alle utl&oslash;ste ytelsesalarmer.</li>
<li>Klikk p&aring; <strong>Oppdater</strong> for &aring; se de nyeste alarmene.</li>
</ul>

<h4>Slik eksporterer du ytelsesalarmer:</h4>
<ol>
<li>G&aring; til <strong>Ytelsesalarm</strong>.</li>
<li>Klikk p&aring; pilen ved siden av knappen <strong>Eksporter</strong>.</li>
<li>Du kan velge &aring; eksportere alarmene i <strong>HTML</strong> eller <strong>CSV</strong>.</li>
</ol>
<div class="section"><h4>Merk:</h4>
<ul>
<li>St&oslash;tten for <strong>Ytelsesalarm</strong> varierer mellom Synology NAS-modeller. For mer informasjon kan du g&aring; til <a href="http://www.synology.com/" target="_blank">www.synology.com</a>.</li>
</ul>
</div>

<p>____<br /> * Bare tilgjengelig p&aring; bestemte modeller.</p>

</body>
</html>
