<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=utf-8" http-equiv="Content-Type" />
<title>Z&aacute;lohov&aacute;n&iacute; dat v&nbsp;poč&iacute;tači pomoc&iacute; služby Synology Drive Client</title>
</head>

<body class="tutorial-content-box" >

<h1>Z&aacute;lohov&aacute;n&iacute; dat v&nbsp;poč&iacute;tači pomoc&iacute; služby Synology Drive Client</h1>
<div class="tutorials_content"><img style="width: 720px; height: auto;" src="../../images/Backup/1x/backup_from_PC/07_1_back_up_your_data_from_pc.png" /><h2>Přehled</h2>
<p>Synology Drive Server nen&iacute; jen sofistikovan&yacute; meziplatformov&yacute; synchronizačn&iacute; software, ale představuje tak&eacute; chytr&yacute; způsob z&aacute;lohov&aacute;n&iacute; dat z&nbsp;osobn&iacute;ch poč&iacute;tačů uživatelů.&nbsp;Jeho n&aacute;stroj pro stoln&iacute; poč&iacute;tače &ndash; Synology Drive Client &ndash; představuje ře&scaron;en&iacute; okamžit&eacute;ho, &scaron;&iacute;řku p&aacute;sma &scaron;etř&iacute;c&iacute;ho z&aacute;lohov&aacute;n&iacute; v&nbsp;re&aacute;ln&eacute;m čase a nab&iacute;z&iacute; vynikaj&iacute;c&iacute; ochranu pomoc&iacute; až 32 historick&yacute;ch verz&iacute; každ&eacute;ho souboru.</p>

<h3>Nastaven&iacute; služby Synology Drive Server v&nbsp;zař&iacute;zen&iacute; Synology NAS a stažen&iacute; aplikace Synology Drive Client</h3>
<ol>
<li>Přejděte do č&aacute;sti <b>Centrum bal&iacute;čků</b>, vyhledejte položku <b>Synology Drive Server</b> a potom klikněte na možnost <strong>Instalovat</strong>. Dojde k&nbsp;současn&eacute;mu stažen&iacute; tř&iacute; bal&iacute;čků, Synology Drive Admin Console, Synology Drive ShareSync a Synology Drive.</li>
<li>Spusťte bal&iacute;ček <strong>Synology Drive</strong>. V&nbsp;prav&eacute;m doln&iacute;m rohu se zobraz&iacute; v&yacute;zva ke stažen&iacute; aplikace <strong>Synology Drive Client</strong>.<br> <img style="width: 300px; height: auto;" src="../../images/Backup/3x/Backup/Image 5.png" /><br> Nebo klikněte na ikonu uživatele v&nbsp;lev&eacute;m doln&iacute;m rohu a přejděte do č&aacute;sti <strong>Klient</strong> &gt; <strong>St&aacute;hnout klienta</strong>.<br> <img style="width: 300px; height: auto;" src="../../images/Backup/3x/Backup/Image 4.png" /><br> Aplikaci Synology Drive Client lze př&iacute;padně st&aacute;hnout tak&eacute; z&nbsp;<a href="https://www.synology.com/support/download" target="_blank">Centra pro stahov&aacute;n&iacute; Synology</a>.</li>
<li>Spusťte na poč&iacute;tači instalačn&iacute; program a postupujte podle pokynů pro instalaci aplikace Synology Drive Client. Po instalaci spusťte aplikaci <strong>Synology Drive Client</strong> kliknut&iacute;m na možnost <strong>Zač&iacute;t</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/01.png" /></li>
<li>Vyberte <strong>&uacute;lohu z&aacute;lohov&aacute;n&iacute;</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/02.png" /></li>
<li>Zadejte adresu nebo QuickConnect ID serveru Synology NAS se spu&scaron;těnou službou Synology Drive Server, uživatelsk&eacute; jm&eacute;no a heslo. Můžete tak&eacute; kliknout na ikonu vyhled&aacute;v&aacute;n&iacute; vpravo a&nbsp;služba Synology Drive Client automaticky vyhled&aacute; v&scaron;echna zař&iacute;zen&iacute; Synology NAS v&nbsp;r&aacute;mci m&iacute;stn&iacute; s&iacute;tě. Klikněte na možnost <strong>Dal&scaron;&iacute;</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/03.png" /></li>
<li>Vyberte zdroj z&aacute;lohov&aacute;n&iacute; a zru&scaron;te za&scaron;krtnut&iacute; v&scaron;ech podsložek, kter&eacute; synchronizovat nechcete. Služba Synology Drive Client vytvoř&iacute; na vybran&eacute;m c&iacute;li z&aacute;lohov&aacute;n&iacute; z&aacute;lohovac&iacute; složku s&nbsp;n&aacute;zvem va&scaron;eho poč&iacute;tače. Podle v&yacute;choz&iacute;ho nastaven&iacute; bude jako c&iacute;lov&aacute; složka vybr&aacute;na složka <strong>home</strong>. Pokud chcete použ&iacute;t složku, kter&aacute; nen&iacute; na seznamu, obraťte se na spr&aacute;vce syst&eacute;mu. Spr&aacute;vci syst&eacute;mu si mohou přeč&iacute;st <a href="https://www.synology.com/knowledgebase/DSM/help/SynologyDrive/drive_admin_console" target="_blank">str&aacute;nku n&aacute;povědy služby Synology Drive Admin Console</a>. Na možnost <strong>Pravidla z&aacute;lohov&aacute;n&iacute;</strong> můžete kliknout i tehdy, když si přejete nastavit filtry či pravidla synchronizace. Klikněte na možnost <b>Dal&scaron;&iacute;</b>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/backup_source.png" /></li>
<li>Vyberte režim z&aacute;lohov&aacute;n&iacute; a&nbsp;klikněte na možnost <b>Dal&scaron;&iacute;</b>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/backup_mode.png" /></li>
<li>Zkontrolujte shrnut&iacute; nastaven&iacute; z&aacute;lohov&aacute;n&iacute;. Chcete-li prov&eacute;st nějak&eacute; změny, klikněte na možnost <b>Zpět</b> nebo dokončete nastaven&iacute; kliknut&iacute;m na možnost <strong>Hotovo</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/backup_summary.png" /></li>
<li>Postup z&aacute;lohov&aacute;n&iacute; se zobrazuje v&nbsp;hlavn&iacute;m okně.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/progress.png" /></li>
</ol>

<h3>Stažen&iacute; nebo obnoven&iacute; předchoz&iacute; verze synchronizovan&eacute;ho souboru v&nbsp;aplikaci Synology Drive Client</h3>
<ol>
<li>V&nbsp;aplikaci Synology Drive Client přejděte do č&aacute;sti <strong>&Uacute;lohy z&aacute;lohov&aacute;n&iacute;</strong> &gt; <strong>Obnoven&iacute;</strong> a vyhledejte soubor nebo složku, kterou chcete obnovit.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/restore.png" /></li>
<li>Vyberte soubor, kter&yacute; chcete nač&iacute;st, a klikněte na možnost <strong>Proch&aacute;zet předchoz&iacute; verze</strong>. Jestliže byl soubor z&nbsp;poč&iacute;tače omylem odstraněn nebo odebr&aacute;n, můžete ho obnovit kliknut&iacute;m na možnost <strong>Obnovit</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/previous_version.png" /></li>
<li>Vyberte verzi souboru, kter&yacute; chcete st&aacute;hnout, a klikněte na možnost <strong>St&aacute;hnout</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/download_restore.png" /></li>
</ol>

<h3>Stažen&iacute; nebo obnoven&iacute; předchoz&iacute; verze synchronizovan&eacute;ho souboru ve službě Synology Drive Admin Console</h3>
<ol>
<li>V&nbsp;syst&eacute;mu DSM přejděte do č&aacute;sti <strong>Synology Drive Admin Console</strong> &gt; <strong>Složka t&yacute;mu</strong>, klikněte na složku, ve kter&eacute; se nach&aacute;z&iacute; soubor, kter&yacute; chcete obnovit, a klikněte na možnost <strong>Průzkumn&iacute;k verz&iacute;</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/version_history.png" /></li>
<li>V&nbsp;okně <strong>Průzkumn&iacute;k verz&iacute;</strong> klikněte na soubor, kter&yacute; chcete nač&iacute;st, a klikněte na možnost <strong>Proch&aacute;zet předchoz&iacute; verze</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/browse_previous versions_server.png" /></li>
<li>Vyberte verzi souboru, kter&yacute; chcete st&aacute;hnout, a klikněte na možnost <strong>St&aacute;hnout</strong>. Nebo pokud si jste jist&iacute;, že chcete vybranou verzi obnovit, klikněte na možnost <strong>Obnovit</strong> &ndash; aktu&aacute;ln&iacute; verze se takto přep&iacute;&scaron;e.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/previous_versions.png" /></li>
</ol>

<h3>Dal&scaron;&iacute; ochrana dat</h3>
<p>Dal&scaron;&iacute; způsoby, jak chr&aacute;nit a z&aacute;lohovat data, objev&iacute;te po kliknut&iacute; na <a href="https://www.synology.com/knowledgebase/tutorials#BackupRestore" target="_blank">tento odkaz</a>, kde se nach&aacute;zej&iacute; dal&scaron;&iacute; n&aacute;vody t&yacute;kaj&iacute;c&iacute; se dal&scaron;&iacute;ch služeb z&aacute;lohov&aacute;n&iacute; nab&iacute;zen&yacute;ch syst&eacute;mem DSM.</p>

</div>
<div class="section">
<ul>
<li>Dal&scaron;&iacute; č&aacute;st tohoto t&eacute;matu: <a href="backup_backup.html">Z&aacute;lohov&aacute;n&iacute; dat ze zař&iacute;zen&iacute; Synology NAS</a>.</li>
</ul>
</div>

</body>
</html>