<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language"  charset="utf-8"/>
<meta content="text/html; charset=utf-8" http-equiv="Content-Type" />
<title>Tř&iacute;děn&iacute; a&nbsp;přehr&aacute;v&aacute;n&iacute; vide&iacute; pomoc&iacute; služby Video Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Kategorizace a přehr&aacute;v&aacute;n&iacute; vide&iacute; pomoc&iacute; služby Video Station</h1>
<div class="tutorials_content"><img src="../../images/HomeTheater/1x/home_theater_videos/Categorize_and_Play_Videos_with_Video_Station.png"/><h2>Přehled</h2>
<p>Pomoc&iacute; služby Video Station můžete snadno organizovat a kategorizovat sb&iacute;rky videa do různ&yacute;ch v&yacute;choz&iacute;ch nebo vlastn&iacute;ch knihoven a zjednodu&scaron;it tak vyhled&aacute;n&iacute; určit&eacute;ho videa. Přehr&aacute;v&aacute;n&iacute; a sd&iacute;len&iacute; vide&iacute; je nav&iacute;c z&aacute;ležitost&iacute; několika jednoduch&yacute;ch kliknut&iacute;.</p>

<h3 class="list_head">1. Instalace služby Video Station</h3>
<p>Chcete-li nainstalovat službu Video Station, přejděte do <b>Centra bal&iacute;čků</b>, vyhledejte bal&iacute;ček <b>Video Station</b> a pot&eacute; klikněte na možnost <b>Instalovat</b>.</p><img src="../../images/HomeTheater/1x/home_theater_videos/1.png" style="width: 700px; border: 1"/><h3 class="list_head">2. Ukl&aacute;d&aacute;n&iacute; a kategorizace vide&iacute; do v&yacute;choz&iacute;ch knihoven</h3>
<p>Služba Video Station nab&iacute;z&iacute; tři v&yacute;choz&iacute; knihovny, kter&eacute; vid&iacute;te na lev&eacute;m panelu: <b>Film</b>, <b>TV pořad</b> a <b>Dom&aacute;c&iacute; video</b>. Aby mohla b&yacute;t videa spr&aacute;vně indexov&aacute;na a kategorizov&aacute;na, mus&iacute;te nejprve do každ&eacute; knihovny přidat složku videa a pot&eacute; do odpov&iacute;daj&iacute;c&iacute;ch složek videa uložit soubory. Podle v&yacute;choz&iacute;ho nastaven&iacute; jsou ve sd&iacute;len&eacute; složce <b>video</b> pro v&yacute;choz&iacute; tři knihovny vytvořeny tři složky videa: <b>movie</b>, <b>TV show</b> a <b>home video</b>. Dal&scaron;&iacute; složky videa můžete do těchto tř&iacute; složek přid&aacute;vat do knihoven n&aacute;sleduj&iacute;c&iacute;m způsobem.</p>

<div class="code_div"><b>Pozn&aacute;mka:</b><p>Syst&eacute;m pro dva typy videa (film a televizn&iacute; pořad) na internetu automaticky vyhled&aacute; metadata a dal&scaron;&iacute; informace (např&iacute;klad obr&aacute;zek plak&aacute;tu). Aby mohla b&yacute;t videa sp&aacute;rov&aacute;na se spr&aacute;vn&yacute;mi informacemi, měla by videa odpov&iacute;dat stanoven&eacute;mu typu videa podle př&iacute;slu&scaron;n&eacute; knihovny.</p>
</div>

<h4>Přid&aacute;n&iacute; složek videa do v&yacute;choz&iacute;ch knihoven</h4>
<ol>
<li>Přejděte do č&aacute;sti <b>Nastaven&iacute;</b> &gt; <b>Knihovna</b>.</li><img src="../../images/HomeTheater/1x/home_theater_videos/2.png" style="width: 700px; border: 1"/><li>Klikněte na ikonu <strong>Přidat složku</strong>, vyberte složku v&nbsp;zař&iacute;zen&iacute; Synology NAS a vyberte c&iacute;lovou knihovnu. Do jedn&eacute; knihovny můžete přidat až 100 složek videa, po v&yacute;běru určit&eacute; složky ale tuto složku ani jej&iacute; podsložky již nelze vybrat pro ž&aacute;dnou jinou knihovnu.</li><img src="../../images/HomeTheater/1x/home_theater_videos/3.png" style="width: 700px; border: 1"/><li>Uložen&iacute;m souborů videa do složek videa proveďte zařazen&iacute; vide&iacute; do odpov&iacute;daj&iacute;c&iacute;ch knihoven.</li>
<li>Nyn&iacute; můžete požadovan&aacute; videa proch&aacute;zet a sledovat z&nbsp;těchto knihoven!</li>
</ol>

<h3 class="list_head">3. Ukl&aacute;d&aacute;n&iacute; a zařazen&iacute; vide&iacute; do vlastn&iacute;ch knihoven</h3>
<p>Kromě tř&iacute; v&yacute;choz&iacute;ch knihoven, do kter&yacute;ch může podle v&yacute;choz&iacute;ho nastaven&iacute; přistupovat kdokoli, můžete jako uživatel <B>admin</B> syst&eacute;mu DSM nebo uživatel&eacute; patř&iacute;c&iacute; do skupiny <b>administrators</b> vytv&aacute;řet rovněž vlastn&iacute; knihovny a přidělovat př&iacute;stupov&aacute; opr&aacute;vněn&iacute; uživatelům.</p>

<h4>Vytvořen&iacute; vlastn&iacute;ch knihoven</h4>
<ol>
<li>Přejděte do č&aacute;sti <b>Nastaven&iacute;</b> &gt; <b>Knihovna</b> a kliknut&iacute;m na ikonu plus vytvořte knihovnu.</li><img src="../../images/HomeTheater/1x/home_theater_videos/4.png" style="width: 700px; border: 1"/><li>Zadejte n&aacute;zev nov&eacute; knihovny, vyberte typ vide&iacute;, kter&yacute; chcete do složky vložit. Pot&eacute; zvolte možnost <b>Veřejn&eacute;</b>, pokud chcete umožnit př&iacute;stup do knihovny komukoli, nebo možnost <b>Soukrom&eacute;</b>, chcete-li omezit př&iacute;stup na určit&eacute; uživatele s&nbsp;opr&aacute;vněn&iacute;m. Videa um&iacute;stěn&aacute; do složky mus&iacute; odpov&iacute;dat zde zvolen&eacute;mu typu, aby bylo možn&eacute; z&nbsp;internetu shrom&aacute;ždit o&nbsp;videu spr&aacute;vn&eacute; informace.</li>
<li>Vyberete-li možnost <b>Soukrom&eacute;</b>, klikněte na možnost <b>Přiřadit opr&aacute;vněn&iacute;</b> a za&scaron;krtnut&iacute;m pol&iacute;ček udělte př&iacute;stup konkr&eacute;tn&iacute;m uživatelům.</li>
</ol>

<h3 class="list_head">4. Přehr&aacute;v&aacute;n&iacute; vide&iacute;</h3>
<p>Po kategorizaci souborů vide&iacute; do jednotliv&yacute;ch knihoven můžete pomoc&iacute; n&aacute;sleduj&iacute;c&iacute;ho postupu videa ve službě Video Station přehr&aacute;vat. Nejprve doporučujeme do poč&iacute;tače nainstalovat aplikaci <a href="http://www.videolan.org/vlc/" target="_blank">VLC media player (Windows, Linux)</a>. Kromě přehr&aacute;v&aacute;n&iacute; vide&iacute; na m&iacute;stn&iacute;m poč&iacute;tači je možn&eacute; tak&eacute; přehr&aacute;vat datov&yacute; proud vide&iacute; na zař&iacute;zen&iacute;ch DMA kompatibiln&iacute;ch s&nbsp;protokolem DLNA/UPnP nebo zař&iacute;zen&iacute;ch kompatibiln&iacute;ch s&nbsp;technologi&iacute; AirPlay určen&yacute;ch k&nbsp;přehr&aacute;v&aacute;n&iacute; videa.</p>

<h4>Přehr&aacute;v&aacute;n&iacute; vide&iacute; pomoc&iacute; integrovan&eacute;ho přehr&aacute;vače videa</h4>
<ol>
<li>Vyberte videoklip, kter&yacute; chcete přehr&aacute;t, a pot&eacute; na obr&aacute;zku videa klikněte na ikonu pro přehr&aacute;v&aacute;n&iacute;.</li><img src="../../images/HomeTheater/1x/home_theater_videos/5.png" style="width: 700px; border: 1"/><li>Okamžitě by se mělo zah&aacute;jit přehr&aacute;v&aacute;n&iacute; videa. Pokud se tak nestane, tak se přesvědčte, jestli v&aacute;&scaron; webov&yacute; prohl&iacute;žeč podporuje tento form&aacute;t videa nebo jestli m&aacute;te v&nbsp;poč&iacute;tači nainstalovan&yacute; modul plug-in aplikace VLC.</li>
<li>Podle potřeby použ&iacute;vejte tlač&iacute;tka na obrazovce a indik&aacute;tor průběhu přehr&aacute;vače videa. Můžete rovněž upravit hlasitost, zvolit kvalitu přehr&aacute;v&aacute;n&iacute; videa a zvukovou stopu, zapnout titulky nebo odeslat datov&yacute; proud videa do jin&eacute;ho zař&iacute;zen&iacute; (pokud je to relevantn&iacute;).</li><img src="../../images/HomeTheater/1x/home_theater_videos/6.png" style="width: 700px; border: 1"/></ol>


<div class="code_div"><b>Pozn&aacute;mka:</b><p>Podrobnosti o&nbsp;modulu plug-in aplikace VLC a podporovan&yacute;ch zař&iacute;zen&iacute;ch se nach&aacute;zej&iacute; v&nbsp;<b>N&aacute;povědě syst&eacute;mu DSM</b> &gt; <b>Video Station</b> &gt; <b>Přehr&aacute;v&aacute;n&iacute; videa</b>.</p>
</div>
 
<h3 class="list_head">5. Sd&iacute;len&iacute; vide&iacute; veřejně</h3> 
<p>Pomoc&iacute; funkce veřejn&eacute;ho sd&iacute;len&iacute; můžete snadno sd&iacute;let svoje videa s&nbsp;dal&scaron;&iacute;mi osobami použ&iacute;vaj&iacute;c&iacute;mi službu Video Station a v&scaron;echna sd&iacute;len&aacute; videa budou veřejně př&iacute;stupn&aacute; komukoli s&nbsp;odkazem.</p>

<h4>Sd&iacute;len&iacute; vide&iacute; s&nbsp;ostatn&iacute;mi</h4>
<ol>
<li>Přejděte do libovoln&eacute; knihovny vide&iacute; a kliknut&iacute;m na možnost <strong>V&scaron;e</strong> v&nbsp;lev&eacute;m horn&iacute;m rohu obrazovky zobrazte v&scaron;echna videa v&nbsp;t&eacute;to knihovně.</li>
<li>Klikněte na ikonu <b>Režim v&yacute;běru</b> nebo stisknut&iacute;m a podržen&iacute;m kl&aacute;ves <b>Ctrl</b> nebo <b>Shift</b> vyberte v&iacute;ce vide&iacute;. Pot&eacute; klikněte na ikonu <strong>Veřejn&eacute; sd&iacute;len&iacute;</strong>.</li>
<ul>
<li>Pokud jste vybrali ke sd&iacute;len&iacute; pouze jedno video, přid&aacute; se video do sd&iacute;len&eacute;ho alba s&nbsp;n&aacute;zvem <b>Sd&iacute;len&aacute; videa</b>. Zde je možn&eacute; spravovat v&scaron;echna videa, kter&aacute; jste sd&iacute;leli, jedno po druh&eacute;m.</li>
<li>Pokud jste ke sd&iacute;len&iacute; vybrali v&iacute;ce vide&iacute;, seskup&iacute; se videa do nov&eacute; sd&iacute;len&eacute; sb&iacute;rky.</li><img src="../../images/HomeTheater/1x/home_theater_videos/9_.png" style="width: 700px; border: 1"/></ul>
<li>V&nbsp;př&iacute;padě potřeby zadejte dobu platnosti.</li>
<li>Na obr&aacute;zku c&iacute;lov&eacute;ho filmu můžete rovněž kliknout na ikonu <strong>v&iacute;ce</strong> a kliknut&iacute;m na možnost <strong>Veřejn&eacute; sd&iacute;len&iacute;</strong> přidat vybran&eacute; video do sb&iacute;rky <strong>Sd&iacute;len&iacute; videa</strong>.</li><img src="../../images/HomeTheater/1x/home_theater_videos/7_.png"  style="width: 700px; border: 1"/><li>Stač&iacute; odkaz zkop&iacute;rovat a vložit do e-mailů, do okamžit&yacute;ch zpr&aacute;v nebo na webov&eacute; str&aacute;nky a sd&iacute;let tak videa s&nbsp;k&yacute;mkoli.</li>
</ol> 


<h3 class="list_head">6. Organizace a sledov&aacute;n&iacute; vide&iacute; na mobiln&iacute;ch zař&iacute;zen&iacute;ch</h3>
<p>Pokud se chcete ke službě Video Station připojit prostřednictv&iacute;m mobiln&iacute;ch zař&iacute;zen&iacute;, můžete si pomoc&iacute; n&iacute;že uveden&yacute;ch k&oacute;dů QR st&aacute;hnout aplikaci DS video pro zař&iacute;zen&iacute; iOS/Android a přehr&aacute;vat videa nebo organizovat sb&iacute;rky na vlastn&iacute;ch mobiln&iacute;ch zař&iacute;zen&iacute;ch, př&iacute;padně přen&aacute;&scaron;et datov&yacute; proud vide&iacute; do zař&iacute;zen&iacute; DMA či zař&iacute;zen&iacute; AirPlay doma i&nbsp;na cest&aacute;ch.</p><img src="../../images/HomeTheater/1x/home_theater_videos/8.png"/></div>
<div class="page-info">
  <ul>
    <li>Předchoz&iacute; č&aacute;st tohoto t&eacute;matu: <a href="home_theater_media_server.html">Pr&aacute;ce s&nbsp;multimedi&aacute;ln&iacute;m obsahem uložen&yacute;m v&nbsp;zař&iacute;zen&iacute; Synology NAS na velk&yacute;ch obrazovk&aacute;ch</a> </li>
    <li>Dal&scaron;&iacute; č&aacute;st tohoto t&eacute;matu: <a href="home_theater_music.html">Vychutn&aacute;vejte si hudbu uloženou na zař&iacute;zen&iacute; Synology NAS prostřednictv&iacute;m služby Audio Station</a> </li>
  </ul>
</div>
</body>
</html>