<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=utf-8" http-equiv="Content-Type" />
<title>Vytv&aacute;řen&iacute; alb při spr&aacute;vě a proch&aacute;zen&iacute; fotografi&iacute; pomoc&iacute; služby Photo Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Vytv&aacute;řen&iacute; alb při spr&aacute;vě a proch&aacute;zen&iacute; fotografi&iacute; pomoc&iacute; služby Photo Station</h1>
<div class="tutorials_content"><img src="../../images/ManagePhotos/1x/manage_share_photos/Create_Albums_to_Manage_and_Browse_Photos_with_Photo_Station.jpg"/><h2>Přehled</h2>
<p>Photo Station je webov&aacute; aplikace určen&aacute; jako pomůcka při organizov&aacute;n&iacute; a zobrazov&aacute;n&iacute; fotografi&iacute; uložen&yacute;ch v&nbsp;zař&iacute;zen&iacute; Synology NAS přes internet. D&iacute;ky odladěn&eacute;mu a&nbsp;uživatelsky př&iacute;jemn&eacute;mu rozhran&iacute; stač&iacute; ve službě Photo Station k&nbsp;odes&iacute;lan&iacute;, proch&aacute;zen&iacute;, spr&aacute;vě a sd&iacute;len&iacute; fotoalb jen p&aacute;r kliknut&iacute;.</p>

<h3 class="list_head">1. Instalace služby Photo Station</h3>
<p>Chcete-li nainstalovat službu Photo Station, přejděte do <b>Centra bal&iacute;čků</b>, vyhledejte bal&iacute;ček <b>Photo Station</b> a pot&eacute; klikněte na možnost <b>Instalovat</b>.</p><img src="../../images/ManagePhotos/1x/manage_share_photos/1.png" border="1"/><h3 class="list_head">2. Odeslat fotografie</h3>
<p>Než začnete proch&aacute;zet a spravovat fotografie ve službě Photo Station, mus&iacute;te nejprve někter&yacute;m z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch způsobů vytvořit alba a odeslat fotografie.</p>

<h4>2.1 Odesl&aacute;n&iacute; fotografi&iacute; pomoc&iacute; aplikace Synology Photo Station Uploader (k&nbsp;dispozici pro syst&eacute;my Windows a Mac)</h4>
<p>Použit&iacute; aplikace Synology Photo Station Uploader doporučujeme kvůli tomu, že se v&nbsp;průběhu procesu odes&iacute;l&aacute;n&iacute; vytvoř&iacute; miniatury jednotliv&yacute;ch fotografi&iacute;. Pokud ode&scaron;lete soubory pomoc&iacute; aplikace Synology Photo Station Uploader, urychl&iacute;te převod využit&iacute;m v&yacute;početn&iacute;ho v&yacute;konu sv&eacute;ho poč&iacute;tače.</p>
<ol>
<li>St&aacute;hněte a nainstalujte aplikaci <b>Synology Photo Station Uploader</b> (dostupn&aacute; v&nbsp;<a href="https://www.synology.com/support/download" target="_blank">Centru pro stahov&aacute;n&iacute; společnosti Synology</a>).</li>
<li>V&nbsp;poč&iacute;tači klikněte na fotografie, kter&eacute; chcete odeslat, a v&yacute;běrem možnosti <b>Odeslat do Photo Station</b> &gt; <b>Vytvořit nov&yacute; profil</b> otevřete průvodce.</li>
<li>Zadejte libovoln&yacute; n&aacute;zev a n&aacute;zev serveru nebo IP adresu c&iacute;lov&eacute;ho zař&iacute;zen&iacute; Synology NAS pro nov&yacute; profil.</li><img src="../../images/ManagePhotos/1x/manage_share_photos/2.png" border="1"/><div class="code_div"><b>Pozn&aacute;mka:</b><p>Zadan&eacute; informace o&nbsp;serveru a&nbsp;přihla&scaron;ovac&iacute; &uacute;daje pro tento profil se ulož&iacute;, aby je bylo možn&eacute; využ&iacute;t v&nbsp;budoucnu. Je možn&eacute; založit několik profilů podle různ&yacute;ch pravidel nebo c&iacute;lů. Takže př&iacute;&scaron;tě m&iacute;sto toho, abyste do aplikace Synology Photo Station Uploader opět zad&aacute;vali informace o&nbsp;serveru, můžete vybrat st&aacute;vaj&iacute;c&iacute; profil, použ&iacute;t dř&iacute;ve zadan&aacute; nastaven&iacute; a&nbsp;odeslat fotky do stejn&eacute;ho c&iacute;le.</p>
</div>

<li>Zvolte, zda chcete fotky odeslat do služby Photo Station nebo Osobn&iacute; Photo Station.</li>

<li>Zadejte přihla&scaron;ovac&iacute; &uacute;daje pro c&iacute;lov&eacute; zař&iacute;zen&iacute; Synology NAS.</li>

<li>Kliknut&iacute;m na možnost <b>Proch&aacute;zet</b> vyberte c&iacute;lovou složku nebo vytvořte podsložku ve sd&iacute;len&eacute; složce <b>photo</b>.</li><img src="../../images/ManagePhotos/1x/manage_share_photos/3.png" border="1"/><li>Po dokončen&iacute; odes&iacute;l&aacute;n&iacute; můžete v&nbsp;zař&iacute;zen&iacute; Synology NAS spustit službu Photo Station a zde si prohl&iacute;žet odeslan&eacute; soubory v&nbsp;různ&yacute;ch režimech, př&iacute;padně upravovat dal&scaron;&iacute; informace, např&iacute;klad vlastnosti alb a př&iacute;stupov&aacute; opr&aacute;vněn&iacute;.</li>
</ol>


<h4>2.2 Vytv&aacute;řen&iacute; alb a odes&iacute;l&aacute;n&iacute; fotografi&iacute; pomoc&iacute; služby Photo Station</h4>
<p>Spusťte službu <b>Photo Station</b> a kliknut&iacute;m na možnost <b>Přidat</b> vytvořte nov&eacute; album nebo do již existuj&iacute;c&iacute;ch alb ode&scaron;lete fotografie z&nbsp;poč&iacute;tače nebo ze zař&iacute;zen&iacute; Synology NAS.</p><img src="../../images/ManagePhotos/1x/manage_share_photos/4.png" border="1"/><div class="code_div"><b>Pozn&aacute;mka:</b><p>Pokud upřednostňujete odes&iacute;l&aacute;n&iacute; fotografi&iacute; prostřednictv&iacute;m rozhran&iacute; služby Photo Station, důrazně doporučujeme povolit službu QuickConnect. Ať už jste doma nebo na cest&aacute;ch, služba QuickConnect v&aacute;m povol&iacute; př&iacute;stup k&nbsp;zař&iacute;zen&iacute; Synology NAS a službě Photo Station odkudkoli prostřednictv&iacute;m internetu, pomoc&iacute; vlastn&iacute;ho ID a bez nutnosti nastavovat složit&eacute; s&iacute;ťov&eacute; konfigurace, např&iacute;klad pravidla pro před&aacute;v&aacute;n&iacute; portů. Dal&scaron;&iacute; informace o&nbsp;službě QuickConnect se nach&aacute;zej&iacute; v&nbsp;<a class="launch-app" href="cloud_set_up_quickconnect.html">tomto n&aacute;vodu</a>.</p>
</div>

<h3 class="list_head">3. Sd&iacute;len&iacute; fotografi&iacute;</h3>
<p>Pomoc&iacute; funkce sd&iacute;len&iacute; můžete jednodu&scaron;e sd&iacute;let fotografie uložen&eacute; ve službě Photo Station s&nbsp;př&aacute;teli nebo odes&iacute;lat fotografie do obl&iacute;ben&yacute;ch soci&aacute;ln&iacute;ch s&iacute;t&iacute;, např&iacute;klad Facebook, Picasa a Flickr.</p>

<h4>3.1 Veřejn&eacute; sd&iacute;len&iacute; fotografi&iacute;</h4>
<ol>
<li>Přejděte do alba a vyberte fotografie, kter&eacute; chcete sd&iacute;let.</li>
<li>Kliknut&iacute;m na možnost <b>Sd&iacute;let</b> &gt; <b>Sd&iacute;let veřejně</b> z&iacute;sk&aacute;te odkaz.</li>
<ul>
<li>Pokud jste vybrali ke sd&iacute;len&iacute; pouze jednu fotografii, přid&aacute; se fotografie do v&yacute;choz&iacute;ho sd&iacute;len&eacute;ho alba s&nbsp;n&aacute;zvem <b>Sd&iacute;len&eacute; fotografie</b>. Zde je možn&eacute; spravovat v&scaron;echny fotografie, kter&eacute; jste sd&iacute;leli, jednu po druh&eacute;.</li>
<li>Pokud jste ke sd&iacute;len&iacute; vybrali v&iacute;ce fotografi&iacute;, seskup&iacute; se fotografie do nov&eacute;ho sd&iacute;len&eacute;ho alba.</li>
</ul>
<li>Tak&eacute; můžete kliknout na možnost <b>Sd&iacute;let</b> &gt; <b>Přidat do sd&iacute;len&eacute;ho alba</b> a přidat fotografie do nějak&eacute;ho st&aacute;vaj&iacute;c&iacute;ho sd&iacute;len&eacute;ho alba (je-li k&nbsp;dispozici).</li><img src="../../images/ManagePhotos/1x/manage_share_photos/5.png" border="1"/><li>Zadejte n&aacute;zev nov&eacute;ho sd&iacute;len&eacute;ho alba a v&nbsp;př&iacute;padě potřeby zadejte dobu jeho platnosti.</li>
<li>Chcete-li vybran&eacute; fotografie s&nbsp;k&yacute;mkoliv sd&iacute;let, zkop&iacute;rujte odkaz a vložte ho do e-mailů, do okamžit&yacute;ch zpr&aacute;v nebo na webov&eacute; str&aacute;nky.</li>
</ol>

<div class="code_div"><b>Pozn&aacute;mka:</b><ul>
<li>Ke v&scaron;em sd&iacute;len&yacute;m fotografi&iacute;m m&aacute; veřejn&yacute; př&iacute;stup kdokoliv s&nbsp;t&iacute;mto odkazem.</li>
<li>V&nbsp;č&aacute;sti <b>Nastaven&iacute;</b> &gt; <b>Sd&iacute;len&iacute;</b> můžete stanovit, kteř&iacute; uživatel&eacute; maj&iacute; opr&aacute;vněn&iacute; sd&iacute;let položky ve službě Photo Station veřejně.</li>
</ul>
</div>

<h4>3.2 Sd&iacute;len&iacute; fotografi&iacute; do soci&aacute;ln&iacute;ch s&iacute;t&iacute;</h4>
<ol>
<li>Vyberte fotografie, kter&eacute; chcete odeslat, a&nbsp;pot&eacute; vyberte možnost <b>Sd&iacute;len&iacute;</b> &gt; <b>Odeslat na [weby soci&aacute;ln&iacute;ch s&iacute;t&iacute;]</b>.</li><img src="../../images/ManagePhotos/1x/manage_share_photos/6.png" border="1"/><li>V&nbsp;zobrazen&eacute;m okně klikněte na možnost <b>Připojit k&nbsp;webu [soci&aacute;ln&iacute; s&iacute;ť]</b> a přihlaste se pomoc&iacute; &uacute;čtu soci&aacute;ln&iacute; s&iacute;tě. Fotografie můžete odeslat do nov&eacute;ho nebo do st&aacute;vaj&iacute;c&iacute;ho alba.</li>
</ol>

<h3 class="list_head">4. Organizace a proch&aacute;zen&iacute; fotografi&iacute; na mobiln&iacute;ch zař&iacute;zen&iacute;ch</h3>
<p>Chcete-li se připojit ke službě Photo Station nebo odes&iacute;lat fotografie prostřednictv&iacute;m mobiln&iacute;ch zař&iacute;zen&iacute;, můžete pomoc&iacute; n&aacute;sleduj&iacute;c&iacute;ch QR k&oacute;dů nainstalovat do sv&yacute;ch mobiln&iacute;ch zař&iacute;zen&iacute; aplikaci <b>DS photo</b>.</p><img src="../../images/ManagePhotos/1x/manage_share_photos/7.png"/></div>

</body>
</html>