<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>High Availability</title>


 </head>
 <body>
<h2>Lagringsstatus</h2>
	<p>Denne siden gir deg detaljer om statusen til lagringsvolum og iSCSI LUN (blokkniv&aring;) p&aring; den aktive og den passive serveren i high-availability-skyen.</p>
    <p>Siden kapasiteten og konfigurasjonene til de korresponderende volumene og iSCSI LUN (blokkniv&aring;) p&aring; den aktive og den passive serveren m&aring; v&aelig;re identiske, vises volumene og iSCSI LUN (blokkniv&aring;) p&aring; de to serverne sammen som enkle enheter. Derfor, hvis du &oslash;nsker &aring; vise statusen til volum og iSCSI LUN (blokkniv&aring;) p&aring; b&aring;de den aktive og passive serveren, m&aring; du g&aring; til siden <b>Lagringsstatus</b> [n&aring;r du &aring;pner en high-availability-sky, er kun volum og iSCSI LUN (blokkniv&aring;) p&aring; den aktive serveren tilgjengelige i <b>Lagringsh&aring;ndtering</b>].</p>

    <p>Denne siden inneholder f&oslash;lgende informasjon:</p>
		<ul>
			<li><b>Navn:</b> Viser navnene p&aring; volum og iSCSI LUN (blokkeringsniv&aring;).</li>
			<li><b>Brukt:</b> Viser prosenten av brukt kapasitet p&aring; volum og iSCSI LUN (blokkeringsniv&aring;).</li>
			<li><b>Brukt/Total st&oslash;rrelse:</b>  Viser totalprosent og prosenten av brukt kapasitet p&aring; volum og iSCSI LUN (blokkeringsniv&aring;).</li>
            <li><b>Status:</b> Viser statusen til volum, iSCSI LUN-er (blokkniv&aring;) og SSD-hurtigbuffere.</li>
            <li><b>Beskrivelse:</b> Viser beskrivelser av feil eller annen informasjon vedr&oslash;rende volumet, iSCSI LUN-en (blokkniv&aring;) og SSD-hurtigbufferen.</li>
		</ul>
<h4>Slik reparerer du et sviktende volum eller iSCSI LUN (blokkniv&aring;):</h4>
	<ul>
		<li>Hvis en harddisk eller en av serverne har brutt sammen, kan du g&aring; til siden <a href="disk.html">Diskstatus</a> for &aring; finne ut hvilken harddisk som har brutt sammen og m&aring; erstattes. I dette tilfellet gj&oslash;r du f&oslash;lgende:
        	<ol>
            	<li>Erstatt den sammenbrutte disken (for trinnene for harddiskinstallasjon, se <i>Installasjonsveiledning</i> for ditt Synology-produkt).</li>
                <li>G&aring; til siden <b>Lagringsstatus</b> og klikk p&aring; <b>Reparer</b>.</li>
            </ol>
        </li>
        <li>Hvis den passive serveren er frakoblet, vil statusen til volumer og iSCSI LUN (blokkniv&aring;) indikere at en feil har oppst&aring;tt, og ingen av diskene p&aring; den passive serveren vil vises p&aring; siden Diskstatus. I dette tilfellet kan du pr&oslash;ve &aring; l&oslash;se problemet ved &aring; gj&oslash;re f&oslash;lgende:
        	<ol>
            	<li>Forsikre deg om at den passive serveren er sl&aring;tt p&aring;.</li>
                <li>Kontroller alle str&oslash;mforsyninger.</li>
                <li>Unders&oslash;k alle tilkoblinger.</li>
            </ol>
        </li>
        <li>Hvis en filsystemfeil oppst&aring;r p&aring; et volum eller iSCSI LUN (blokkniv&aring;) p&aring; en av serverne, gj&oslash;r du f&oslash;lgende:
        	<ul>
            	<li>G&aring; til siden <b>Lagringsstatus</b>.</li>
                <li>Klikk p&aring; <b>Reparer</b>.</li>
            </ul>
        </li>
	</ul>

<p><span class="note_head">Merk:</span>  Grensen for volum og iSCSI LUN (blokkeringsniv&aring;) i en high-availability-sky er 64.</p>



<h3>Kvorumserver</h3>
<p>Kvorumservere kan bidra til &aring; redusere risikoen for split-brain-feil. I innstillinger for split-brain kan du tilordne en annen server som kvorumserver, s&aring; lenge den er konstant tilkoblet b&aring;de den aktive og den passive serveren. Gateway-servere eller DNS-servere er gode valg som kvorumserver fordi de kan kobles til b&aring;de den aktive og den passive serveren. V&aelig;r oppmerksom p&aring; at kvorumserveren kun skal yte Ping-tjenester, s&aring; du trenger ikke &aring; installere noen programmer. Nedenfor finner du situasjoner som kan oppst&aring; n&aring;r kvorumserver er aktivert:</p>

<ul>
<li>Hvis den passive serveren ikke kan koble til b&aring;de den aktive serveren og kvorumserveren, kan ikke feiloverf&oslash;ring utf&oslash;res for &aring; unng&aring; split-brain-feil.</li>
<li>Hvis den aktive serveren ikke kan koble til kvorumserveren mens den passive serveren kan, blir overf&oslash;ring av tjenester utl&oslash;st for &aring; sikre tilgjengeligheten.</li>
</ul>

 </body>
</html>
