<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Se&ccedil;enekler</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="leaf_user"></a>Hesap</h2>

<p>Hesap sekmesi a&ccedil;ıklama, şifre, e-posta ve 2 adımlı doğrulama gibi temel hesap ayarlarını d&uuml;zenleme se&ccedil;enekleri sağlar. Bu sekmeyi g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in, masa&uuml;st&uuml;n&uuml;n sağ &uuml;st&uuml;ndeki insan şekilli simgeye tıklayın ve <strong>Kişisel</strong>'i se&ccedil;in.</p>



<h3>Hesap Ayarlarını Değiştirme</h3>

<p>Aşağıdaki hesap ayarları d&uuml;zenlenebilir:</p>
<ul>
<li><strong>A&ccedil;ıklama:</strong> Hesabınız i&ccedil;in bir a&ccedil;ıklama girin. Kullanıcı a&ccedil;ıklamaları en fazla 64 tane g&ouml;r&uuml;nt&uuml;lenebilir Unicode karakter i&ccedil;erebilir.</li>
<li><strong>Yeni Parola:</strong> Hesabınızın şifresini değiştirmek isterseniz, burada yenisini girin ve aşağıdaki <strong>Şifreyi onayla</strong> alanında onaylayın. Şifreler b&uuml;y&uuml;k/k&uuml;&ccedil;&uuml;k harfe duyarlıdır ve harfler, rakamlar, simgeler ve boşluklar da dahil 127'ye kadar g&ouml;r&uuml;nt&uuml;lenebilir karakterden oluşabilir.</li>
<li><strong>E-posta:</strong> Bir e-posta adresi girin (yalnızca y&ouml;netici olmayan kullanıcılar i&ccedil;in).</li>
<li><strong>Ekran dili:</strong> Hesabınız i&ccedil;in ekran dilini belirleyin. Burada belirlediğiniz ekran dili ayarları, <b>Denetim Masası</b> &gt; <b>B&ouml;lgesel Se&ccedil;enekler</b> &gt; <b>Dil</b>'de belirlenenden y&uuml;ksek &ouml;nceliğe sahip olacaktır.</li>
</ul>
<p>Hesap ayarlarını d&uuml;zenledikten sonra, <b>Tamam</b>'a tıklayarak değişiklikleri kaydedin.</p>


<h3>2 Adımlı Doğrulama</h3>

<p>2 adımlı doğrulama, DSM hesabınız i&ccedil;in geliştirilmiş g&uuml;venlik sağlar. 2 adımlı doğrulama etkinleştirilirse, DSM'de oturum a&ccedil;arken, bir kerelik doğrulama koduna ek olarak şifrenizi girmeniz gerekecektir. Doğrulama kodları, mobil aygıtınızda y&uuml;kl&uuml; olan doğrulayıcı uygulamalardan elde edilir. Bundan dolayı, biri hesabınıza erişmek istediğinde, yalnızca kullanıcı adı ve şifrenize değil, aynı zamanda mobil aygıtınıza da ihtiya&ccedil; duyacaktır.</p>

<div class="section">
<h4>Gereksinimler:</h4>
<p>2 adımlı doğrulama, bir mobil aygıt ve Time-based One-Time Password (TOTP) protokol&uuml;n&uuml; destekleyen bir doğrulayıcı uygulama gerektirir. Doğrulayıcı uygulamalar, Google Authenticator (Android/iPhone/BlackBerry) ya da Authenticator (Windows Phone) i&ccedil;erir.</p>
</div>

<h4>2 adımlık doğrulamayı etkinleştirmek i&ccedil;in:</h4>

<ol>
<li><strong>Kişisel</strong> &gt; <strong>Hesap</strong> sekmesine gidin ve 2 adımlı doğrulama kurulum sihirbazını &ccedil;alıştırmak i&ccedil;in <strong>2 adımlı doğrulamayı etkinleştir</strong> kutusunu işaretleyin.</li>
<li>İlk ekranda bir e-posta adresi girin. Mobil aygıtınızın kaybolması durumunda, acil durum doğrulama kodları bu e-posta adresine g&ouml;nderilebilir.</li>
<li>Google Authenticator (Android/iPhone/BlackBerry) ya da Authenticator (Windows Phone) gibi bir doğrulayıcı uygulamasını indirip y&uuml;kleyin.</li>
<li>Sonraki ekranda, doğrulayıcı uygulamanızı a&ccedil;ın ve QR kodunu tarayın. Alternatif olarak, bir gizli anahtarı elle girmek i&ccedil;in bağlantıya tıklayabilirsiniz.</li>
<li>Ardından doğrulayıcı uygulamanız 6 basamaklı bir doğrulama kodu &uuml;retir. Yapılandırmaların doğru olduğunu onaylamak i&ccedil;in bu kodu sihirbaz metin alanına girin. Bir hata meydana gelirse, l&uuml;tfen mobil aygıtınızın sistem saatinin DSM'nin sistem saatiyle senkronize olduğundan emin olun. Ayrıca, doğrulama kodları d&uuml;zenli aralıklarla g&uuml;ncellendiğinden, girdiğiniz kodun s&uuml;resinin ge&ccedil;mediğinden emin olun.</li>
<li>Kurulum sihirbazı tamamlandığında <strong>Tamam</strong>'a tıklayarak ayarları kaydedin.</li>
</ol>



<h4>2 adımlık doğrulamayla DSM'de oturum a&ccedil;mak i&ccedil;in:</h4>

<p>2 adımlık doğrulama etkinleştirildiğinde, DSM'de oturum a&ccedil;arken 6 basamaklı doğrulama kodunu girmeniz istenecektir.</p>

<ol>
<li>DSM oturum a&ccedil;ma ekranında, kullanıcı adı ve şifrenizi her zaman olduğu gibi girin.</li>
<li>Bir doğrulama kodunu girmeniz istendiğinde, mobil aygıtınızda doğrulayıcı uygulamayı a&ccedil;ın.</li>
<li>Hesabınıza y&ouml;nelik 6 basamaklı doğrulama kodunu bulup girin. Mobil aygıtınız kaybolursa, <b>Telefonunuzu mu kaybettiniz?</b> bağlantısına tıkladığınızda, e-posta adresinize bir acil durum kodu g&ouml;nderilecektir.</li>
</ol>

<div class="section">
<h4>Not:</h4>
<ul>
<li><strong>SMTP Ayarları:</strong> E-posta aracılığıyla acil durum kodları almak i&ccedil;in, <b>Denetim Masası</b> &gt; <b>Bildirim</b> kısmında bulunan SMTP sunucusu ayarları doğru bi&ccedil;imde yapılmalıdır.</li>
<li><strong>Acil Durum Kodu Sınırı:</strong> Her bir kullanıcı 5 acil durum kodu sınırına sahiptir. Limitinizi aşarsanız, daha fazla acil durum kodu almadan &ouml;nce 2 adımlı doğrulamayı devre dışı bırakıp etkinleştirmeniz gerekecektir.</li>
<li>2 adımlı doğrulama DSM ve t&uuml;m ilgili Synology mobil uygulamaları (&ouml;r. DSM mobile ve DS file) &uuml;zerinde zorunlu tutulabilir.</li>
<li style="display: none;">2 adımlı doğrulama ayrıca, SSH terminal, SFTP ve SSH aktarım şifrelemeli rsync gibi SSH ilişkili hizmetler i&ccedil;in de ge&ccedil;erlidir. Ancak, Hyper Backup ve SSH aktarım şifrelemeli rsync yoluyla Paylaşımlı Klas&ouml;r Senkronizasyonu 2 adımlı şifrelemeyi desteklemediği i&ccedil;in, bu iki hizmet 2 adımlı doğrulama etkinleştirildikten sonra normal şekilde &ccedil;alışmaz.</li>

</ul>
</div>


<h4>Kullanıcıların 2 adımlık doğrulama ayarlarını sıfırlamak i&ccedil;in:</h4>

<p><strong>administrators</strong> grubundaki kullanıcılar, diğer kullanıcıların 2 adımlı doğrulama ayarlarını sıfırlayabilir. 
<ol>
<li><strong>Denetim Masası</strong> &gt; <strong>Kullanıcı</strong> &ouml;ğesine gidin.</li>
<li>2 adımlı doğrulamasını sıfırlamak istediğiniz kullanıcıya &ccedil;ift tıklayın.</li>
<li><strong>Kullanıcı Bilgileri</strong> sekmesinde, <strong>2 Adımlı Doğrulamayı Sıfırla</strong> d&uuml;ğmesine tıklayın.</li>
</ol>

<div class="section">
<h4>Not:</h4>
<ul>
<li><strong>Administrators</strong> grubunda bir kullanıcı mevcut değilse, DSM ayarlarını sıfırlamak ve 2 adımlık doğrulamayı devre dışı bırakmak i&ccedil;in, Synology NAS cihazınızdaki fiziksel sıfırlama d&uuml;ğmesine basabilirsiniz.</li>
</ul>
</div>


<h3>Hesap Etkinliği</h3>
<p>Hesap etkinliği, DSM hesabınızın, ge&ccedil;erli bağlantılar, hatırlanan cihazlar ve oturum a&ccedil;ma ge&ccedil;mişi gibi oturum etkinliğini g&ouml;r&uuml;nt&uuml;ler.</p>


<h4>Hesap etkinliğinizi kontrol etmek i&ccedil;in:</h4>
<p><strong>Hesap Etkinliği</strong> d&uuml;ğmesine tıklayın. Aşağıdaki sekmeleri g&ouml;r&uuml;nt&uuml;leyen bir pencere belirir:

<ul>
<li><strong>Bağlanan Kullanıcılar:</strong> Bu sekme aşağıdaki bilgileri g&ouml;sterir:
  <ul>
<li><strong>Tarih ve Saat:</strong> Hesaba erişilme zamanı.</li>
<li><strong>İstemci ismi ve IP'si:</strong> Hesaba erişmiş aygıtın ismi ve IP adresi. İstemci ismi yalnızca hesaba CIFS protokol&uuml;yle erişildiğinde g&ouml;r&uuml;n&uuml;r.</li>
<li><strong>Hizmet:</strong> Hesaba erişmek i&ccedil;in kullanılan protokol.</li>
<li><strong>Kaynak:</strong> Hesap tarafından kullanılan sistem kaynakları.</li>
</ul></li>

<li><strong>Hatırlanan Cihazlar:</strong> Bu sekme hatırlanan cihaz y&ouml;netim sayfasını g&ouml;sterir:
   <ul>
<li><strong>Mevcut cihaz hatırlanmaz / hatırlanır:</strong> Mevcut cihazı hatırlamayı se&ccedil;erseniz <strong>Bu cihazı hatırla</strong> &ouml;ğesini se&ccedil;in ve 2 adımlı doğrulama bu cihazda DSM'de oturum a&ccedil;tığınızda gerekli olmayacaktır.</li>

<li><strong>Diğer cihazları hatırlamayı durdur:</strong> Hatırlanan diğer cihazların (&ouml;r., diğer bilgisayarlar veya mobil cihazlar) hatırlanmasını durdurabilirsiniz. Bu, bu cihazlar &uuml;zerinde DSM'de oturum a&ccedil;tığınızda 2 adımlı doğrulamanın gerekli olacağı anlamına gelir.</li>
</ul></li>


<li><strong>Oturum A&ccedil;ma Ge&ccedil;mişi:</strong> Bu sekme, yakın zamandaki oturumları ve aşağıdaki bilgileri g&ouml;sterir:
<ul>
<li><strong>Tarih ve Saat:</strong> Hesaba erişilme zamanı.</li>
<li><strong>Olay:</strong> Kullanıcı adını ve IP adresini g&ouml;sterir.</li>
</ul>
</li>
</ul>


<div class="section">
<h4>Not:</h4>
<p>Hatırlanan olarak işaretlediğiniz cihaz sadece aynı hesapla ve aynı tarayıcıdan oturum a&ccedil;tığınızda hatırlanacaktır. Daha &ouml;nce bir cihazı hatırlanmış olarak işaretlemiş olsanız bile aşağıdaki senaryolarda 2 adımlı doğrulama i&ccedil;in bir OTP (bir defalık parola) girmeniz istenecektir:</p>
<ul>
<li>Aynı hesapla ancak farklı bir tarayıcıda oturum a&ccedil;ıyorsunuz.</li>
<li>&Ccedil;erezleriniz tarayıcıdan kaldırıldı.</li>
<li>Kullanıcı A olarak oturum a&ccedil;arken bir cihazı hatırlanmış olarak işaretlersiniz ve ardından Kullanıcı B olarak oturum a&ccedil;arken aynı cihazı hatırlanmış olarak işaretlersiniz. Tekrar Kullanıcı A olarak oturum a&ccedil;tığınızda, 2 adımlı doğrulama i&ccedil;in bir parola girmeniz yine de gerekir.</li>
</ul>

</div>


</body>
</html>