<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>DDNS</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>DDNS</h2>
<p>DDNS (Servicio din&aacute;mico de nombres de dominio) simplifica la conexi&oacute;n a su Synology NAS a trav&eacute;s de Internet asignando un nombre de host a su direcci&oacute;n IP. Por ejemplo, DDNS le permite acceder a su Synology NAS con un nombre de dominio (p. ej., <i>www.john.synology.me</i>), de forma que no sea necesario recordar una direcci&oacute;n IP (p. ej., <i>172.16.254.1</i>).</p>

<h3>Configurar DDNS</h3>
<p>Puede asignar un nombre de host existente a la direcci&oacute;n IP de su Synology NAS o bien registrar uno nuevo suministrado por Synology o por otros servidores DDNS. Consulte a cada proveedor para obtener m&aacute;s informaci&oacute;n sobre el registro de nombres de host.</p>



<h4>Para configurar un nombre de host de DDNS:</h4>
<ol>
<li>Haga clic en el bot&oacute;n <b>Agregar</b>.</li>
<li>Aparece un cuadro de di&aacute;logo pidi&eacute;ndole que edite las siguientes opciones:<ul>
<li><strong>Proveedor de servicios:</strong> seleccione un proveedor de servicios. Para registrar un nombre de host gratuito de Synology, elija <b>Synology</b> en el men&uacute; desplegable.</li>
<li><strong>Nombre de host:</strong> escriba un nombre de host DDNS registrado, como <i>john.synology.me</i>.</li>
<li><strong>Nombre de usuario/Correo electr&oacute;nico:</strong> Introduzca el nombre de usuario/correo electr&oacute;nico de su proveedor de DDNS.</li>
<li><strong>Contrase&ntilde;a/Clave:</strong> introduzca la contrase&ntilde;a/clave de su proveedor de DDNS.</li>
<li><strong>Direcci&oacute;n externa:</strong> introduzca la direcci&oacute;n IP externa del Synology NAS que utilizar&aacute; el nombre de host.</li>
<li><strong>Heartbeat:</strong> habilite esta opci&oacute;n para recibir alertas sobre el estado del nombre de host asignado (solo para nombres de host proporcionados por Synology).</li>
</ul>
</li>
<li>Haga clic en <strong>Probar conexi&oacute;n</strong> para comprobar que la configuraci&oacute;n es correcta.</li>
<li>Haga clic en <strong>OK</strong> para guardar y finalizar.</li>
<li>Si ha seleccionado <strong>Synology</strong> como proveedor de servicios, aparecer&aacute; un cuadro de mensaje si no hay un certificado SSL que coincida con su nombre de host de DDNS para recomendarle que firme un certificado de Let&apos;s Encrypt para el nombre de host y lo establezca como certificado predeterminado. Haga clic en <strong>S&iacute;</strong>.<p><span class="note_head">Observaci&oacute;n:</span> Si un certificado SSL ya coincide con su nombre de host de DDNS, aparecer&aacute; un cuadro de mensaje y se le preguntar&aacute; si desea establecerlo como el certificado predeterminado. Este mensaje aparecer&aacute; cada vez que se edite el nombre de host de DDNS. Para obtener m&aacute;s informaci&oacute;n acerca del certificado SSL, consulte <a href="https://www.synology.com/knowledgebase/DSM/help/DSM/AdminCenter/connection_certificate" target=blank>aqu&iacute;</a>.</p>
	</li>
</ol>

<p>Una vez completada la configuraci&oacute;n, puede acceder a su Synology NAS a trav&eacute;s de Internet introduciendo el nombre de host de DDNS en un explorador web.</p>
<div class="section">
<h4>Requisitos y limitaciones</h4>
<ul> 
<li>Los servidores del proveedor de servicios DDNS est&aacute;n funcionando.</li>
<li>Synology NAS puede conectarse a Internet.</li>
<li>DDNS solo funciona en un entorno de red en el que no sea necesario ning&uacute;n servidor proxy.</li>
<li>Solo puede introducir un nombre de host para cada proveedor DDNS.</li>

</ul>
</div>

<h3>Administrar nombres de host</h3>
<p>Utilice los siguientes botones para administrar entradas de nombres de host existentes:</p>
<ul>
<li><strong>Eliminar:</strong> permite eliminar la entrada de nombre de host seleccionada de la lista.</li>
<li><strong>Editar:</strong> permite cambiar la configuraci&oacute;n de la entrada de nombre de host.</li>
<li><strong>Actualizar ahora:</strong> permite actualizar el estado de todas las entradas de nombre de host que tienen habilitado el servicio DDNS.</li></ul>

<h3>Configurar un proveedor de DDNS personalizado</h3>
<p>Puede a&ntilde;adir un proveedor de DDNS personalizado si su proveedor todav&iacute;a no aparece en la lista de proveedores de servicios.</p>
<h4>Para configurar un proveedor de DDNS:</h4>
<ol>
<li>Haga clic en <b>Personalizar</b>.</li>
<li>Aparece un cuadro de di&aacute;logo pidi&eacute;ndole que introduzca las siguientes configuraciones:<ul>
    <li><strong>Proveedor de servicios:</strong> Introduzca el nombre de su proveedor de servicios personalizado.</li>
    <li><strong>URL de consulta:</strong> Introduzca la URL de su proveedor de servicios personalizado.</li>
  </ul>
</li>
<li>Haga clic en <strong>Guardar</strong> para a&ntilde;adir el proveedor de servicios personalizado a la lista de proveedores de servicios de DDNS.</li>
</ol>
<div class="section">
<h4>Requisitos y limitaciones</h4>
<ul>
  <li>La URL de consulta se debe adherir al protocolo especificado por su proveedor de servicios. Esta URL se utilizar&aacute; para actualizar la informaci&oacute;n de IP en el servidor DDNS de su proveedor.</li>
  <li>Una URL de consulta normalmente contiene los cuatro par&aacute;metros siguientes. Al introducir una URL de consulta, sustituya los siguientes par&aacute;metros por la variable correspondiente.</li>
  <ul>
    <li>Nombre de usuario: __USERNAME__</li>
    <li>Contrase&ntilde;a: __PASSWORD__</li>
    <li>Nombre de host: __HOSTNAME__</li>
    <li>Direcci&oacute;n externa: __MYIP__</li>
  </ul>
<li>La URL de consulta no puede contener espacios ni puntos y coma.</li>
</ul>
</div>
</body>
</html>
