<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Cuenta: ayuda de Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Protect your account from external attacks.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Cuenta</h2>

<p>Proteja su cuenta de ataques externos.</p>

<h2>Bloqueo autom&aacute;tico</h2>

<p>La funci&oacute;n de bloqueo autom&aacute;tico ayuda a mejorar la seguridad de su Synology NAS bloqueando las direcciones IP de clientes con demasiados intentos de conexi&oacute;n fallidos. Esto ayuda a reducir el riesgo de que se fuerce la entrada a cuentas con ataques de fuerza bruta.</p>

<p>Tambi&eacute;n puede crear y administrar una lista de permisos para agregar direcciones de IP de confianza, o una lista de bloqueo para evitar siempre que determinadas direcciones IP inicien sesi&oacute;n.</p>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>Varios servicios y paquetes son compatibles con el bloqueo autom&aacute;tico: DSM, SSH, Telnet, rsync, copia de seguridad de red, sincronizaci&oacute;n de carpetas compartidas, FTP, WebDAV, File Station, Photo Station, Audio Station, Video Station, Download Station, Mail Server, Mail Station, Time Backup, VPN Server, Cloud Station y aplicaciones m&oacute;viles de Synology.</li>
</ul>
</div>

<h4>Para habilitar bloqueo autom&aacute;tico:</h4>
<ol>
	<li>Abra el <strong>Panel de control</strong> y vaya a <strong>Seguridad</strong> &gt; <strong>Bloqueo autom&aacute;tico</strong>.</li>
	<li>Marque <strong>Habilitar bloqueo autom&aacute;tico</strong>.</li>
	<li>Introduzca un n&uacute;mero de intentos fallidos de inicio de sesi&oacute;n en el campo <strong>Intentos de conexi&oacute;n</strong> y un n&uacute;mero de minuto en el campo <strong>En (minutos)</strong>. Se bloquear&aacute; una direcci&oacute;n IP cuando exceda el n&uacute;mero de intentos de inicio de sesi&oacute;n fallidos en el n&uacute;mero de minutos especificado.</li>
	<li>Marque <strong>Habilitar caducidad del bloqueo</strong> e introduzca un n&uacute;mero para quitar una direcci&oacute;n IP bloqueada al cabo del n&uacute;mero de d&iacute;as especificado.</li>
	<li>Haga clic en <strong>Aplicar</strong> para guardar la configuraci&oacute;n.</li>
</ol>


<h3>Administrar la Lista de bloqueo</h3>
<p>Haga clic en <strong>Lista de permiso/bloqueo</strong> y vaya a la pesta&ntilde;a <strong>Lista de bloqueo</strong>.</p>

<h4>Para a&ntilde;adir direcciones IP:</h4>
<p>Elija una de las siguientes opciones del men&uacute; desplegable <strong>Crear</strong>:</p>

<ul>
	<li><strong>A&ntilde;adir direcci&oacute;n IP</strong>: introduzca una direcci&oacute;n IP y establezca el tiempo de caducidad.</li>
	<li><strong>Importar lista de direcciones IP</strong>: importe un archivo de texto con las direcciones IP para a&ntilde;adir varias direcciones IP y establecer la fecha de caducidad a la vez. Marque la casilla de verificaci&oacute;n si desea sobrescribir direcciones IP existentes. Si esta opci&oacute;n no est&aacute; seleccionada, se omitir&aacute;n las direcciones IP duplicadas.<br />Si el archivo que ha seleccionado tiene un formato correcto, ver&aacute; todas las direcciones IP en el &aacute;rea de vista previa. Haga clic en <strong>Aceptar</strong> para importar.</li>
</ul>

<div class="section"><h4>Observaci&oacute;n:</h4>
<p>Para importar un archivo, el archivo debe cumplir los siguientes criterios:</p>
<ul>
	<li>El archivo debe ser un archivo de texto sin formato.</li>
	<li>Cada l&iacute;nea del archivo debe contener una &uacute;nica direcci&oacute;n IP.</li>
	<li>Las l&iacute;neas de comentario deben empezar por # (almohadilla).</li>
</ul>
</div>

<h4>Para eliminar direcciones IP bloqueadas:</h4>
<p>Seleccione las direcciones IP que desee eliminar de la lista y haga clic en <strong>Quitar</strong>.</p>


<h3>Administrar la Lista de permiso</h3>

<p>Haga clic en <strong>Lista de permiso/bloqueo</strong>, y vaya a la pesta&ntilde;a <strong>Lista de permiso</strong>.</p>

<h4>Para a&ntilde;adir direcciones IP:</h4>
<p>Elija una de las siguientes opciones del men&uacute; desplegable <strong>Crear</strong>:</p>
<ul>
	<li><strong>A&ntilde;adir direcci&oacute;n IP</strong>: introduzca una direcci&oacute;n IP, un rango IP, una subred o un nombre de dominio.</li>
	<li><strong>Importar lista de direcciones IP</strong>: importe un archivo de texto con las direcciones IP para a&ntilde;adir varias direcciones IP a la vez. Marque la casilla de verificaci&oacute;n si desea sobrescribir direcciones IP existentes. Si esta opci&oacute;n no est&aacute; seleccionada, se omitir&aacute;n las direcciones IP duplicadas.<br />Si el archivo que ha seleccionado tiene un formato correcto, ver&aacute; todas las direcciones IP en el &aacute;rea de vista previa. Haga clic en <strong>Aceptar</strong> para importar.</li>
</ul>

<div class="section"><h4>Observaci&oacute;n:</h4>
<p>Para importar un archivo, el archivo debe cumplir los siguientes criterios:</p>
<ul>
<li>El archivo debe ser un archivo de texto sin formato.</li>
<li>Cada l&iacute;nea del archivo solo puede contener una direcci&oacute;n IP, un rango de IP (<em>192.168.1.1 - 192.168.1.10</em>), una subred (<em>192.168.1.1/255.255.0.0</em>) o un nombre de dominio (<em>www.synology.com</em>).</li>
<li>Las l&iacute;neas de comentario deben empezar por # (almohadilla).</li>
</ul>
</div>

<h4>Para eliminar direcciones IP:</h4>
<p>Seleccione las direcciones IP que desee eliminar de la lista y haga clic en <strong>Quitar</strong>.</p>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>Si su dispositivo Synology NAS est&aacute; situado tras un servidor proxy inverso, agregue la direcci&oacute;n IP de dicho servidor a la lista de permisos.</li>
</ul>
</div>


<h2>Protecci&oacute;n de la cuenta</h2>

<p>La protecci&oacute;n de la cuenta ayuda a mejorar la seguridad de su Synology NAS protegiendo las cuentas de clientes que no sean de confianza con demasiados intentos de conexi&oacute;n fallidos. Esto ayuda a reducir el riesgo de que se fuerce la entrada a cuentas con ataques de fuerza bruta.</p>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>Paquetes y servicios compatibles: DSM, File Station, Audio Station, Video Station, Download Station, Mail Station, Cloud Station y aplicaciones m&oacute;viles de Synology.</li>
</ul>
</div>

<h4>Para habilitar la protecci&oacute;n de la cuenta:</h4>
<ol>
	<li>Vaya a <strong>Panel de control</strong> &gt; <strong>Seguridad</strong> &gt; <strong>Protecci&oacute;n de la cuenta</strong>.</li>
	<li>Marque <strong>Habilitar protecci&oacute;n de la cuenta</strong>.</li>
	<li>Especifique un n&uacute;mero en el campo <strong>Intentos de conexi&oacute;n</strong> y <strong>En (minutos)</strong>. Si el inicio de sesi&oacute;n ha dado error demasiadas veces en un periodo de tiempo predeterminado, se bloquear&aacute; a un cliente que no sea de confianza.</li>
	<li>Especifique un n&uacute;mero en el campo <strong>Desbloquear (minutos m&aacute;s tarde)</strong>. Se cancelar&aacute; la protecci&oacute;n de la cuenta tras un periodo de tiempo predeterminado.</li>
	<li>Haga clic en <strong>Aplicar</strong> para guardar la configuraci&oacute;n.</li>
</ol>

<h4>Para cancelar la protecci&oacute;n de las cuentas seleccionadas</h4>
<ol>
	<li>Haga clic en <strong>Administrar cuentas protegidas</strong>.</li>
	<li>Seleccione las cuentas que desea cancelar y haga clic en <strong>Cancelar la protecci&oacute;n</strong>.</li> 
</ol>

<h4>Para desbloquear clientes de confianza</h4>
<ol>
	<li>Haga clic en <strong>Administrar dispositivos de confianza</strong>.</li>
	<li>Seleccione los clientes que desea desbloquear y haga clic en <strong>Desbloquear</strong>.</li>
</ol>

</body>
</html>
