
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" charset="utf-8">

<title>M&oacute;vil</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>


<h2><a name="usbmodem"></a>M&oacute;vil*</h2>

<p>Cuando est&eacute; equipado con un adaptador de banda ancha m&oacute;vil, su Synology NAS podr&aacute; conectarse a Internet a trav&eacute;s de una red inal&aacute;mbrica 3G/LTE. Las configuraciones en <strong>Panel de control</strong> &gt; <strong>Red</strong> &gt; <strong>Interfaz de red</strong> &gt; <strong>M&oacute;vil</strong> le ayudar&aacute;n a establecer y modificar una conexi&oacute;n inal&aacute;mbrica a Internet a trav&eacute;s de su adaptador de banda ancha m&oacute;vil.</p>

<div class="section">
<h4>Observaci&oacute;n:</h4>
<ul><li>Para obtener una lista completa de las llaves (dongle) de banda ancha m&oacute;vil compatibles con los productos de Synology, visite <a href="http://www.synology.com/" target=_blank>www.synology.com</a>.</li>
	<li>Despu&eacute;s de actualizar a DSM 6.2.2, primero deber&aacute; insertar un adaptador inal&aacute;mbrico o Bluetooth para activar esta funci&oacute;n.</li></ul>
</div>

<h4>Para configurar una red m&oacute;vil:</h4>
<p>Cuando una llave (dongle) de banda ancha m&oacute;vil se conecta a uno de los puertos USB en su Synology NAS, Synology NAS intentar&aacute; conectarse autom&aacute;ticamente. Si la conexi&oacute;n no se puede establecer autom&aacute;ticamente o si desea modificar la configuraci&oacute;n de conexi&oacute;n, vea la siguiente informaci&oacute;n:</p>

<ul>
<li><b>Configuraci&oacute;n/desbloqueo de SIM:</b> si la tarjeta SIM est&aacute; protegida con un PIN, se debe desbloquear para permitir que Synology NAS se conecte a la red. Una vez desbloqueada, esta secci&oacute;n proporciona opciones para modificar la configuraci&oacute;n del PIN.</li>

<li><b>Editar:</b> puede configurar manualmente la conexi&oacute;n o elegir de acuerdo con la ubicaci&oacute;n y el proveedor. La configuraci&oacute;n manual de la conexi&oacute;n requiere introducir su APN, n&uacute;mero de tel&eacute;fono, nombre de usuario y contrase&ntilde;a. Si no conoce esta informaci&oacute;n, p&oacute;ngase en contacto con su proveedor de telefon&iacute;a m&oacute;vil para obtener ayuda.</li>

<li><b>Conectar/desconectar:</b> estos botones le permiten conectar Synology NAS a la red 3G/LTE o desconectarlo de esta.</li>
<li><b>Opciones:</b> esta secci&oacute;n incluye una opci&oacute;n para configurar la interfaz de la llave (dongle) de banda ancha m&oacute;vil como la pasarela predeterminada de su Synology NAS. Cuando configure la red m&oacute;vil como la pasarela predeterminada, el tr&aacute;fico de Internet de su Synology NAS ir&aacute; a trav&eacute;s de la red m&oacute;vil en lugar de la red conectada con cable.</li>
</ul>
<div class="section">
<h4>Observaci&oacute;n:</h4>
<ol>
<li>Cuando una llave (dongle) de banda ancha m&oacute;vil se conecta a Internet no mostrar&aacute; la intensidad de la se&ntilde;al si no es compatible con esta caracter&iacute;stica.</li>
<li>En algunas llaves (dongle) de banda ancha m&oacute;vil no se puede cambiar la configuraci&oacute;n de tarjeta SIM cuando est&aacute;n conectados a Internet.</li>
</ol>
</div>
<p>____<br> <strong>*</strong>Solo disponible en determinados modelos.</p>


</body>
</html>
