<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Win/Mac/NFS</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>

<body>

<h2>SMB</h2>
<p>El protocolo SMB (Server Message Block) permite a los clientes de Windows, Mac y Linux compatibles con SMB/CIFS acceder a los datos almacenados en Synology NAS. Si desea explorar archivos en Synology NAS a trav&eacute;s de Windows Explorer o montar carpetas compartidas como unidades de red, habilite esta opci&oacute;n en <strong>Panel de control</strong> &gt; <strong>Servicios de archivos</strong> &gt; <strong>SMB/AFP/NFS</strong>.</p>

<h4>Para activar el protocolo SMB:</h4>
  <ol>
    <li>Marque <strong>Habilitar servicio SMB</strong>.</li>
    <li>Haga clic en <strong>Apply</strong>.</li>
  </ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
  <ul>
    <li>Tras habilitar el protocolo SMB, puede montar carpetas indexadas en su ordenador Mac a trav&eacute;s del protocolo SMB y utilizar Finder para buscar en el contenido de los archivos en las carpetas montadas (no aplicable a NVR216 ni VS360HD).</li>
  </ul>
</div>


<h3>Grupo de trabajo</h3>
<p>esta opci&oacute;n le permite designar el sistema como miembro de un grupo de trabajo espec&iacute;fico para fines de administraci&oacute;n de redes.</p>

<div class="section"><h4>Observaci&oacute;n:</h4>
  <ul>
    <li>El nombre de un grupo de trabajo puede contener entre 1 y 15 caracteres. El nombre no puede incluir los siguientes caracteres: [ ] ; : &quot;< >* + = \ / | ? ,</li>
    <li>Si utiliza un Mac con OS X 10.9 y su Synology NAS se ha unido a un dominio Windows, puede iniciar sesi&oacute;n a&ntilde;adiendo <strong>localhost\</strong> delante del nombre de usuario local de Synology NAS para acceder a los archivos almacenados en Synology NAS a trav&eacute;s del protocolo SMB.</li>
  </ul>
</div>


<h3>No permitir el acceso a versiones anteriores</h3>
<p>En Windows Explorer, los usuarios pueden acceder a las instant&aacute;neas de carpetas o archivos haciendo clic en la pesta&ntilde;a <strong>Versiones anteriores</strong> dentro de una carpeta compartida, permitiendo restaurar o copiar datos sin ayuda de un administrador. Si elige <strong>No permitir el acceso a versiones anteriores</strong>, la p&aacute;gina &ldquo;Versiones anteriores&rdquo; no mostrar&aacute; ninguna informaci&oacute;n.</p>

<div class="section"><h4>Nota:</h4>
  <ul>
    <li>Esta funci&oacute;n solo es compatible con VDSM y los modelos con las siguientes arquitecturas de paquete: Apollo Lake, Avoton, Braswell, Broadwell, Bromolow, Cedarview y Grantley. Para ver qu&eacute; arquitectura de paquete es compatible con su modelo, consulte <a href="https://www.synology.com/en-us/knowledgebase/DSM/tutorial/General/What_kind_of_CPU_does_my_NAS_have" target="_blank">este art&iacute;culo</a>.</li>
    <li>Se permite que los usuarios accedan a una versi&oacute;n anterior siempre y cuando, en el momento de tomar la instant&aacute;nea de la versi&oacute;n anterior, sus cuentas de usuario se hayan creado y se les haya otorgado el permiso necesario para leer la carpeta compartida correspondiente a la instant&aacute;nea tomada.</li>
  </ul>
</div>


<h3>Habilitar registro de transferencia</h3>
<p>Marque la casilla de verificaci&oacute;n <strong>Habilitar registro de transferencia</strong> para habilitar el registro de operaciones de archivos realizadas a trav&eacute;s del protocolo CIFS/SMB. De forma predeterminada, el registro de transferencia solo supervisa la eliminaci&oacute;n de un archivo o carpeta; sin embargo, tambi&eacute;n puede ir a <strong>Configuraci&oacute;n del registro</strong> para seleccionar otros eventos de operaciones de archivo (crear, mover, renombrar, leer o escribir) que debe registrar el sistema. Tenga en cuenta que cuantos m&aacute;s eventos de operaciones de archivo seleccione, m&aacute;s probable ser&aacute; que el rendimiento del sistema se vea afectado.</p>


<h3>Configuraci&oacute;n avanzada</h3>
<p>Haga clic en el bot&oacute;n <strong>Configuraci&oacute;n avanzada</strong> para ver las siguientes opciones.</p>
  <ul>
    <li><strong>Servidor WINS</strong>: el Servicio de nombres Internet de Windows (WINS) de Microsoft es un servicio de asignaci&oacute;n de nombre NetBIOS a direcci&oacute;n IP. Los usuarios de Windows localizar&aacute;n el sistema con mayor facilidad en redes TCP/IP si el sistema se ha configurado para registrarse con un servidor WINS.</li>
    <li><strong>Protocolo SMB m&aacute;ximo</strong>: seg&uacute;n la configuraci&oacute;n de red, establezca el protocolo SMB m&aacute;s reciente compatible con Synology NAS.<ul>
        <li><strong>SMB1</strong>: SMB1 (tambi&eacute;n llamado CIFS) es compatible desde Windows NT.</li>
        <li><strong>SMB2</strong>: SMB2 es compatible desde Windows Vista y es la versi&oacute;n mejorada de SMB. SMB2 a&ntilde;ade la posibilidad de componer varias acciones de SMB en una sola solicitud para reducir el n&uacute;mero de paquetes de red y mejorar as&iacute; el rendimiento.</li>
        <li><strong>SMB2 y Large MTU</strong>: la unidad de transmisi&oacute;n m&aacute;xima (MTU) es la unidad de datos m&aacute;s grande que se puede pasar a trav&eacute;s de un protocolo de comunicaciones. Para aprovechar interfaces de red m&aacute;s r&aacute;pidas, como Ethernet de 1 gigabit o de 10 gigabits, Large MTU aumenta la unidad de transmisi&oacute;n m&aacute;xima a 1 megabyte (MB). Al habilitar Large MTU se mejora la velocidad y la eficacia de las transferencias de archivos grandes, a la vez que se reduce el n&uacute;mero de paquetes que se tienen que procesar.</li>
        <li><strong>SMB3</strong>: SMB3 es compatible desde Windows 8 y Windows Server 2012. Es la versi&oacute;n mejorada de SMB2. SMB3 es compatible con la transmisi&oacute;n cifrada de archivos basados en AES y por ello mejora la seguridad de las transferencias de archivos entre iguales.</li>
      </ul>

      <div class="section"><h4>Observaci&oacute;n:</h4>
        <ul>
          <li>SMB2 es compatible con Windows Vista, Windows Server 2008 R2, Windows 7 y versiones posteriores.</li>
          <li>Large MTU es compatible con Windows Server 2008 R2, Windows 7 y versiones posteriores.</li>
          <li>Para hacer que Large MTU funcione con su ordenador Windows, tendr&aacute; que modificar la configuraci&oacute;n del registro. Para m&aacute;s detalles, consulte el soporte t&eacute;cnico de Microsoft (como este <a href="http://technet.microsoft.com/en-us/library/ff625695(v=ws.10).aspx" target="_blank">art&iacute;culo</a>).</li>
        </ul>
      </div>

      <li><strong>Protocolo SMB m&iacute;nimo</strong>: seg&uacute;n la configuraci&oacute;n de red, utilice el nivel de protocolo SMB m&aacute;s antiguo compatible con Synology NAS.</li>
      <li><strong>Modo de cifrado de transporte</strong>: cuando se habilita SMB3, el protocolo SMB agregar&aacute; un cifrado de transporte para reforzar la seguridad de la transmisi&oacute;n de archivos.<ul>
          <li><strong>Deshabilitar</strong>: no se aplicar&aacute; ning&uacute;n cifrado de transporte.</li>
          <li><strong>Autom&aacute;tico</strong>: el cifrado de transporte solo se aplicar&aacute; a clientes compatibles con esta caracter&iacute;stica.</li>
          <li><strong>Forzar</strong>: el cifrado de transporte se aplicar&aacute; siempre. Esto har&aacute; que los clientes no compatibles con el cifrado de transporte no puedan utilizar el protocolo SMB.</li>
        </ul>
      </li>

      <div class="section"><h4>Observaci&oacute;n:</h4>
        <ul>
          <li>El cifrado de transporte es compatible con Windows 8, Windows Server 2012 y versiones posteriores.</li>
          <li>El inicio de sesi&oacute;n an&oacute;nimo del protocolo SMB no es compatible cuando se habilita el cifrado de transporte.</li>
          <li>Cuando el cifrado de transporte est&eacute; activado, deje marcada la opci&oacute;n <strong>Habilitar Opportunistic Locking</strong> para evitar errores de tiempo de espera de la aplicaci&oacute;n.</li>
        </ul>
      </div>

      <li><strong>Habilitar Opportunistic Locking</strong>: seleccione esta opci&oacute;n para activar el &apos;Opportunistic locking&apos; de CIFS, de modo que el cliente pueda almacenar mejor el contenido de los archivos en la memoria cach&eacute; y evitar peque&ntilde;as sobrecargas de lectura/escritura. Cuando esta opci&oacute;n est&aacute; desactivada, mejorar&aacute; el rendimiento de las aplicaciones de bases de datos a la hora de acceder a los archivos de base de datos almacenados en Synology NAS a trav&eacute;s de la red.<ul>
          <li><strong>Habilitar concesi&oacute;n SMB2</strong>: la activaci&oacute;n de esta opci&oacute;n permite aplicar m&aacute;s ajustes relacionados con SMB2 para afinar el mecanismo de cach&eacute; del cliente proporcionado por Opportunistic Locking.</li>
        </ul>
      </li>
      <li><strong>Habilitar Local Master Browser</strong>: cuando existen m&uacute;ltiples ordenadores Windows en la misma subred, estos negociar&aacute;n y elegir&aacute;n un ordenador como &apos;Local Master Browser&apos;. El Local Master Browser mantiene las listas de los otros ordenadores de la subred y sus recursos compartidos, y comparte estas listas con los dem&aacute;s ordenadores. Esta opci&oacute;n permite que Synology NAS adopte el papel de Local Master Browser.</li>

      <div class="section"><h4>Observaci&oacute;n:</h4>
        <ul>
          <li>Al habilitar esta funci&oacute;n, se deshabilita la hibernaci&oacute;n del disco duro y se activa la cuenta guest sin contrase&ntilde;a.</li>
        </ul>
      </div>

      <li><strong>Habilitar el m&oacute;dulo VFS DirSort</strong>: ordena los nombres de las carpetas y los enumera por orden alfab&eacute;tico. La habilitaci&oacute;n de esta opci&oacute;n afecta el rendimiento del sistema.</li>
      <li><strong>Vetar archivos</strong>: oculta archivos de acuerdo con unos criterios especificados. Entre los criterios se pueden incluir comodines (*) y las entradas m&uacute;ltiples se deben separar con una barra inclinada (/). Por ejemplo: <i>/abc*/*.txt/*.conf/</i>. La habilitaci&oacute;n de esta opci&oacute;n afecta el rendimiento del sistema.</li>
      <li><strong>Permitir enlaces simb&oacute;licos dentro de carpetas compartidas</strong>: seleccione esta opci&oacute;n para permitir que los enlaces simb&oacute;licos apunten a archivos o carpetas dentro de la misma carpeta compartida. Los enlaces simb&oacute;licos se pueden crear utilizando el terminal DSM.<ul>
          <li><strong>Permitir enlaces simb&oacute;licos entre carpetas compartidas</strong>: seleccione esta opci&oacute;n para permitir que los enlaces simb&oacute;licos apunten a archivos o carpetas en carpetas compartidas diferentes. Los enlaces simb&oacute;licos se pueden crear utilizando el terminal DSM. Sin embargo, los usuarios sin privilegios podr&iacute;an acceder a las carpetas compartidas de destino de enlaces simb&oacute;licos.</li>
        </ul>
      </li>
      <li><strong>Habilitar el m&oacute;dulo VFS para convertir caracteres especiales Mac</strong>: seleccione esta opci&oacute;n para convertir los caracteres reservados para SMB (p. ej. &lt; &gt; &quot; * ?) en los nombres de archivo a Lat&iacute;n b&aacute;sico durante la creaci&oacute;n del archivo. Dichos archivos se podr&aacute;n reconocer a trav&eacute;s de AFP.</li>
      <li><strong>Habilitar el m&oacute;dulo VFS MSDFS</strong>: permite a los enlaces simb&oacute;licos apuntar a archivos o carpetas situados en otros servidores SMB. Con versiones anteriores de Windows, como Windows XP, el cliente y Synology NAS deben unirse a un dominio Windows antes de habilitar esta opci&oacute;n. Para obtener m&aacute;s informaci&oacute;n acerca de la creaci&oacute;n de enlaces MSDFS, haga clic <a href="http://www.samba.org/samba/docs/man/Samba-HOWTO-Collection/msdfs.html" target=_blank>aqu&iacute;</a>. Tenga en cuenta que la cach&eacute; del dispositivo cliente se debe borrar despu&eacute;s de deshabilitar esta opci&oacute;n (tambi&eacute;n se recomienda reiniciar el dispositivo cliente); de lo contrario, el rendimiento y comportamiento normales se podr&iacute;an ver afectados.</li>
      <li><strong>Desactivar las conexiones m&uacute;ltiples desde la misma direcci&oacute;n IP</strong>: cuando se habilita esta opci&oacute;n, Synology NAS solo permite una conexi&oacute;n por direcci&oacute;n IP de clientes que utilizan el protocolo SMB. Cuando varios clientes con la misma direcci&oacute;n IP utilizan el protocolo SMB, Synology NAS conservar&aacute; el &uacute;ltimo de ellos e interrumpir&aacute; las conexiones anteriores. En un entorno NAT, es posible que el cliente utilice una direcci&oacute;n IP individual, en cuyo caso habilitar esta opci&oacute;n puede afectar al rendimiento normal.</li>
      <li><strong>Recoger registros de depuraci&oacute;n</strong>: cuando se habilita esta opci&oacute;n, se almacenar&aacute;n registros detallados para realizar depuraciones. La habilitaci&oacute;n de esta opci&oacute;n afecta el rendimiento del sistema.</li>
      <li><strong>Aplicar permisos UNIX predeterminados</strong>: habilite esta opci&oacute;n para aplicar los permisos UNIX predeterminados cuando se cargan o crean archivos y carpetas. Los permisos UNIX ser&aacute;n 744 para archivos y 755 para carpetas. Cuando se desactiva esta opci&oacute;n, el permiso UNIX es 777 para archivos y carpetas.</li>

      <div class="section"><h4>Observaci&oacute;n:</h4>
        <ul>
          <li>Para las carpetas compartidas con Windows ACL (todos los recursos compartidos excepto &apos;photo&apos; y los recursos compartidos en discos externos), ejecute el comando <strong>chmod</strong> en el cliente Linux o FTP para cambiar los tipos de permisos de carpeta y de archivo de Windows ACL a UNIX (no aplicable a EDS14).</li>
          <li>Si se habilita esta opci&oacute;n se pueden provocar problemas de permisos que no mantienen la consistencia entre protocolos diferentes. Para evitar inconsistencias, sugerimos no habilitar esta opci&oacute;n.</li>
        </ul>
      </div>

      <li><strong>No reserve espacio de disco al crear archivos</strong>: active esta opci&oacute;n para no permitir la reserva de espacio en disco al crear archivos en su Synology NAS.</li>
      <li><strong>Habilitar b&uacute;squeda con comodines en cach&eacute;</strong>: habilite esta opci&oacute;n para mejorar el rendimiento de la b&uacute;squeda si los clientes env&iacute;an solicitudes de b&uacute;squeda repetidas con comodines.</li>
      <li><strong>Habilitar identificadores duraderos SMB (se deshabilitar&aacute; el bloqueo de archivos entre protocolos)</strong>: la activaci&oacute;n de esta opci&oacute;n permite a los usuarios restaurar la conexi&oacute;n SMB2 perdida a este Synology NAS despu&eacute;s de una desconexi&oacute;n temporal; los archivos abiertos permanecer&aacute;n disponibles durante la interrupci&oacute;n de la conexi&oacute;n a la red. El bloqueo de archivos entre protocolos se deshabilitar&aacute; para que los usuarios puedan acceder o modificar un archivo bloqueado a trav&eacute;s de protocolos distintos a SMB2 (p. Ej. AFP).</li>
      <li><strong>Borrar cach&eacute; SMB</strong>: haga clic en este bot&oacute;n para borrar los siguientes archivos de la cach&eacute; SMB para resolver problemas:<ul>
          <li>/var/cache/samba/netsamlogon_cache.tdb</li>
          <li>/var/lib/samba/winbindd_cache.tdb</li>
          <li>/var/lib/samba/share_info.tdb</li>
          <li>/var/lib/samba/registry.tdb</li>
          <li>/run/samba/connections.tdb</li>
          <li>/run/samba/gencacche.tdb</li>
          <li>/run/samba/gencache_notran.tdb</li>
        </ul>
      </li>
    </ul>

</body>
</html>