<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Actualizar</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1><a name="leaf_update"></a>Actualizar</h1>
<h2><a name="leaf_update"></a>Actualizaci&oacute;n de DSM</h2>
<p>De manera peri&oacute;dica, Synology publica actualizaciones gratuitas para DSM. Las actualizaciones pueden incluir caracter&iacute;sticas nuevas, mejoras a funciones y mejoras de rendimiento. Las actualizaciones de DSM pueden presentarse en forma de actualizaciones secundarias o principales. el sistema muestra un mensaje junto a <b>Estado</b> si la actualizaci&oacute;n es secundaria. Cuando existan versiones de DSM principales, habr&aacute; una secci&oacute;n en <b>Estado</b> en la que se proporcionar&aacute; informaci&oacute;n sobre esta versi&oacute;n, adem&aacute;s de un v&iacute;nculo de descarga a la versi&oacute;n de actualizaci&oacute;n principal. Normalmente, las actualizaciones secundarias incluyen correcciones de errores cr&iacute;ticos y parches de seguridad para la estabilidad del sistema. Por su parte, las actualizaciones principales incluyen sobre todo funciones nuevas y mejoras de rendimiento, junto con correcciones de errores cr&iacute;ticos y parches de seguridad.</p>


<div class="section">
<h4>Observaci&oacute;n:</h4>
<ul>
<li>La actualizaci&oacute;n de DSM no afecta a los datos de Synology NAS. Sin embargo, para mayor seguridad de los datos, se recomienda encarecidamente hacer una copia de seguridad de los datos antes de empezar.</li>
<li>Despu&eacute;s de actualizar a nuevas versiones de DSM, no podr&aacute; volver a las versiones anteriores de DSM.</li>
<li>Synology NAS ejecuta autom&aacute;ticamente una lista de comprobaci&oacute;n para determinar si las nuevas versiones son relevantes para su sistema en funci&oacute;n de los servicios y las configuraciones del sistema. Por lo tanto, las actualizaciones disponibles y las versiones m&aacute;s recientes pueden variar en funci&oacute;n de sus configuraciones actuales de DSM.</li>
</ul>
</div>

<h3>Realizar la actualizaci&oacute;n manual de DSM</h3>
<p>Puede descargar el archivo de actualizaci&oacute;n .pat desde el <a href="http://www.synology.com/support/download.php" target="_blank">Centro de descargas</a> de Synology y realizar la actualizaci&oacute;n manual de DSM.</p>

<h4>Para realizar una actualizaci&oacute;n manual de DSM:</h4>

<ol>
<li>Visite el <a href="http://www.synology.com/support/download.php" target="_blank">Centro de descargas</a> para descargar la nueva actualizaci&oacute;n de DSM en su equipo local. No es necesario extraer el archivo .pat.</li>
<li>Haga clic en <b>Actualizaci&oacute;n DSM manual</b> para acceder a la p&aacute;gina Actualizaci&oacute;n DSM manual</li>
<li>Haga clic en <b>Examinar</b> para seleccionar el archivo de actualizaci&oacute;n.</li>
<li>Haga clic en <b>Aplicar</b> para comenzar a actualizar DSM. El sistema se reiniciar&aacute; de forma autom&aacute;tica cuando finalice la actualizaci&oacute;n.</li>
</ol>
<div class="section">
<h4>Resoluci&oacute;n de problemas:</h4>
<p>Si no puede actualizar DSM, las siguientes sugerencias pueden ayudarle a solucionar el problema:</p>
<ul>
<li>Compruebe si el proceso de actualizaci&oacute;n ha sido interrumpido por los usuarios, o si se han producido otros eventos inesperados, como un corte el&eacute;ctrico.</li>
<li>Compruebe la versi&oacute;n de DSM. S&oacute;lo puede actualizar el sistema con una versi&oacute;n m&aacute;s reciente de DSM.</li>
<li>Descargue de nuevo la actualizaci&oacute;n de DSM, pues es posible que el archivo de actualizaci&oacute;n est&eacute; da&ntilde;ado.</li>
</ul>
<p>Si contin&uacute;a sin resolver el problema, p&oacute;ngase en contacto con el <a href="https://account.synology.com" target="_blank">Soporte t&eacute;cnico</a> de Synology.</p>
</div>

<h3>Configuraci&oacute;n de las preferencias de actualizaci&oacute;n e instalaci&oacute;n autom&aacute;ticas de DSM</h3>
<p>
<font>Para ajustar la configuraci&oacute;n de instalaci&oacute;n de actualizaciones y comprobar el programa, haga clic en <b>Configuraci&oacute;n de actualizaciones</b>.</font>
</p>

<h4>Para que el sistema le notifique si hay una nueva actualizaci&oacute;n de DSM disponible:</h4>
<p>La opci&oacute;n <b>Notificarme y dejarme decidir si se instala la nueva actualizaci&oacute;n</b> permite al sistema notificarle &uacute;nicamente cuando hay una nueva versi&oacute;n disponible. Puede optar por descargar la actualizaci&oacute;n despu&eacute;s de recibir la notificaci&oacute;n.</p>

<p>Se mostrar&aacute; una notificaci&oacute;n en el escritorio cuando la actualizaci&oacute;n de DSM se haya descargado y est&eacute; lista para la instalaci&oacute;n. Para evitar que DSM se actualice autom&aacute;ticamente, puede cancelar esta opci&oacute;n en las notificaciones de escritorio. Adem&aacute;s, las actualizaciones de DSM se instalar&aacute;n antes de los apagados programados si ha habilitado <strong>Apagar</strong> en <strong>Programa de energ&iacute;a</strong>.</p>

<h4>Para instalar autom&aacute;ticamente la nueva actualizaci&oacute;n de DSM:</h4>
<p>La opci&oacute;n <b>Instalar autom&aacute;ticamente la nueva actualizaci&oacute;n</b> permite que el sistema instale autom&aacute;ticamente la nueva actualizaci&oacute;n de DSM si el resultado de la comprobaci&oacute;n determina que hay una nueva actualizaci&oacute;n disponible. Esto se aplica &uacute;nicamente a las actualizaciones secundarias que se muestran en <b>Estado</b> y no a las actualizaciones principales.</p>

<h4>Para configurar un programa de comprobaci&oacute;n:</h4>
<p>La opci&oacute;n <b>Comprobar programa</b> le permite decidir cu&aacute;ndo debe comprobar el sistema las actualizaciones disponibles. Seleccione los d&iacute;as de la semana y la hora del d&iacute;a de los d&iacute;as especificados para buscar actualizaciones. Por ejemplo, de martes a viernes, a las 11:00 h.</p>

<h3>Actualizaci&oacute;n principal</h3>
<p>Cuando haya una versi&oacute;n de DSM principal disponible, esta informaci&oacute;n se mostrar&aacute; en la parte inferior de la secci&oacute;n Actualizaci&oacute;n de DSM. Podr&aacute; descargar la versi&oacute;n de actualizaci&oacute;n principal haciendo clic en <b>Descargar</b>. Cuando finalice la descarga, haga clic en <b>Actualizar ahora</b> para completar el proceso.</p>


<div class="section">
<h4>Resoluci&oacute;n de problemas:</h4>
<p>Si ve mensajes de error en texto rojo durante la comprobaci&oacute;n o descarga de la nueva versi&oacute;n de DSM, compruebe lo siguiente:</p>
<ul>
<li>Compruebe que Synology NAS tiene conexi&oacute;n a Internet.</li>
<li>Es posible que el servidor de descargas de Synology est&eacute; ocupado en este momento. Vuelva a intentar la descarga m&aacute;s adelante.</li>
</ul>
<p>Si contin&uacute;a sin resolver el problema, p&oacute;ngase en contacto con el <a href="https://account.synology.com" target="_blank">Soporte t&eacute;cnico</a> de Synology.</p>
</div>

<h2><a name="leaf_update"></a>Actualizaci&oacute;n de firmware de las unidades de expansi&oacute;n</h2>

<p>Si tiene unidades de expansi&oacute;n SAS, puede que sea necesario actualizar el firmware de vez en cuando. El sistema comprobar&aacute; autom&aacute;ticamente si hay actualizaciones de firmware y mostrar&aacute; uno de estos estados: <b>Es necesario actualizar el firmware de inmediato.</b>, <b>El firmware de todas las unidades de expansi&oacute;n est&aacute; actualizado</b> o <b>Ninguna unidad de expansi&oacute;n conectada</b>.<ul>
<li><b>Es necesario actualizar el firmware de inmediato</b>: cuando se muestre este estado, recomendamos encarecidamente actualizar el firmware de la unidad de expansi&oacute;n lo antes posible. Sus unidades de expansi&oacute;n dejar&aacute;n de estar disponibles hasta que se complete la actualizaci&oacute;n. Tampoco podr&aacute; crear nuevos vol&uacute;menes en las unidades de expansi&oacute;n durante este tiempo.</li>

<li><b>El firmware de todas las unidades de expansi&oacute;n est&aacute; actualizado</b>: este estado indica que su sistema ha completado la actualizaci&oacute;n y est&aacute; funcionando en un entorno estable.</li>

<li><b>Ninguna unidad de expansi&oacute;n conectada</b>: Este estado indica que su Synology NAS no tiene unidades de expansi&oacute;n conectadas. Por lo tanto, no es necesario realizar ninguna actualizaci&oacute;n de firmware.</li>
</ul></p>

<p><span class="note_head">Importante:</span> Normalmente, la actualizaci&oacute;n del firmware de la unidad de expansi&oacute;n no afecta a los datos de Synology NAS. Sin embargo, para mayor seguridad de los datos, se recomienda encarecidamente hacer una copia de seguridad de los datos antes de empezar.</p>

<div class="section">
<h4>Observaci&oacute;n:</h4>
<ul>
<li>Solo es necesario actualizar el firmware de las unidades de expansi&oacute;n en modelos de SAS espec&iacute;ficos.</li>
<li>La actualizaci&oacute;n de firmware de las unidades de expansi&oacute;n solo est&aacute; disponible en DSM 6.2.2 o superiores.</li>
</ul>
</div>

<h4>Para actualizar el firmware de las unidades de expansi&oacute;n:</h4>

<p>La actualizaci&oacute;n de firmware de las unidades de expansi&oacute;n solo tarda unos minutos y no requiere que se reinicie el sistema. El resto de servicios en ejecuci&oacute;n no se interrumpir&aacute;n durante la actualizaci&oacute;n.</p>

<ol>
<li>Haga clic en <b>Actualizar ahora</b> para iniciar la actualizaci&oacute;n.</li>
<li>Aparecer&aacute; un cuadro de di&aacute;logo de advertencia. Seleccione cualquiera de las siguientes opciones:<ul>
		<li>Para continuar con la actualizaci&oacute;n, haga clic en <b>Aceptar</b>. Aparecer&aacute; una barra de progreso.</li>
		<li>Para realizar la actualizaci&oacute;n m&aacute;s adelante, haga clic en <b>Cancelar</b>.</li>
	</ul>
</li>
<li>El sistema mostrar&aacute; una de las siguientes notificaciones de escritorio para informarle de si la descarga se ha realizado correctamente: <b>Actualizaci&oacute;n de firmware de las unidades de expansi&oacute;n completada</b> o <b>Error al actualizar el firmware de las unidades de expansi&oacute;n</b>.</li>
<li>Se mostrar&aacute; uno de los mensajes de estado siguientes en <b>Estado</b>:<ul>
		<li><b>El firmware de todas las unidades de expansi&oacute;n est&aacute; actualizado</b>: este mensaje se muestra cuando la actualizaci&oacute;n se completa correctamente. El sistema funciona en un entorno estable y las unidades de expansi&oacute;n est&aacute;n disponibles para su uso.</li>
		<li><b>Error de actualizaci&oacute;n</b>: si la actualizaci&oacute;n de firmware de las unidades de expansi&oacute;n falla, haga clic en <b>Contactar con el servicio de asistencia</b> para resolver el problema.</li>
	</ul></li>
</ol>
<div class="section">
<h4>Observaci&oacute;n:</h4>
<ul>
<li>Para garantizar la estabilidad del sistema, el servicio de las unidades de expansi&oacute;n deja de estar disponible cuando el sistema detecta que es necesario actualizar el firmware. El servicio volver&aacute; a estar disponible cuando se complete la actualizaci&oacute;n de firmware.</li>
<li>Si la actualizaci&oacute;n de firmware de las unidades de expansi&oacute;n falla, no intente reiniciar ni retirar las unidades o las unidades de expansi&oacute;n. Para resolver este problema, consulte <a href="https://www.synology.com/knowledgebase/DSM/help/DSM/SupportCenter/contact_support" target="_blank">este art&iacute;culo</a> o p&oacute;ngase en contacto con el departamento de <a href="https://account.synology.com" target="_blank">soporte t&eacute;cnico</a> de Synology para obtener m&aacute;s ayuda.</li>
</ul>
</div>

</body>
</html>
