<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<meta name="author" content="Synology Inc.">
<meta name="description" content="Enabling email notifications allows your Synology NAS to send messages to your email when specified events occur.">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Correo electr&oacute;nico</h2>

<p>Habilitar las notificaciones por correo electr&oacute;nico permite a Synology NAS enviarle mensajes a su correo electr&oacute;nico cuando se produzcan determinados eventos, como errores del sistema, p&eacute;rdidas de conexi&oacute;n a la red, fallos en el comportamiento del ventilador, cortes de alimentaci&oacute;n o no se puedan completar las tareas de copias de seguridad.</p>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>El evento de comportamiento del ventilador no est&aacute; disponible en un modelo sin ventilador, como EDS14. Para obtener m&aacute;s informaci&oacute;n, visite el <a href="https://www.synology.com/" target="_blank">sitio web de Synology</a>.</li>
</ul>
</div>

<h4>Para habilitar las notificaciones por correo electr&oacute;nico:</h4>
<ol>
	<li>Vaya al <strong>Panel de control</strong> &gt; <strong>Notificaci&oacute;n</strong> &gt; <strong>Correo electr&oacute;nico</strong>.</li>
	<li>Marque <strong>Habilitar las notificaciones de correo electr&oacute;nico</strong>.</li>
	<li>Introduzca una o varias direcciones de correo electr&oacute;nico en el campo <strong>Direcci&oacute;n de correo electr&oacute;nico del destinatario</strong>. Las notificaciones del sistema se enviar&aacute;n a las direcciones introducidas aqu&iacute;. Se permite introducir dos direcciones. Puede separar varias direcciones con un punto y coma (;).</li>
	<li>Si fuera necesario, agregue un prefijo de asunto en el campo <strong>Prefijo del asunto</strong>. Este prefijo se agregar&aacute; al asunto de cada mensaje enviado por Synology NAS para que pueda identificar y filtrar los mensajes con facilidad.</li>
	<li>Si desea utilizar un servidor de correo electr&oacute;nico de terceros (por ejemplo, Gmail o Outlook) para transmitir mensajes, consulte la secci&oacute;n sobre &quot;correos electr&oacute;nicos de terceros&quot; a continuaci&oacute;n. Si desea utilizar un servidor personalizado, consulte la secci&oacute;n sobre &quot;servidor SMTP personalizado&quot;.</li>
</ol>

<h4>Para utilizar un servicio de correo electr&oacute;nico de terceros:</h4>
<ol>
	<li>En el men&uacute; de <strong>Proveedor de servicios</strong>, elija un servicio de correo electr&oacute;nico de terceros, como Gmail o Outlook.</li>
	<li>Introduzca su nombre de usuario y contrase&ntilde;a para el servicio de correo electr&oacute;nico seleccionado.</li>
	<li>Haga clic en <strong>Aplicar</strong> para guardar la configuraci&oacute;n.</li>
	<li>Puede hacer clic en <strong>Enviar un correo electr&oacute;nico de prueba</strong> para ver si la configuraci&oacute;n es correcta.</li>
</ol>

<h4>Para utilizar un servidor SMTP personalizado:</h4>
<ol>
	<li>En el men&uacute; <strong>Proveedor de servicios</strong>, seleccione <strong>Servidor SMTP personalizado</strong>.</li>
	<li>Introduzca el nombre del servidor SMTP o la direcci&oacute;n IP en el campo <strong>Servidor SMTP</strong>.</li>
	<li>Escriba el n&uacute;mero de puerto SMTP en el campo <strong>Puerto SMTP</strong> (si ha especificado un puerto SMTP diferente al configurar las reglas de reenv&iacute;o de puerto, introduzca ese n&uacute;mero).</li>
	<li>Si su servidor SMTP requiere autenticaci&oacute;n, marque <strong>Se requiere autenticaci&oacute;n</strong> y escriba su <strong>Nombre de usuario</strong> y <strong>Contrase&ntilde;a</strong> para el servidor de correo electr&oacute;nico.</li>
	<li>Si su servidor SMTP requiere una conexi&oacute;n SSL/TLS, marque <strong>Es necesaria una conexi&oacute;n segura (SSL/TLS)</strong>.</li>
	<li>Si desea personalizar el nombre del remitente que aparece en los mensajes de correo electr&oacute;nico enviados por Synology NAS, introduzca el nombre en el campo <strong>Nombre del remitente</strong>. Si desea personalizar la direcci&oacute;n de correo electr&oacute;nico del remitente, introduzca la direcci&oacute;n de correo electr&oacute;nico en el campo <strong>Correo electr&oacute;nico del remitente</strong>. Si el campo est&aacute; en blanco, se utilizar&aacute; la primera direcci&oacute;n de correo electr&oacute;nico en el campo <strong>Direcci&oacute;n de correo electr&oacute;nico del destinatario</strong>.</li>
	<li>Haga clic en <strong>Aplicar</strong> para guardar la configuraci&oacute;n.</li>
	<li>Puede hacer clic en <strong>Enviar un correo electr&oacute;nico de prueba</strong> para ver si la configuraci&oacute;n es correcta.</li>
</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>Si desea enviar un mensaje de bienvenida a cada nueva cuenta de usuario creada, marque <strong>Enviar mensajes de bienvenida a usuarios nuevos</strong> y cada usuario recibir&aacute; un mensaje de bienvenida cuando se cree su cuenta.</li>
	<li>El idioma de las notificaciones de correo electr&oacute;nico se puede configurar en <strong>Idioma de notificaci&oacute;n</strong>. Para cambiar el idioma de notificaci&oacute;n por correo electr&oacute;nico, vaya a <strong>Men&uacute; principal</strong> &gt; <strong>Panel de control</strong> &gt; <strong>Opciones regionales</strong>, haga clic en la pesta&ntilde;a <strong>Idioma</strong> y, a continuaci&oacute;n, seleccione el idioma que prefiera en el men&uacute; desplegable de la secci&oacute;n <strong>Idioma de notificaci&oacute;n</strong>.</li>
	<li>Si utiliza el servidor SMTP de Gmail y ha habilitado la verificaci&oacute;n en dos pasos, recuerde que debe utilizar su &quot;contrase&ntilde;a espec&iacute;fica de la aplicaci&oacute;n&quot; proporcionada por Google para la autenticaci&oacute;n SMTP.</li>
</ul>
</div>

<div class="section"><h4>Nombre del dominio del servidor SMTP:</h4>
<p>El servidor SMTP puede ser una direcci&oacute;n IP o un nombre de dominio. En el segundo caso, aseg&uacute;rese de haber introducido una direcci&oacute;n IP de DNS server v&aacute;lida en <b>Men&uacute; principal</b> &gt; <b>Panel de control</b> &gt; <b>Red</b> y que el servidor se encuentre en Internet.</p>
</div>

<div class="section">
<h4>Observación:</h4>
<p>Debido a un cambio en la política de API de Google Gmail, los usuarios deben elegir la <b>Configuración personalizada del servidor SMTP</b> en el menú desplegable <b>Proveedor de servicios</b> para enviar mensajes de correo electrónico con estas tres finalidades. Para obtener más información sobre su configuración, consulte <a href="https://www.synology.com/knowledgebase/DSM/tutorial/Management/How_to_use_Gmail_SMTP_server_to_send_emails_for_DSM" target="_blank">esta página</a>. <ul><li>Usar ssmtp binario para enviar mensajes de correo electrónico, por ejemplo, ejecutar scripts definidos por usuario en el Programador de tareas.</li>
		<li>Crear un sitio web con Web Station y enviar mensajes de correo electrónico con PHP. Esto también incluye enviar mensajes de correo electrónico desde un paquete de un sitio web de terceros como Wordpress, MantisBT, etc.</li>
		<li>Enviar notificaciones de correo electrónico cuando alguien deje un comentario en una foto o artículo de Photo Station.</li></ul></p>
</div>

</body>
</html>