<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" charset="utf-8">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>General</h2>

<p><strong>Panel de control</strong> &gt; <strong>Hardware y alimentaci&oacute;n</strong> &gt; <strong>General</strong> proporciona opciones para habilitar la recuperaci&oacute;n de energ&iacute;a y Wake on LAN (WOL). Aqu&iacute; tambi&eacute;n puede modificar el control de pitido, el modo de velocidad del ventilador y el brillo de los LED.</p>

<h3>Compresi&oacute;n de memoria</h3>
	<p>Puede habilitar la compresi&oacute;n de memoria para mejorar la respuesta general del sistema bajo carga, comprimiendo los datos que se han utilizado menos recientemente en la memoria.</p>
	<p>Cuando varias aplicaciones est&aacute;n funcionando al mismo tiempo y la memoria comienza a llenarse, la compresi&oacute;n din&aacute;mica de la memoria reduce el tama&ntilde;o de elementos raramente utilizados, minimizando as&iacute; el uso de memoria. Cuando los elementos se necesitan de nuevo, se pueden descomprimir instant&aacute;neamente. Esto reduce la necesidad de intercambiar archivos de lectura y escritura en el disco y mejora la eficacia y la respuesta.</p>
	<p>Para habilitar la compresi&oacute;n de memoria, basta con marcar la casilla de verificaci&oacute;n.</p>

<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>La compresi&oacute;n de memoria solo est&aacute; disponible en modelos espec&iacute;ficos. Para obtener m&aacute;s informaci&oacute;n, visite el <a href="https://www.synology.com/" target="_blank">sitio web de Synology</a>.</li>
	</ul>
</div>

<h3>Recuperaci&oacute;n de energ&iacute;a</h3>
<p>En caso de que el sistema se apague debido a un corte el&eacute;ctrico, la funci&oacute;n de recuperaci&oacute;n de energ&iacute;a permite que el sistema arranque autom&aacute;ticamente una vez restaurada la alimentaci&oacute;n.</p>

<h3>Wake on LAN</h3>
<p>Habilitar Wake on LAN (WOL) le permite activar su Synology NAS a trav&eacute;s de una red de &aacute;rea local o de Internet, introduciendo una direcci&oacute;n IP (o nombre de host DDNS) y la direcci&oacute;n MAC de su Synology NAS mediante una aplicaci&oacute;n WOL, como por ejemplo Synology Assistant, DS finder o cualquier otra aplicaci&oacute;n WOL.</p>

<p>Wake on LAN funciona solo despu&eacute;s de que Synology NAS se haya apagado correctamente pulsando el bot&oacute;n f&iacute;sico de <b>Alimentaci&oacute;n</b> o haciendo clic en <b>Apagar</b> en la interfaz de DSM. Mantenga el cable de alimentaci&oacute;n enchufado a una toma de corriente que funcione despu&eacute;s del apagado.</p>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>WOL solo est&aacute; disponible en modelos espec&iacute;ficos. Para obtener m&aacute;s informaci&oacute;n, visite el <a href="https://www.synology.com/knowledgebase/DSM/tutorial/General/Which_Synology_DiskStation_supports_WOL_Wake_on_LAN" target="_blank">sitio web de Synology</a>.</li>
	<li>WOL no es compatible con puertos LAN de 10GbE (si est&aacute; disponible en el Synology NAS).</li>
	<li>En RC18015xs+, WOL est&aacute; habilitada por defecto en los puertos LAN de 1GbE para Synology NAS, y no puede deshabilitarse.</li>
</ul>
</div>

<h3>Modo de velocidad de ventilador</h3>
<p>Las opciones de velocidad del ventilador disponibles son las siguientes:</p>
<ul>
	<li><strong>Modo Velocidad completa:</strong> el ventilador funciona a toda velocidad, de forma que Synology NAS se mantiene refrigerado, pero se produce m&aacute;s ruido.</li>
	<li><strong>Modo Fresco:</strong> el ventilador funciona a mayor velocidad, de forma que Synology NAS se mantiene refrigerado, pero se produce m&aacute;s ruido.</li>
	<li><strong>Modo Silencioso:</strong> el ventilador funciona a menor velocidad, de forma que se produce menos ruido, pero Synology NAS se puede recalentar.</li>
	<li><strong>Modo Bajo consumo:</strong> el ventilador funciona a menor velocidad, de forma que se produce menos ruido, pero Synology NAS se puede recalentar. Adem&aacute;s, cuando Synology NAS est&eacute; refrigerado, el ventilador se parar&aacute; para ahorrar energ&iacute;a. El modo Bajo consumo solo est&aacute; disponible en algunos modelos.</li>
</ul>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>La configuraci&oacute;n del ventilador no est&aacute; disponible en un modelo sin ventilador, como EDS14. Para obtener m&aacute;s informaci&oacute;n, visite el <a href="https://www.synology.com/knowledgebase/DSM/tutorial/General/What_type_of_fan_speed_modes_are_available_on_my_Synology_NAS" target="_blank">sitio web de Synology</a>.</li>
</ul>
</div>

<h3>Control de pitido</h3>
<p>Synology NAS puede emitir un pitido cuando se produzcan ciertos eventos o errores. Marque las casillas de selecci&oacute;n de los eventos enumerados para permitir que Synology NAS le avise cuando se produzcan errores.</p>

<h4>Para detener el pitido:</h4>
<ul>
	<li>Si Synology NAS est&aacute; emitiendo un pitido, haga clic en el bot&oacute;n <strong>Pitido desactivado</strong> para apagarlo.</li>
</ul>



<h3>LED</h3>
<p>En <strong>Panel de control</strong> &gt; <strong>Hardware y alimentaci&oacute;n</strong> &gt; <strong>General</strong> &gt; <strong>Control de brillo LED</strong> puede ajustar el brillo de los indicadores de su Synology NAS.</p>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>La configuraci&oacute;n de LED solo est&aacute; disponible en modelos espec&iacute;ficos. Para obtener m&aacute;s informaci&oacute;n, visite el <a href="https://www.synology.com/knowledgebase/DSM/tutorial/General/Which_Synology_DiskStation_supports_LED_brightness_adjustment" target="_blank">sitio web de Synology</a>.</li>
	<li>La configuraci&oacute;n del brillo se aplica a todos los indicadores LED de su Synology NAS (p.ej. encendido, STATUS, LAN, estado del disco, etc.).</li>
</ul>
</div>

<h4>Para ajustar el brillo de los LED:</h4>
<p>Ahora, su Synology NAS dispone de cuatro niveles de brillo para los indicadores LED.</p>
<ol>
	<li>Haga clic y arrastre el puntero de la escala de brillo en cualquier direcci&oacute;n:<ul>
			<li>Hacia la derecha: aumenta el brillo de los LED.</li>
			<li>Hacia la izquierda: reduce el brillo de los LED.</li>
		</ul>
	</li>
	<li>Haga clic en <strong>Aplicar</strong> para guardar la configuraci&oacute;n.</li>
</ol>

<h4>Para ajustar el brillo de los LED seg&uacute;n un programa:</h4>
<p>Los indicadores LED pueden modificar su nivel de brillo en base a una hora programada.</p>

<ol>
	<li>Haga clic en <strong>Establecer el programa</strong>.</li>
	<li>Haga clic en alg&uacute;n tipo de brillo a continuaci&oacute;n:<ul>
			<li><strong>Brillo predeterminado</strong>: el m&aacute;ximo brillo</li>
			<li><strong>Brillo ajustado</strong>: el nivel de brillo especificado en la escala de brillo</li>
			<li><strong>Desactivado</strong>: LED apagado</li>
		</ul>
	</li>
	<li>Haga clic en los periodos para personalizar el programa de brillo.</li>
	<li>Haga clic en <strong>Aceptar</strong> y en <strong>Aplicar</strong> para guardar la configuraci&oacute;n.</li>
</ol>

</body>
</html>