<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Centro de informaci&oacute;n</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>Centro de informaci&oacute;n</h1>
<p>El Centro de informaci&oacute;n muestra informaci&oacute;n b&aacute;sica relacionada con varios aspectos de su Synology NAS, como las especificaciones de hardware, red, almacenamiento y servicios. El Centro de informaci&oacute;n est&aacute; en <strong>Panel de control</strong> &gt; <strong>Centro de informaci&oacute;n</strong>.</p>
<h2><a name="general"></a>General</h2>
<p>La pesta&ntilde;a <b>General</b> muestra la informaci&oacute;n b&aacute;sica sobre su Synology NAS, como el n&uacute;mero de serie, el nombre de modelo, la cantidad de memoria f&iacute;sica, la versi&oacute;n de DSM, la informaci&oacute;n de tiempo, el estado de temperatura del sistema o los dispositivos externos.</p>

<h3 class="disable-eds14">Estado de temperatura del sistema</h3>
<p class="disable-eds14">El estado de temperatura del sistema de Synology NAS se indica con luces verde o naranja:</p>

<ul class="disable-eds14">
<li><strong>Verde</strong>: el estado de temperatura del sistema es normal.</li>
<li><strong>Naranja</strong>: la temperatura de Synology NAS es demasiado alta. Si la temperatura de Synology NAS se mantiene alta, puede que se apague debido al sobrecalentamiento.</li>
</ul>
<div class="section disable-eds14">
<h4>Observaci&oacute;n:</h4>
<p>La informaci&oacute;n de estado de temperatura del sistema no se mostrar&aacute; en determinados modelos sin ventilador.</p>
</div>

<h2><a name="network"></a>Red</h2>
<p>La pesta&ntilde;a <b>Red</b> muestra informaci&oacute;n de la red, como el servidor DNS, la direcci&oacute;n IP, la m&aacute;scara de subred y m&aacute;s.</p>

<h2><a name="storage"></a>Almacenamiento</h2>
<p class="disable-eds14">La pesta&ntilde;a <b>Almacenamiento</b> muestra informaci&oacute;n relacionada con el uso de volumen y el estado del disco duro.</p>
<p class="enable-eds14">La pesta&ntilde;a <strong>Almacenamiento</strong> muestra informaci&oacute;n relacionada con el uso del almacenamiento y el estado de los dispositivos externos de almacenamiento.</p>

<h3 class="disable-eds14">Estado del disco duro</h3>

<p class="disable-eds14">Los posibles tipos de estado de un disco duro interno son:</p>

<ul class="disable-eds14">
<li><strong>No hay ning&uacute;n disco instalado:</strong> no hay ning&uacute;n disco instalado en la ranura del disco duro correspondiente.</li>
<li><strong>No iniciado:</strong> la partici&oacute;n del sistema y el volumen no est&aacute;n establecidos en el disco duro.</li>
<li><strong>Normal:</strong> la partici&oacute;n del sistema y el volumen est&aacute;n disponibles para su uso en el disco duro.</li>
<li><strong>Iniciado:</strong> la partici&oacute;n del sistema est&aacute; establecida, pero no se ha creado ning&uacute;n volumen.</li>
<li><strong>Error de partici&oacute;n del sistema:</strong> la partici&oacute;n del sistema en el disco duro no est&aacute; disponible.</li>
<li><strong>Averiado:</strong> no se ha podido acceder al volumen del disco duro. Recomendamos que sustituya el disco duro.</li>
</ul>




<div class="section disable-eds14">

<h4>Observaci&oacute;n:</h4>
<p>Para que el sistema funcione con normalidad, debe haber al menos un disco en estado <b>Normal</b> o <b>Iniciado</b>.</p>

</div>


<h2><a name="service"></a>Servicio</h2>
<p>La pesta&ntilde;a <b>Servicio</b> muestra una lista de servicios y paquetes instalados, incluidas las opciones para habilitar o deshabilitar cada servicio o paquete. Adem&aacute;s, en algunos servicios y paquetes, existen opciones para comprobar la conectividad o elegir si se puede acceder a un paquete o servicio a trav&eacute;s del cortafuegos.</p>

<h4>Para modificar la configuraci&oacute;n de servicios o paquetes:</h4>
<ol>
<li>Las opciones disponibles son las siguientes:<ul>
	  <li><strong>Habilitar:</strong> habilite o deshabilite los servicios o paquetes.</li>
	  <li><strong>Permitir a trav&eacute;s del cortafuegos:</strong> agregue o quite los puertos utilizados por el servicio o la aplicaci&oacute;n en <strong>Panel de control</strong> &gt; <strong>Acceso externo</strong> &gt; <strong>Configuraci&oacute;n de enrutador</strong>, permitiendo al servicio o paquete pasar a trav&eacute;s del cortafuegos de Synology NAS.</li>
	  <li><strong>Configuraci&oacute;n:</strong> seleccione la interfaz de red cuya configuraci&oacute;n de cortafuegos le gustar&iacute;a mostrar y administrar. Puede seleccionar <strong>Todos</strong> para mostrar y administrar las configuraciones de cortafuegos de todas las interfaces de red.</li>
	  <li><strong>Probar conexi&oacute;n:</strong> compruebe los puertos utilizados por los servicios y paquetes. Esto le permite comprobar si los dispositivos pueden acceder o no a los servicios y paquetes desde una red externa.</li>
    </ul>
</li>
<li>Haga clic en <strong>Guardar</strong> para guardar los cambios o en <strong>Restablecer</strong> para descartarlos.</li>
</ol>

<h2>Cuenta de Synology</h2>
<p>La Cuenta Synology es una plataforma web bien integrada que ayuda a los usuarios a acceder a los siguientes servicios ofrecidos por Synology:</p>

<ul>
<li>Servicios QuickConnect y DDNS para su Synology NAS</li>
<li>Gesti&oacute;n de licencias de software</li>
<li>Asistencia urgente de Synology</li>
<li>Suscripci&oacute;n a eNews</li>
<li>Historial de compra de productos Synology</li>
</ul>

<h4>Para registrarse o iniciar sesi&oacute;n en su Cuenta Synology:</h4>

<ol>
<li>Vaya a <strong>Panel de control</strong> &gt; <strong>Centro de informaci&oacute;n</strong> &gt; <strong>Cuenta Synology</strong>.</li>
<li>Haga clic en <strong>Iniciar sesi&oacute;n o registrar una Cuenta Synology</strong>.</li>
<li>Especifique las credenciales de usuario o haga clic en <strong>Registrarse</strong> para registrar una Cuenta Synology.</li>
</ol>


<h4>Para administrar su Cuenta Synology:</h4>

<ol>
<li>Haga clic en <strong>Administrar cuenta</strong> para ir a la plataforma web.</li>
<li>Siga las instrucciones web para acceder a la administraci&oacute;n de su Cuenta Synology.</li>
</ol>

<h4>Para cerrar sesi&oacute;n en su Cuenta Synology:</h4>

<p>Haga clic en <strong>Cambiar cuenta</strong> para cerrar la sesi&oacute;n de su Cuenta Synology.</p>

<div class="section">
<h4>Observaci&oacute;n:</h4>
<p>Al cerrar sesi&oacute;n en su Cuenta Synology cabe la posibilidad de que se suspendan los servicios de Synology asociados (p. ej. QuickConnect y DDNS).</p>
</div>



</body>
</html>
