<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Notificaci&oacute;n</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="advanced"></a>Avanzado</h2>
<p>Puede seleccionar los tipos de eventos que activar&aacute;n el sistema para que env&iacute;e mensajes de notificaci&oacute;n as&iacute; como el medio (correo electr&oacute;nico, SMS y dispositivos m&oacute;viles) que utilizar&aacute; para recibir los mensajes.</p>
<p>Cada uno de los eventos tiene su propio mensaje de notificaci&oacute;n predeterminado, pero usted tambi&eacute;n cuenta con la opci&oacute;n de personalizar su propio contenido de notificaci&oacute;n editando el mensaje de notificaci&oacute;n. El mensaje predeterminado puede restaurarse si decide rechazar m&aacute;s tarde su configuraci&oacute;n personalizada.</p>

<h4>Para buscar eventos de notificaci&oacute;n:</h4>
	<ol>
	<li>Escriba una palabra clave en el campo de b&uacute;squeda de la esquina superior derecha.</li>
	<li>Se mostrar&aacute;n los eventos relacionados con la palabra clave introducida.</li>
	</ol>


<h4>Para seleccionar medios de notificaci&oacute;n para los eventos de notificaci&oacute;n:</h4>
	<ol>
	<li>Marque las casillas de verificaci&oacute;n para cada uno de los eventos para seleccionar los medios de notificaci&oacute;n que prefiera.</li>
	<li>Haga clic en <b>Guardar</b> para aplicar la configuraci&oacute;n.</li>
	</ol>

<h4>Para editar los mensajes de notificaci&oacute;n:</h4>
<ol>
	<li>Seleccione un evento de la lista de eventos y, a continuaci&oacute;n, haga clic en <b>Editar mensaje</b>.</li>
	<li>En la ventana que aparece, edite el asunto y el contenido del cuerpo para personalizar el mensaje de notificaci&oacute;n.</li>
	<li>Tambi&eacute;n puede editar las siguientes variables. Las variables actualizadas se aplicar&aacute;n a todos los mensajes de notificaci&oacute;n:<ul>
			<li><strong>%COMPANY_NAME%</strong>: La firma que aparece al final de un mensaje de notificaci&oacute;n. El valor predeterminado es <strong>Synology DiskStation</strong>, <strong>Synology RackStation</strong>, <strong>Synology FlashStation</strong> o <strong>Synology Unified Controller</strong>, en funci&oacute;n de su modelo.</li>
			<li><strong>%HTTP_URL%</strong>: Un hiperv&iacute;nculo a su Synology NAS. Si no se especifica, el sistema mostrar&aacute; todos los v&iacute;nculos posibles en el mensaje de notificaci&oacute;n.</li></ul></li>
	<li>Haga clic en <strong>Guardar</strong> para aplicar los cambios.</li>
	<li>Para restaurar el mensaje de notificaci&oacute;n al valor predeterminado:<ol>
		<li>Seleccione un evento de la lista de eventos y, a continuaci&oacute;n, haga clic en <b>Editar mensaje</b>.</li>
		<li>En la ventana que aparece, haga clic en <b>Restaurar los valores por defecto</b> y luego en <strong>S&iacute;</strong> en el cuadro de di&aacute;logo de confirmaci&oacute;n.</li>
		</ol></li>
</ol>

<div class="section">
<h4>Observaci&oacute;n:</h4> 
<ul>
	<li>Se recomienda que reserve los segmentos de cadenas que contengan &apos;%&apos; tanto en el asunto como en el contenido del cuerpo. Se sustituir&aacute;n por la informaci&oacute;n real del sistema cuando se env&iacute;e una notificaci&oacute;n.</li>
</ul>
</div>

</body>
</html>
