<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Alimentaci&oacute;n</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>





<h2>SAI</h2>

<p>Un SAI (sistema de alimentaci&oacute;n ininterrumpida) es un dispositivo de alimentaci&oacute;n de reserva que permite que su Synology NAS siga funcionando durante un breve periodo de tiempo si se produce un corte de electricidad. Esta funci&oacute;n en <strong>Panel de control</strong> &gt; <strong>Hardware y alimentaci&oacute;n</strong> &gt; <strong>SAI</strong> ayuda a evitar p&eacute;rdidas de datos dando a Synology NAS tiempo suficiente para guardar los datos y desmontar los vol&uacute;menes antes de perder la corriente y apagarse (o detenerse, en el caso de EDS14).</p>

<div class="section">
<h4>Modo seguro</h4>
<p>Cuando Synology NAS entra en el Modo seguro, se detienen todos los servicios y se desmontan los vol&uacute;menes para evitar que se pierdan datos y garantizar un apagado seguro (o detenci&oacute;n, en el caso de EDS14) cuando el dispositivo SAI se quede sin energ&iacute;a. De forma predeterminada, el sistema entrar&aacute; en el Modo seguro cuando el dispositivo SAI empiece a quedarse sin energ&iacute;a. Tambi&eacute;n puede especificar la cantidad de tiempo antes de que la unidad Synology NAS entre en el Modo seguro cuando se produzca un corte de electricidad. Sin embargo, si el dispositivo SAI se queda sin bater&iacute;a antes del tiempo especificado, el sistema entrar&aacute; en el Modo seguro inmediatamente.</p>

<p>En situaciones en las que Synology NAS se apaga mientras est&aacute; en el modo seguro, se volver&aacute; a encender autom&aacute;ticamente cuando se restaure la alimentaci&oacute;n si ha habilitado la opci&oacute;n <strong>Reiniciar autom&aacute;ticamente despu&eacute;s de un corte de electricidad</strong> (situada en el <strong>Panel de control</strong> &gt; <strong>Hardware y alimentaci&oacute;n</strong> &gt; <strong>General</strong>).</p>
</div>

<h3>Compatibilidad con SAI local</h3>
<p>Para obtener informaci&oacute;n sobre la instalaci&oacute;n de hardware, consulte el manual de usuario de su dispositivo SAI. Tras completar la instalaci&oacute;n y conectar la unidad Synology NAS al dispositivo SAI, puede seguir estos pasos para habilitar la compatibilidad con SAI.</p>
<h4>Para habilitar la compatibilidad con SAI local:</h4>
<ol>
<li>Conecte el dispositivo SAI a un puerto USB de Synology NAS.</li>
<li>En la pesta&ntilde;a <b>SAI</b>, marque la casilla de verificaci&oacute;n <b>Habilitar compatibilidad con SAI</b>.</li>
<li>Seleccione el momento en que la unidad Synology NAS deber&iacute;a entrar en el Modo seguro despu&eacute;s de un corte de electricidad.</li>
<li>Elija si desea enviar una se&ntilde;al de apagado al dispositivo SAI cuando el sistema entre en el Modo seguro. La mayor&iacute;a de dispositivos SAI pueden encenderse autom&aacute;ticamente cuando se restablece la electricidad.
<ul><li>Si esta opción está habilitada, la unidad Synology NAS se apagará inmediatamente debido a la pérdida de la fuente de alimentación.</li>
<li>Si esta opción está habilitada, asegúrese de marcar <strong>Reiniciar automáticamente después de un corte de electricidad</strong> en <strong>Panel de control</strong> > <strong>Hardware y alimentación</strong> > <strong>General</strong> para garantizar que la unidad Synology NAS se reinicie automáticamente después de que se restablezca la electricidad.</li></ul></li>
<li>Haga clic en <b>Aplicar</b>.</li>
</ol>

<h3>Compatibilidad con SAI de SNMP</h3>

<p>La SAI de SNMP es un dispositivo de alimentaci&oacute;n de reserva que se conecta a su unidad Synology NAS a trav&eacute;s de SNMP. Para obtener informaci&oacute;n sobre la instalaci&oacute;n de hardware, consulte el manual de usuario de su dispositivo SAI de SNMP. Tras conectar Synology NAS al dispositivo y a la misma red, puede seguir estos pasos para habilitar la compatibilidad con SAI.</p>

<h4>Para habilitar la compatibilidad con SAI de SNMP:</h4>
<ol>
<li>En la pesta&ntilde;a <strong>SAI</strong>, marque la casilla de verificaci&oacute;n <b>Habilitar compatibilidad con SAI</b>.</li>
<li>Seleccione <strong>SAI de SNMP</strong> en el men&uacute; desplegable <strong>Tipo de SAI</strong>.</li>
<li>Marque <strong>Tiempo antes de que Synology NAS entre en modo seguro</strong> para personalizar el momento en que la unidad Synology NAS deber&iacute;a entrar en el modo seguro despu&eacute;s de un corte de electricidad. Introduzca un valor num&eacute;rico y seleccione <b>segundo(s)</b>, <b>minuto(s)</b> u <b>hora(s)</b> en el men&uacute; desplegable. Si no se marca, se aplicar&aacute; <b>Hasta bater&iacute;a baja</b>, lo que significa que el Synology NAS entrar&aacute; autom&aacute;ticamente en modo seguro cuando el SAI tenga poca bater&iacute;a.</li>
	<p><span class="note_head">Observaci&oacute;n:</span> Independientemente de la opci&oacute;n seleccionada, Synology NAS entrar&aacute; autom&aacute;ticamente en el modo seguro cuando el nivel de alimentaci&oacute;n sea bajo.</p>
<li>En el campo <strong>Direcci&oacute;n IP de SAI de SNMP</strong>, introduzca la direcci&oacute;n IP del dispositivo SAI de SNMP.</li>
<li>Seleccione la <strong>MIB de SNMP</strong> en el men&uacute; desplegable.</li>
<li>Seleccione la <strong>versi&oacute;n de SNMP</strong> en el men&uacute; desplegable.</li>
<li>Introduzca la cadena de comunidad del dispositivo SAI de SNMP en el campo <strong>Comunidad de SNMP</strong>.</li>
<li>Marque <strong>Habilitar servidor SAI de red</strong> si esta unidad Synology NAS est&aacute; conectada a trav&eacute;s de SNMP y actuar&aacute; como un servidor SAI de red. Haga clic en <strong>Dispositivos Synology NAS permitidos</strong> para introducir las direcciones IP de todos los dispositivos Synology NAS a los que permitir&aacute; conectarse a esta SAI.</li>
<p><span class="note_head">Observaci&oacute;n: </span>La funci&oacute;n <b>Dispositivos Synology NAS permitidos</b> no est&aacute; disponible en SA3200D.</p>
<li>Haga clic en <b>Aplicar</b>.</li>
</ol>

<div class="section">
<h4>Observaci&oacute;n:</h4>
<ul>
<li>Se recomienda encarecidamente utilizar <b>SAI de SNMP</b> para instalaciones Synology High Availability (SHA).</li>
<li>Synology NAS es compatible con dispositivos SAI SNMPv1 y SNMPv2c.</li>
</ul>
</div>

<h3>Servidor SAI de Synology</h3>

<p>Si hay varios productos de Synology utilizando un dispositivo SAI con un producto de Synology conectado al dispositivo SAI a trav&eacute;s de un puerto USB o red, solo la unidad Synology NAS conectada a trav&eacute;s del USB o red podr&aacute; obtener informaci&oacute;n sobre el estado del dispositivo SAI. En este caso, este Synology NAS actuar&aacute; como &quot;servidor SAI de red&quot;. El servidor SAI de red recibe la informaci&oacute;n de SAI y la transmite al otro Synology NAS cliente.</p>

<h4>Para habilitar el servidor SAI de Synology:</h4>
<ol>
<li>Inicie sesi&oacute;n en la unidad Synology NAS conectada al dispositivo SAI (por USB o red).</li>
<li>En la pesta&ntilde;a <strong>SAI</strong>, marque la casilla <strong>Habilitar servidor SAI de red</strong> para permitir que la unidad Synology NAS transmita la informaci&oacute;n de SAI a la unidad Synology NAS cliente.</li>
<li>Haga clic en el bot&oacute;n <strong>Dispositivos Synology NAS permitidos</strong>.</li>
<li>En la ventana que aparece, introduzca las direcciones IP del Synology NAS cliente. Haga clic en <strong>OK</strong>.</li>
<li>Haga clic en <strong>Aplicar</strong> para guardar la configuraci&oacute;n.</li>
</ol>

<p>Ahora el servidor SAI de red puede obtener la informaci&oacute;n de SAI y transmitirla a unidad Synology NAS cliente que utiliza el dispositivo SAI. Siga estas instrucciones para habilitar la compatibilidad con SAI en la unidad Synology NAS cliente.</p></strike>

<h4>Para habilitar la compatibilidad con SAI en la unidad Synology NAS cliente:</h4>
<ol>
<li>Inicie sesi&oacute;n en la unidad Synology NAS cliente que utiliza el dispositivo SAI pero no est&aacute; conectada por USB o red.</li>
<li>En la pesta&ntilde;a <strong>SAI</strong>, marque la casilla de verificaci&oacute;n <strong>Habilitar compatibilidad con SAI</strong>.</li>
<li>Seleccione <strong>Servidor SAI de Synology</strong> en el men&uacute; desplegable <strong>Tipo de SAI</strong>.</li>
<li>Marque <strong>Tiempo antes de que Synology NAS entre en modo seguro</strong> para personalizar el momento en que la unidad Synology NAS deber&iacute;a entrar en el modo seguro despu&eacute;s de un corte de electricidad. Introduzca un valor num&eacute;rico y seleccione <strong>segundo(s)</strong>, <strong>minuto(s)</strong> u <strong>hora(s)</strong> en el men&uacute; desplegable. Si no se marca, se aplicar&aacute; <b>Igual que el servidor</b>, lo que significa que el Synology NAS entrar&aacute; en modo seguro cuando el servidor se apague.</li>
	<p><span class="note_head">Observaci&oacute;n:</span> Independientemente de la opci&oacute;n seleccionada, Synology NAS entrar&aacute; autom&aacute;ticamente en el modo seguro cuando el nivel de alimentaci&oacute;n sea bajo.</p>
<li>Introduzca la direcci&oacute;n IP del servidor SAI de red en el campo <strong>IP del servidor UPS de red</strong>.</li>
<li>Haga clic en <b>Aplicar</b> para guardar la configuraci&oacute;n.</li>
</ol>

<div class="section">
<h4>Requisitos de SAI de red:</h4>
<ul>
<li>Para transmitir la informaci&oacute;n del dispositivo SAI, todas las unidades Synology NAS deber&iacute;an estar conectadas a la misma red.</li>
<li>El dispositivo de red (p. ej., switch o concentrador) al que est&eacute; conectada cada una de las unidades Synology NAS deber&iacute;a estar conectado al mismo dispositivo SAI. De lo contrario, las unidades Synology NAS no podr&aacute;n transmitir la informaci&oacute;n del dispositivo SAI si se produce un corte de electricidad.</li>
</ul>
</div>






</body>
</html>
