<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Wolumen</h2>
<p>Wolumen to podstawowe miejsce w pamięci masowej, na kt&oacute;rym można tworzyć foldery udostępnione i jednostki iSCSI LUN (zwykłe pliki), zapisywać dane bądź instalować pakiety. Przed utworzeniem jakiegokolwiek wolumenu trzeba utworzyć grupę RAID Group. Więcej informacji na temat grup RAID Group można znaleźć w&nbsp;temacie <a href="raid.html">Grupa RAID Group</a>.</p>

<h4>Aby utworzyć wolumen:</h4>
<ol>
	<li>Sprawdź, czy na serwerze Synology NAS utworzono już grupę RAID Group z miejscem do przydzielenia.</li>
	<li>Kliknij przycisk <strong>Utw&oacute;rz</strong>.</li>
	<li>Wybierz grupę RAID Group, w kt&oacute;rej ma zostać utworzony wolumen.</li>
	<li>Zmień ustawienia stosownie do potrzeb.</li>
	<li>Ustaw przydział miejsca wolumenu. (Ustawianie przydziału miejsca jest niedostępne w przypadku wolumen&oacute;w utworzonych w grupie RAID Group dla pojedynczych wolumen&oacute;w lub jednostek iSCSI LUN).</li>
    <li>Kliknij przycisk <strong>Zastosuj</strong>, aby potwierdzić ustawienia.</li>


</ol>

<div class="section"><h4>Uwaga:</h4>
<ul>
	<li>Limit wielkości wolumenu do przydzielenia wynosi 200 TB.</li>
	<li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Minimalna wielkość przydzielona do wolumenu Btrfs wynosi 10 GB.</li>
    <li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Wolumeny Btrfs rezerwują 4% miejsca dla metadanych.</li>
</ul>
</div>

<h4>Aby usunąć wolumen:</h4>
<ol>
	<li>Wybierz wolumen do usunięcia.</li>
	<li>Kliknij przycisk <strong>Usuń</strong> i postępuj zgodnie z instrukcjami kreatora, aby ukończyć proces.</li>
</ol>

<div class="section"><h4>Uwaga:</h4>
<ul>
	<li>Usunięcie wolumenu spowoduje usunięcie wszystkich przechowywanych na nim danych.</li>
</ul>
</div>

<h4>Aby wymusić montowanie wolumenu:</h4>
<p>Jeżeli w wolumenie nie ma pamięci podręcznej, wolumen nie zostanie zamontowany przez system podczas uruchamiania. Jeżeli pamięci podręcznej nie można odzyskać, dostęp do wolumenu można uzyskać, klikając przycisk <strong>Wymuś montowanie</strong>.</p>

<div class="section"><h4>Uwaga:</h4>
<ul>
	<li>Ta funkcja jest dostępna tylko w niekt&oacute;rych modelach.</li>
</ul>
</div>

<h4>Aby naprawić wolumen:</h4>
<p>Jeżeli wolumen ma stan <strong>Zdegradowany</strong>, przejdź do karty <strong>Grupa RAID Group</strong> i znajdź odpowiednią grupę RAID Group. Następnie postępuj zgodnie z instrukcjami wyświetlanymi na ekranie, aby ją naprawić.</p>

<h4>Aby rozszerzyć wielkość wolumenu</h4>
<ul>
	<li>W&nbsp;przypadku wolumen&oacute;w utworzonych w grupie RAID Group dla wielu wolumen&oacute;w lub jednostek iSCSI LUN (na poziomie bloku):<ol>
			<li>Wybierz wolumen do rozszerzenia.</li>
			<li>Kliknij przycisk <strong>Edytuj</strong>.</li>
			<li>Wprowadź nową wielkość i kliknij przycisk <strong>OK</strong>, aby rozszerzyć.</li>
		</ol>
	</li>
	<li>W przypadku wolumen&oacute;w utworzonych w grupie RAID Group dla pojedynczego wolumenu lub jednostki iSCSI LUN (na poziomie bloku) zapoznaj się z&nbsp;treścią części <strong>Aby rozszerzyć rozmiar grupy RAID Group</strong> w&nbsp;temacie <a href="raid.html">Grupa RAID Group</a>. Wielkość wolumenu zostanie zwiększona po rozszerzeniu powiązanej grupy RAID Group.</li>
</ul>

<div class="section">
<h4>Uwaga:</h4>
<p>Jeżeli wolumeny używane są jako zreplikowane cele pakietu <strong>Snapshot Replication</strong>, wydajność replikacji można poprawić, dostosowując ustawienie <strong>Zarejestruj czas dostępu do plik&oacute;w</strong> w oknie <strong>Edycja</strong> po utworzeniu wolumen&oacute;w:</p>
<ul>
	<li><strong>Codziennie</strong>: Czas dostępu do plik&oacute;w aktualizowany jest codziennie lub w przypadku modyfikacji pliku tak, jak w przypadku większości system&oacute;w operacyjnych. Niekt&oacute;re funkcje aplikacji polegają na dokładności czasu dostępu do pliku. Wybranie opcji <strong>Codziennie</strong> spowoduje zmniejszenie wydajności replikacji, ale jest zalecane w przypadku częstego korzystania z dowolnej z następujących funkcji lub aplikacji:<ul>
			<li>Funkcja <strong>Czas najdawniejszego dostępu do plik&oacute;w</strong> w aplikacji <strong>Analizator pamięci masowej</strong></li>
			<li>Funkcja <strong>Inspektor pamięci podręcznej SSD</strong> w aplikacji <strong>Zarządzanie przechowywaniem</strong></li>
			<li>Dowolna aplikacja innego producenta zależna od funkcji <strong>Zarejestruj czas dostępu do plik&oacute;w</strong>.</li>
		</ul>
	<li><strong>Co miesiąc</strong>: Czas dostępu do plik&oacute;w jest aktualizowany co miesiąc lub gdy pliki zostaną zmodyfikowane. Opcja powoduje niewielką poprawę wydajności replikacji, a aplikacje zależne od funkcji <strong>Zarejestruj czas dostępu do plik&oacute;w</strong> będą w stanie działać przy obniżonej dokładności.</li>
	<li><strong>Nigdy</strong>: opcja zalecana w celu osiągnięcia najwyższej wydajności replikacji oraz gdy aplikacje zależne od funkcji <strong>Zarejestruj czas dostępu do plik&oacute;w</strong> zazwyczaj nie są używane.</li>
</ul>
</div>

<h3>SSD TRIM</h3>
<p>Jeżeli wolumen składa się wyłącznie z dysk&oacute;w SSD, zaleca się włączenie funkcji SSD TRIM. Funkcja ta zwiększa szybkość odczytu i zapisu wolumen&oacute;w utworzonych na dyskach SSD, poprawiając wydajność i wydłużając okres eksploatacji dysk&oacute;w SSD.</p>

<h4>Aby włączyć funkcję SSD TRIM:</h4>
<ol>
	<li>Otw&oacute;rz <strong>Zarządzanie przechowywaniem</strong> i przejdź do karty <strong>Wolumen</strong>.</li>
	<li>Wybierz wolumen, w kt&oacute;rego skład wchodzą dyski SSD, następnie kliknij przycisk <strong>Konfiguruj</strong>.</li>
	<li>W wyświetlonym oknie dialogowym przejdź do karty <strong>SSD TRIM</strong>, następnie zaznacz pole <strong>Włącz TRIM</strong>.</li>
	<li>Kliknij przycisk <strong>Ustaw harmonogram</strong>, aby określić moment wykonania operacji SSD TRIM przez system.</li>
	<li>Kliknij przycisk <strong>OK</strong>.</li>
</ol>

<div class="section"><h4>Uwaga:</h4>
<ul>
	<li>Funkcja SSD TRIM jest dostępna tylko w niekt&oacute;rych modelach serwera Synology NAS i typach macierzy RAID.</li>
	<li>Niekt&oacute;re modele dysk&oacute;w SSD nie umożliwiają wykonywania operacji SSD TRIM w wolumenach RAID 5<span class="enable-grantley">,</span><span class="disable-grantley"> </span>RAID 6 i <span class="enable-grantley">RAID F1</span>. Lista zgodności znajduje się na <a href="https://www.synology.com/" target="_blank">oficjalnej stronie</a> firmy Synology.</li>
	<li>Funkcji SSD TRIM nie można włączyć w następujących sytuacjach:<ul>
			<li>Wolumen jest zamontowany z pamięcią podręczną SSD.</li>
			<li>W&nbsp;systemie zainstalowano pakiet <strong>Time Backup</strong>.</li>
		</ul>
	</li>
	<li>Funkcji SSD TRIM nie można włączyć w przypadku jednostek iSCSI LUN na poziomie bloku.</li>
	<li>Podczas wykonywania funkcji SSD TRIM pogarsza się wydajność systemu. Czas wykonywania funkcji TRIM zależy od rozmiaru wolumenu i modelu dysku SSD.</li>
	<li>Funkcja TRIM włączona na jednym woluminie zostanie także włączona na innych woluminach utworzonych w tej samej grupie dysk&oacute;w lub grupie RAID Group.</li>
</ul>
</div>


<h3>Czyszczenie systemu plik&oacute;w*</h3>
<p>Czyszczenie systemu plik&oacute;w to funkcja do zarządzania danymi, kt&oacute;ra sprawdza wolumeny. Po wykryciu niesp&oacute;jnych danych z sumą kontrolną ścieżka pliku zostaje zapisana w centrum log&oacute;w. W celu naprawienia danych zaleca się skorzystanie z kopii zapasowej.</p>

<p>Zalecamy regularne przeprowadzanie czyszczenia systemu plik&oacute;w, aby zapewnić sp&oacute;jność danych.</p>

<h4>Aby wykonać czyszczenie systemu plik&oacute;w:</h4>
<ol>
	<li>Otw&oacute;rz <strong>Zarządzanie przechowywaniem</strong> i przejdź do karty <strong>Wolumen</strong>.</li>
	<li>Wybierz wolumen, dla kt&oacute;rego chcesz przeprowadzić czyszczenie systemu plik&oacute;w.</li>
	<li>Kliknij przycisk <strong>Zarządzaj</strong>.</li>
	<li>Wybierz <strong>Czyszczenie systemu plik&oacute;w</strong>.</li>
</ol>

<div class="section"><h4>Uwaga:</h4>
<ul>
	<li>Czyszczenie systemu plik&oacute;w może być przeprowadzane jedynie w wolumenach z systemem plik&oacute;w <strong>Btrfs</strong>.</li>
	<li>Czyszczenie systemu plik&oacute;w można przeprowadzić tylko wtedy, gdy stan wolumenu jest <strong>Normalny</strong>.</li>
	<li>Nie zamykaj systemu przed zakończeniem procesu czyszczenia systemu plik&oacute;w. Jeśli system zostanie zamknięty przed zakończeniem, należy ponownie ręcznie uruchomić czyszczenie systemu plik&oacute;w od nowa.</li>
</ul>
</div>

<h3>Defragmentacja systemu plik&oacute;w*</h3>
<p>Jeśli dane są nieustannie modyfikowane, liczba pofragmentowanych plik&oacute;w w systemie będzie zwiększać się, przez co dostęp do plik&oacute;w na dyskach twardych będzie coraz wolniejszy. Dostęp do plik&oacute;w można przyspieszyć, przeprowadzając defragmentację systemu plik&oacute;w.</p>

<h4>Aby wykonać defragmentację systemu plik&oacute;w:</h4>
<ol>
	<li>Otw&oacute;rz <strong>Zarządzanie przechowywaniem</strong> i przejdź do karty <strong>Wolumen</strong>.</li>
	<li>Wybierz wolumen, dla kt&oacute;rego chcesz przeprowadzić defragmentację systemu plik&oacute;w.</li>
	<li>Kliknij przycisk <strong>Zarządzaj</strong>.</li>
	<li>Wybierz opcję <strong>Defragmentacja systemu plik&oacute;w</strong>.</li>
</ol>

<div class="section"><h4>Uwaga:</h4>
<ul>
	<li>Defragmentacja systemu plik&oacute;w może być przeprowadzana jedynie na wolumenach z systemem plik&oacute;w <strong>Btrfs</strong>.</li>
	<li>Defragmentację systemu plik&oacute;w można przeprowadzić tylko wtedy, gdy stan wolumenu jest <strong>Normalny</strong>.</li>
	<li>Nie zamykaj systemu przed zakończeniem procesu defragmentacji systemu plik&oacute;w. Jeśli system zostanie zamknięty przed zakończeniem, należy ponownie ręcznie uruchomić defragmentację systemu plik&oacute;w od nowa.</li>
	<li>Użycie wolumenu może wzrosnąć, jeśli zawiera on migawki folder&oacute;w wsp&oacute;łdzielonych.</li>
</ul>
</div>

<p>____<br />*Ta funkcja jest dostępna tylko w niekt&oacute;rych modelach.</p>

</body>
</html>