 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Tworzenie nowej puli pamięci &mdash; Pomoc Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article walks you through the steps to create a Storage Pool on Synology NAS using Storage Manager.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Utw&oacute;rz nową pulę pamięci</h2>
<div class="section"><h4>Ważne:</h4>
<ul>
	<li>Przed rozpoczęciem upewnij się, że na dyskach, na kt&oacute;rych ma zostać utworzona pula pamięci, nie znajdują się żadne ważne dane. Podczas procesu tworzenia wszystkie dane zostaną usunięte.</li>
	<li>Przejdź do strony <strong>HDD/SSD</strong> i upewnij się, że stan poszczeg&oacute;lnych dysk&oacute;w jest <strong>Zainicjowany</strong> lub <strong>Nie zainicjowany</strong>.</li>
	<li>Zalecamy korzystanie z dysk&oacute;w wymienionych na <a href="https://www.synology.com/compatibility" target=blank>liście zgodności produkt&oacute;w firmy Synology</a>, aby uniknąć wszelkich problem&oacute;w. Stosowanie niezgodnych dysk&oacute;w może obniżyć wydajność systemu, a nawet spowodować utratę danych w urządzeniu Synology NAS.</li>
</ul>
</div>

<h4>Aby utworzyć pulę pamięci:</h4>
<ol>
	<li>Otw&oacute;rz aplikację <strong>Zarządzanie przechowywaniem</strong>.</li>
	<li>Przejdź do <strong>Pula pamięci</strong> i kliknij przycisk <strong>Utw&oacute;rz</strong>.</li>
	<li>Wybierz typ puli pamięci:<ul>
			<li><strong>Lepsza wydajność</strong>: Ten typ puli pamięci obsługuje tylko pojedynczy wolumen, lecz zapewnia lepszą wydajność.</li>
			<li><strong>Większa elastyczność</strong>: Ten typ puli pamięci obsługuje wiele wolumen&oacute;w, technologię Synology Hybrid RAID (SHR) oraz funkcję RAID Group.</li>
		</ul>
	</li>
	<li>Skonfiguruj właściwości puli pamięci:<ul>
			<li>Opis puli pamięci: Opis tej puli pamięci.</li>
			<li>Typ RAID: R&oacute;żne typy RAID zapewniają r&oacute;żne poziomy ochrony danych. Więcej informacji można znaleźć w części <a href="general.html">Og&oacute;lne</a>.</li>
			<li>Minimalna liczba dysk&oacute;w w macierzy RAID: Minimalna liczba dysk&oacute;w wymagana dla wybranego typu RAID.</li>
			<li>Maksymalna liczba dysk&oacute;w w macierzy RAID: Większa liczba dysk&oacute;w w macierzy RAID zwiększa prawdopodobieństwo awarii macierzy. Zalecamy ustawienie limitu dysk&oacute;w w pojedynczej macierzy RAID oraz zastosowanie grupy RAID Group w celu ustalenia r&oacute;wnowagi między bezpieczeństwem danych a pojemnością puli pamięci.</li>
			<li>Funkcja grup RAID Group: Określanie, czy funkcja grup RAID Group jest obsługiwana przez wybrany typ RAID. Podczas gdy pojedyncza macierz RAID posiada ograniczenie liczby dysk&oacute;w, funkcja grupy RAID Group pozwala na stworzenie bloku pamięci przy użyciu wielu macierzy RAID, tym samym zwiększając dostępną pojemność oraz nadmiarowość dysk&oacute;w. Funkcja grup RAID Group obsługuje macierze RAID 5, RAID 6 oraz RAID F1.</li>
		</ul>
	</li>
	<li>Postępuj zgodnie z pozostałymi krokami kreatora, aby zakończyć tworzenie puli pamięci.</li>
</ol>

<div class="section"><h4>Uwaga:</h4>
<ul>
	<li>Typ SHR (Synology Hybrid RAID) jest dostępny tylko w określonych modelach. Więcej informacji można znaleźć na <a href="https://www.synology.com/" target="_blank">stronie internetowej Synology</a>.</li>
	<li>Funkcja maksymalnej liczby dysk&oacute;w w macierzy RAID i grupie RAID Group jest dostępna tylko w wybranych modelach. Więcej informacji można znaleźć na <a href="https://www.synology.com/" target="_blank">stronie internetowej Synology</a>.</li>
	<li>Maksymalna liczba dysk&oacute;w na macierz RAID może zostać zmieniona tylko wtedy, gdy wybrany typ RAID obsługuje funkcję grup RAID Group.</li>
	<li>Jeśli typ RAID puli pamięci to RAID 5, RAID 6, RAID F1, SHR (powyżej trzech dysk&oacute;w) lub SHR-2, system wykona ponowną synchronizację dla macierzy RAID w puli pamięci, aby zwiększyć szybkość dostępu i odporność danych.</li>
</ul>
</div>

</body>
</html>