<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Pula pamięci</h2>

<p>Jeden lub więcej dysk&oacute;w można połączyć w jedną jednostkę pamięci masowej zwaną pulą pamięci masowej, kt&oacute;ra może być chroniona przez macierz RAID. R&oacute;żne typy RAID zapewniają r&oacute;żne poziomy ochrony danych. Og&oacute;lną listę typ&oacute;w RAID obsługiwanych przez urządzenie Synology NAS można znaleźć w części <a href="general.html">Og&oacute;lne</a>. Po utworzeniu puli pamięci masowej można na niej utworzyć jeden lub kilka wolumen&oacute;w. Wolumen jest jednostką przechowywania danych i może być rozszerzany, jeśli powiązana z nim pula magazyn&oacute;w zawiera miejsce do przydzielenia. Przed rozpoczęciem zapisywania danych w urządzeniu Synology NAS należy utworzyć co najmniej jeden wolumen.</p>

<div class="section"><h4>Uwaga:</h4>
<ul>
	<li>Zalecamy korzystanie z dysk&oacute;w wymienionych na <a href="https://www.synology.com/compatibility?search_by=category&category=hdds&p=1" target=blank>liście zgodności produkt&oacute;w firmy Synology</a>, aby uniknąć wszelkich problem&oacute;w związanych ze zgodnością. Stosowanie niezgodnych dysk&oacute;w może obniżyć wydajność systemu, a nawet spowodować utratę danych.</li>
	<li>Pula pamięci musi składać się z dysk&oacute;w tego samego typu. Oznacza to, że puli pamięci masowej nie można utworzyć przy użyciu kombinacji dysk&oacute;w SATA i SAS.</li>
	<li>W przypadku modeli serwer&oacute;w Synology NAS obsługujących grupę RAID Group pule pamięci <b>RAID 5</b>, <b>RAID 6</b> i <b>RAID F1</b> z obsługą wielu wolumen&oacute;w mogą zawierać wiele <b>macierzy RAID</b>. Każda macierz RAID należąca do tej samej puli pamięci będzie tego samego typu RAID (np. RAID 5, RAID 6 lub RAID F1). Maksymalna liczba dysk&oacute;w w każdej macierzy RAID wynosi 6, 12, lub 24. Podczas tworzenia puli pamięci można ustawić maksymalną liczbę dysk&oacute;w i liczby tej nie można już p&oacute;źniej zmodyfikować. Gdy do macierzy RAID przypisano maksymalną liczbę dysk&oacute;w, następny dysk dodany do puli pamięci może być przypisany do nowej macierzy RAID. Nowa macierz RAID musi zawierać minimalną liczbę dysk&oacute;w wymaganą dla określonego typu RAID (np. trzy dyski w przypadku RAID 5 i RAID F1 oraz cztery dyski w przypadku RAID 6).</li>
	<li>Jeśli do utworzenia puli pamięci masowej chcesz użyć określonego dysku, ale dysk nie został wyświetlony w <strong>Kreatorze tworzenia puli pamięci masowej</strong>, przejdź do pozycji <strong>HDD/SSD</strong>, aby sprawdzić stan dysku.</li>
</ul>
</div>

</body>
</html>


	