<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=utf-8" http-equiv="Content-Type" />
<title>Realizar una copia de seguridad de los datos de mi ordenador mediante Synology Drive Client</title>
</head>

<body class="tutorial-content-box" >

<h1>Realizar una copia de seguridad de los datos de mi ordenador mediante Synology Drive Client</h1>
<div class="tutorials_content"><img style="width: 720px; height: auto;" src="../../images/Backup/1x/backup_from_PC/07_1_back_up_your_data_from_pc.png" /><h2>Visi&oacute;n general</h2>
<p>Synology Drive Server no es solo un sofisticado software de sincronizaci&oacute;n entre plataformas, sino tambi&eacute;n un medio inteligente de realizar una copia de seguridad de los datos de los ordenadores personales de los usuarios.&nbsp;Su utilidad de escritorio, Synology Drive Client, es una soluci&oacute;n de copia de seguridad en tiempo real instant&aacute;nea que permite ahorrar ancho de banda, con una protecci&oacute;n excelente gracias a un m&aacute;ximo de 32 versiones hist&oacute;ricas de un solo archivo.</p>

<h3>Configurar Synology Drive Server en Synology NAS y descargar Synology Drive Client</h3>
<ol>
<li>Vaya al <b>Centro de paquetes</b>, busque <b>Synology Drive Server</b> y, a continuaci&oacute;n, haga clic en&nbsp;<strong>Instalar</strong>. Se descargar&aacute;n tres paquetes en total: Consola de administraci&oacute;n de Synology Drive, Synology Drive ShareSync y Synology Drive.</li>
<li>Inicie <strong>Synology Drive</strong>. En la esquina inferior derecha, ver&aacute; un mensaje para descargar <strong>Synology Drive Client</strong>.<br> <img style="width: 300px; height: auto;" src="../../images/Backup/3x/Backup/Image 5.png" /><br> O bien, vaya a la esquina inferior izquierda, haga clic en el icono de usuario y vaya a <strong>Cliente</strong> &gt; <strong>Descargar cliente</strong>.<br> <img style="width: 300px; height: auto;" src="../../images/Backup/3x/Backup/Image 4.png" /><br> Tambi&eacute;n puede descargar Synology Drive Client desde el <a href="https://www.synology.com/support/download" target="_blank">Centro de descargas de Synology</a>.</li>
<li>Abra el instalador en su ordenador y siga las instrucciones para instalar Synology Drive Client. Despu&eacute;s de la instalaci&oacute;n, ejecute <strong>Synology Drive Client</strong> haciendo clic en <strong>Iniciar ahora</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/01.png" /></li>
<li>Seleccione <strong>Tarea de copia de seguridad</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/02.png" /></li>
<li>Introduzca la direcci&oacute;n o QuickConnect ID del Synology NAS que ejecuta Synology Drive Server, el nombre de usuario y la contrase&ntilde;a. Tambi&eacute;n puede hacer clic en el icono de b&uacute;squeda de la derecha y Synology Drive Client buscar&aacute; autom&aacute;ticamente Synology NAS disponibles en su red local. Haga clic en <strong>Siguiente</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/03.png" /></li>
<li>Seleccione el origen de copia de seguridad y desmarque las subcarpetas que no quiera sincronizar. Synology Drive Client crear&aacute; una carpeta de copia de seguridad con el nombre del ordenador en el destino que haya seleccionado. La carpeta <strong>home</strong> se seleccionar&aacute; como la carpeta de destino predeterminada. Si desea utilizar una carpeta que no est&eacute; en la lista, p&oacute;ngase en contacto con el administrador del sistema. Los administrators del sistema pueden consultar la <a href="https://www.synology.com/knowledgebase/DSM/help/SynologyDrive/drive_admin_console" target="_blank">p&aacute;gina de ayuda de la Consola de administraci&oacute;n de Synology Drive</a>. Tambi&eacute;n puede hacer clic en <strong>Reglas de la copia de seguridad</strong> si desea definir filtros o reglas de sincronizaci&oacute;n. Haga clic en <b>Siguiente</b>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/backup_source.png" /></li>
<li>Seleccione un modo de copia de seguridad y haga clic en <b>Siguiente</b>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/backup_mode.png" /></li>
<li>Revise un resumen de la configuraci&oacute;n de copia de seguridad. Haga clic en <b>Atr&aacute;s</b> para realizar cualquier cambio o haga clic en&nbsp;<strong>Finalizado</strong> para finalizar la configuraci&oacute;n.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/backup_summary.png" /></li>
<li>Puede ver el progreso de la copia de seguridad en la ventana principal.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/progress.png" /></li>
</ol>

<h3>Descargar o restaurar una versi&oacute;n anterior de un archivo sincronizado en Synology Drive Client</h3>
<ol>
<li>En Synology Drive Client, vaya a <strong>Tareas de copia de seguridad</strong> &gt; <strong>Restaurar</strong> y localice el archivo o la carpeta que desea restaurar.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/restore.png" /></li>
<li>Seleccione el archivo que desea recuperar y haga clic en <strong>Examinar versiones anteriores</strong>. Si un archivo se ha eliminado accidentalmente o se ha borrado de su ordenador, puede hacer clic en <strong>Restaurar</strong> para recuperarlo.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/previous_version.png" /></li>
<li>Seleccione la versi&oacute;n del archivo que desea descargar y haga clic en <strong>Descargar</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/download_restore.png" /></li>
</ol>

<h3>Descargar o restaurar una versi&oacute;n anterior de un archivo sincronizado en la Consola de administraci&oacute;n de Synology Drive</h3>
<ol>
<li>En DSM, vaya a <strong>Consola de administraci&oacute;n de Synology Drive</strong> &gt; <strong>Carpeta de equipo</strong>, haga clic en la carpeta en la que est&aacute; almacenado el archivo que desea restaurar y haga clic en <strong>Explorador de versiones</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/version_history.png" /></li>
<li>En la ventana <strong>Explorador de versiones</strong>, haga clic en el archivo que desee recuperar y, a continuaci&oacute;n, haga clic en <strong>Examinar versiones anteriores</strong>.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/browse_previous versions_server.png" /></li>
<li>Seleccione la versi&oacute;n del archivo que desea descargar y haga clic en <strong>Descargar</strong>. O si no est&aacute; seguro de que desea restaurar la versi&oacute;n seleccionada, haga clic en <strong>Restaurar</strong> y sobrescribir&aacute; su versi&oacute;n actual.<br> <img style="width: 600px; height: auto;" src="../../images/Backup/3x/Backup/previous_versions.png" /></li>
</ol>

<h3>Protecci&oacute;n adicional de sus datos</h3>
<p>Para obtener m&aacute;s informaci&oacute;n acerca de c&oacute;mo proteger y hacer copias de seguridad de sus datos, haga clic <a href="https://www.synology.com/knowledgebase/tutorials#BackupRestore" target="_blank">aqu&iacute;</a> para ver m&aacute;s tutoriales sobre otros servicios de copia de seguridad ofrecidos en DSM.</p>

</div>
<div class="section">
<ul>
<li>Siguiente en este tema: <a href="backup_backup.html">Copia de seguridad de los datos de su Synology NAS</a>.</li>
</ul>
</div>

</body>
</html>