<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language"  charset="utf-8"/>
<meta content="text/html; charset=utf-8" http-equiv="Content-Type" />
<title>Organice y reproduzca v&iacute;deos con Video Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Clasificar y reproducir v&iacute;deos con Video Station</h1>
<div class="tutorials_content"><img src="../../images/HomeTheater/1x/home_theater_videos/Categorize_and_Play_Videos_with_Video_Station.png"/><h2>Informaci&oacute;n general</h2>
<p>Con Video Station, puede organizar y clasificar f&aacute;cilmente sus colecciones de v&iacute;deo en distintas bibliotecas predeterminadas o personalizadas para encontrar con mucha m&aacute;s eficiencia el v&iacute;deo que busca. Adem&aacute;s, reproducir y compartir v&iacute;deos puede ser tan f&aacute;cil y sencillo como unos simples clics.</p>

<h3 class="list_head">1. Instalar Video&nbsp;Station</h3>
<p>Para instalar Video Station, dir&iacute;jase al <b>Centro de paquetes</b>, busque <b>Video Station</b> y, a continuaci&oacute;n, haga clic en <b>Instalar</b>.</p><img src="../../images/HomeTheater/1x/home_theater_videos/1.png" style="width: 700px; border: 1"/><h3 class="list_head">2. Almacenar y clasificar v&iacute;deos en bibliotecas predeterminadas</h3>
<p>Video Station ofrece tres bibliotecas predeterminadas como se indica en el panel izquierdo: <b>Pel&iacute;cula</b>, <b>Serie de TV</b> y <b>V&iacute;deo casero</b>. Para asegurarse de que sus v&iacute;deos se pueden indexar y clasificar, primero necesita agregar una carpeta de v&iacute;deo para cada biblioteca y, a continuaci&oacute;n, almacenar los archivos en la carpeta correspondiente. De forma predeterminada, se crean tres carpetas de v&iacute;deo en la carpeta compartida <b>v&iacute;deo</b> para cada una de las bibliotecas predeterminadas: <b>pel&iacute;cula</b>, <b>serie de TV</b> y <b>v&iacute;deo casero</b>. Sin embargo, adem&aacute;s de estas tres carpetas, tambi&eacute;n puede hacer lo siguiente para agregar m&aacute;s carpetas de v&iacute;deo a las bibliotecas.</p>

<div class="code_div"><b>Observaci&oacute;n:</b><p>El sistema buscar&aacute; autom&aacute;ticamente metadatos relacionados y otra informaci&oacute;n (p. ej., im&aacute;genes del p&oacute;ster) para dos tipos de v&iacute;deo (pel&iacute;culas y programas de televisi&oacute;n) de Internet. Por lo tanto, para garantizar que sus v&iacute;deos puedan sincronizarse con la informaci&oacute;n correcta, se recomienda encarecidamente que los v&iacute;deos coincidan con el tipo de v&iacute;deo especificado en sus respectivas bibliotecas.</p>
</div>

<h4>Agregar carpetas de v&iacute;deo a las librer&iacute;as predeterminadas</h4>
<ol>
<li>Vaya a <b>Configuraci&oacute;n</b> &gt; <b>Biblioteca</b>.</li><img src="../../images/HomeTheater/1x/home_theater_videos/2.png" style="width: 700px; border: 1"/><li>Haga clic en el icono <strong>Agregar carpeta</strong> para seleccionar una carpeta del Synology NAS y seleccione la biblioteca de destino. Puede agregar hasta 100 carpetas de v&iacute;deo para una biblioteca, pero una vez que selecciona una carpeta, ni la carpeta ni sus subcarpetas pueden seleccionarse para otra biblioteca.</li><img src="../../images/HomeTheater/1x/home_theater_videos/3.png" style="width: 700px; border: 1"/><li>Almacene los archivos de v&iacute;deo en las carpetas de v&iacute;deo para clasificarlos en sus bibliotecas correspondientes.</li>
<li>Ya puede buscar y ver en las bibliotecas los v&iacute;deos que desee.</li>
</ol>

<h3 class="list_head">3. Almacenar y clasificar v&iacute;deos en bibliotecas personalizadas</h3>
<p>Adem&aacute;s de las tres bibliotecas predeterminadas, a las que puede acceder cualquiera de forma predeterminada, usted como <B>admin</B> de DSM y los usuarios que pertenezcan al grupo de <b>administradores</b> tambi&eacute;n pueden crear bibliotecas personalizadas y asignar permisos de acceso a ciertos usuarios.</p>

<h4>Crear bibliotecas personalizadas</h4>
<ol>
<li>Vaya a <b>Configuraci&oacute;n</b> &gt; <b>Biblioteca</b> y haga clic en el icono &quot;+&quot; para crear una biblioteca.</li><img src="../../images/HomeTheater/1x/home_theater_videos/4.png" style="width: 700px; border: 1"/><li>Especifique un nombre para la nueva biblioteca, seleccione el tipo de v&iacute;deo que desee colocar en la carpeta y, a continuaci&oacute;n, seleccione <b>P&uacute;blica</b> si desea que todos puedan acceder a la misma o <b>Privada</b> para limitar el acceso a determinados usuarios con permisos. Tenga en cuenta que los v&iacute;deos que coloque en la carpeta deben coincidir con el tipo seleccionado aqu&iacute; para garantizar la exactitud de la informaci&oacute;n de v&iacute;deo recopilada de Internet.</li>
<li>Si selecciona <b>Privada</b>, haga clic en <b>Asignar permisos</b> y, a continuaci&oacute;n, marque las casillas para conceder acceso a los usuarios.</li>
</ol>

<h3 class="list_head">4. Reproducci&oacute;n de v&iacute;deos</h3>
<p>Cuando haya clasificado los archivos de v&iacute;deo en diferentes bibliotecas, puede seguir los pasos que se indican a continuaci&oacute;n para reproducir los v&iacute;deos en Video Station. Se recomienda encarecidamente instalar <a href="http://www.videolan.org/vlc/" target="_blank">VLC media player (Windows, Linux)</a> antes en el equipo. Adem&aacute;s de reproducir v&iacute;deos en su ordenador local, tambi&eacute;n puede transmitir sus v&iacute;deos en DMA compatibles con DLNA/UPnP o dispositivos compatibles con AirPlay para la reproducirlos.</p>

<h4>Reproducir v&iacute;deos con el reproductor de v&iacute;deo integrado</h4>
<ol>
<li>Seleccione cualquier clip de v&iacute;deo que desee reproducir y, a continuaci&oacute;n, haga clic en el icono de reproducci&oacute;n de la imagen de v&iacute;deo.</li><img src="../../images/HomeTheater/1x/home_theater_videos/5.png" style="width: 700px; border: 1"/><li>El v&iacute;deo deber&iacute;a empezar a reproducirse enseguida. Si no es as&iacute;, aseg&uacute;rese de que el formato del v&iacute;deo es compatible con el explorador web o de haber instalado el complemento de VLC en el equipo.</li>
<li>Utilice los botones que aparecen en pantalla y en la barra de progreso del reproductor de v&iacute;deo en funci&oacute;n de sus necesidades. Tambi&eacute;n puede ajustar el volumen, seleccionar al calidad de la reproducci&oacute;n de v&iacute;deo y audio, activar los subt&iacute;tulos o transmitir el v&iacute;deo a otro dispositivo (si procede).</li><img src="../../images/HomeTheater/1x/home_theater_videos/6.png" style="width: 700px; border: 1"/></ol>


<div class="code_div"><b>Observaci&oacute;n:</b><p>Para obtener informaci&oacute;n detallada sobre el complemento de VLC y los dispositivos compatibles, consulte <b>Ayuda de DSM</b> &gt; <b>Video Station</b> &gt; <b>Reproducci&oacute;n de v&iacute;deo</b>.</p>
</div>
 
<h3 class="list_head">5. Compartir v&iacute;deos con el p&uacute;blico</h3> 
<p>Con la funci&oacute;n de uso p&uacute;blico compartido, puede compartir sus v&iacute;deos f&aacute;cilmente con otras personas mediante Video Station y todos los v&iacute;deos compartidos tendr&aacute;n accesibilidad p&uacute;blica para cualquiera que disponga del v&iacute;nculo.</p>

<h4>Compartir v&iacute;deos con otras personas</h4>
<ol>
<li>Vaya a cualquier biblioteca de v&iacute;deo y haga clic en <strong>Todos</strong> en la esquina superior izquierda para ver todos los v&iacute;deos de esa biblioteca.</li>
<li>Haga clic en el icono <b>Modo de selecci&oacute;n</b> o mantenga pulsado <b>Ctrl</b> o <b>May&uacute;s</b> para seleccionar varios v&iacute;deos. A continuaci&oacute;n haga clic en el icono <strong>Uso p&uacute;blico compartido</strong> .</li>
<ul>
<li>Si solo ha seleccionado un v&iacute;deo para compartir, este se agregar&aacute; a la colecci&oacute;n compartida llamada <b>V&iacute;deos compartidos</b>. All&iacute; podr&aacute; administrar individualmente todos los v&iacute;deos que haya compartido.</li>
<li>Si ha seleccionado varios v&iacute;deos para compartir, estos se agrupar&aacute;n en una nueva colecci&oacute;n compartida.</li><img src="../../images/HomeTheater/1x/home_theater_videos/9_.png" style="width: 700px; border: 1"/></ul>
<li>Especifique un per&iacute;odo de validez si es necesario.</li>
<li>Tambi&eacute;n puede hacer clic en el icono <strong>+</strong> de la imagen de la pel&iacute;cula de destino y, a continuaci&oacute;n, en <strong>Uso p&uacute;blico compartido</strong> para agregar el v&iacute;deo seleccionado a <strong>V&iacute;deos compartidos</strong>.</li><img src="../../images/HomeTheater/1x/home_theater_videos/7_.png"  style="width: 700px; border: 1"/><li>Sencillamente copie y pegue el enlace en correos electr&oacute;nicos, mensajes instant&aacute;neos y p&aacute;ginas web para compartir estos v&iacute;deos con cualquiera.</li>
</ol> 


<h3 class="list_head">6. Organizar y ver v&iacute;deos en dispositivos m&oacute;viles</h3>
<p>Para conectarse a Video Station a trav&eacute;s de dispositivos m&oacute;viles, puede descargar DS video con dispositivos iOS/Android con los siguientes c&oacute;digos QR. Podr&aacute; reproducir v&iacute;deos y organizar sus colecciones con sus dispositivos m&oacute;viles y transmitir v&iacute;deos a sus DMA o dispositivos AirPlay tanto en casa como en sus desplazamientos.</p><img src="../../images/HomeTheater/1x/home_theater_videos/8.png"/></div>
<div class="page-info">
  <ul>
    <li>Anterior en este tema: <a href="home_theater_media_server.html">Disfrute de contenido multimedia almacenado en Synology NAS en grandes pantallas</a> </li>
    <li>Siguiente en este tema: <a href="home_theater_music.html">Disfrute de la m&uacute;sica almacenada en su Synology NAS con Audio Station</a> </li>
  </ul>
</div>
</body>
</html>