<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=utf-8" http-equiv="Content-Type" />
<title>Cree &aacute;lbumes para gestionar y examinar las fotograf&iacute;as con Photo Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Cree &aacute;lbumes para gestionar y examinar las fotograf&iacute;as con Photo Station</h1>
<div class="tutorials_content"><img src="../../images/ManagePhotos/1x/manage_share_photos/Create_Albums_to_Manage_and_Browse_Photos_with_Photo_Station.jpg"/><h2>Visi&oacute;n general</h2>
<p>Photo Station es una aplicaci&oacute;n basada en la web dise&ntilde;ada para ayudarle a organizar y ver a trav&eacute;s de Internet as fotos almacenadas en Synology NAS. Con su interfaz refinada y f&aacute;cil de usar, Photo Station le permite cargar, explorar, gestionar y compartir sus &aacute;lbumes de fotos con solo unos clics.</p>

<h3 class="list_head">1. Instalar Photo&nbsp;Station</h3>
<p>Para instalar Photo Station, dir&iacute;jase al <b>Centro de paquetes</b>, busque <b>Photo Station</b> y, a continuaci&oacute;n, haga clic en <b>Instalar</b>.</p><img src="../../images/ManagePhotos/1x/manage_share_photos/1.png" border="1"/><h3 class="list_head">2. Cargar fotos</h3>
<p>Para poder explorar y gestionar fotos en Photo Station, primero debe crear &aacute;lbumes y cargar fotos con cualquiera de los siguientes m&eacute;todos.</p>

<h4>2.1 Carga de fotos a trav&eacute;s de Synology Photo Station Uploader (para Windows y Mac)</h4>
<p>Le recomendamos que utilice Synology Photo Station Uploader, ya que las miniaturas de cada foto que se va a mostrar se generar&aacute;n durante el proceso de carga. La carga de archivos a trav&eacute;s de Synology Photo Station Uploader aprovechar&aacute; la capacidad inform&aacute;tica de su equipo para acelerar la conversi&oacute;n.</p>
<ol>
<li>Descargue e instale <b>Synology Photo Station Uploader</b> (disponible en el <a href="https://www.synology.com/support/download" target="_blank">Centro de descargas de Synology</a>).</li>
<li>En el ordenador, haga clic con el bot&oacute;n derecho en las fotos que desee cargar y seleccione <b>Cargar a Photo Station</b> &gt; <b>Crear nuevo perfil</b> para abrir el asistente.</li>
<li>Introduzca un nombre de su elecci&oacute;n y la direcci&oacute;n IP/el nombre del servidor del Synology NAS de destino para el nuevo perfil.</li><img src="../../images/ManagePhotos/1x/manage_share_photos/2.png" border="1"/><div class="code_div"><b>Observaci&oacute;n:</b><p>La informaci&oacute;n del servidor y las credenciales de usuario proporcionadas se guardar&aacute;n en este perfil para su uso futuro. Puede configurar varios perfiles de acuerdo con diferentes reglas o destinos. En lugar de volver a rellenar la informaci&oacute;n del servidor la pr&oacute;xima vez que utilice Synology Photo Station Uploader, puede seleccionar un perfil existente y utilizar sus configuraciones configuradas previamente para cargar fotos en el mismo destino.</p>
</div>

<li>Elija si desea cargar los archivos a Photo Station o Personal Photo Station.</li>

<li>Introduzca las credenciales de usuario para el Synology NAS de destino.</li>

<li>Haga clic en <b>Examinar</b> para seleccionar una carpeta de destino o crear una subcarpeta en la carpeta compartida <b>photo</b>.</li><img src="../../images/ManagePhotos/1x/manage_share_photos/3.png" border="1"/><li>Una vez finalizada la carga, puede iniciar Photo Station en su Synology NAS y ver los archivos cargados en varios modos o editar otra informaci&oacute;n, como las propiedades del &aacute;lbum y los privilegios de acceso.</li>
</ol>


<h4>2.2 Creaci&oacute;n de &aacute;lbumes y carga de fotos a trav&eacute;s de Photo Station</h4>
<p>Inicie <b>Photo Station</b> y haga clic en <b>Agregar</b> para crear un nuevo &aacute;lbum o cargar fotos desde su ordenador o Synology NAS a &aacute;lbumes existentes.</p><img src="../../images/ManagePhotos/1x/manage_share_photos/4.png" border="1"/><div class="code_div"><b>Observaci&oacute;n:</b><p>Si prefiere cargar fotos a trav&eacute;s de la interfaz de Photo Station, se recomienda habilitar el servicio QuickConnect. Tanto si se encuentra en casa como fuera de ella, QuickConnect le permite acceder a su Synology NAS y Photo Station desde cualquier lugar a trav&eacute;s de Internet con un ID personalizado sin la molestia de tener que configurar complicadas configuraciones de red, como reglas de reenv&iacute;o de puerto. Para obtener m&aacute;s informaci&oacute;n sobre QuickConnect, consulte <a class="launch-app" href="cloud_set_up_quickconnect.html">este tutorial</a>.</p>
</div>

<h3 class="list_head">3. Compartir fotos</h3>
<p>Con la funci&oacute;n de compartir, puede compartir f&aacute;cilmente las fotos almacenadas en Photo Station con sus amigos o cargarlas en las redes sociales m&aacute;s populares, como Facebook, Picasa y Flickr.</p>

<h4>3.1 Compartir fotos con el p&uacute;blico</h4>
<ol>
<li>Navegue hasta un &aacute;lbum y seleccione las fotos que desea compartir.</li>
<li>Haga clic en <b>Compartir</b> &gt; <b>Compartir con el p&uacute;blico</b> para obtener el enlace.</li>
<ul>
<li>Si solo ha seleccionado una foto para compartir, esta se agregar&aacute; a un &aacute;lbum compartido predeterminado llamado <b>Fotos compartidas</b>. All&iacute; podr&aacute; administrar individualmente todas las fotos que haya compartido.</li>
<li>Si ha seleccionado varias fotos para compartir, estas se agrupar&aacute;n en un nuevo &aacute;lbum compartido.</li>
</ul>
<li>Tambi&eacute;n puede hacer clic en <b>Compartir</b> &gt; <b>Agregar a un &aacute;lbum compartido</b> para a&ntilde;adir las fotos seleccionadas a un &aacute;lbum compartido existente (si procede).</li><img src="../../images/ManagePhotos/1x/manage_share_photos/5.png" border="1"/><li>Introduzca un nombre para el nuevo &aacute;lbum compartido y especifique su periodo de validez si es necesario.</li>
<li>Copie y pegue el v&iacute;nculo en correos electr&oacute;nicos, mensajes instant&aacute;neos y p&aacute;ginas web para compartir las fotos seleccionadas con cualquier usuario.</li>
</ol>

<div class="code_div"><b>Observaci&oacute;n:</b><ul>
<li>Todas las fotos compartidas son de acceso p&uacute;blico para cualquier persona que tenga el enlace.</li>
<li>Puede especificar qu&eacute; usuarios tienen privilegios para compartir elementos de Photo Station con el p&uacute;blico en <b>Configuraci&oacute;n</b> &gt; <b>Compartir</b>.</li>
</ul>
</div>

<h4>3.2 Compartir fotos en redes sociales</h4>
<ol>
<li>Seleccione las fotos que desea cargar y luego elija <b>Compartir</b> &gt; <b>Cargar en [sitios web de redes sociales]</b>.</li><img src="../../images/ManagePhotos/1x/manage_share_photos/6.png" border="1"/><li>En la ventana que aparece, haga clic en <b>Conectar con [sitios web de redes sociales]</b> y luego autorice con su cuenta de red social. Puede elegir cargar las fotos a una carpeta nueva o existente.</li>
</ol>

<h3 class="list_head">4. Organizar y explorar fotos en dispositivos m&oacute;viles</h3>
<p>Para conectarse a Photo Station o cargar fotos a trav&eacute;s de dispositivos m&oacute;viles, puede instalar <b>DS photo</b> en sus dispositivos m&oacute;viles con los siguientes c&oacute;digos QR.</p><img src="../../images/ManagePhotos/1x/manage_share_photos/7.png"/></div>

</body>
</html>