<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Prote&ccedil;&atilde;o de Conta - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="The account protection feature helps improve the security of your Synology NAS by protecting the accounts from untrusted device with too many failed login attempts.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Prote&ccedil;&atilde;o de Conta</h2>

<p>O recurso de Prote&ccedil;&atilde;o de Conta ajuda a refor&ccedil;ar a seguran&ccedil;a do seu Synology NAS protegendo as contas contra clientes n&atilde;o confi&aacute;veis com muitas tentativas malsucedidas de login. Isso ajuda a reduzir o risco da invas&atilde;o de contas por ataques de for&ccedil;a bruta.</p>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>Pacotes e servi&ccedil;os suportados: DSM, File Station, Audio Station, Video Station, Download Station, Mail Station, Cloud Station e aplicativos m&oacute;veis da Synology.</li>
</ul>
</div>

<h3>Para habilitar a prote&ccedil;&atilde;o da conta:</h3>
<ol>
	<li>V&aacute; para <strong>Painel de controle</strong> &gt; <strong>Seguran&ccedil;a</strong> &gt; <strong>Prote&ccedil;&atilde;o de Conta</strong>.</li>
	<li>Marque <strong>Habilitar prote&ccedil;&atilde;o da conta</strong>.</li>
	<li>Especifique um n&uacute;mero no campo <strong>Tentativas de login</strong> e <strong>Dentro de (minutos)</strong>. Um cliente n&atilde;o confi&aacute;vel ser&aacute; bloqueado se fizer muitas tentativas malsucedidas de login dentro do per&iacute;odo predefinido de tempo. </li>
	<li>Especifique um n&uacute;mero no campo <strong>Desbloquear (minutos depois)</strong>. A prote&ccedil;&atilde;o da conta ser&aacute; cancelada ap&oacute;s o per&iacute;odo predefinido de tempo.</li>
	<li>Clique em <strong>Aplicar</strong> para salvar as configura&ccedil;&otilde;es.</li>
</ol>

<h3>Para cancelar a prote&ccedil;&atilde;o das contas selecionadas</h3>
<ol>
	<li>Clique em <strong>Gerenciar contas protegidas</strong>.</li>
	<li>Selecione as contas a serem canceladas e clique em <strong>Cancelar prote&ccedil;&atilde;o</strong>.</li> 
</ol>

<h3>Para desbloquear os clientes confi&aacute;veis</h3>
<ol>
	<li>Clique em <strong>Gerenciar dispositivos confi&aacute;veis</strong>.</li>
	<li>Selecione os clientes a serem desbloqueados e clique em <strong>Desbloquear</strong>.</li>
</ol>

</body>
</html>
