<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Configura&ccedil;&otilde;es do DSM</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="https"></a>Configura&ccedil;&otilde;es do DSM</h2>

<p>Em <strong>Painel de Controle</strong> &gt; <strong>Rede</strong> &gt; <strong>Configura&ccedil;&otilde;es do DSM</strong>, voc&ecirc; pode alterar o n&uacute;mero da porta que os clientes usam para acessar o Synology NAS.</p>

<h4>Para mudar o n&uacute;mero de porta padr&atilde;o:</h4>
<p>Conex&otilde;es HTTP e HTTPS s&atilde;o sempre habilitadas no DSM. A porta HTTP padr&atilde;o &eacute; 5000 e a porta HTTPS padr&atilde;o &eacute; 5001.</p>
<ol>
<li>Digite o n&uacute;mero da porta no campo <b>HTTP</b> ou <b>HTTPS</b>.</li>
<li>Clique em <b>Aplicar</b>.</li>
</ol>

<h4>Para redirecionar conex&otilde;es HTTP para HTTPS:</h4>
<p>Voc&ecirc; pode redirecionar clientes para a porta HTTPS quando eles tentarem acessar seu Synology NAS atrav&eacute;s da porta HTTP.</p>
<ol>
<li>Selecione <b>Redirecionar automaticamente conex&otilde;es HTTP para HTTPS (exceto Web Station e Photo Station)</b>.</li>
<li>
Clique em <b>Aplicar</b>.
</li>
</ol>

<div class="section">
<h4>Portas usadas para a conex&atilde;o HTTPS:</h4>
<ul>
  <li><b>DSM</b>: O n&uacute;mero da porta padr&atilde;o &eacute; 5001, portanto &eacute; poss&iacute;vel acessar o DSM de forma segura digitando o seguinte endere&ccedil;o: https://server-hostname:5001/</li>
<li><b>Web Station e Photo Station</b>: O n&uacute;mero da porta padr&atilde;o &eacute; 443, portanto &eacute; poss&iacute;vel acessar o Web Station e o Photo Station de forma segura digitando o seguinte endere&ccedil;o: https://server-hostname/</li>
</ul>

</div>

<h4>Para habilitar HTTP/2:</h4>
<p>Voc&ecirc; pode acelerar conex&otilde;es HTTPS habilitando o HTTP/2.</p>
<ol>
<li>Marque <b>Habilitar HTTP/2</b>.</li>
<li>Clique em <b>Aplicar</b>.</li>
</ol>

<div class="enable-x64 enable-bromolow enable-cedarview enable-avoton enable-grantley enable-broadwell enable-dockerx64 enable-braswell">

<h4>Para personalizar o m&aacute;ximo de conex&otilde;es HTTP simult&acirc;neas:</h4>
<p>Voc&ecirc; pode habilitar a op&ccedil;&atilde;o <strong>Personalizar m&aacute;ximo de conex&otilde;es HTTP simult&acirc;neas</strong> para aumentar o n&uacute;mero de conex&otilde;es HTTP no seu Synology NAS.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Quanto maior o n&uacute;mero m&aacute;ximo de conex&otilde;es HTTP simult&acirc;neas, mais mem&oacute;ria do sistema ser&aacute; consumida.</li>
</ul>
</div>
</div>

<h4>Para personalizar o cabe&ccedil;alho &quot;Server&quot; em respostas HTTP:</h4>
<ol>
<li>Marque <b>Habilitar o cabe&ccedil;alho &ldquo;Server&rdquo; em respostas HTTP</b>.</li>
<li>Especifique um cabe&ccedil;alho para seu servidor Web (por exemplo, nginx).</li>
<li>Clique em <b>Aplicar</b>.</li>
</ol>
<p>Voc&ecirc; pode desabilitar o cabe&ccedil;alho &ldquo;Server&rdquo; desmarcando a caixa de sele&ccedil;&atilde;o.</p>

<h2>Dom&iacute;nio</h2>
<p>Em <strong>Dom&iacute;nio</strong>, voc&ecirc; pode especificar um nome de dom&iacute;nio personalizado para acessar o Synology NAS.
</p>
<h4>Para habilitar o dom&iacute;nio personalizado:</h4>
<ol>
<li>
Marque <b>Habilitar dom&iacute;nio personalizado</b>.
</li>
<li>
Especifique um nome de dom&iacute;nio aplicado para seu Synology NAS.
</li>
<li>
Voc&ecirc; tamb&eacute;m pode marcar <b>Habilitar HSTS</b> para for&ccedil;ar conex&otilde;es HTTPS criptografadas nesse dom&iacute;nio.
</li>
<li>
Clique em <b>Aplicar</b>.
</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Cada nome de dom&iacute;nio pode ser usado somente para um aplicativo espec&iacute;fico no seu Synology NAS.</li>
<li>Se o nome de dom&iacute;nio n&atilde;o exceder 15 caracteres e respeitar as <a href="https://support.microsoft.com/kb/909264" target="_blank">conven&ccedil;&otilde;es de nomenclatura do NetBIOS</a> (por exemplo, MyDSM), ele ser&aacute; registrado e transmitido pelo sistema automaticamente. Usu&aacute;rios do Windows podem acessar a &aacute;rea de trabalho do DSM na mesma rede local com uma URL semelhante: <code>http://MyDSM</code> ou <code>https://MyDSM</code></li>
<li>Ao acessar aplicativos com URLs que usam nomes de dom&iacute;nio, voc&ecirc; passar&aacute; pela porta HTTP padr&atilde;o (80) ou pela porta HTTPS padr&atilde;o (443).</li>
</ul>

</div>

</body>
</html>

