<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Protokoll-Center</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Protokolle</h2>
<p>Auf der Seite <strong>Protokoll-Center</strong> &gt; <strong>Protokolle</strong> k&ouml;nnen Protokolle angezeigt, gesucht und exportiert werden. </p>

<h4>So werden Protokolle gesucht:</h4>

<ol>
<li>Im Suche-Dropdown-Men&uuml; k&ouml;nnen Sie die folgenden Kriterien abh&auml;ngig von der Situation angeben:
  <ul>
  <li><b>Schl&uuml;sselwort</b>: Geben Sie ein Schl&uuml;sselwort ein, um Protokollmeldungen zu suchen, die das entsprechende Schl&uuml;sselwort enthalten.
  	<div class="section">
    <h4>Hinweis:</h4>
    <p>Sie k&ouml;nnen die folgenden Wildcard-Zeichen und Operatoren f&uuml;r die erweiterte Suche verwenden:</p>
    <ul>
      <li>[<span class="note_head">*</span>]: Die Wildcard steht f&uuml;r Null oder weitere Zeichen au&szlig;er Leerzeichen. [a*n] kann beispielsweise f&uuml;r jedes Wort stehen, das mit [a] anf&auml;nft und mit [n] endet, wie [<span class="note_head">a</span>ctio<span class="note_head">n</span>], [<span class="note_head">a</span>ttentio<span class="note_head">n</span>] oder [<span class="note_head">an</span>].</li>
      <li>[<span class="note_head">?</span>]: Die Wildcard steht genau ein Zeichen au&szlig;er Leerzeichen. [ca?] kann f&uuml;r jedes Wort stehen, das mit [ca] beginnt und nur mit einem Zeichen endet, wie [<span class="note_head">ca</span>r], [<span class="note_head">ca</span>t] oder [<span class="note_head">ca</span>p].</li>
      <li>[<span class="note_head">AND</span>]: Der Operator zeigt die Ergebnisse, die alle Suchbegriffe enthalten. Beispiel: [admin AND root] zeigt Ergebnisse, die sowohl [admin] als auch [root] enthalten.</li>
      <li>[<span class="note_head">OR</span>]: Der Operator zeigt die Ergebnisse, die einen der Suchbegriffe enthalten. [admin OR root] zeigt Ergebnisse, die entweder [admin] oder [root] enthalten.</li>
      <li>[<span class="note_head">NOT</span>]: Der Operator schlie&szlig;t Worte aus Ihrer Suche aus. [NOT admin] zeigt beispielsweise Ergebnisse, die [admin] ausschlie&szlig;en.</li>
      <li>[<span class="note_head">()</span>]: Klammern umschlie&szlig;en Suchbegriffe, um die Reihenfolge festzulegen, in der sie interpretiert werden, wenn sowohl AND als auch OR verwendet werden. [(admin OR root) AND NOT logged] zeigt Ergebnisse, die [admin] oder [root] enthalten, dann wird [logged] ausgeschlossen.  </li>
  </ul>
    </div>
  </li>
  <li><strong>Datumsbereich: </strong>Sucht nach Protokollen nach dem angegebenen Datumsbereich.
  <li><b>Stufe</b>: Suchen Sie Protokolle nach der angegebenen Stufe.</li>
  <li><b>Hostname</b>: Suchen Sie Protokolle nach dem angegebenen Hostnamen.</li>
  <li><b>Programm</b>: Suchen Sie Protokolle nach dem angegebenen Programmnamen.</li>
  <li><b>Kategorie</b>: Suchen Sie Protokolle nach der angegebenen Programmkategorie.</li>
  </ul>
<li>Klicken Sie auf<strong> Suche</strong>, um Protokolle zu suchen, die den angegebenen Kriterien entsprechen.</li>
</ol>

<h4>Protokolle exportieren:</h4>

<ol>
<li>Klicken Sie auf den Pfeil neben der Schaltfl&auml;che<strong> Exportieren</strong>.</li>
<li>W&auml;hlen Sie<strong> HTML</strong> oder <strong>CSV</strong>, um die Protokolle im gew&uuml;nschten Format herunterzuladen.</li>
</ol>

<div class="section">
<h4>Hinweis:</h4>
<ul>
<li>Die Zeichenverschl&uuml;selung exportierter CSV-Protokolldateien ist UTF-8. Sie m&uuml;ssen die Datei mit einem Programm &ouml;ffnen, das die UTF-8-Zeichenverschl&uuml;sselung unterst&uuml;tzt. </li>
</ul>
</div>

</body></html>
