<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Automatisk blokering - Synology DSM - Hj&aelig;lp</title> 
<meta name="author" content="Synology Inc.">
<meta name="description" content="The auto block feature helps improve the security of your Synology NAS by blocking the IP addresses of clients with too many failed login attempts.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Automatisk blokering</h2>

<p>Den automatisk blokeringsfunktion forbedrer sikkerheden i din Synology NAS ved at blokere IP-adresser for klienter med for mange fejlede p&aring;logningsfors&oslash;g. Det hj&aelig;lper med at reducere risikoen for, at der brydes ind p&aring; kontoen med voldelige angreb.</p>

<p>Du kan ogs&aring; oprette og administrere en tilladelsesliste for at tilf&oslash;je IP-adresser, som du har tillid til, eller en blokeringsliste for altid at forhindre visse IP-adresser i at logge ind.</p>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>Forskellige tjenester og pakker underst&oslash;tter automatisk blokering, f.eks. f&oslash;lgende: DSM, SSH, Telnet, rsync, netv&aelig;rksbackup, synkroisering af delt mappe, FTP, WebDAV, File Station, Photo Station, Audio Station, Video Station, Download Station, Mail Server, Mail Station, Time Backup, VPN Server, Cloud Station og Synologys mobile apps.</li>
</ul>
</div>

<h4>S&aring;dan aktiveres automatisk blokering:</h4>
<ol>
	<li>&Aring;bn <strong>Kontrolpanel</strong>, og g&aring; til <strong>Sikkerhed</strong> &gt; <strong>Automatisk blokering</strong>.</li>
	<li>Marker <strong>Aktiver automatisk blokering</strong>.</li>
	<li>Indtast et antal mislykkedes p&aring;logningsfors&oslash;g i feltet <strong>Login-fors&oslash;g</strong> og et antal min. i feltet <strong>Inden for (minutter)</strong>. En IP-adresse skal blokeres, n&aring;r den overstiger antal mislykkede login-fors&oslash;g inden for det angivne antal minutter.</li>
	<li>Marker <strong>Aktiver blokeringsudl&oslash;b</strong>, og indtast et tal, der vil fjerne en blokeret IP-adresse efter det angivne antal dage.</li>
	<li>Klik p&aring; <strong>Anvend</strong> for at gemme indstillingerne.</li>
</ol>


<h3>Administration af blokeringsliste</h3>
<p>Klik p&aring; <strong>Tilladelses-/blokeringsliste</strong>, og g&aring; til fanen <strong>Blokeringsliste</strong>. </p>

<h4>S&aring;dan tilf&oslash;jer du IP-adresser:</h4>
<p>V&aelig;lg en af f&oslash;lgende i rullemenuen <strong>Opret</strong>:</p>

<ul>
	<li><strong>Tilf&oslash;j IP-adresse</strong>: Indtast en IP-adresse, og angive udl&oslash;bstiden.</li>
	<li><strong>Importer IP-adresseliste</strong>: Importer en tekstfil, der viser IP-adresser for at tilf&oslash;je et antal IP-adresse og angive udl&oslash;bsdato p&aring; samme tid. Marker afkrydsningsfeltet, hvis du vil overskrive eksisterende IP-adresser. Hvis denne mulighed ikke er valgt, bliver kopierede IP-adresser sprunget over.<br /> Hvis den valgte fil har korrekt format, vil du se alle IP-adresserne i forh&aring;ndsvisningsomr&aring;det. Klik p&aring; <strong>OK</strong> for at importere.</li>
</ul>

<div class="section"><h4>Bem&aelig;rk:</h4>
<p>For at importere en fil skal filen opfylde f&oslash;lgende kriterier:</p>
<ul>
	<li>Filen skal v&aelig;re en almindelig tekstfil.</li>
	<li>Hver linje i filen kan kun indeholde &eacute;n IP-adresse.</li>
	<li>Kommentarlinjer begynder med et # (pundtegn).</li>
</ul>
</div>

<h4>S&aring;dan fjerner du blokerede IP-adresser:</h4>
<p>V&aelig;lg de IP-adresser, du vil fjerne fra listen, og klik p&aring; <strong>Fjern</strong>.</p>


<h3>Administration af tilladelsesliste</h3>

<p>Klik p&aring; <strong>Tilladelses-/blokeringsliste</strong>, og g&aring; til fanen <strong>Tilladelsesliste</strong>.</p>

<h4>S&aring;dan tilf&oslash;jer du IP-adresser:</h4>
<p>V&aelig;lg en af f&oslash;lgende i rullemenuen <strong>Opret</strong>:</p>
<ul>
	<li><strong>Tilf&oslash;j IP-adresse</strong>: Indtast en IP-adresse, et IP-interval, undernet eller dom&aelig;nenavn.</li>
	<li><strong>Importer IP-adresseliste</strong>: Importer en tekstfil, der viser IP-adresser for at tilf&oslash;je et antal IP-adresse p&aring; samme tid. Marker afkrydsningsfeltet, hvis du vil overskrive eksisterende IP-adresser. Hvis denne mulighed ikke er valgt, bliver kopierede IP-adresser sprunget over.<br /> Hvis den valgte fil har korrekt format, vil du se alle IP-adresserne i forh&aring;ndsvisningsomr&aring;det. Klik p&aring; <strong>OK</strong> for at importere.</li>
</ul>

<div class="section"><h4>Bem&aelig;rk:</h4>
<p>For at importere en fil skal filen opfylde f&oslash;lgende kriterier:</p>
<ul>
<li>Filen skal v&aelig;re en almindelig tekstfil.</li>
<li>Hver linje kan kun indeholde enten en IP-adresse, et IP-interval (<em>192.168.1.1 - 192.168.1.10</em>), et undernet (<em>192.168.1.1/255.255.0.0</em>) eller et dom&aelig;nenavn (<em>www.synology.com</em>).</li>
<li>Kommentarlinjer begynder med et # (pundtegn).</li>
</ul>
</div>

<h4>S&aring;dan fjerner du IP-adresser:</h4>
<p>V&aelig;lg de IP-adresser, du vil fjerne fra listen, og klik p&aring; <strong>Fjern</strong>.</p>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>Hvis din Synology NAS-enhed ligger bag en omvendt proxy-server, skal du tilf&oslash;je IP-adressen p&aring; den omvendte proxy-server til tilladelseslisten.</li>
</ul>
</div>

</body>
</html>
