<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>DSM-indstillinger</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="https"></a>DSM-indstillinger</h2>

<p>Under <strong>Kontrolpanel</strong> &gt; <strong>Netv&aelig;rk</strong> &gt; <strong>DSM-indstillinger</strong> kan du &aelig;ndre det portnummer, som klienterne bruger til at f&aring; adgang til din Synology NAS.</p>

<h4>S&aring;dan &aelig;ndrer du standardportnummeret:</h4>
<p>B&aring;de HTTP- og HTTPS-forbindelser er altid aktiverede i DSM. Standard HTTP-porten er 5000 og standard HTTPS-porten er 5001.</p>
<ol>
<li>Indtast portnummeret i feltet <b>HTTP</b> eller <b>HTTPS</b>.</li>
<li>Klik p&aring; <b>Anvend</b>.</li>
</ol>

<h4>S&aring;dan omdirigerer du HTTP- til HTTPS-forbindelser:</h4>
<p>Du kan omdirigere klienter til HTTPS-porten, n&aring;r de fors&oslash;ger at f&aring; adgang til din Synology NAS via HTTP-porten.</p>
<ol>
<li>V&aelig;lg <b>Omdiriger automatisk HTTP-forbindelser til HTTPS (bortset fra Web Station og Photo Station)</b>.</li>
<li>
Klik p&aring; <b>Anvend</b>.
</li>
</ol>

<div class="section">
<h4>Porte, der bruges til HTTPS-forbindelse:</h4>
<ul>
  <li><b>DSM</b>: Standardportnummeret er 5001, s&aring; du sikkert kan f&aring; adgang til DSM ved at indtaste f&oslash;lgende adresse: https://server-hostname:5001/</li>
<li><b>Web Station og Photo Station</b>: Standardportnummeret er 443, s&aring; du sikkert kan f&aring; adgang til Web Station og Photo Station ved at indtaste f&oslash;lgende adresse: https://server-hostname/</li>
</ul>

</div>

<h4>S&aring;dan aktiverer du HTTP/2:</h4>
<p>Du kan &oslash;ge hastigheden i HTTPS-forbindelser ved at aktivere HTTP/2.</p>
<ol>
<li>Marker <b>Aktiver HTTP/2</b>.</li>
<li>Klik p&aring; <b>Anvend</b>.</li>
</ol>

<div class="enable-x64 enable-bromolow enable-cedarview enable-avoton enable-grantley enable-broadwell enable-dockerx64 enable-braswell">

<h4>S&aring;dan tilpasser du det maksimale antal samtidige HTTP-forbindelser:</h4>
<p>Du kan aktivere <strong>Tilpas maks. samtidige HTTP-forbindelser</strong> for at for&oslash;ge HTTP-forbindelser p&aring; din Synology NAS.</p>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Jo h&oslash;jere det maksimale antal samtidige HTTP-forbindelser, jo mere systemhukommelse kr&aelig;ves der.</li>
</ul>
</div>
</div>

<h4>S&aring;dan tilpasser du &quot;Server&quot;-hovedet i HTTP-svar:</h4>
<ol>
<li>Marker <b>Aktiver &quot;Server&quot;-hovedet i HTTP-svar</b>.</li>
<li>Angiv et hoved til din webserver (f.eks. nginx).</li>
<li>Klik p&aring; <b>Anvend</b>.</li>
</ol>
<p>Du kan deaktivere &quot;Server&quot;-hovedet ved at afmarkere afkrydsningsfeltet.</p>

<h2>Dom&aelig;ne</h2>
<p>Under <strong>Dom&aelig;ne</strong> kan du angive et tilpasset dom&aelig;nenavn til adgang til Synology NAS.
</p>
<h4>S&aring;dan aktiverer du tilpasset dom&aelig;ne:</h4>
<ol>
<li>
Marker <b>Aktiver tilpasset dom&aelig;ne</b>.
</li>
<li>
Angiv et ans&oslash;gt dom&aelig;nenavn til din Synology NAS.
</li>
<li>
Du kan ogs&aring; markere <b>Aktiver HSTS</b> for at gennemtvinge HTTPS-krypterede forbindelser p&aring; dette dom&aelig;ne.
</li>
<li>
Klik p&aring; <b>Anvend</b>.
</li>
</ol>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Hvert dom&aelig;nenavn kan kun bruges til &eacute;t s&aelig;rskilt program p&aring; din Synology NAS.</li>
<li>Hvis dom&aelig;nenavnet ikke overstiger 15 tegn og overholder <a href="https://support.microsoft.com/kb/909264" target="_blank">Navngivningskonventionerne for NetBIOS</a>, vil systemet registrere og udsende dom&aelig;nenavnet (f.eks. MyDSM) automatisk. Windows-brugere kan f&aring; adgang til DSM-skrivebordet p&aring; det samme netv&aelig;rk med en lignende URL: <code>http://MyDSM</code> or <code>https://MyDSM</code></li>
<li>N&aring;r du f&aring;r adgang til programmer via URL'er, der bruger dom&aelig;nenavne, skal du g&aring; gennem standard HTTP-porten (80) eller standard HTTPS-porten (443).</li>
</ul>

</div>

</body>
</html>

