<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="wireless_ap"></a>Hotspot*</h2>

<p>Din Synology NAS-enhed underst&oslash;tter oprettelse af et hotspot til at dele internetforbindelsen tr&aring;dl&oslash;st med andre enheder, hvis du har installeret en USB Wi-Fi-adapter eller din Synology NAS har indbygget Wi-Fi. Du kan indstille din Synology NAS til at v&aelig;re et tr&aring;dl&oslash;st adgangspunkt (AP) eller tr&aring;dl&oslash;s router, afh&aelig;ngigt af hvordan du vil bruge internettet.</p>

<table>
	<tr>
		<th width="23%">Hotspot-tilstand</th>
		<th width="77%">Beskrivelse</th>
	</tr>
	<tr>
		<th>Tr&aring;dl&oslash;st AP</th>
		<td>
			<ul>
				<li>Bygger bro fra dit LAN til dit Wi-Fi-netv&aelig;rk.</li>
				<li>B&aring;de LAN og tr&aring;dl&oslash;se klienter skal v&aelig;re p&aring; samme lokalnetv&aelig;rk.</li>
				<li>G&aelig;lder, n&aring;r du allerede har en router og vil bruge din Synology NAS som yderligere adgangspunkt p&aring; et eksisterende netv&aelig;rk.</li> 
				<li>Tillader deling af netv&aelig;rksressourcer, f.eks. DLNA-enheder, <span class="disable-grantley">printere</span>, Synology Web Assistant eller andre tjenester, der skal bruge netv&aelig;rksudsendelser.</li>
				<li>DHCP Server bliver deaktiveret p&aring; Synology NAS-enheder, som fungerer som tr&aring;dl&oslash;se AP'er. Genaktiver DHCP-serveren til din Synology NAS, fjern Wi-Fi-dongles, og genstart Synology NAS.</li>
				<li>For modeller med flere LAN-porte bruges kun LAN 1 til at bygge bro med det tr&aring;dl&oslash;se AP.</li>
			</ul>
		</td>
	</tr>
	<tr>
		<th>Tr&aring;dl&oslash;s router</th>
		<td>
			<ul>
				<li>Konfigurerer et tr&aring;dl&oslash;st netv&aelig;rk, hvor enheder er p&aring; et privat undernet.</li>
			</ul>
		</td>
	</tr>
</table>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ol>
	<li>Nogle modeller kr&aelig;ver tilslutning af tr&aring;dl&oslash;se dongles for at oprette hotspots. En komplet liste over underst&oslash;ttede tr&aring;dl&oslash;se dongles findes p&aring; <a href="https://www.synology.com/compatibility?search_by=category&category=usb_wifi_dongles&p=1&filter_ap_mode=yes&not_recommend_mode=false" target=_blank>www.synology.com</a>.</li>
	<li>For ikke-DS213air-modeller er den tr&aring;dl&oslash;se hotspot-mulighed i DSM 4.3 omd&oslash;bt til &quot;Tr&aring;dl&oslash;s router&quot; i DSM 5.0 og senere.</li>
</ol>
</div>

<h3>Administration af indstillinger for hotspot</h3>
<p>Dette afsnit forklarer, hvordan du aktiverer og administrerer indstillinger for din Synology NAS.</p>

<h4>S&aring;dan g&oslash;r du din Synology NAS til et hotspot:</h4>
<ol>
	<li>G&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Tr&aring;dl&oslash;s</strong> &gt; <strong>Netv&aelig;rkstilknytning</strong>. V&aelig;lg <strong>Tr&aring;dl&oslash;st AP</strong> eller <strong>Tr&aring;dl&oslash;s router</strong>.</li>
	<li>G&aring; til fanen <strong>Wi-Fi</strong> og klik p&aring; <strong>Rediger</strong> for at administrere f&oslash;lgende indstillinger:
		<ul>
			<li><strong>Navn (SSID):</strong> Indtast et navn p&aring; det tr&aring;dl&oslash;se netv&aelig;rk.</li>
			<li><strong>Vis/skjul:</strong> V&aelig;lg, om det tr&aring;dl&oslash;se netv&aelig;rk er synligt for andre enheder eller ej.</li>
			<li><strong>Tr&aring;dl&oslash;s tilstand:</strong> V&aelig;lg en tr&aring;dl&oslash;s standard. Hver standard underst&oslash;tter forskellige b&aring;ndbredder og frekvenser.</li>
			<li><strong>Kanalbredde:</strong> V&aelig;lg en kanalbredde (kun tilg&aelig;ngelig ved brug af 802.11n tr&aring;dl&oslash;s tilstand).</li>
			<li><strong>Kanal:</strong> V&aelig;lg a frekvens til et tr&aring;dl&oslash;se netv&aelig;rk. F&aring; bedre ydelse ved at v&aelig;lge en frekvens, der er forskellig fra dem, der bruges af netv&aelig;rk i n&aelig;rheden.</li>
			<li><strong>Overf&oslash;rselskraft:</strong> V&aelig;lg en signalstyrke til det tr&aring;dl&oslash;se netv&aelig;rk.</li>
			<li><strong>Maks. antal forbindelser:</strong> V&aelig;lg, hvor mange klientenheder, der kan tilsluttes til netv&aelig;rket. Den h&oslash;jeste forbindelsesindstilling er 256.</li>
			<li><strong>Aktiver WMM QoS:</strong> Wi-Fi-multimedier (WMM) QoS (Tjenestekvalitet) over Wi-Fi. Denne mulighed s&aelig;tter det tr&aring;dl&oslash;se netv&aelig;rk i stand til at prioritere trafik og optimere, hvordan ressourcer deles blandt programmer.</li>
		</ul>
	</li>
</ol>

<h4>S&aring;dan konfigurer du en tr&aring;dl&oslash;s plan:*</h4>
<p>Aktivering af en tr&aring;dl&oslash;s netv&aelig;rksplan s&aelig;tter dig i stand til at kontrollere, hvorn&aring;r det tr&aring;dl&oslash;se netv&aelig;rk p&aring; din Synology NAS er aktivt og &aring;bent.</p>
<ol>
	<li>G&aring; til fanen <strong>Wi-Fi</strong>, og klik p&aring; <strong>Rediger direkte visning</strong>.</li>
	<li>Marker feltet <strong>Aktiver plan</strong>.</li>
	<li>Klik p&aring; <strong>Angiv plan</strong>.</li>
	<li>P&aring; plansk&aelig;rmen v&aelig;lger du, hvorn&aring;r det tr&aring;dl&oslash;se netv&aelig;rk vil v&aelig;re aktivt.</li>
</ol>

<h3>Sikkerhedsindstillinger</h3>
<p><strong>Kontrolpanel</strong> &gt; <strong>Tr&aring;dl&oslash;s</strong> &gt; <strong>Wi-Fi</strong> indeholder valgmuligheder til redigering af sikkerhedsindstillinger for dit tr&aring;dl&oslash;se netv&aelig;rk.</p>

<h4>S&aring;dan konfigurerer du tr&aring;dl&oslash;s sikkerhed:</h4>
<ol>
	<li>Klik p&aring; <strong>Rediger</strong>.</li>
	<li>V&aelig;lg en af f&oslash;lgende sikkerhedsprotokoller fra rullemenuen <strong>Sikkerhedsindstillinger</strong>:
		<ul>
			<li><strong>WEP:</strong> En grundl&aelig;ggende sikkerhedsprotokol, der kr&aelig;ver, at brugere indtaster en adgangskode for at f&aring; adgang til det tr&aring;dl&oslash;se netv&aelig;rk, men giver minimal beskyttelse.</li>
			<li><strong>WPA/WPA2 Personlig:</strong> Anbefales. Kr&aelig;ver, at bruger indtaster en adgangskode for at f&aring; adgang til det tr&aring;dl&oslash;se netv&aelig;rk, og er mere sikker end WEP.</li>
			<li><strong>WPA/WPA2 Enterprise:</strong>* En sikkerhedsprotokol, der er designet til virksomheder, som kr&aelig;ver godkendelse af brugere med en ekstern godkendelsesserver.</li>
		</ul>
	</li>
</ol>

<h4>S&aring;dan aktiverer du Wi-Fi Protected Setup:*</h4>
<p>Wi-Fi Protected Setup (WPS) er en standard, der markedsf&oslash;res af Wi-Fi Alliance til forenkling af tr&aring;dl&oslash;se sikkerhedsindstillinger for brugere. Du kan bruge en trykknap eller en pinkode til at holde dit Wi-Fi-netv&aelig;rk sikkert. Klik p&aring; <strong>WPS</strong> for at aktivere Wi-Fi Protected Setup.</p>

<h3>G&aelig;stenetv&aelig;rk*</h3>
<p>Ud over at oprette et tr&aring;dl&oslash;st v&aelig;rtsnetv&aelig;rk underst&oslash;tter din Synology NAS ogs&aring; oprettelse af tr&aring;dl&oslash;st g&aelig;stenetv&aelig;rk. Indstillingerne for g&aelig;stenetv&aelig;rk kan begr&aelig;nses til at begr&aelig;nse brugeres adgang, som er nyttigt i virksomheder eller andre institutioner, hvor man vil yde tr&aring;dl&oslash;st netv&aelig;rk til bes&oslash;gende, men holde dem ude af v&aelig;rtsnetv&aelig;rket.</p>

<h4>S&aring;dan aktiverer du g&aelig;stenetv&aelig;rk:</h4>
<ol>
	<li>G&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Tr&aring;dl&oslash;s</strong> &gt; <strong>Wi-Fi</strong>.</li>
	<li>Klik p&aring; <strong>Rediger</strong> for at administrere f&oslash;lgende indstillinger p&aring; fanen <strong>G&aelig;stenetv&aelig;rk</strong> tab:
		<ul>
			<li><strong>Navn (SSID):</strong> Indtast et navn p&aring; det tr&aring;dl&oslash;se netv&aelig;rk.</li>
			<li><strong>Vis/skjul:</strong> V&aelig;lg, om det tr&aring;dl&oslash;se netv&aelig;rk er synligt for andre enheder eller ej.</li>
			<li><strong>Maks. antal forbindelser:</strong> V&aelig;lg, hvor mange klientenheder, der kan tilsluttes til netv&aelig;rket. Den h&oslash;jeste forbindelsesindstilling er 256.</li>
		</ul>
	</li>
</ol>

<h4>S&aring;dan konfigurerer du sikkerhed p&aring; g&aelig;stenetv&aelig;rk:</h4>
<p>V&aelig;lg en af f&oslash;lgende sikkerhedsprotokoller fra rullemenuen <strong>Sikkerhedsindstillinger</strong>:</p>
<ul>
	<li><strong>WEP:</strong> En grundl&aelig;ggende sikkerhedsprotokol, der kr&aelig;ver, at brugere indtaster en adgangskode for at f&aring; adgang til det tr&aring;dl&oslash;se netv&aelig;rk, men giver minimal beskyttelse.</li>
	<li><strong>WPA/WPA2 Personlig:</strong> Anbefales. Kr&aelig;ver, at bruger indtaster en adgangskode for at f&aring; adgang til det tr&aring;dl&oslash;se netv&aelig;rk, og er mere sikker end WEP.</li>
</ul>

<h4>S&aring;dan konfigurer du en plan til g&aelig;stenetv&aelig;rk:</h4>
<p>Aktivering af en g&aelig;stenetv&aelig;rksplan s&aelig;tter dig i stand til at kontrollere, hvorn&aring;r det tr&aring;dl&oslash;se g&aelig;stenetv&aelig;rk p&aring; din Synology NAS er aktivt og &aring;bent.</p>

<ol>
	<li>Marker feltet <strong>Aktiver plan for g&aelig;stenetv&aelig;rk</strong>.</li>
	<li>Klik p&aring; <strong>Angiv g&aelig;steplan</strong>.</li>
	<li>P&aring; plansk&aelig;rmen v&aelig;lger du, hvorn&aring;r det tr&aring;dl&oslash;se g&aelig;stenetv&aelig;rk vil v&aelig;re aktivt.</li>
</ol>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
<li>Denne funktion er kun tilg&aelig;ngelig p&aring; DS213air.</li>
<li>Det tr&aring;dl&oslash;se g&aelig;stenetv&aelig;rk kan ikke v&aelig;re aktivt i tidsperioder, hvor det tr&aring;dl&oslash;se v&aelig;rtsnetv&aelig;rk er deaktiveret.</li>
</ul>
</div>

<h3>MAC-filterindstilling*</h3>
<p>MAC-filterindstillinger (under <strong>Kontrolpanel</strong> &gt; <strong>Tr&aring;dl&oslash;s</strong>) angiver, hvilke MAC-adresser der giver adgang til det tr&aring;dl&oslash;se netv&aelig;rk, s&aring; du kan blokere eller give adgang til bestemte enheder. Denne funktion kontrollerer kun netv&aelig;rksadgang og ikke andre krypteringsindstillinger.</p>

<h4>S&aring;dan opretter du Mac-filterregler:</h4>
<ol>
	<li>Indtast beskrivelsen og MAC-adressen p&aring; en enhed.</li>
	<li>V&aelig;lg an adgangspolitik:
		<ul>
			<li><strong>Afvis:</strong> Begr&aelig;nser den angivne MAC-adresse fra at f&aring; adgang til det tr&aring;dl&oslash;se netv&aelig;rk.</li>
			<li><strong>Tillad:</strong> Tillader den angivne MAC-adresse til at f&aring; adgang til det tr&aring;dl&oslash;se netv&aelig;rk.</li>
		</ul> 
	</li>
</ol>

<h3>For&aelig;ldrekontrol*</h3>
<p>Funktionen For&aelig;ldrekontol s&aelig;tter dig i stand til at kontrollere, n&aring;r hver klientenhed, der er tilsluttet til Synology NASs lokale netv&aelig;rk kan f&aring; adgang til internettet. Hvis f.eks. dine b&oslash;rns computere eller mobilenheder opretter forbindelse til internettet via Synology NAS, kan du konfigurere indstillinger for for&aelig;ldrekontrol for at begr&aelig;nse deres internetbrug i overensstemmelse med bestemt enheder og tidspunkter.</p>

<h4>S&aring;dan aktiverer du For&aelig;ldrekontrol:</h4>
<ol>
	<li>G&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Tr&aring;dl&oslash;s</strong> &gt; <strong>Indstillinger for for&aelig;ldrekontrol</strong>.</li>
	<li>Klik p&aring; knappen <strong>Tilf&oslash;j</strong> for at tilf&oslash;je en klientenhed.
		<ul>
			<li><strong>Klientnavn:</strong> V&aelig;lg en enhed, der har forbindelse til Synology NAS, eller indtast et navn manuelt (f.eks. Louisas b&aelig;rbare).</li>
			<li><strong>MAC-adresse:</strong> Indtast MAC-adressen for den enhed, hvis internetbrug du vil kontrollere.</li>
			<li><strong>Angiv plan:</strong> V&aelig;lg det tidspunkt, den bestemt enhed har tilladelse til at f&aring; adgang til internettet via Synology NAS.</li>
		</ul>
	</li>
</ol>

<h3>Forbindelsesliste*</h3>
<p>Forbindelseslisten (under <strong>Kontrolpanel</strong> &gt; <strong>Tr&aring;dl&oslash;s</strong>) viser oplysninger om enheder, der har forbindelse til Synology NAS. Enheder kan tilf&oslash;jes direkte til MAC-filterlisten herfra.</p>

<h4>S&aring;dan tilf&oslash;je du enheder til MAC-filterlisten:</h4>
<ol>
	<li>Marker feltet ved siden af den enhed, som du vil tilf&oslash;je til MAC-filteret.</li>
	<li>Klik p&aring; <strong>Tilf&oslash;j til MAC-filterlisten</strong>.</li>
</ol>

<p>____<br />* Findes kun p&aring; bestemte modeller. </p>

</body>
</html>