<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Tjenesteopdagelse</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>




<h2>Tjenesteopdagelse</h2>

<p>Tjenesteopdagelse s&aelig;tter brugere i stand til at finde denne Synology NAS p&aring; netv&aelig;rket via SSDP (Simple Service Discovery Protocol) og Bonjour-tjenester.</p>


<h4>S&aring;dan g&oslash;r du Synology NAS registrerbar via SSDP:</h4>

<p>SSDP-tjenesten s&aelig;tter brugere i stand til at finde Synology NAS via Windows-netv&aelig;rksopdagelse</p>

<ol>
	<li>G&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Filtjenester</strong> &gt; <strong>Tjenesteopdagelse</strong> &gt; <strong>SSDP</strong>.</li>
    <li>V&aelig;lg <strong>Aktiver Windows netv&aelig;rksregistrering</strong>.</li>
    <li>Klik p&aring; <strong>Anvend</strong> for at gemme indstillingerne.</li>
</ol>



<h4>S&aring;dan g&oslash;r du Synology NAS registrerbar via Bonjour-tjeneste:</h4>

<p>Bonjour-tjenesten s&aelig;tter brugere i stand til at finde Synology NAS og udf&oslash;re udskrivnings- og backupogaver fra Mac-computeren.</p>

<ol>
	<li>G&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Filtjenester</strong> &gt; <strong>Tjenesteopdagelse</strong> &gt; <strong>Bonjour</strong>.</li>
    <li>V&aelig;lg <strong>Aktiver Bonjour-tjenesteopdagelse</strong>.</li>
    <li>Du kan v&aelig;lge Bonjour-relaterede valgmuligheder, der passer til dine behov.
    	<ul>
        <li><strong>Aktiver Bonjour-printerudsendelse</strong>: V&aelig;lg ikke at tillade for Mac-computere at s&oslash;ge efter USB-printer, der er tilsluttet til din Synology NAS til dokumentudskrivning.</li>
        <li><strong>Aktiver Bonjour Time Machine-udsendelse via SMB</strong>: V&aelig;lg at tillade Mac Time Machine at finde din Synology NAS og udf&oslash;re backup p&aring; filer til DSM-delte mapper via SMB.</li>
        <li><strong>Aktiver Bonjour Time Machine-udsendelse via AFP</strong>: V&aelig;lg at tillade Mac Time Machine at finde din Synology NAS og udf&oslash;re backup p&aring; filer til DSM-delte mapper via AFP.</li>
        </ul>
    
    </li>
    <li>Hvis du har markeret en valgmulighed for Time Machine, skal du klikke p&aring; <strong>Angiv Time Machine-mapper</strong> for at angive destinationsmapper til Time Machine-backups.</li>

<li>Klik p&aring; <strong>Anvend</strong> for at gemme indstillingerne.</li>
</ol>


<div class="section">
<h4>Bem&aelig;rk:</h4>

<ul>
	<li>Hvis du deaktivere SMB/AFP-tjenesten (under <strong>Kontrolpanel</strong> &gt; <strong>Filtjenester</strong> &gt; <strong>SMB/AFP/NFS</strong>), bliver den tilknyttede Bonjour-valgmulighed automatisk deaktiveret.</li>
	<li>N&aring;r <strong>Aktiver Bonjour Time Machine-udsendelse via SMB</strong> er markeret, bliver f&oslash;lgende valgmuligheder aktiverede (under <strong>Kontrolpanel</strong> &gt; <strong>Filtjenester</strong> &gt; <strong>SMB/AFP/NFS</strong> &gt; <strong>Avancerede indstillinger</strong>):
    	<ul>
        <li><strong>Aktiver SMB 3</strong> (for <strong>Maks. protokol til Windows-filservice</strong>)</li>
        <li><strong>Opportunistic Locking</strong></li>
        <li><strong>Aktiver SMB2-leje</strong></li>
        <li><strong>Aktiver SMB permanente handles (fill&aring;sning p&aring; tv&aelig;rs af protokol deaktiveres</strong>)</li>
      </ul>
    
    </li>
</ul>
</div>

</body>
</html>