<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Opret en delt mappe - Synology DSM - Hj&aelig;lp</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Shared folders are the basic directories where you can store and manage files and folders on your Synology NAS. This article shows you how to create a shared folder.">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Opret en delt mappe</h2>
<p>Delte mapper er de grundl&aelig;ggende biblioteker, hvor du kan gemme og administrere filer og mapper p&aring; din Synology NAS. F&oslash;r du lagrer nogen filer, skal du oprette mindst &eacute;n delt mappe i DSM. </p>

<h4>S&aring;dan opretter du en delt mappe:</h4>
<ol>
	<li>G&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Delt mappe</strong>, og klik p&aring; <strong>Opret</strong>.<br /><img src="about:blank" class="help_image"/></li>
	<li>Angiv et navn og en beskrivelse p&aring; den delte mappe.<br /><img src="about:blank" class="help_image disable-bromolow disable-grantley disable-avoton disable-braswell disable-broadwell disable-kvmx64 disable-cedarview disable-apollolake disable-denverton"/><img src="about:blank" class="help_image enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"/></li>
	<li>V&aelig;lg er lager, hvorp&aring; du vil oprette den delte mappe (spring denne mulighed over, hvis der kun er &eacute;t lager).<br /><img src="about:blank" class="help_image disable-bromolow disable-grantley disable-avoton disable-braswell disable-broadwell disable-kvmx64 disable-cedarview disable-apollolake disable-denverton"/><img src="about:blank" class="help_image enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"/></li>
	<li>Ret f&oslash;lgende valgmuligheder efter behov:<br /><img src="about:blank" class="help_image disable-bromolow disable-grantley disable-avoton disable-braswell disable-broadwell disable-kvmx64 disable-cedarview disable-apollolake disable-denverton"/><img src="about:blank" class="help_image enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"/>
		<ul>
			<li><strong>Skjul denne delte mappe in &quot;Mine netv&aelig;rkssteder&quot;:</strong> Holder den delte mappe fra at blive vist under &ldquo;Netv&aelig;rk&rdquo; i Windows Stifinder. Denne mulighed p&aring;virker ikke adgangsprivilegier for den delte mappe.
				<div class="section"><h4>Bem&aelig;rk:</h4>
				<ul>
				<li>Skjulning af en delt mappe i &quot;Netv&aelig;rkssteder&quot; p&aring;virker ikke dens adgangsrettigheder. Adgangsrettigheden for den skjulte delte mappe forbliver uforandret. Brugere, der har korrekte adgangsrettigheder til den delte mappe, kan stadig f&aring; adgang til den ved at angive &quot;\\server name\shared folder name&quot;.</li>
				</ul>
				</div>
			</li>
			<li><strong>Skjul undermapper og filer fra brugere uden tilladelser:</strong> N&aring;r <strong>Skjul undermapper og filer fra brugere uden tilladelser</strong> er aktiveret, og en bruger uden l&aelig;seprivilegier fors&oslash;ger at &aring;bne en delt mappe via protokollen Windows Fildeling, kan brugeren ikke se undermapper eller filer i den delte mappe. Dette forhindrer brugere i at blive forvirrede, n&aring;r de opretter forbindelse til Synology-produktet, men finder et st&oslash;rre antal filer og undermapper, end de ikke kan &aring;bne.
				<div class="section"><h4>Bem&aelig;rk:</h4>
				<ul>
					<li>Denne funktion underst&oslash;ttes kun via protokollen Windows Fildeling.</li>
					<li>Du kan &aelig;ndre privilegieindstillinger til hver mappe og fil i File Station ved at h&oslash;jreklikke p&aring; den. V&aelig;lg <strong>Egenskaber</strong> fra rullemenuen, og klik p&aring; fanen <strong>Tilladelse</strong>.</li>
					<li>Den delte mappe skjules ikke fra brugere uden tilladelser ved at aktivere <strong>Skjul undermapper og filer fra brugere uden tilladelser</strong>. Kun undermapper og filer i denne delte mappe bliver skjult.</li>
				</ul>
				</div>
			</li>
		</ul>
	</li>
	<li><strong>Aktiver Papirkurv:</strong> N&aring;r filer i den delte mappe slettes, bliver de flyttet til en mappe med navnet <strong>#recycle</strong>. Adgang til papirkurven kan begr&aelig;nses til bruger, der h&oslash;rer til gruppen <strong>administrators</strong>.</li>
	<a name="sharequota"></a><li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><strong>Aktiver delt mappekvote:</strong> Hvis du vil angive den maksimale kapacitet for hver delt mappe, skal du markere afkrydsningsfeltet <strong>Aktiver delt mappekvote</strong> og indtaste den maksimale kapacitet (f.eks. 10 GB) i f&oslash;lgende felt.
		<div class="section"><h4>Bem&aelig;rk:</h4>
		<ul>
			<li>Kun n&aring;r lageret bruger Btrfs-filsystemet, vil valgmuligheden <strong>Aktiver delt mappekvote</strong> v&aelig;re tilg&aelig;ngelige for delte mapper.</li>
			<li>Det kombinerede lagerforbrug for alle brugeres <strong>home</strong>-biblioteker kan ikke overstige kvoten for &quot;<strong>homes</strong>&quot;.</li>
		</ul>
		</div>
	</li>
	<a name="integrity_protection"></a><li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><strong>Aktiver avanceret dataintegritetsbeskyttelse:</strong> Beskyt en delt mappe med strategierne <strong>CRC32-kontrolsum</strong> og <strong>kopier-ved-skrivning</strong>, s&aring; du kan <strong>aktivere avanceret dataintegritetsbeskyttelse</strong> under oprettelse af den delte mappe. CRC32-kontrolsum anvendes til at kontrollere, om data forbliver identiske til det tidspunkt, hvor de oprindeligt blev skrevet, og brugeren bliver underrettet, n&aring;r der registreres skader. Kopier-ved-skrivning hj&aelig;lper med at forbedre datakonsekvens ved unormal systemnedlukning.
		<div class="section"><h4>Bem&aelig;rk:</h4>
		<ul>
			<li>Denne mulighed er kun tilg&aelig;ngelig for de diskenheder, der bruger Btrfs-filsystemet.</li>
			<li>Du kan aktivere/deaktivere denne mulighed for hver delt mappe under oprettelsen. Denne valgmulighed kan ikke &aelig;ndres, &aring;r den delte mappe er oprettet.</li>
			<li>Hvis filer, som databaser, hele tiden redigeres og opdateres, kan m&aelig;ngden af defragmenterede filer stige af den grund. Det anbefales, at du deaktiverer denne valgmulighed for at forbedre ydeevnen.</li>
		</ul>
		</div>
	</li>
    <a name="btrfs_compression"></a><li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><strong>Aktiver filkomprimering</strong>: Data i den oprettede delte mappe bliver automatisk komprimeret af Btrf-filsystemet til at spare p&aring; lagerpladsen. N&aring;r de hentes til brug, bliver data automatisk dekomprimeret.
		<div class="section"><h4>Bem&aelig;rk:</h4>
		<ul>
			<li>Denne valgmulighed er kun tilg&aelig;ngelig, n&aring;r du opretter en delt mappe p&aring; en Btrfs-diskenhed, eller n&aring;r <strong>Avanceret beskyttelse af dataintegritet</strong> er aktiveret.</li>
			<li>Denne valgmulighed kan ikke &aelig;ndres, &aring;r den delte mappe er oprettet.</li>
			<li>Komprimeringsraten er forskellig efter datatype: Tekstfiler har h&oslash;jere komprimeringsrate, mens multimediefiler (f.eks. billeder, musik og videoer) ikke bliver lige s&aring; komprimerede, da de allerede er komprimeret til output.</li>
            <li>Denne valgmulighed kan ikke aktiveres, hvis kryptering af delt mappe aktiveres.</li>
		</ul>
		</div>
	</li>
	<li><strong>Krypter denne delte mappe:</strong> S&aring;dan g&oslash;r du for at kryptere den delte mappe:
		<ol>
			<li>Angiv og bekr&aelig;ft en ny krypteringsn&oslash;gle. Krypteringsn&oslash;glen kan ikke indeholder kommaer (,) eller lig med (=), </li>
			<li>Marker feltet <strong>Tilf&oslash;j krypteringsn&oslash;gle til N&oslash;glestyring</strong> efter behov for at tilslutte den krypterede mappe automatisk, n&aring;r systemet starter. Hvis denne mulighed er deaktiveret, vil den krypterede mappe bliver fraknyttet n&aelig;ste gang Synology NAS genstarter. Vis eller f&aring; adgang til en ikke-tilsluttet delt mappe ved at tilslutte mappen manuelt ved at importere eller indtaste krypteringsn&oslash;glen.</li>
		</ol>
	</li>
	<li>Klik p&aring; <strong>OK</strong> for at afslutte.</li>
</ol>

<div class="section"><h4>Navngivningsregler for delt mappe</h4>
<ul>
	<li>Delte mappenavne skelner mellem store og sm&aring; bogstaver og kan indeholder 1 og 32 tegn. Navnene kan ikke inkludere f&oslash;lgende tegn:&nbsp;<strong>! &quot; # $ % &amp; ' ( ) * + , / : ; &lt;= &gt; ? @ [ ] \ ^ ` { } | ~</strong></li>
	<li>F&oslash;lgende navne er forbeholdt systembrug:&nbsp;<strong>.</strong>,&nbsp;<strong>..</strong>,&nbsp;<strong>global</strong>,&nbsp;<strong>home</strong>,&nbsp;<strong>homes</strong>,&nbsp;<strong>printers</strong>,&nbsp;<strong>public</strong>,&nbsp;<strong>satashare</strong>,&nbsp;<strong>surveillance</strong>,&nbsp;<strong>usbbackup</strong>,&nbsp;<strong>usbshare</strong>. </li>
	<li>Det f&oslash;rste tegn i en delt mappe kan ikke v&aelig;re minus eller mellemrum, og det sidste tegn kan ikke v&aelig;re et mellemrum.</li>
	<li>Den delte mappe <strong>Beskrivelse</strong> skelner mellem store og sm&aring; bogstaver og er begr&aelig;nset til 64 visbare Unicode-tegn.</li>
</ul>
</div>


<div class="section"><h4>Kryptering af delte mapper:</h4>
<p>AES 256-bit-krypteringen beskytter data ved at blokere for alle uautoriserede adgangsfors&oslash;g. N&aring;r en delt mappe krypteres, kan ingen uden krypteringsn&oslash;glen &aring;bne eller &aelig;ndre de krypterede data, selv om de fjerner harddisken fra din Synology NAS og tilslutter den til en anden enhed.</p>
</div>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>Navnet p&aring; en fil eller en mappe i en krypteret delt mappe kan ikke overstige 143 engelske tegn eller 47 asiatiske (CJK)-tegn. Hvis du &aring;bner dine delte mapper med Mac OS, kan navnet p&aring; en fil eller mappe i en krypteret delt mappe ikke overstige 130 engelske tegn eller 43 asiatiske (CJK)-tegn.</li>
	<li>Der er ikke adgang til krypterede delte mapper via NFS.</li>
	<li>Hvis du gendanner til standardadgangskoder ved nulstillingsknappen p&aring; Synology NAS, vil krypterede delte mapper ikke blive fraknyttet, og valgmuligheden til automatisk at tilknytte krypterede delte mapper bliver deaktiveret.</li>
	<li class="enable-dockerx64">Krypterede delte mapper underst&oslash;ttes kun i tilstand med h&oslash;jt privilegium. Hvis du vil bruge denne funktion, skal du g&aring; til Docker-pakken p&aring; din v&aelig;rts-DSM, v&aelig;lge den <strong>Docker DSM</strong>, du vil aktivere krypterede delte mapper for, klikke p&aring; <strong>Rediger</strong> og markere feltet ved siden af <strong>Udf&oslash;r container med h&oslash;je privilegier</strong>.</li>
</ul>
</div>

</body>
</html>