<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Avancerede brugerindstillinger</h2>

<p>Ret avancerede brugerindstillinger ved at g&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Bruger</strong> &gt; <strong>Avanceret</strong>. Nedenst&aring;ende valgmuligheder er tilg&aelig;ngelige. </p>

<h3>Indstillinger for adgangskode</h3>
<p>Du kan konfigurere indstillinger, der er relateret til adgangskodesikkerheds- og styrkeregler for brugere p&aring; din Synology NAS .</p>

<h4>S&aring;dan tillader du brugere at nulstille glemte adgangskoder via e-mail:</h4>
<ol>
	<li>Marker afkrydsningsfeltet <strong>Tillad ikke-admin-brugere at nulstille glemte adgangskoder via e-mail</strong>.</li>
	<li>Klik p&aring; <strong>Anvend</strong> for at gemme indstillingerne.</li>
	<li>Linket med &quot;Har du glemt din adgangskode?&quot; vises p&aring; DSM's loginside. N&aring;r adgangskoden glemmes, kan brugeren klikke p&aring; dette link og indtaste brugernavnet. I det tilf&aelig;lde vil systemet sende denne bruger en e-, der indeholder et link til nulstilling af hans glemte adgangskode.</li>
</ol>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>F&oslash;r du aktiverer denne mulighed, skal du s&oslash;rge for, at du allerede har aktiveret SMTP-e-mail-underretninger. Det g&oslash;r du ved at g&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Underretning</strong>.</li>
	<li>Hvis du vil modtage meddelelser fra systemet, skal du angive en e-mailadresse i afsnittet Brugeroplysninger for kontiene.</li>
	<li>Brugere, der h&oslash;rer til gruppen <strong>administrators</strong> kan ikke nulstille adgangskoder med denne mulighed.</li>
	<li>Dom&aelig;nebrugere kan ikke nulstille adgangskoder med denne mulighed.</li>
	<li>LDAP-brugere kan nulstille adgangskoder med denne mulighed, n&aring;r blot Synology NAS bruges som LDAP-katalogserver og opfylder f&oslash;lgende betingelser:
		<ul>
			<li>Synology <strong>Directory Server</strong>-pakkeversionen skal v&aelig;re 2457 eller senere.</li>
			<li>LDAP-bruger kan ikke v&aelig;re Administrator, Biblioteksbrugere, Biblioteksforbrugere eller Biblioteksklienter.</li>
			<li>Hvis Synology Directory Server er en <strong>Forbruger</strong>, skal dens <strong>Udbyder</strong> opfylde ovenst&aring;ende betingelser.</li>
			<li>Den skal v&aelig;re adgang til den endelige udbyder med brugerens webbrowser, og dens e-mailunderretninger skal aktiveres.</li>
			<li>Undg&aring; at nulstilling af glemt adgangskodelink bliver brugt af andre ved at klikke p&aring; linket fra den identiske IP-adresse, som blev brugt til at foretage den glemte adgangskodeanmodning.</li>
		</ul>
	</li>
</ul>
</div>	

<h4>S&aring;dan tvinger du brugere til at &aelig;ndre adgangskoden ved nulstilling:</h4>
<ol>
	<li>Marker afkrydsningsfeltet <strong>Gennemtving, at brugere &aelig;ndrer adgangskode, n&aring;r administratoren nulstiller adgangskode</strong>.</li>
	<li>Klik p&aring; <strong>Anvend</strong> for at gemme indstillingerne.</li>
	<li>N&aring;r administratoren &aelig;ndrer adgangskoden for en bruger, skal brugeren &aelig;ndre hans eller hendes adgangskode ved n&aelig;ste login.</li>
</ol>

<h4>S&aring;dan aktiverer du regler for adgangskodestyrke:</h4>
<ol>
	<li>Marker afkrydsningsfeltet <strong>Anvend regler for adgangskodestyrke</strong>.</li>
	<li>Marker eller afmarker f&oslash;lgende muligheder i overensstemmelse med dine behov:
		<ul>
			<li><strong>Udeluk navn og beskrivelse p&aring; bruger fra adgangskode</strong>: Adgangskoden m&aring; ikke indeholde brugernavn eller beskrivelse p&aring; bruger. UTF-8-kodede tegn er ekskluderet.</li>
			<li><strong>Inkluder store og sm&aring; bogstaver</strong>: Adgangskoden skal indeholde b&aring;de store og sm&aring; bogstaver.</li>
			<li><strong>Inkluder numerisk tegn</strong>: Adgangskoden skal indeholde mindst &eacute;t numerisk tegn (0 - 9).</li>
			<li><strong>Inkluder s&aelig;rligt tegn</strong>: Adgangskoden skal indeholde mindst et ASCII-tegn (dvs. <span class="note_content">~ ` ! @ # $ % ^ &amp; * ( ) - _ = + [ { ] } \ | ; : ' &quot; &lt; &gt; / ?</span>).</li>
			<li><strong>Udelade f&aelig;lles adgangskode</strong>: Lad ikke brugere bruge almindelige adgangskoder, f.eks. <em>123456</em>, <em>adgangskode</em>, <em>qwerty</em> og et cetera.</li>
			<li><strong>Mindste adgangskodel&aelig;ngde</strong>: Adgangskoden skal v&aelig;re mindst den v&aelig;rdi, der er angivet i tekstfeltet. L&aelig;ngden skal v&aelig;re et tal mellem 6 og 127.</li>
			<li><strong>Adgangskodehistorik</strong>: Adgangskoden skal v&aelig;re forskellig fra tidligere. Antallet angives her.</li>
		</ul>
	</li>
	<li>Klik p&aring; <strong>Anvend</strong> for at gemme indstillingerne.</li>
</ol>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>Regler for adgangskodestyrke g&aelig;lder kun for nye adgangskoder. F.eks. g&aelig;lder nye regler for adgangskodestyrke kun, n&aring;r der oprettes en ny brugerkonto, eller n&aring;r en eksisterende bruger &aelig;ndrer sin adgangskode. Eksisterende adgangskoder, og dem, der h&oslash;rer til importerede brugerkonti, udelukkes fra nye adgangskoderegler.</li>
</ul>
</div>

<h3>Adgangskodeudl&oslash;b</h3>
<p>Du kan forbedre sikkerheden for brugerkonti med funktionen til adgangskodeudl&oslash;b for at tvinge brugere til at skifte adgangskode efter den angivne tidsperiode.</p>

<h4>S&aring;dan konfigurerer du udl&oslash;bsplan for adgangskoden:</h4>
<ol>
	<li>Marker afkrydsningsfeltet <strong>Aktiver adgangskodeudl&oslash;b</strong></li>
	<li>F&oslash;lgende muligheder kan konfigureres:
		<ul>
			<li><strong>Maks. gyldighedsperioden for adgangskode</strong>: Angiv antallet af dage, hvorefter adgangskoder udl&oslash;ber.</li>
			<li><strong>Min. gyldighedsperioden for adgangskode</strong>: Marker afkrydsningsfeltet for at aktivere denne funktion, og angiv antallet af dage, f&oslash;r brugerne ikke l&aelig;ngere kan &aelig;ndre deres adgangskoder.</li>
			<li><strong>Bed brugere &aelig;ndre adgangskoden ved log ind f&oslash;r udl&oslash;b</strong>: Marker afkrydsningsfeltet for at aktivere denne funktion, og angiv antallet af dage for adgangskodeudl&oslash;b, hvor brugerne bliver p&aring;mindet om at &aelig;ndre deres adgangskoder ved login.</li>
			<li><strong>Tillad brugere at &aelig;ndre adgangskode efter udl&oslash;b</strong>: Marker afkrydsningsfeltet for at tillade brugere at logge ind med deres aktuelle adgangskoder, som er l&oslash;bet ud, og &aelig;ndre deres adgangskoder.</li>
			<li><strong>Send e-mails om udl&oslash;b</strong>: Marker afkrydsningsfeltet for at underrette brugere om adgangskodeudl&oslash;b via e-mail.</li>
		</ul>
	</li>
	<li>Klik p&aring; <strong>Anvend</strong> for at gemme indstillingerne.</li>
</ol>

<h3>2-trins verificering</h3>
<p>2-trins verificering giver forbedret sikkerhed til din DSM-brugerkonti. Du kan tvinge DSM-administratorer eller alle DSM-brugere til at aktivere deres 2-trins verificering for yderligere at beskytte deres konti.</p>

<h4>S&aring;dan tvinger du 2-trins verificering for DSM-brugere:</h4>
<ol>
	<li>Marker feltet <strong>Gennemtving 2-trins verificering for f&oslash;lgende brugere</strong>, og v&aelig;lg de brugere, det skal anvendes p&aring;.</li>
	<li>Klik p&aring; <strong>Anvend</strong> for at gemme indstillingerne.</li>
	<li>N&aring;r gennemtvingelsen er fuldf&oslash;rt, bliver brugere, der ikke har aktiveret deres 2-trins verificering, bedt om at f&aelig;rdigg&oslash;re indstillingerne, f&oslash;r de kan logge ind p&aring; DSM.</li>
</ol>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>Hvis du endnu ikke har konfigureret 2-trins verificering under <strong>Personlig</strong> &gt; <strong>Konto</strong>, bliver guiden til 2-trins verificering startet som hj&aelig;lp med at fuldf&oslash;re de kr&aelig;vede indstillinger, f&oslash;r du kan anvende gennem gennemtvingelse.</li>
	<li>Deaktivering af gennemtvingelse af 2-trins verificering her vil ikke p&aring;virke eller deaktivere 2-trins verificeringsindstillinger for hver bruger. Brugere kan beholde deres 2-trins verificeringsindstillinger eller g&aring; til <strong>Personlig</strong> &gt; <strong>Konto</strong> for at deaktivere disse indstillinger.</li>
	<li style="display: none;">2-trinsverificering g&aelig;lder ogs&aring; for alle SSH-relaterede tjenester, f.eks. SSH-terminal, SFTP og rsync med SSH-overf&oslash;rselskryptering. Da Hyper Backup og Synkronisering af delt mappe via rsync med SSH-overf&oslash;rselskryptering ikke underst&oslash;tter 2-trinsverificering, kan disse to tjenester ikke arbejde normalt, n&aring;r 2-trinsverificering er aktiveret.</li>
</ul>
</div>


<h3>Brugerstart</h3>

<p>Aktier brugerstart for at oprette en personlig <strong>start</strong>-mappe til hver bruger bortset fra <strong>guest</strong> . Alle brugere kan f&aring; adgang til deres egen startmappe via CIFS, AFP, FTP eller File Station.</p>

<p>Brugere, der h&oslash;rer til gruppen <strong>administrators</strong>, og kan f&aring; adgang til alle personlige mapper i den delte standardmappe <strong>homes</strong>. Navnet p&aring; startmappen er det samme som brugerkontoen.</p>

<h4>S&aring;dan aktiverer du brugerstarttjeneste:</h4>
<ol>
	<li>Marker <strong>Aktiver brugerstarttjeneste</strong>.</li>
	<li>Hvis der er flere diskenheden, skal du v&aelig;lge den, hvor du &oslash;nsker, at mappen <strong>homes</strong> skal gemmes.</li>
	<li>Klik p&aring; <strong>Anvend</strong>.</li>
</ol>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>N&aring;r den lokale brugerstarttjeneste er deaktiveret, vil dom&aelig;nebrugerens starttjeneste alle blive deaktiveret.</li>
</ul>
</div>

<h4>S&aring;dan deaktiverer du brugerstarttjeneste:</h4>
<ol>
	<li>Afmarker <strong>Aktiver brugerstarttjeneste</strong>.</li>
	<li>Klik p&aring; <strong>Anvend</strong> for at gemme indstillingerne.</li>
</ol>

<p>N&aring;r brugerstarttjeneste er deaktiveret, vil den delte mappe <strong>homes</strong> bevares, s&aring; administrator har adgang til den.  Bruger f&aring;r adgang til deres startmapper igen, n&aring;r brugerstarttjenesten aktiveres igen.</p>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>Brugerstartservice skal f&oslash;rst deaktiveres, f&oslash;r den delte <strong>homes</strong>-mappe kan slettes.</li>
	<li>Dom&aelig;nebrugerens startservice bliver deaktiveret, hvis den lokale brugers starttjeneste deaktiveres.</li> 
</ul> 
</div>

</body>	
</html> 