<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Win/Mac/NFS</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SMB</h2>

<p>SMB (Server Message Block)-protokollen giver Windows-, Mac- og Linux-klienter med SMB/CIFS-support adgang til data, der er lagret p&aring; Synology NAS. Hvis du vil gennemg&aring; filer p&aring; Synology NAS via Windows Stifinder eller tilknytter delte mapper som netv&aelig;rksdrev, skal du aktivere denne mulighed under <strong>Kontrolpanel</strong> &gt; <strong>Filtjenester</strong> &gt; <strong>SMB/AFP/NFS</strong>.</p>


<h4>S&aring;dan aktiverr du SMB-protokol:</h4>
<ol>
<li>
Marker <b>Aktiver SMB-tjeneste</b>
</li>
<li>
Klik p&aring; <b>Anvend</b>.
</li>
</ol>

<div class="section disable-hi3535">
<h4>Bem&aelig;rk:</h4>
<p>Efter aktivering af SMB-protokollen kan du tilslutte fuldt indekserede mapper til din Mac-computer via SMB og bruge Finder til at s&oslash;ge efter filindholdet i de tilsluttede mapper.</p>
</div>


<h3>Arbejdsgruppe</h3>
<p>Denne mulighed s&aelig;tter dig i stand til at udpege systemet som medlem af en bestemt arbejdsgruppe til netv&aelig;rksadministrationsform&aring;l.</p>

<div class="section">

<h4>Bem&aelig;rk:</h4>
<ul>
<li>Navnet p&aring; en arbejdsgruppe kan indeholde 1 til 15 tegn. Navnet kan ikke indeholde f&oslash;lgende tegn: [ ] ; : &quot; &lt; &gt; * + = \ / | ? ,</li>
<li>Hvis du bruger en Mac, der k&oslash;rer OS X 10.9, og din Synology NAS er med p&aring; et Windows-dom&aelig;ne, kan du logge ind ved at tilf&oslash;je <strong>localhost\</strong> foran dit lokale brugernavn til Synology NAS for at f&aring; adgang til filer, der er lagret p&aring; Synology NAS via SMB-protokollen.</li>
</ul>
</div>

<h3 class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Tillad ikke adgang til tidligere versioner</h3>
<p class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">I Windows Stifinder kan brugere f&aring; adgang til billeder af mapper eller filer ved at klikke p&aring; fanen <strong>Foreg&aring;ende versioner</strong> i en delt mappe, s&aring; gendannelse eller kopiering af data tillades uden hj&aelig;lp fra en administrator. Hvis du v&aelig;lger <strong>Tillad ikke adgang til tidligere versioner</strong> vises ingen oplysninger p&aring; siden &ldquo;Foreg&aring;ende Versioner&rdquo;.</p>

<div class="section enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>Brugere f&aring;r kun adgang til en tidligere version, hvis deres brugerkonti er oprettet p&aring; det tidspunkt, hvor det billede, der svarer til den tidligere version, er tages, og de har tilladelse til at l&aelig;se den delte mappe, hvor dette tilsvarende billede er.</li>
</ul>
</div>

<h3>Aktivering af logf&oslash;ring af overf&oslash;rsel</h3>
<p>Markering af denne indstilling aktiverer logf&oslash;ring af filadgangsoperationer, herunder oprettelse, sletning, l&aelig;sning, skrivning, flytning og omd&oslash;bning af filer eller mapper via CIFS/SMB-protokollen, ogs&aring; kendt som SMB-protokollen.</p>

<h3>Avancerede indstillinger</h3>
<p>Klik p&aring; knappen <strong>Avancerede indstillinger</strong> for at se nedenst&aring;ende valgmuligheder.</p>
<ul>
<li><strong>WINS-server</strong>: Microsoft Windows Internet Name Service (WINS) er et NetBIOS-navn-til-IP-adressetilslutningstjeneste. Windows-brugere vil finde systemet nemmere p&aring; TCP/IP-netv&aelig;rk, hvis systemet er konfigureret til registrering af en WINS-server.</li>
<li><strong>Maks. SMB-protokol</strong>: Afh&aelig;ngigt af din netv&aelig;rkskonfiguration kan du angive den seneste SMB-protokol, som skal underst&oslash;ttes af din Synology NAS.
  <ul>
  <li><strong>SMB1</strong>: SMB1 (kaldes ogs&aring; CIFS) er underst&oslash;ttet siden Windows NT.</li>
    <li><strong>SMB2</strong>: SMB2 er underst&oslash;ttet siden Windows Vista og er den forbedrede version af SMB. SMB2 tilf&oslash;jer mulighed for sammens&aelig;tning af flere SMB-handlinger til &eacute;n anmodning for at reducere antallet af netv&aelig;rkspakker og forbedre ydelsen.</li>
    <li><strong>SMB2 og stor MTU</strong>: Maximum transmission unit (MTU eller Maksimal overf&oslash;rselsenhed) refererer til den st&oslash;rste dataenhed, der kan overf&oslash;res over en kommunikationsprotokol. For at kunne drage fordel af hurtigere netv&aelig;rksinterfacer, f.eks. som 1- eller 10-gigabit Ethernet, for&oslash;ger Stor MTU den maksimale overf&oslash;rselsenhed til 1 MB. Aktivering af Stor MTU forbedrer hastigheden og effektiviteten af overf&oslash;rsel af store filer, mens det neds&aelig;tter antallet af pakker, der skal behandles.</li>
    <li><strong>SMB3</strong>: SMB3 er underst&oslash;ttet siden Windows 8 og Windows Server 2012. Det er en forbedret version af SMB2. SMB3 underst&oslash;tter AES-baseret filkrypteringsoverf&oslash;rsel, hvilket forbedrer sikkerheden i peer-to-peer-filoverf&oslash;rsler.</li>
</ul>
<div class="section">
  <h4>Bem&aelig;rk:</h4>
  <ul>
    <li>SMB2 underst&oslash;ttes p&aring; Windows Vista, Windows Server2008 R2, Windows 7 og senere.</li>
    <li>Stor MTU underst&oslash;ttes p&aring; Windows Server 2008 R2, Windows 7 og senere.</li>
    <li>For at g&oslash;re store MTU effektive p&aring; din Windows-computer, skal du &aelig;ndre computerens registreringsdatabaseindstillinger. Yderligere oplysninger findes i Microsofts tekniske support (f.eks. denne <a href="http://technet.microsoft.com/en-us/library/ff625695(v=ws.10).aspx" target="_blank">artikel</a>).</li>
    </ul>
</div>
<li><strong>Min. SMB-protokol</strong>: Afh&aelig;ngigt af din netv&aelig;rkskonfiguration kan du angive den tidligste SMB-protokol, som skal underst&oslash;ttes af din Synology NAS.</li>
<li><strong>Transportkrypteringstilstand</strong>: N&aring;r SMB3 aktiveres, vil SMB-protokollen tilf&oslash;je transportkryptering for at styrke filoverf&oslash;rslens sikkerhe.
  <ul>
    <li><b>Deaktiver</b>: Ingen transportkryptering anvendes.</li>
    <li><b>Auto</b>: Transportkryptering anvendes kun p&aring; klienter, der underst&oslash;tter denne funktion.</li>
    <li><b>Gennemtving</b>: Transportkryptering anvendes altid Dette vil medf&oslash;re, at klienter, der ikke underst&oslash;tter transportkryptering, ikke kan bruge SMB-protokollen.</li>
  </ul>
</li>
<div class="section">
  <h4>Bem&aelig;rk:</h4>
  <ul>
    <li>Transportkryptering underst&oslash;ttes i Windows 8, Windows Server 2012 og senere.</li>
    <li>Anonym login til SMB-protokollen underst&oslash;ttes ikke, n&aring;r transportkryptering aktiveres.</li>
    <li>N&aring;r transportkryptering er aktiveret, skal du lade <b>Deaktiver Opportunistic Locking</b> st&aring; umarkeret for at undg&aring; programtimeouts.</li>
    </ul>
</div>
<li><strong>Aktiver Opportunistic Locking</strong> V&aelig;lg at aktivere &quot;Opportunistic Locking&quot; af CIFS, s&aring; klienten bedre kan cache filindhold og undg&aring; lille l&aelig;se/skriveoverhead. N&aring;r denne valgmulighed er fravalgt, vil databaseprogrammer k&oslash;re bedre ved adgang til databasefiler, der er gemt p&aring; Synology NAS via netv&aelig;rk.
	<ul>
    <li><strong>Aktiver SMB2-leje</strong>: Aktivering af denne valgmulighed muligg&oslash;r, at flere SMB2-relaterede indstillinger kan finindstille klient-caching-mekanismen, der leveres af Opportunistic Locking.</li>
    </ul>

</li>



<li>
  <strong>Aktiver Local Master Browser</strong>: N&aring;r der er flere Windows-computere p&aring; samme undernet, vil de forhandle og v&aelig;lge en computer som en &quot;local master browser.&quot; Denne Local Master Browser vedligeholder lister over de andre computere p&aring; undernettet og deres delte ressourcer og deler disse lister med de andre computere. Denne mulighed s&aelig;tter Synology NAS i stand til at p&aring;tage sig rollen som local master browser.
</li>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<p>Aktivering af denne funktion deaktiverer harddiskdvale og aktiverer kontoen guest uden en adgangskode.</p>
</div>


<li><strong>Aktiver DirSort VFS-modul</strong>: Sorterer mappenavne og viser dem alfabetisk. Aktivering af denne mulighed p&aring;virker systemydelsen.</li>

<li><strong>Veto filer</strong>: Skjuler filer i overensstemmelse med bestemte kriterier. Kriterier kan omfatte jokertegn (*), og flere angivelser skal deles af en skr&aring;streg (/). F.eks.: <i>/abc*/*.txt/*.conf/</i>. Aktivering af denne mulighed p&aring;virker systemydelsen.</li>

<li><strong>Tillad symbolske links i delte mapper</strong>: V&aelig;lg at tillade, at symbolske links peger p&aring; filer og mapper i den samme delte mappe. Symbolske links kan oprettes med DSM-terminal.
<ul>
	<li><strong>Tillad symbolske links p&aring; tv&aelig;rs af delte mapper</strong>: V&aelig;lg, at symbolske links at pege p&aring; filer eller mapper i forskellige delte mapper. Symbolske links kan oprettes med DSM-terminal. Brugere uden privilegier kan dog ikke f&aring; adgang til delte destinationsmapper for symbolske links.</li>
</ul>
</li>


<li><strong>Aktiver VFS-modul for at konvertere Mac-s&aelig;rlige tegn</strong>: V&aelig;lg at konvertere SMB-reserverede tegn (f.eks. &lt;   &gt;  &quot; * ?) i filnavne til almindelige latinske under filoprettelse. S&aring;danne filer bliver genkendt via AFP.</li>
<li><strong>Aktiver MSDFS VFS-modul</strong>: G&oslash;r det muligt for symbolske links at pege p&aring; filer eller mapper p&aring; andre SMB-servere. Med &aelig;ldre versioner af Windows, f.eks. Windows XP, skal klienten og Synology NAS v&aelig;re p&aring; et Windows-dom&aelig;ne, f&oslash;r muligheden aktiveres. F&aring; mere at vide om oprettelse af MSDFS-links <a href="http://www.samba.org/samba/docs/man/Samba-HOWTO-Collection/msdfs.html" target=_blank>her</a>. Bem&aelig;rk, at cachen til klientenheden skal ryddes efter deaktivering af denne mulighed. Ellers kan den normale ydelse blive p&aring;virket.</li>

<li><strong>Deaktiver flere forbindelser fra den samme IP-adresse</strong>: N&aring;r muligheden er aktiveret, muligg&oslash;r Synology NAS kun en forbindelse pr. IP-adresse fra klienter, der bruger SMB-protokollen. N&aring;r flere klienter med samme IP-adresse bruger SMB-protokollen, vil Synology NAS bevare den seneste og droppe alle &aelig;ldre forbindelser. I et NAT-milj&oslash; kan klienten m&aring;ske bruge &eacute;n IP-adresse, hvorved aktivering af denne mulighed kan p&aring;virke den normale ydelse.</li>

<li><strong>Indsaml fejlfindingslogfiler</strong>: N&aring;r denne mulighed er aktiveret, gemmes detaljerede logfiler til fejlfindingsform&aring;l. Aktivering af denne mulighed p&aring;virker systemydelsen.</li>
<li><strong>Anvend standard UNIX-tilladelser</strong>: Aktiver denne valgmulighed for at anvende standard UNIX-tilladelser ved upload eller oprettelse af filer og mapper. UNIX-tilladelsen bliver 744 for filer og 755 for mapper. N&aring;r muligheden er deaktiveret, er UNIX-tilladelsen 777 for filer og mapper.</li>
<div class="section enable-eds14">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Aktivering af denne mulighed kan medf&oslash;re inkonsekvente tilladelsesproblemer mellem forskellige protokoller. Hvis du vil undg&aring; inkonsekvenser, foresl&aring;r vi, at du deaktiverer denne mulighed.</li>
</ul>
</div>
<div class="section disable-eds14">
<h4>Bem&aelig;rk:</h4>
<ul>
  <li>For Windows ACL-aktiverede delte mapper (alle delinger bortset fra &quot;photo&quot; og delinger p&aring; eksterne drev) skal du k&oslash;re kommandoen <strong>chmod</strong> p&aring; din Linux eller FTP-klient for at &aelig;ndre mappe- og filtilladelsestyper fra Windows ACL til UNIX.</li>
  <li>Aktivering af denne mulighed kan medf&oslash;re inkonsekvente tilladelsesproblemer mellem forskellige protokoller. Hvis du vil undg&aring; inkonsekvenser, foresl&aring;r vi, at du deaktiverer denne mulighed.</li>
</ul>
</div>
<li><b>Reserver ikke diskplads, n&aring;r du opretter filer</b>: Aktiver denne valgmulighed for ikke at tillade diskplads fra at v&aelig;re reserveret, n&aring;r der oprettes filer p&aring; din Synology NAS .</li>
<li><strong>Aktiver SMB permanente handles (fill&aring;sning p&aring; tv&aelig;rs af protokol deaktiveres</strong>): Aktivering af denne valgmulighed s&aelig;tter brugere i stand til at gendanne mistede SMB2-forbindelser til denne Synology NAS efter midlertidig afbrydelse. &Aring;bnede filer forbliver tilg&aelig;ngelige under netv&aelig;rksnedbrud. L&aring;sen til krydsprotokolfil bliver dog deaktiveret, s&aring; brugere kan f&aring; adgang til eller &aelig;ndre en l&aring;st fil via ikke-SMB2-protokoller (f.eks. AFP).</li>
<li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><b>Aktiver Btrfs-hurtigkloning</b>: Aktivering af denne valgmulighed s&aelig;tter brugere i stand til at kopiere filer med h&oslash;j hastighed, n&aring;r b&aring;de kilden og destinationen er p&aring; samme Btrfs-diskenhed.</li>
<li><strong>Ryd SMB-cache</strong>: Klik p&aring; denne knap for at slette f&oslash;lgende SMB-cache-filer til fejlfindingsform&aring;l:
  <ul>

<li>/var/cache/samba/netsamlogon_cache.tdb</li>
<li>/var/lib/samba/winbindd_cache.tdb</li>
<li>/var/lib/samba/share_info.tdb</li>
<li>/var/lib/samba/registry.tdb</li>
<li>/run/samba/connections.tdb</li>
<li>/run/samba/gencacche.tdb</li>
<li>/run/samba/gencache_notran.tdb</li>
</ul>
</li>

</ul>

</body>
</html>
