<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Eksterne enheder</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="usbprinter"></a>Printere</h2>
<p>Synology NAS kan v&aelig;re printerserver, s&aring; klientcomputere eller mobile enheder kan f&aring; adgang til printere, som er tilsluttet til Synology NAS. Derudover s&aelig;tter Apple Wireless Printing og Google Cloud Print-underst&oslash;ttelse dig i stand til fjernt at udskrive p&aring; iOS-enheder eller Google-produkter og -tjenester.</p>
<p>Bes&oslash;g <a href="http://www.synology.com" target="_blank"> www.synology.com</a> for at se kompatible printere.</p>

<h3>Konfiguration af printere</h3>
<p>Se vejledningen nedenfor for at konfigurere og tilslutte til en <span class="disable-rc18015xsp">USB eller </span>netv&aelig;rksprinter med din Synology NAS.</p>


<h4 class="disable-rc18015xsp"><a id="t1"></a>S&aring;dan konfigurerer du en USB-printer:</h4>
<ol class="disable-rc18015xsp">
<li>Aktiver og tilslut printeren til en USB-port p&aring; Synology NAS.</li>
<li>G&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Eksterne enheder</strong> &gt; <strong>Printer</strong>.</li>
<li>V&aelig;lg den printer, du vil konfigurere. Bem&aelig;rk, at Synology NAS ikke kan genkende printere, der er tilsluttet via USB-hubs.</li>
<li>Klik p&aring; <b>Printerstyring</b>, og v&aelig;lg <b>Konfigurer printer</b>.</li>
<li>V&aelig;lg en af f&oslash;lgende tilstande i dialogboksen:
<ul>
<li><b>Netv&aelig;rk-MFP:</b> Giver klienter mulighed for p&aring; det lokale netv&aelig;rk at bruge printer, scanner og fax-funktioner p&aring; din multifunktionsprinter. Scannings- og faxfunktioner er kun tilg&aelig;ngelige p&aring; Windows-computere.</li>
<li><b>Netv&aelig;rksprinter:</b> V&aelig;lg denne tilstand for printere, der kun underst&oslash;tter udskrift, eller hvis du vil g&oslash;re det muligt for klienter kun at bruge udskriftsfunktionen.</li>
</ul>
</li>
<li>Konfigurer indstillinger for Apple Wireless Printing eller Google Cloud Print (valgfrit).</li>
<li>Klik p&aring; <b>Gem</b>.</li>
</ol>

<div class="section disable-rc18015xsp">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>En netv&aelig;rks-MFP kan kun &aring;bnes af &eacute;n klient p&aring; et givet tidspunkt.</li>
</ul>
</div>

<h4>S&aring;dan konfigurerer du en netv&aelig;rksprinter:</h4>
<ol>
<li>Aktiver og tilslut netv&aelig;rksprinteren til det samme lokale netv&aelig;rk som din Synology NAS.</li>
<li>G&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Eksterne enheder</strong> &gt; <strong>Printer</strong>.</li>
<li>Klik p&aring; <b>Tilf&oslash;j netv&aelig;rksprinter</b>, og f&oslash;lg vejledningen i konfigurationsguiden.</li>
</ol>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li><strong>Printernavn:</strong> Der skal angives et printernavn under konfigurationen, og det kan indeholder op til 32 tegn, herunder bogstaver, tal og understregninger.</li>
	<li><strong>Protokol:</strong> Generelt bruger HP-netv&aelig;rksprintere Socket, Canon-netv&aelig;rksprintere bruger BJNP og andre for det meste LPR.</li>
<li><strong>K&oslash;navn:</strong> Indtastning af et k&oslash;navn kr&aelig;ves til LPR- og IPP-netv&aelig;rksprintere, men g&aelig;lder ikke for Socket- eller BJNP-printere.</li>
<li><strong>Ingen netv&aelig;rk-MFP:</strong> Netv&aelig;rksprintere tilsluttet til Synology NAS kan ikke bruge netv&aelig;rks-MFP-tilstand p&aring; nuv&aelig;rende tidspunkt.</li>
<li><strong>Ingen USB-printere:</strong> USB-printere, der deles af et Synology-produkt, kan ikke angives som netv&aelig;rksprintere.</li>
</ul>
</div>

<div class="disable-rc18015xsp">
<h4>S&aring;dan konfigurerer du en PostScript USB-printer vha. en Mac:</h4>
<p><strong>Til Mac OS 10.6.X:</strong></p>
<ol>
<li>F&oslash;lg trinnene i <a href="system_externaldevice_printer.html#t1">S&aring;dan konfigurerer du en USB-printer</a>.</li>
<li>P&aring; din Mac g&aring;r du til <b>Systempr&aelig;ferencer</b> &gt; <b>Printer og fax</b> og klikker p&aring; <strong>+</strong> for at tilf&oslash;je en ny printer.</li>
<li>V&aelig;lg <strong>IP</strong>.</li>
<ul>
	<li>V&aelig;lg <strong> Line Printer Daemon - LPD</strong> som <strong>Protokol</strong>.</li>
	<li>Angiv printerens IP-adresse.</li>
	<li>Indtast &quot;usbprinter&quot; i feltet <strong>K&oslash;</strong>.</li>
	<li>V&aelig;lg <strong>Generisk PostScript-printer</strong> for <strong>Udskriv med</strong>.</li>
	<li>Klik p&aring; <strong>Tilf&oslash;j</strong> for af afslutte.</li>
</ul>
</ol>
<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>AppleTalk underst&oslash;ttes ikke l&aelig;ngere af Mac OS 10.6.X. Hvis du skal bruge en AppleTalk-printer, skal du l&aelig;se dokumentationen for at finde en mulige m&aring;de at tilslutte Mac-computeren eller det lokale netv&aelig;rk. Hvis der ikke er nogen m&aring;de at tilslutte printeren, skal du tilslutte den til en Mac-computer med Mac OS 10.5.X eller tidligere og konfigurere den som delt.</li>
</ul>
</div>

<p><strong>Til Mac OS 10.5.X:</strong></p>
<ol>
<li>F&oslash;lg trinnene i <a href="system_externaldevice_printer.html#t1">S&aring;dan konfigurerer du en USB-printer</a>.</li>
<li>P&aring; din Mac g&aring;r du til <b>Systempr&aelig;ferencer</b> &gt; <b>Printer og fax</b> og klikker p&aring; <strong>+</strong> for at tilf&oslash;je en ny printer.</li>
<li>V&aelig;lg en metode.</li>
<ul>
	<li>Metode 1: <strong>AppleTalk</strong></li>
	<ul>
		<li>V&aelig;lg <strong>Generisk PostScript-printer</strong> for <strong>Udskriv med</strong>.</li>
		<li>Klik p&aring; <strong>Tilf&oslash;j</strong> for af afslutte.</li>
	</ul>
	<li>Metode 2: <strong>IP</strong></li>
	<ul>
		<li>V&aelig;lg <strong>Line Printer Daemon - LPD</strong> som Protokol.</li>
		<li>Angiv printerens IP-adresse.</li>
		<li>Indtast &quot;usbprinter&quot; i feltet <strong>K&oslash;</strong>.</li>
		<li>V&aelig;lg <strong>Generisk PostScript-printer</strong> for <strong>Udskriv med</strong>.</li>
		<li>Klik p&aring; <strong>Tilf&oslash;j</strong> for af afslutte.</li>
	</ul>
</ul>
</ol>
</div>

<h3>Administration af printere</h3>
<p>Printerfanen indeholder f&oslash;lgende muligheder til administration af <span class="disable-rc18015xsp">USB eller </span> netv&aelig;rksprintere, der er tilsluttet til Synology NAS.</p>

<ul>
<li><b>Hent oplysninger:</b> Viser oplysninger, der relaterer sig til den valgte printer, f.eks. enhedsnavn, producent, status osv.</li>
<li><strong>Fjern:</strong> Fjerner og afbryder en printer fra Synology NAS.</li>
<li><strong>Printerstyring:</strong> Omfatter f&oslash;lgende muligheder:
<ul>
<li><strong>Konfigurer printer</strong>: Rediger printerindstillinger, f.eks Apple Wireless Printing eller Google Cloud Print (se nedenfor for instruktioner).</li>
<li><strong>Ryd op i spool-plads:</strong> Annuller alle udskriftsopgaver p&aring; alle printere.</li>
<li><strong>Udskriv testside:</strong> Udskriver en testside for at sikre, at konfigurationerne er korrekte.</li>
<li><b>Frigiv printer:</b> Afbryder printeren og klienten (kun for tilstanden Netv&aelig;rk-MFP). N&aring;r en klient tilsluttes til en multifunktionsprinter for at modtage faxer eller scanne filer, kan opgave tage lang tid. Om n&oslash;dvendigt kan forbindelsen standses for at tillade den n&aelig;ste klient i k&oslash;en at f&aring; adgang til printeren.</li>
</ul></li>
</ul>


<h4>S&aring;dan aktiverer du Apple Wireless Printing:</h4>
<ol>
<li>G&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Eksterne enheder</strong> &gt; <strong>Printer</strong>.</li>
<li>V&aelig;lg en printer i enhedslisten.</li>
<li>Klik p&aring; <b>Printerstyring</b> &gt; <b>Konfigurer printer</b>.</li>
<li>Marker feltet <b>Aktiver Apple Wireless Printing</b>.</li>
<li>V&aelig;lg din printers m&aelig;rke og driver.</li>
<li>Klik p&aring; <b>Gem</b>.</li>
</ol>

<p>N&aring;r konfigurationen er f&aelig;rdig, kan du udskrive en testside ved at klikke p&aring; <b>Printerstyring</b> &gt; <b>Udskriv testside</b>.</li>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Aktivering af Apple Wireless Printing aktiverer ogs&aring; Bonjour-printerrundkastning for DSM.</li>
<li>Apple Wireless Printing findes til iOS 4.2 eller senere.</li>
</ul>
</div>


<h4>S&aring;dan aktiverer du Google Cloud Print:</h4>
<ol>
<li>G&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Eksterne enheder</strong> &gt; <strong>Printer</strong>.</li>
<li>V&aelig;lg en printer i enhedslisten.</li>
<li>Klik p&aring; <b>Printerstyring</b> &gt; <b>Konfigurer printer</b>.</li>
<li>Marker feltet <b>Aktiver Google Cloud Print</b>.</li>
<li>Indtast f&oslash;lgende detaljer:
<ul>

<li>Dine Google-kontooplysninger.</li>
<li>Din printers m&aelig;rke og driver.</li>
</ul>
<li>Klik p&aring; <b>Gem</b>.</li>
</ol>
<p>N&aring;r konfigurationen er f&aelig;rdig, kan du udskrive en testside ved at klikke p&aring; <b>Printerstyring</b> &gt; <b>Udskriv testside</b>.</li>
</p>
<p>Administrer Google Cloud Print-opgaver ved at klikke p&aring; linket <a href="http://www.google.com/cloudprint/manage.html" target="_blank">Google Cloud Print</a>.</p>


<h3>Adgang til printere</h3>
<p>Se nedenst&aring;ende afsnit for at f&aring; adgang til printere med en PC eller Mac.</p>
<h4><a name="others"></a>S&aring;dan f&aring;r du adgang til printere med en Windows PC:</h4>
<p>
Den bedste m&aring;de at f&aring; adgang til Synology NAS-enhedens udskriftstjeneste er at konfigurere forbindelsen til printeren med Synology Assistant. Der henvises til Hj&aelig;lp for at f&aring; flere oplysninger.
</p>

<p>Hvis Synology Assistant ikke er installeret p&aring; computeren, skal du se nedenfor for at se andre m&aring;der, du kan f&aring; adgang til Synology NAS-enhedens udskriftstjeneste p&aring;.</p>
<p><strong>Type 1. Delt netv&aelig;rksprinter</strong></p>
<ol>
<li>&Aring;bn <b>Netv&aelig;rk </b>i Stifinder p&aring; computeren, og dobbeltklik p&aring; Synology NAS.</li>

<li>Dobbeltklik p&aring; <span class="disable-rc18015xsp"><b>usbprinter</b> eller </span><b>navn p&aring; netv&aelig;rksprinter</b>. Systemet beder dig installere den korrekte driver og klikke p&aring; <b>Ja</b>.</li>

<li>Hent printerdriveren fra cd'en eller producentens websted. V&aelig;lg printerproducenten og modellen, eller klik p&aring; <strong>Har disk</strong> for at v&aelig;lge placeringen af driveren. Klik p&aring; <b>OK</b></li>
<li>Systemet vil begynde konfigurationen af netv&aelig;rksprinteren. Efter konfigurationen er f&aelig;rdig, kan du begynde at bruge printeren. </li>
</ol>


<p><strong>Type 2. LPR-port (anbefales)</strong></p>
<ol>
<li>Klik p&aring; <b>Start</b> p&aring; computeren, og g&aring; til <b>Enheder og printere.</b></li>
<li>Klik p&aring; <b>Tilf&oslash;j printer</b>. </li>
	<li>V&aelig;lg <strong>Tilf&oslash;j en netv&aelig;rks-, tr&aring;dl&oslash;s eller Bluetooth-printer.</strong> </li>
	<li>V&aelig;lg <strong>Den printer, jeg &oslash;nsker, er ikke p&aring; listen.</strong></li>
<li>V&aelig;lg <b>Tilf&oslash;j en printer ved hj&aelig;lp af TCP/IP-adresse eller v&aelig;rtsnavn</b>. Klik p&aring; <b> N&aelig;ste</b> for at forts&aelig;tte.</li>
<li>V&aelig;lg enhedstypen til at v&aelig;re <b>TCP/IP-portenhed.</b></li>
<li>Angiv IP-adressen p&aring; Synology NAS. Klik p&aring; <b> N&aelig;ste</b> for at forts&aelig;tte.</li>
<li>V&aelig;lg <b>Enhedstype:</b> <strong>Tilpasset</strong> &gt; <strong>Indstillinger</strong> &gt; …. Klik p&aring; <b> N&aelig;ste</b> for at forts&aelig;tte.</li>

<li>V&aelig;lg <b>LPR</b> for protokol. Indtast <span class="disable-rc18015xsp"><b>usbprinter</b> eller </span><b>navn p&aring; netv&aelig;rksprinter</b> som k&oslash;navn, og marker afkrydsningsfeltet <b>Byte-t&aelig;lling for LPR aktiveret</b>. Klik p&aring; <b>OK</b> for at forts&aelig;tte.</li>

<li>Hent printerdriveren fra cd'en eller producentens websted. V&aelig;lg printerproducenten og modellen, eller klik p&aring; <strong>Har disk</strong> for at v&aelig;lge placeringen af driveren. Klik p&aring; <b>OK</b></li>
	<li>Systemet vil begynde konfigurationen af netv&aelig;rksprinteren. Efter konfigurationen er f&aelig;rdig, kan du begynde at bruge printeren.</li>
</ol>

<h4>S&aring;dan f&aring;r du adgang til printere med en Mac:</h4>
<p>
Mac-brugere kan f&aring; adgang til Synology NAS-enhedens udskriftstjenester ved at aktivere DSM's Bonjour-printerrundkastning og tilf&oslash;je printeren under Systempr&aelig;ferencer.</p>

<P>S&oslash;rg for, at din Synology NAS bruger en Postscript-printer, f&oslash;r du forts&aelig;tter.
</p>

<p><strong>Trin 1. Aktiver DSM's Bonjour-printerrundkastning</strong></p>
<ol>
<li>
Log ind p&aring; DSM som <b>admin</b> eller en bruger, der h&oslash;rer til gruppen <b>administrators</b>.
</li>
<li>
G&aring; til <b>Kontrolpanel</b> &gt; <strong>Filtjenester</strong> &gt; <b>Win/Mac/NFS</b>.
</li>
<li>
Marker <b>Aktiver Bonjour-printerrundkastning</b>.
</li>
</ol>

<p><strong>Trin 2. F&aring; adgang til printer med Mac</strong></p>
<ol>
<li>
Flyt til <b>Systempr&aelig;ferencer</b> &gt; <b>Udskriv og scan</b> p&aring; din Mac, og klik p&aring; <b>+</b>.
</li>

<li>
V&aelig;lg <span class="disable-rc18015xsp"><b>usbprinter[nummer]</b> eller </span><b>navn p&aring; netv&aelig;rksprinter</b> fra rullemenuen. Din Mac vil konfigurere printeren automatisk.
</li>

</ol>



</body>
</html>
