<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

	<h2>HDD/SSD</h2>
	<p>Det h&auml;r avsnittet g&ouml;r att du kan &ouml;vervaka och f&ouml;rst&aring; statusen f&ouml;r interna lagringsdiskar som &auml;r installerade p&aring; din Synology NAS. G&aring; till <strong>Lagringshanterare</strong> &gt; <strong>HDD/SSD</strong> f&ouml;r att hantera dessa alternativ.</p>


	<h4>Att kontrollera info f&ouml;r HDD/SSD:</h4>
	<ol>
		<li>G&aring; till fliken <b>HDD/SSD</b>.</li>
		<li>V&auml;lj en disk fr&aring;n listan och expandera den. H&auml;r kan du se S.M.A.R.T.-status, information f&ouml;r disk/RAID Group, modellnamn, serienummer, version av fast programvara och temperatur.</li>
	</ol>	
	
	<h4>Att kontrollera h&auml;lsoinformationen:</h4>
    <ol>
      <li>G&aring; till fliken <b>HDD/SSD</b>.</li>
	  <li>V&auml;lj en disk.</li>
      <li>Klicka p&aring; <b>H&auml;lsoinformation</b>.</li>
	  <li>G&aring; till fliken <strong>&Ouml;versikt</strong> f&ouml;r att f&aring; reda p&aring; i hur m&aring;nga timmar disken har varit p&aring;slagen och se dess nuvarande temperatur, antal &aring;teranslutningar/&aring;teridentifieringar och skadade sektorer. H&auml;r kan du &auml;ven se den &ouml;vergripande statusen, S.M.A.R.T.-status och status f&ouml;r IronWolf-h&auml;lsa*. V&auml;nligen se nedanst&aring;ende tabell f&ouml;r en &ouml;versikt &ouml;ver diskens &ouml;vergripande h&auml;lsostatus och dess associerade h&auml;lsotillst&aring;nd.</li>
      <li>G&aring; till fliken <strong>S.M.A.R.T. Info</strong> f&ouml;r att ytterligare diagnostisera diskens status.</li>
    </ol>

<table>
	<tr>
		<th>Diskstatus</th>
		<th>H&auml;lsotillst&aring;nd</th>
	</tr>
	<tr>
		<td>Normal</td>
		<td>
			<p>Disken &auml;r antingen i ett gott skick eller s&aring; har varningen f&ouml;r disken blivit sp&auml;rrad eller avaktiverad.</p>
		</td>
	</tr>
	<tr>
		<td>Varning</td>
		<td>
			<p>Problem har uppt&auml;ckts p&aring; disken och/eller s&aring; har antalet skadade sektorer &ouml;verskridit den inst&auml;llda gr&auml;nsen. &Auml;ven om diskar med den h&auml;r statusen fortfarande vara funktionsdugliga ska de &ouml;vervakas.</p>
		</td>
	</tr>
	<tr>
		<td>Kritisk</td>
		<td>
			<p>Ett kritiskt problem eller flera problem har uppt&auml;ckts p&aring; disken. Omedelbart utbyte av disken rekommenderas best&auml;mt.</p>
		</td>
	</tr>
	<tr>
		<td>Misslyckas</td>
		<td>
			<p>Flera kritiska problem har uppt&auml;ckts p&aring; disken. Diskens integritet &auml;r inte garanterad n&auml;r diskar har den h&auml;r h&auml;lsostatusen.</p>
		</td>
	</tr>
	<tr>
		<td>&Aring;tkomstfel</td>
		<td>
			<p>Diskkommunikationsfel kan ha orsakat att disken kopplats fr&aring;n systemet eller resulterat i allvarliga l&auml;s-skriv-fel. Den h&auml;r h&auml;lsostatusen indikerar vanligtvis att allvarliga problem har intr&auml;ffat.</p>
		</td>
	</tr>
</table>



<div class="section">
<h4>Obs:</h4>
<ul>
<li>SAS-diskar har inte st&ouml;d f&ouml;r alla S.M.A.R.T.-funktioner.</li>
</ul>
</div>

<h4>Att &auml;ndra status f&ouml;r diskvarning:</h4>
<P>DSM &ouml;vervakar st&auml;ndigt h&auml;lsostatus f&ouml;r dina diskar och meddelar dig n&auml;r problem uppt&auml;cks. En del problem kan vara mer allvarliga &auml;n andra. F&ouml;r vissa problem som resulterar i h&auml;lsostatusen <strong>Varning</strong> (i <strong>H&auml;lsoinformation</strong> &gt; <strong>&Ouml;versikt</strong>) kan varningen &auml;ndras genom att f&ouml;ljande g&ouml;rs:</P>
<ol>
 <li>G&aring; till fliken <strong>HDD/SSD</strong>.</li>
 <li>V&auml;lj disken som &auml;r i varningsstatus och klicka p&aring; <strong>H&auml;lsoinformation</strong>.</li> 
 <li>Klicka p&aring; <strong>Modifiera diskvarning</strong>.</li>
 <li>Klicka p&aring; alternativet <strong>Sp&auml;rra varning</strong> eller <strong>Avaktivera varning</strong> (du har dessa tv&aring; alternativ beroende p&aring; problemets art): 
  <ul>
   <li><strong>Sp&auml;rra varning:</strong> &Ouml;vervakning av det trasiga f&auml;ltet forts&auml;tter; dock utl&ouml;ses varningarna bara n&auml;r dess v&auml;rde fors&auml;tter att g&aring; s&ouml;nder.</li> 
   <li><strong>Avaktivera varning:</strong> &Ouml;vervakning av S.M.A.R.T.-f&auml;ltet avaktiveras permanent.</li>
  </ul>
 </li>
</ol>

<div class="section">
<h4>Obs:</h4>
<ul>
<li>&Auml;ndring av diskvarningsstatus l&ouml;ser inte problem som uppst&aring;r p&aring; en disk, det f&ouml;rhindrar dem inte heller fr&aring;n att intr&auml;ffa; av den anledningen ska den h&auml;r &aring;tg&auml;rden inte betraktas som en l&aring;ngsiktig l&ouml;sning.</li>
<li>V&auml;nligen observera att en varning om S.M.A.R.T.-problem vanligtvis indikerar att ett problem har uppst&aring;tt p&aring; disken. Att ignorera varningen kan resultera i dataf&ouml;rlust.</li>
<li>Vissa S.M.A.R.T.-f&auml;lt betecknas som kritiska och kan inte sp&auml;rras eller avaktiveras.</li>
</div>


	<h4>Starta ett S.M.A.R.T.-test:</h4>
	<P>S.M.A.R.T. Test unders&ouml;ker och rapporterar status f&ouml;r dina diskar och varnar dig f&ouml;r m&ouml;jligt diskfel. Vi rekommenderar att omg&aring;ende byta diskar om fel uppt&auml;cks. </P>
    <ol>
      <li>G&aring; till fliken <strong>HDD/SSD</strong>.</li>
      <li>V&auml;lj en disk.</li>
      <li>Klicka p&aring; <b>S.M.A.R.T. Test</b>.</li>
      <li>V&auml;lj en testtyp och klicka p&aring; <strong>Start</strong> f&ouml;r att starta testet.</li>
      <li>De senaste resultaten visas i avsnittet <b>Testresultat</b>.</li>
      <li>G&aring; till fliken <strong>Historik</strong> f&ouml;r att visa tidigare testresultat.</li>
    </ol>
<div class="section">
<h4>Obs:</h4>
    <ul>
     <li>Tiden som kr&auml;vs f&ouml;r att k&ouml;ra ett S.M.A.R.T.-test kan variera, beroende p&aring; systemanv&auml;ndning och diskkapacitet.</li> 
     <li>Testets utdata &auml;r antingen <strong>Normal</strong> eller <strong>Underk&auml;nd</strong>.</li>
    </ul>
</div>

    <h4>Att schemal&auml;gga ett S.M.A.R.T.-test:</h4>
    <p>S.M.A.R.T-test kan schemal&auml;ggas att k&ouml;ras automatiskt p&aring; diskar.</p>
    <ol>
      <li>G&aring; till fliken <strong>Schemal&auml;ggare f&ouml;r test</strong>.</li>
      <li>Klicka p&aring; <strong>Skapa</strong> f&ouml;r att g&ouml;ra en ny uppgift.</li>
      <li>&Auml;ndra f&ouml;ljande inst&auml;llningar p&aring; fliken <strong>Allm&auml;nt</strong>:</li>
      <ul>
        <li><strong>Uppgiftsnamn:</strong> Ange ett namn f&ouml;r uppgiften.</li>
        <li><strong>S.M.A.R.T. testtyp:</strong> V&auml;lj att utf&ouml;ra ett snabbtest eller ett ut&ouml;kat test.</li>
        <li><strong>S.M.A.R.T. testintervall:</strong> V&auml;lj vilka HDD/SSD som ska testas var g&aring;ng S.M.A.R.T.-test utf&ouml;rs.</li>
      </ul>
      <li>P&aring; fliken <strong>Schema</strong>, &auml;ndra f&ouml;ljande inst&auml;llningar:</li>
      <ul>
        <li><strong>Datum:</strong> Specificera datum att k&ouml;ra S.M.A.R.T.-testet som kan schemal&auml;ggas att k&ouml;ras vissa dagar i veckan (t.ex. dagligen, under veckoslut eller varje s&ouml;ndag) eller p&aring; specifika datum (t.ex. 2016-11-21).</li>
        <li><strong>Tid:</strong> Specificera hur ofta S.M.A.R.T.-test ska k&ouml;ras p&aring; diskar samt &auml;ven f&ouml;rsta och sista k&ouml;rningstid.</li>
      </ul>
      <li>Klicka p&aring; <strong>OK</strong> f&ouml;r att slutf&ouml;ra.</li>
    </ol>

<div class="section">
<h4>Obs:</h4>
   <ul>
    <li>Om S.M.A.R.T.-testet inte &auml;r schemalagt att k&ouml;ras p&aring; en s&auml;rskild disk visas knappen <strong>Schemal&auml;gga S.M.A.R.T. Test</strong> att visas i <strong>H&auml;lsoinformation</strong> &gt; <strong>&Ouml;versikt</strong> f&ouml;r den disken.</li> 
   </ul> 
</div>

<h4>Att aktivera varning f&ouml;r skadade sektorer*:</h4>
<ol>
	<li>G&aring; till fliken <b>Allm&auml;nt</b>.</li>
	<li>Bocka f&ouml;r <b>Aktivera varning f&ouml;r skadade sektorer</b>. Som standard &auml;r denna funktion aktiverad.</li>
	<li>St&auml;ll in gr&auml;nsen i f&auml;ltet <b>Antal skadade sektorer</b>. Statusen f&ouml;r h&aring;rddisken &auml;ndras till <b>Varning</b> n&auml;r antalet skadade sektorer n&aring;r upp till det v&auml;rde som specificerats h&auml;r.</li>
	<li>Klicka p&aring; <b>Till&auml;mpa</b>.</li>
</ol>

<h4>Att aktivera varning f&ouml;r diskens livsl&auml;ngd*: </h4>
<ol>
	<li>G&aring; till fliken <b>Allm&auml;nt</b>.</li>
	<li>Bocka f&ouml;r <b>Aktivera varning f&ouml;r diskens livsl&auml;ngd</b>. Som standard &auml;r denna funktion aktiverad.</li>
	<li>St&auml;ll in gr&auml;nsen f&ouml;r f&auml;ltet <b>Livsl&auml;ngd i procent (%)</b>. Statusen f&ouml;r en SSD kommer att &auml;ndras till <b>Varning</b> n&auml;r den f&ouml;rv&auml;ntade livsl&auml;ngden &auml;r l&auml;gre &auml;n det v&auml;rde som specificerats h&auml;r nedanf&ouml;r.</li>
	<li>Klicka p&aring; <b>Till&auml;mpa</b>.</li>
</ol>

<div class="section">
<h4>Obs:</h4>
<ul>
<li>Varning f&ouml;r diskens livsl&auml;ngd har bara st&ouml;d p&aring; SSD:er.</li>
<li>V&auml;rdet f&ouml;r diskens livsl&auml;ngd &auml;r direkt genererat fr&aring;n S.M.A.R.T.-information. Om disken inte har st&ouml;d f&ouml;r det h&auml;r S.M.A.R.T.-attributet st&ouml;ds inte den h&auml;r funktionen.</li>
</ul>
</div>

<h4>Att utf&ouml;ra Prestandatest*:</h4>
<ol>
	<li>G&aring; till fliken <b>HDD/SSD</b>.</li>
	<li>V&auml;lj en disk och klicka p&aring; <b>Prestandatest</b>.</li>
	<li>I f&ouml;nstret som visas, klicka p&aring; <b>K&ouml;r test nu</b> f&ouml;r att starta prestandatestet. Resultaten visas h&auml;r n&auml;r testet &auml;r avslutat.</li>
	<li>F&ouml;r att j&auml;mf&ouml;ra resultatet med tidigare test, klicka p&aring; <b>V&auml;lj</b> i f&auml;ltet <b>J&auml;mf&ouml;rda test</b> f&ouml;r att v&auml;lja den &ouml;nskade loggfilen.</li>
</ol>

<div class="section">
<h4>Obs:</h4>
<ul>
	<li>Sekventiell datakapacitet, slumpvis IOPS och f&ouml;rdr&ouml;jning ing&aring;r i prestandatestet, vilket tar ungef&auml;r 18 minuter.</li>
	<li>Det finns tv&aring; typer av test: <b>grundl&auml;ggande</b> och <b>ut&ouml;kat</b>.
	<ul>
		<li>F&ouml;r diskar som anv&auml;nds med RAID kan du bara utf&ouml;ra grundl&auml;ggande tester och data p&aring; de diskarna p&aring;verkas inte. Du kan dock testa skrivprestandan f&ouml;r h&aring;rdiskar som anv&auml;nds till RAID.</li>
		<li>I &ouml;vriga fall kan ut&ouml;kade tester utf&ouml;ras f&ouml;r att f&ouml;rb&auml;ttra noggrannhet. Dock kan inte prestandatest garantera dataintegritet. Var d&auml;rf&ouml;r noga med att kontrollera att det inte finns n&aring;gra viktiga data p&aring; diskarna innan Prestandatest utf&ouml;rs.</li>
	</ul>
    </li>
	<li>F&ouml;r att s&auml;kerst&auml;lla systemets tillg&auml;nglighet kan du inte utf&ouml;ra test p&aring; fler &auml;n tre diskar p&aring; samma g&aring;ng, eller n&auml;r det bara finns en disk. Dessutom, n&auml;r diskanv&auml;ndningen &ouml;verskrider 5% ber systemet dig att fr&aring;ga igen innan du forts&auml;tter med prestandatestet, f&ouml;r att s&auml;kerst&auml;lla testets noggrannhet.</li>
	<li>Resultaten f&ouml;r Prestandatestet kan j&auml;mf&ouml;ras med tidigare test. N&auml;r skillnaden &auml;r st&ouml;rre &auml;n 5% blir du uppm&auml;rksammad p&aring; detta.</li>
    <li>Prestandatest av disk k&ouml;rs med l&aring;g prioritet p&aring; DSM f&ouml;r att s&auml;kerst&auml;lla minimal p&aring;verkan p&aring; andra tj&auml;nster under tiden det k&ouml;rs. De siffror som presenteras kan skilja sig &aring;t beroende p&aring; systembelastningen och konfiguration. Dessa siffror b&ouml;r endast anv&auml;ndas som referenser f&ouml;r att uppskatta diskens funktionalitet och &auml;r inte avsedda att j&auml;mf&ouml;ras mellan olika modeller eller DSM-versioner.</li>
</ul>
</div>


<h4>F&ouml;r att utf&ouml;ra Secure Erase:</h4>
<ol>
<li>G&aring; till fliken <b>HDD/SSD</b>.</li>
<li>V&auml;lj en disk och klicka p&aring; <b>Secure Erase</b>.</li>
</ol>


<div class="section">
<h4>Obs:</h4>
<ul>
<li>Secure Erase kan inte utf&ouml;ras p&aring; diskar i ut&ouml;kningsenheter.</li>
<li>Secure Erase kommer permanent att utpl&aring;na all data som lagras p&aring; din disk. V&auml;nligen s&auml;kerst&auml;ll att den valda disken inte anv&auml;nds och att data har s&auml;kerhetskopierats innan detta g&ouml;rs.</li>
<li>N&auml;r systemet utf&ouml;r Secure Erase kommer den valda disken att tempor&auml;rt l&aring;sas och sedan automatiskt l&aring;sas upp n&auml;r &aring;tg&auml;rden &auml;r slutf&ouml;rd.</li>
<li>Om Secure Erase stoppas p&aring; ett felaktigt s&auml;tt under &aring;tg&auml;rden kan du k&ouml;ra Secure Erase igen, direkt i anv&auml;ndargr&auml;nssnittet. Om diskarna &auml;r borttagna eller anv&auml;nds n&aring;gon annanstans n&auml;r de fortfarande &auml;r l&aring;sta, v&auml;nligen ange l&ouml;senordet &rdquo;synology&rdquo; f&ouml;r att l&aring;sa upp enheterna.</li>
</ul>
</div>

<h4>Att uppdatera S.M.A.R.T. Databas:</h4>
<p>S.M.A.R.T. Databasen inneh&aring;ller information i relation till s&auml;ker driftstemperatur och namnen p&aring; S.M.A.R.T.-f&auml;lten f&ouml;r en disk. Databasen uppdateras periodvis och uppdateras automatiskt efter att en disk bytts ut. &Aring;tg&auml;rden ska endast utf&ouml;ras n&auml;r en regelbunden eller automatisk uppdatering av databasen misslyckas.</p>

<ol>
<li>G&aring; till fliken <strong>Allm&auml;nt</strong>.</li>
<li>Rulla ned till avsnittet <strong>S.M.A.R.T. Databas</strong>.</li>
<li>Klicka p&aring; <strong>Uppdatera nu</strong>.</li>
</ol>

<div class="section">
<h4>Obs:</h4>
<ul>
<li>S.M.A.R.T. Databasen kan bara uppdateras en g&aring;ng per 24 timmar.</li>
<li>S.M.A.R.T. Databasen uppdateras automatiskt n&auml;r en ny disk s&auml;tts in i din Synology NAS.</li>
<li>Uppdatering av S.M.A.R.T. Databasen p&aring;verkar inte eller f&ouml;rb&auml;ttrar diskens kompatibilitet och prestanda.</li>
<li>V&auml;nligen utf&ouml;r den h&auml;r &aring;tg&auml;rden bara n&auml;r flera v&auml;rden i S.M.A.R.T. Info &auml;r oidentifierade eller n&auml;r Synology supportteam rekommenderar att du g&ouml;r detta.</li>
</ul>
</div>


	<h3>Aktivera st&ouml;d f&ouml;r skrivcache f&ouml;r HDD</h3>
	<p>Aktivering av st&ouml;d f&ouml;r skrivcache f&ouml;rb&auml;ttrar prestanda f&ouml;r din Synology NAS. Endast vissa HDD-modeller har st&ouml;d f&ouml;r denna funktion. F&ouml;r att s&auml;kerst&auml;lla dataskyddet vid anv&auml;ndning av st&ouml;d f&ouml;r skrivcache rekommenderas anv&auml;ndning av en UPS-enhet. Vi rekommenderar ocks&aring; att st&auml;nga av systemet ordentligt efter varje anv&auml;ndning. Att avaktivera skrivcache minskar risken f&ouml;r dataf&ouml;rlust som orsakas av onormala str&ouml;mavbrott men systemprestandan minskar.</p>

	<h4>Att aktivera st&ouml;d f&ouml;r skrivcache: </h4>
	<ol>
		<li>G&aring; till fliken <b>Cache-hantering</b>.</li>
		<li>Markera <b>Aktivera skrivcache</b>. Som standard &auml;r denna funktion aktiverad.</li>
		<li>Klicka p&aring; <b>Till&auml;mpa</b>.</li>
	</ol>


    
    
<p>____<br>* Endast tillg&auml;ngligt f&ouml;r vissa modeller. </p>

</body>
</html>
