<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Hot Spare*</h2>
<p>Hot Spare-diskar &auml;r h&aring;rddiskar som st&aring;r standby och kan reparera en trasig volym/diskgrupp/iSCSI LUN genom att automatiskt ers&auml;tta en trasig disk. Hot spare-diskar kan tilldelas globalt f&ouml;r att skydda valfri volym/diskgrupp/iSCSI LUN p&aring; din Synology NAS s&aring; l&auml;nge som f&ouml;ljande villkor uppfylls av volym/diskgrupp/iSCSI LUN:</p>
<ul>
	<li>RAID-typ f&ouml;r volym/diskgrupp/iSCSI LUN m&aring;ste ha dataskydd (dvs. RAID 1, RAID 5, RAID 6, RAID 10<span class="enable-grantley">, RAID F1</span>).</li>
	<li>Hot spare-diskens storlek m&aring;ste vara lika stor eller st&ouml;rre &auml;n den minsta h&aring;rddiskens storlek f&ouml;r volym/diskgrupp/iSCSI LUN.</li>
</ul>

<h4>Installera hot spare-h&aring;rddiskar:</h4>
<ol>
<li>Klicka p&aring; <strong>Hantera</strong>.</li>
<li>En dialog visas med hot spare-status f&ouml;r varje volym/diskgrupp/iSCSI LUN s&aring;v&auml;l som tillg&auml;ngliga h&aring;rddiskar. Status f&ouml;r volym/diskgrupp/iSCSI LUN inkluderar f&ouml;ljande:</li>
<ul>
<li><strong>Tilldelad:</strong> Volym/diskgrupp/iSCSI LUN &auml;r skyddad av minst en tilldelad hot spare-disk.</li>
<li><strong>Tillg&auml;ngligt:</strong> Det finns tillg&auml;ngliga h&aring;rddiskar som kan skydda volym/diskgrupp/iSCSI LUN men ingen hot spare har tilldelats &auml;nnu.</li>
<li><strong>Ej tillg&auml;nglig:</strong> Det finns inte n&aring;gra tillg&auml;ngliga hot spare-diskar som kan skydda volym/diskgrupp/iSCSI LUN.</li>
</ul>
<li>Avsnittet f&ouml;r <strong>Tillg&auml;ngliga h&aring;rddiskar</strong> visar h&aring;rddiskar som kan tilldelas som hot spare-diskar. F&ouml;r att tilldela hot spare-diskar, markera kryssrutan vid disken du &ouml;nskar tilldela som hot spare.</li>
<li>Klicka p&aring; <strong>Till&auml;mpa</strong> f&ouml;r att spara inst&auml;llningarna.</li>
</ol>
<div class="section">
<h4>Obs:</h4> 
<ul>
<li>N&auml;r en h&aring;rddisk tilldelas som hot spare-disk blir all data p&aring; disken raderad. F&ouml;re tilldelning av en hot spare-h&aring;rddisk ska du f&ouml;rs&auml;kra att h&aring;rddisken inte inneh&aring;ller n&aring;gon viktiga data.</li>
<li>En RAID som &auml;r sammansatt av HDD:er repareras inte automatiskt av SSD-hot spare-diskar och tv&auml;rtom.</li>
</ul>
</div>

<h4>Att konfigurera inst&auml;llningar f&ouml;r hot spare f&ouml;r volymer/diskgrupper/iSCSI LUN:</h4>
<ol>
<li>Klicka p&aring; <strong>Konfigurera</strong>.</li>
<li>P&aring; fliken <strong>Hot Spare-m&aring;l</strong> listas volymer/diskgrupper/iSCSI LUNs som kan skyddas av hot spare-diskar. Om du tar bort markeringarna i rutorna repareras inte motsvarande volymer/diskgrupper/iSCSI LUNs av hot spare-diskar n&auml;r de &auml;r trasiga.</li>
<li>P&aring; fliken <strong>Hot Spare mellan enheter</strong> kan du till&aring;ta hot spare-diskar p&aring; en enhet att reparera en trasig RAID som finns p&aring; en annan enhet.</li>
<li>Klicka p&aring; <strong>OK</strong> f&ouml;r att spara inst&auml;llningarna.</li>
</ol>



<p>____<br />* Endast tillg&auml;ngligt f&ouml;r vissa modeller.</p>

</body>
</html>
