<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Volym</h2>
<p>Volymer &auml;r enkla lagringsutrymmen som anv&auml;ndaren kan skapa delade mappar, iSCSI LUN (vanlig fil), spara data eller installera filpaket p&aring;. Innan du skapar n&aring;gra volymer ska du f&ouml;rvissa att du redan har skapat en RAID Group. F&ouml;r mer information om RAID Groups, se <a href="raid.html">RAID Group</a>.
</p>

<h4>Skapa en volym:</h4>
<ol>
	<li>F&ouml;rs&auml;kra dig om att din Synology NAS har en befintlig RAID Group med allokerbart utrymme.</li>
	<li>Klicka p&aring; knappen <strong>Skapa</strong>.</li>
	<li>V&auml;lj en RAID Group f&ouml;r att skapa volymen p&aring;.</li>
	<li>&Auml;ndra &ouml;nskade inst&auml;llningar.</li>
	<li>St&auml;ll in storleksf&ouml;rdelningen f&ouml;r volymen. (Inst&auml;llning av storleksf&ouml;rdelningen &auml;r inte tillg&auml;ngligt f&ouml;r volymer som skapats p&aring; RAID Group f&ouml;r en enskild volym eller iSCSI LUN).</li>
    <li>V&auml;lj om tiden f&ouml;r &aring;tkomst av fil ska registreras:</li>
	  <ul>
      <li>Aktivering av alternativet <strong>Registrera tid f&ouml;r &aring;tkomst av fil</strong> &auml;r motsvarande att anv&auml;nda alternativet relatime f&ouml;r montering p&aring; Linux-system. Tiden f&ouml;r &aring;tkomst av fil uppdateras bara n&auml;r den senaste tiden f&ouml;r &aring;tkomst (atid) &auml;r innan nuvarande tid f&ouml;r &auml;ndring (mtid) eller &auml;ndrad tid (ctid). Tid f&ouml;r &aring;tkomst uppdateras om tiden f&ouml;r senast &aring;tkomst har passerat en dag.</li>
      <li>Avaktivering av alternativet <strong>Registrera tid f&ouml;r &aring;tkomst av fil</strong> &auml;r motsvarande att anv&auml;nda alternativet noatime f&ouml;r montering p&aring; Linux-system. Tiden f&ouml;r &aring;tkomst f&ouml;r filer eller mappar uppdateras inte, vilket f&aring;r minskad anv&auml;ndning av filsystem som resultat. V&auml;nligen observera att vissa applikationer kan vara beroende av tid f&ouml;r &aring;tkomst av fil f&ouml;r att fungera ordentligt.</li>
      </ul>
    <li>Klicka p&aring; knappen <strong>Till&auml;mpa</strong> f&ouml;r att bekr&auml;fta inst&auml;llningarna.</li>


</ol>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>Den maximala volymstorleken som kan allokeras &auml;r 200 TB.</li>
	<li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Den minsta storleken som allokeras till en Btrfs-volym m&aring;ste vara minst 10 GB.</li>
    <li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Btrfs-volymer reserverar 4% mer plats f&ouml;r metadata.</li>
</ul>
</div>

<h4>Radera en volym:</h4>
<ol>
	<li>V&auml;lj den volym som du vill ta bort.</li>
	<li>Klicka p&aring; knappen <strong>Radera</strong> och f&ouml;lj guiden f&ouml;r att avsluta processen.</li>
</ol>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>Borttagning av en volym raderar all befintlig data p&aring; den volymen.</li>
</ul>
</div>

<h4>Framtvinga montering av en volym:</h4>
<p>Om cache p&aring; en volym saknas kommer systemet inte att montera volymen vid uppstart. Om cache inte &auml;r &aring;terst&auml;llbart och du vill f&aring; &aring;tkomst till volymen kan du klicka p&aring; <strong>Framtvinga montering</strong>. </p>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>Denna funktion &auml;r bara tillg&auml;nglig p&aring; vissa modeller.</li>
</ul>
</div>

<h4>Reparera en volym:</h4>
<p>Om volymstatus visar <strong>Trasig</strong>, g&aring; till fliken <strong>RAID Group</strong> och lokalisera l&auml;mplig RAID Group. F&ouml;lj sedan f&ouml;reslagna anvisningar f&ouml;r att reparera den.</p>

<h4>Expandera storlek f&ouml;r en volym</h4>
<ul>
	<li>F&ouml;r volymer som skapats p&aring; RAID Group f&ouml;r flera volymer eller iSCSI LUNs (blockniv&aring;). 
		<ol>
			<li>V&auml;lj den volym som du vill ut&ouml;ka.</li>
			<li>Klicka p&aring; <strong>Redigera</strong>.</li>
			<li>Ange ny storlek och klicka p&aring; <strong>OK</strong> f&ouml;r att ut&ouml;ka.</li>
		</ol>
	</li>
	<li>F&ouml;r volymer som skapats p&aring; RAID Group f&ouml;r en enskild volym eller iSCSI LUN (blockniv&aring;), se avsnittet <strong>F&ouml;r att ut&ouml;ka en RAID Groups storlek</strong> p&aring; en <a href="raid.html">RAID Group</a>. Volymstorleken ut&ouml;kas efter att underliggande&nbsp;RAID Group&nbsp;har expanderat.</li>
</ul>

<h3>SSD TRIM</h3>
<p>Om en volym best&aring;r endast av SSD:er (Solid State Drives), rekommenderar vi aktivering av SSD TRIM. Den h&auml;r funktionen f&ouml;rb&auml;ttrar l&auml;s- och skrivprestandan f&ouml;r volymer som skapats p&aring; SSD:er, vilket &ouml;kar effektiviteten och &auml;ven f&ouml;rl&auml;nger livsl&auml;ngden p&aring; dina SSD:er.</p>

<h4>Aktivera SSD TRIM:</h4>
<ol>
	<li>&Ouml;ppna <strong>Lagringshanterare</strong> och g&aring; till <strong>Volym</strong>.</li>
	<li>V&auml;lj en volym som helt och h&aring;llet best&aring;r av SSD:er och klicka sedan p&aring; knappen <strong>Konfigurera</strong>.</li>
	<li>I f&ouml;nstret som visas, g&aring; till fliken <strong>SSD TRIM</strong> och markera rutan <strong>Aktivera TRIM</strong>.</li>
	<li>Klicka p&aring; knappen <strong>L&auml;gg till schema</strong> f&ouml;r att v&auml;lja n&auml;r systemet ska utf&ouml;ra SSD TRIM.</li>
	<li>Klicka p&aring; <strong>OK</strong>.</li>
</ol>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>SSD TRIM &auml;r endast tillg&auml;ngligt p&aring; vissa modeller av Synology NAS och typer av RAID. </li>
	<li>En del SSD-modeller kan inte utf&ouml;ra SSD TRIM p&aring; volymer med RAID 5<span class="enable-grantley"></span> <span class="disable-grantley">och </span>RAID 6<span class="enable-grantley"> och RAID F1</span>. V&auml;nligen se kompabilitetslistan p&aring; den <a href="https://www.synology.com/" target="_blank">officiella webbplatsen</a> f&ouml;r Synology.</li>
	<li>SSD TRIM kan i f&ouml;ljande situationer inte aktiveras:
		<ul>
			<li>Volymen &auml;r monterad med SSD-cache.</li>
			<li>Filpaketet <strong>Time Backup</strong> &auml;r installerat.</li>
		</ul>
	</li>
	<li>SSD TRIM kan inte aktiveras p&aring; Blockniv&aring; iSCSI LUNs.</li>
	<li>Systemets prestanda kan p&aring;verkas vid utf&ouml;rande av SSD TRIM. Tiden det tar att utf&ouml;ra TRIM beror p&aring; volymens storlek och modell p&aring; SSD.</li>
	<li>N&auml;r TRIM &auml;r aktiverad p&aring; en volym, kommer den ocks&aring; att bli aktiverad p&aring; andra volymer som skapas p&aring; samma diskgrupp eller RAID Group.</li>
</ul>
</div>


<h3>Skrubbning av filsystem*</h3>
<p>Skrubbning av filsystem &auml;r en funktion f&ouml;r dataunderh&aring;ll som inspekterar volymer. Om n&aring;gra data som inte st&auml;mmer &ouml;verens med checksumman uppt&auml;cks blir fils&ouml;kv&auml;gen registrerad i Loggcentralen och det rekommenderas att du anv&auml;nder en s&auml;kerhetskopia f&ouml;r att reparera data.</p>

<p>Vi rekommenderar att dataskrubbning av filsystem utf&ouml;rs regelbundet, f&ouml;r att s&auml;kerst&auml;lla data&ouml;verensst&auml;mmelse.</p>

<h4>Att utf&ouml;ra skrubbning av filsystem:</h4>
<ol>
	<li>&Ouml;ppna <strong>Lagringshanterare</strong> och g&aring; till <strong>Volym</strong>.</li>
	<li>V&auml;lj den volym p&aring; vilken du vill utf&ouml;ra skrubbning av filsystem.</li>
	<li>Klicka p&aring; <strong>Hantera</strong>.</li>
	<li>V&auml;lj <strong>Skrubbning av filsystem</strong>.</li>
</ol>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>Skrubbning av filsystem kan endast utf&ouml;ras p&aring; volymer som har filsystemet <strong>Btrfs</strong>.</li>
	<li>Skrubbning av filsystem kan bara utf&ouml;ras n&auml;r status f&ouml;r volymen &auml;r <strong>Normal</strong>.</li>
	<li>St&auml;ng inte av systemet innan skrubbning av filsystem &auml;r slutf&ouml;rd. Om systemet st&auml;ngs av innan slutf&ouml;rande, m&aring;ste du manuellt starta om skrubbningen av filsystem fr&aring;n b&ouml;rjan.</li>
</ul>
</div>

<h3>Defragmentering av filsystem*</h3>
<p>Om dina data konstant &auml;ndras &ouml;kar m&auml;ngden fragmenterade filer i filsystemet, vilket resulterar i l&aring;ngsam prestanda f&ouml;r &aring;tkomst av filer p&aring; h&aring;rddiskarna. Att utf&ouml;ra defragmentering av filsystem kan f&ouml;rb&auml;ttra prestandan.</p>

<h4>Att utf&ouml;ra defragmentering av filsystem:</h4>
<ol>
	<li>&Ouml;ppna <strong>Lagringshanterare</strong> och g&aring; till <strong>Volym</strong>.</li>
	<li>V&auml;lj den volym p&aring; vilken du vill utf&ouml;ra defragmentering av filsystem.</li>
	<li>Klicka p&aring; <strong>Hantera</strong>.</li>
	<li>V&auml;lj <strong>Defragmentering av filsystem</strong>.</li>
</ol>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>Defragmentering av filsystem kan endast utf&ouml;ras p&aring; volymer som har filsystemet <strong>Btrfs</strong>.</li>
	<li>Defragmentering av filsystem kan bara utf&ouml;ras n&auml;r status f&ouml;r volymen &auml;r <strong>Normal</strong>.</li>
	<li>St&auml;ng inte av systemet innan defragmentering av filsystem &auml;r slutf&ouml;rd. Om systemet st&auml;ngs av innan slutf&ouml;rande, m&aring;ste du manuellt starta om defragmenteringen av filsystem fr&aring;n b&ouml;rjan.</li>
	<li>Volymanv&auml;ndning kan &ouml;ka om volymen inneh&aring;ller snapshots eller delade mappar.</li>
</ul>
</div>

<p>____<br />* Endast tillg&auml;ngligt f&ouml;r vissa modeller.</p>

</body>
</html>