<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>RAID Group*</h2>

<p>Med Synology NAS kan du kombinera flera h&aring;rddiskar till en enskild lagringsenhet kallad en RAID Group. Volymer eller iSCSI LUNs (Blockniv&aring;) kan skapas ut&ouml;ver RAID Groups. Volymer eller iSCSI LUNs kan ut&ouml;kas om en RAID Group har allokerbart utrymme. Olika RAID-typer erbjuder varierande niv&aring; av dataskydd. F&ouml;r en allm&auml;n lista &ouml;ver RAID-typer som st&ouml;ds av din Synology NAS, se <a href="general.html">Allm&auml;nt</a>.</p>

<h4>F&ouml;r att skapa en ny RAID Group:</h4>
<ol>
	<li>Klicka p&aring; knappen <strong>Skapa</strong>.</li>
	<li>V&auml;lj n&aring;got av f&ouml;ljande alternativ: 
		<ul>
			<li>RAID Group f&ouml;r en enskild volym eller iSCSI LUN (blockniv&aring;): Ger b&auml;ttre prestanda.</li>
			<li>RAID Group f&ouml;r flera volymer eller iSCSI LUNs (blockniv&aring;): Ger b&auml;ttre hanteringsflexibilitet.</li>
		</ul>
	</li>
	<li>F&ouml;lj guiden f&ouml;r att slutf&ouml;ra processen.</li>
</ol>

<div class="section"><h4>Obs: </h4>
<ul>
	<li>En RAID Group m&aring;ste inneh&aring;lla h&aring;rddiskar av samma h&aring;rddisk-typ. Du kan inte anv&auml;nda h&aring;rddiskar med SATA och SAS samtidigt och inte heller SSD och HDD samtidigt f&ouml;r att skapa RAID.</li>
	<li>En RAID Group f&ouml;r flera volymer eller iSCSI LUNs (blockniv&aring;) som anv&auml;nder <strong>RAID 5</strong><span class="enable-grantley"></span> <span class="disable-grantley">eller </span><strong>RAID 6</strong><span class="enable-grantley"> eller <strong>RAID F1</strong></span> kan inneh&aring;lla flera <strong>RAID Arrays</strong>. Varje RAID Array som tillh&ouml;r samma RAID Group blir samma RAID-typ (t.ex. RAID 5<span class="enable-grantley"></span> <span class="disable-grantley">eller </span>RAID 6<span class="enable-grantley"> eller RAID F1</span>). H&ouml;gsta antal h&aring;rddiskar f&ouml;r varje RAID Array &auml;r 6, 12 eller 24. Du kan st&auml;lla in maximalt antal diskar n&auml;r du skapar RAID Group och det antalet kan inte &auml;ndras senare. N&auml;r en RAID Array har tilldelats, med maximalt antal diskar, s&aring; kan n&auml;sta h&aring;rddisk, som l&auml;ggs till en RAID Group, tilldelas till en ny RAID Array. Den nya RAID Arrayen m&aring;ste inneh&aring;lla det l&auml;gsta antalet diskar som kr&auml;vs f&ouml;r den specifika RAID-typen (dvs. tre diskar f&ouml;r RAID 5<span class="enable-grantley"> och RAID F1</span> och fyra h&aring;rddiskar f&ouml;r RAID 6).</li>
	<li>Om du vill skapa en RAID Group med en viss h&aring;rddisk och denna inte visas i <strong>guiden Skapa RAID Group</strong> kan du kontrollera h&aring;rddiskens status i <strong>HDD-hantering</strong>.</li>
</ul>
</div>

<h4>F&ouml;r att ta bort en RAID Group:</h4>
<ol>
	<li>V&auml;lj den RAID Group du vill ta bort.</li>
	<li>Klicka p&aring; knappen <strong>Radera</strong> och f&ouml;lj guiden f&ouml;r att avsluta processen.</li>
</ol>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>Volymer och iSCSI LUNs p&aring; RAID Group kommer att tas bort n&auml;r du tar bort aktuell RAID Group. F&ouml;rvissa att inga viktiga data tas bort.</li>
</ul>
</div>

<h4>F&ouml;r att reparera en RAID Group:</h4>
<p>En RAID Group med statusen <strong>Trasig</strong> kan repareras om denna RAID Group &auml;r en av f&ouml;ljande typer: RAID 1, RAID 5, RAID 6 <span class="disable-grantley">och </span>RAID 10<span class="enable-grantley"> och RAID F1</span>. Befintlig data p&aring; denna RAID Group kommer inte att tas bort.</p>

<p>F&ouml;lj nedanst&aring;ende steg f&ouml;r att reparera din RAID Group:</p>
<ol>
	<li>St&auml;ng av din Synology NAS. (Du kan hoppa &ouml;ver detta steg om din modell st&ouml;der byte under k&ouml;rning.)</li>
	<li>Ers&auml;tt den felaktiga h&aring;rddisken som visas i Diskinfo, som du hittar i RAID Group-statusen.</li>
	<li>Klicka p&aring; <strong>Hantera</strong>.</li>
	<li>V&auml;lj <strong>Reparera</strong>.</li>
	<li>F&ouml;lj guiden f&ouml;r att slutf&ouml;ra processen.</li>
</ol>
        
<div class="section"><h4>Obs:</h4>
<ul>
	<li>H&aring;rddiskens storlek f&ouml;r ers&auml;ttning m&aring;ste vara lika stor eller st&ouml;rre &auml;n den minsta h&aring;rddisken i aktuell RAID Group.</li>
	<li>H&aring;rddiskens status f&ouml;r ers&auml;ttning m&aring;ste vara &rdquo;Initierad&rdquo; eller &rdquo;Ej initierad&rdquo;.</li>
</ul>
</div>

<h4>F&ouml;r att &auml;ndra RAID-typ p&aring; en RAID Group</h4>
<p>F&ouml;r att &auml;ndra RAID-typ p&aring; en RAID Group m&aring;ste det finnas tillg&auml;ngliga h&aring;rddiskar installerade p&aring; din Synology NAS. Numera erbjuds f&ouml;ljande RAID-utbytesfunktioner:</p>
<ul>
	<li>Grundl&auml;ggande till RAID 1 eller RAID 5</li>
	<li>RAID 1 till RAID 5</li>
	<li>RAID 5 till RAID 6</li>
	<li>L&auml;gg till spegelh&aring;rddisk till RAID 1</li>
</ul>

<p>F&ouml;lj stegen nedan f&ouml;r att &auml;ndra RAID-typ p&aring; din RAID Group:</p>
<ol>
	<li>V&auml;lj den RAID Group du vill ta &auml;ndra.</li>
	<li>Klicka p&aring; <strong>Hantera</strong>.</li>
	<li>V&auml;lj <strong>&Auml;ndra RAID-typ</strong>.</li>
	<li>F&ouml;lj guiden f&ouml;r att slutf&ouml;ra processen.</li>
</ol>

<div class="section"><h4>Obs: </h4>
<ul>
	<li>Status f&ouml;r en RAID Group m&aring;ste vara <strong>Normal</strong> innan dess typ av RAID kan &auml;ndras. Annars kommer data att f&ouml;rloras. Om status f&ouml;r RAID Group &auml;r <strong>Trasig</strong>, v&auml;nligen reparera den f&ouml;rst.</li>
	<li>F&ouml;r att &auml;ndra RAID-typ f&ouml;r RAID Group m&aring;ste tillr&auml;ckligt m&aring;nga h&aring;rddiskar vara installerade p&aring; din Synology NAS, och den nya h&aring;rddiskens storlek m&aring;ste vara st&ouml;rre &auml;n den minsta h&aring;rddisken i samma&nbsp;RAID Group.</li>
	<li>Statusen f&ouml;r den nya h&aring;rddisken m&aring;ste vara &quot;Initierat&quot; eller &quot;Ej initierat&quot;.</li>
	<li>RAID-typ f&ouml;r RAID Group med flera RAID Arrays kan inte &auml;ndras.</li>
</ul>
</div>

<h4>Ut&ouml;ka storlek p&aring; RAID Group</h4>
<p>Storleken p&aring; RAID Groups kan ut&ouml;kas genom att ers&auml;tta befintliga h&aring;rddiskar med st&ouml;rre h&aring;rddiskar eller genom att l&auml;gga till h&aring;rddiskar.</p>

<div class="section"><h4>Obs: </h4>
<ul>
	<li>F&ouml;r att expandera en RAID Group med h&aring;rddiskar som &auml;r 3 TB stora, eller st&ouml;rre, v&auml;nligen tillse att din RAID Group skapades med DSM 3.0 eller senare.</li>
</ul>
</div>

<h4>F&ouml;r att ut&ouml;ka en RAID Group genom att ers&auml;tta befintliga h&aring;rddiskar med st&ouml;rre h&aring;rddiskar:</h4>
<p>Du kan ut&ouml;ka en RAID Group genom att ers&auml;tta befintliga h&aring;rddiskar med st&ouml;rre h&aring;rddiskar i f&ouml;ljande RAID-typer: RAID 1, RAID 5 <span class="disable-grantley">och </span>RAID 6<span class="enable-grantley"> och RAID F1</span>. Associerade volymer eller iSCSI LUN p&aring; RAID Group f&ouml;r en enskild volym eller iSCSI LUN expanderas automatiskt. F&ouml;lj stegen&nbsp;nedan:</p>
<ol>
	<li>St&auml;ng av din Synology NAS. Du kan hoppa &ouml;ver detta steg om din modell st&ouml;der byte under k&ouml;rning.</li>
	<li>Byt ut en h&aring;rddisk mot en st&ouml;rre.</li>
	<li>Sl&aring; p&aring; Synology NAS och reparera RAID Group.</li>
	<li>Upprepa steg 1 till 3 tills alla h&aring;rddiskar har bytts ut mot st&ouml;rre h&aring;rddiskar.</li>
	<li>Systemet kommer att expandera din RAID Group automatiskt.</li>
</ol>

<div class="section"><h4>Obs: </h4>
<ul>
	<li>Alla tj&auml;nster p&aring; Lagringshanterare kommer tillf&auml;lligt att stoppas under utvidgningsprocessen.</li> 
	<li>Du kan bara ut&ouml;ka h&aring;rddisken n&auml;r status f&ouml;r RAID Group &auml;r <strong>Normal</strong>, annars g&aring;r data f&ouml;rlorade. Om status f&ouml;r RAID Group &auml;r <strong>Trasig</strong>, v&auml;nligen reparera den f&ouml;rst.</li>
</ul>
</div>

<h4>Du kan ut&ouml;ka en RAID Group genom att l&auml;gga till h&aring;rddiskar:</h4>
<p>Den h&auml;r funktionen g&aring;r att anv&auml;nda med RAID-typerna JBOD, RAID 5 <span class="disable-grantley">och </span>RAID 6<span class="enable-grantley"> och RAID F1</span>. F&ouml;r att g&ouml;ra detta:</p>
<ol>
	<li>V&auml;lj den RAID Group du vill ut&ouml;ka.</li>
	<li>Klicka p&aring; <strong>Hantera</strong>.</li>
	<li>V&auml;lj <strong>L&auml;gg till disk</strong>.</li>
	<li>F&ouml;lj guiden f&ouml;r att slutf&ouml;ra installationen.</li>
</ol>

<div class="section"><h4>Obs: </h4>
<ul>
	<li>Status f&ouml;r RAID Group m&aring;ste vara <strong>Normal</strong>.</li>
	<li>F&ouml;r RAID Group-typerna RAID 5<span class="enable-grantley"></span> <span class="disable-grantley">och </span>RAID 6<span class="enable-grantley"> och RAID F1</span> m&aring;ste h&aring;rddiskens storlek vara st&ouml;rre &auml;n den minsta h&aring;rddisken i samma RAID Group.</li>
	<li>Den markerade h&aring;rddiskens status m&aring;ste vara &quot;Initierad&quot; eller &quot;Ej initierad&quot;.</li>
</ul>
</div>

<h4>F&ouml;r att redigera RAID Group-beskrivningen:</h4>
<ol>
	<li>V&auml;lj den RAID Group du vill redigera</li>
	<li>Klicka p&aring; <strong>Hantera</strong>.</li>
	<li>V&auml;lj <strong>Redigera beskrivning</strong>.</li>
	<li>Redigera beskrivning och klicka p&aring; <strong>OK</strong> f&ouml;r att spara resultatet.</li>
</ol>

<h3>RAID-skrubbning</h3>
<p>RAID-skrubbning &auml;r en dataunderh&aring;llsfunktion som inspekterar RAID Groups och reparerar alla icke &ouml;verensst&auml;mmande data som uppt&auml;cks. Denna funktion kan anv&auml;ndas med RAID Groups som har implementerat RAID 5<span class="enable-grantley"></span> <span class="disable-grantley">eller </span>RAID 6<span class="enable-grantley"> eller RAID F1</span>.</p>

<p>Vi rekommenderar att regelbundet utf&ouml;ra RAID-skrubbning f&ouml;r att uppr&auml;tth&aring;lla data&ouml;verensst&auml;mmelse och undvika att f&ouml;rlora n&aring;gra kritiska data i h&auml;ndelse av diskfel.</p>

<h4>Att utf&ouml;ra RAID-skrubbning:</h4>
<ol>
	<li>V&auml;lj den RAID Group p&aring; vilken RAID-skrubbning ska utf&ouml;ras.</li>
	<li>Klicka p&aring; <strong>Hantera</strong></li>
	<li>V&auml;lj <strong>RAID-skrubbning</strong>.</li>
</ol>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>RAID-skrubbning kan bara utf&ouml;ras n&auml;r status f&ouml;r RAID Group &auml;r <strong>Normal</strong>.</li>
	<li>St&auml;ng inte av systemet innan RAID-skrubbningen &auml;r slutf&ouml;rd. Om systemet st&auml;ngs av innan slutf&ouml;rande, m&aring;ste RAID-skrubbningen startas om fr&aring;n b&ouml;rjan.</li>
</ul>
</div>
    
<p>____<br />* Endast tillg&auml;ngligt f&ouml;r vissa modeller.</p>

</body>
</html>