<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>L&auml;gg till en disk f&ouml;r att ut&ouml;ka lagringskapaciteten</h2>

<p>Om det finns tomma diskfack i din Synology NAS kan du installera ytterligare diskar och l&auml;gga till dem till en befintlig volym eller diskgrupp. Den h&auml;r artikeln tillhandah&aring;ller instruktioner f&ouml;r att ut&ouml;ka en befintlig volym eller diskgrupp genom att installera ytterligare diskar.</p>

<h3>Innan du b&ouml;rjar</h3>

<p>Innan du b&ouml;rjar, tillse att diskarna du vill l&auml;gga till uppfyller f&ouml;ljande krav p&aring; storlek:</p>
<ul>
	<li><strong>F&ouml;r SHR:</strong> Kapaciteten p&aring; den disk du vill l&auml;gga till m&aring;ste vara st&ouml;rre eller lika stor &auml;n den st&ouml;rsta disken i volymen eller diskgruppen eller vara likadan som alla diskarna i volymen eller diskgruppen. Till exempel, om din SHR-volym &auml;r sammansatt av tre diskar som &auml;r 2 TB, 1,5 TB och 1 TB var f&ouml;r sig, m&aring;ste kapaciteten p&aring; din nya disk vara minst 2 TB eller motsvara 1,5 TB eller 1 TB.</li>
	<li><strong>For RAID 5<span class="enable-grantley"></span> <span class="disable-grantley">och </span>RAID 6<span class="enable-grantley"> och RAID F1</span>:</strong> Kapaciteten p&aring; den disk du vill l&auml;gga till m&aring;ste vara st&ouml;rre eller lika stor &auml;n den minsta disken i volymen eller diskgruppen. Till exempel om dina volymer &auml;r sammansatta av tre diskar som &auml;r 2 TB, 1,5 TB och 1 TB var f&ouml;r sig, m&aring;ste kapaciteten p&aring; din nya disk vara minst 1 TB.</li>
</ul>

<div class="section"><h4>Kontrollera volymstatus</h4>
<p>Tillse att statusen f&ouml;r din volym eller diskgrupp &auml;r <strong>Normal</strong>. Om inte, m&aring;ste du f&ouml;rst reparera den.</p>
</div>

<h3>L&auml;gga till en disk till en Volym eller Diskgrupp</h3>
<p>H&aring;rddiskar kan l&auml;ggas till f&ouml;ljande RAID-typer: </p>
<ul>
	<li>Synology Hybrid RAID (SHR)</li>
	<li>JBOD</li>
	<li>RAID 5</li>
	<li>RAID 6</li>
</ul>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>F&ouml;r SHR-volymer expanderas lagringskapaciteten bara n&auml;r diskar l&auml;ggs till en volym med tv&aring; eller fler diskar.</li>
</ul>
</div>

<h4>Att l&auml;gga till en disk till en volym eller diskgrupp:</h4>

<ol>
	<li>St&auml;ng av din Synology NAS. (Du kan hoppa &ouml;ver detta steg om din Synology NAS st&ouml;der snabbv&auml;xling.)</li>
	<li>S&auml;tt in en ny disk i ett tomt diskfack.</li>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>F&ouml;r att f&ouml;rhindra att du skadar dig sj&auml;lv eller din Synology NAS, v&auml;nligen f&ouml;lj instruktionerna f&ouml;r diskinstallation som finns i <em>H&aring;rdvaruinstallationsguide</em> f&ouml;r din Synology-produkt.</li>
</ul>
</div>

<li>Starta din Synology NAS.</li>
	<li>Logga in p&aring; DSM med ett konto som h&ouml;r till gruppen <strong>administrators</strong>.</li>
	<li>&Ouml;ppna <strong>Lagringshanterare</strong>.<br /><img src="about:blank" class="help_image" /></li>
	<li>Vid denna punkt, v&auml;nligen g&ouml;r f&ouml;ljande:
		<ul>
			<li>Om du expanderar en enkel volym, g&aring; till fliken <strong>Volym</strong>. V&auml;lj den volym du vill expandera. Klicka p&aring; <strong>Hantera</strong> och forts&auml;tt till n&auml;sta steg.<br /><img src="about:blank" class="help_image" /></li>
			<li>Om du expanderar en diskgrupp, g&aring; till fliken <strong>Diskgrupp</strong>. V&auml;lj den diskgrupp du vill ut&ouml;ka. Klicka p&aring; <strong>Hantera</strong> och forts&auml;tt till n&auml;sta steg.<br /><img src="about:blank" class="help_image" /></li>
		</ul>
	</li>
	<li>V&auml;lj <strong>Ut&ouml;ka volymen (eller diskgruppen) genom att l&auml;gga till h&aring;rddiskar</strong>. Klicka sedan p&aring; <strong>N&auml;sta</strong>.<br /><img src="about:blank" class="help_image" /></li>
	<li>V&auml;lj de diskar med vilka du vill ut&ouml;ka volymen eller diskgruppen. Du kan l&auml;gga till diskar genom att markera motsvarande kryssrutor. Klicka sedan p&aring; <strong>N&auml;sta</strong>.<br /><img src="about:blank" class="help_image" /></li>
	<li>F&ouml;lj stegen i guiden f&ouml;r att slutf&ouml;ra.</li>
</ol>

</body>
</html>