<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>SSD TRIM - Synology DSM hj&auml;lp</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="SSD TRIM improves the read and write performance of volumes created on SSDs, increasing efficiency as well as extending the lifetime of your SSDs.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SSD TRIM</h2>
<p>Om en volym best&aring;r endast av SSD:er (Solid State Drives), rekommenderar vi aktivering av SSD TRIM. Denna funktion f&ouml;rb&auml;ttrar l&auml;s- och skrivprestandan p&aring; volymer som skapats p&aring; SSD:er, vilket &ouml;kar effektiviteten s&aring;v&auml;l som f&ouml;rl&auml;nger livsl&auml;ngden p&aring; dina SSD:er.</p>
<h4>Aktivera SSD TRIM:</h4>
<ol>
  <li>&Ouml;ppna <strong>Lagringshanterare</strong> och g&aring; till <strong>Volym</strong>. </li>
  <li>V&auml;lj en volym som helt och h&aring;llet best&aring;r av SSD:er och klicka sedan p&aring; knappen <b>Konfigurera</b>.</li>
  <li>I f&ouml;nstret som visas, g&aring; till fliken <b>SSD TRIM</b> och markera rutan <strong>Aktivera TRIM</strong>.</li>
  <li>Klicka p&aring; knappen <strong>L&auml;gg till schema</strong> f&ouml;r att v&auml;lja n&auml;r systemet ska utf&ouml;ra SSD TRIM.</li>
  <li>Klicka p&aring; <strong>OK</strong>.</li>
</ol>
<div class="section">
  <h4>Obs:</h4>
  <ul>
    <li>SSD TRIM &auml;r endast tillg&auml;ngligt p&aring; vissa modeller av Synology NAS och typer av RAID. </li>
    <li>En del modeller av SSD kan inte utf&ouml;ra SSD TRIM p&aring; volymer med RAID 5 eller RAID 6. V&auml;nligen se kompabilitetslistan p&aring; <a href="http://www.synology.com/" target=_blank>www.synology.com</a>.</li>
    <li>SSD TRIM kan i f&ouml;ljande situationer inte aktiveras:
      <ul>
        <li>Volymen &auml;r monterad med SSD-cache.</li>
        <li>Filpaketet <strong>Time Backup</strong> &auml;r installerat.</li>
      </ul>
    </li>
    <li>SSD TRIM kan inte aktiveras p&aring; Blockniv&aring; iSCSI LUNs.</li>
    <li>Systemets prestanda kan p&aring;verkas vid utf&ouml;rande av SSD TRIM. Tiden det tar att utf&ouml;ra TRIM beror p&aring; volymens storlek och modell p&aring; SSD.</li>
    <li>N&auml;r TRIM &auml;r aktiverad p&aring; en volym, kommer den ocks&aring; att bli aktiverad p&aring; andra volymer som skapas p&aring; samma diskgrupp eller RAID Group.</li>
  </ul>
</div>
</body>
</html>
