<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Skapa en Volym - Synology DSM Hj&auml;lp</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article walks you through the steps to create a volume on Synology NAS using Storage Manager.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Skapa en Volym</h2>

<p>Denna artikel f&ouml;rklarar hur att skapa en volym p&aring; din Synology NAS. N&auml;r du skapar en ny volym kan du v&auml;lja en av f&ouml;ljande metoder:</p>

<ul>
  <li><b>Snabb:</b> Detta &auml;r det b&auml;sta alternativet f&ouml;r nyb&ouml;rjare. V&auml;lj denna metod om du automatiskt vill optimera lagringskapacitet och prestanda utan att bekymra dig om tekniska aspekter, s&aring;som RAID-niv&aring;er. </li>

<li><b>Anpassat:</b> F&ouml;r avancerade anv&auml;ndare som mer i detalj vill kontrollera aspekterna av att skapa volymen, s&aring;som RAID-typer och allokering av kapacitet. Detta alternativ st&ouml;der olika RAID-typer, l&aring;ter dig skapa enkla eller flera volymer och tillhandah&aring;ller alternativ att allokera specifika m&auml;ngder av kapacitet f&ouml;r varje volym (endast n&auml;r flera volymer skapas p&aring; RAID).
</li>
</ul>

<div class="section">
<h4>Enkla eller flera volymer p&aring; RAID?</h4>
<p>N&auml;r du skapar en volym i anpassat l&auml;ge kan du v&auml;lja en av f&ouml;ljande metoder:</p>
<ul>
  <li><b>Enkel volym p&aring; RAID</b>
    <ul>
      <li>Skapar en enkel volym som anv&auml;nder all tillg&auml;nglig kapacitet hos de valda h&aring;rddiskarna.</li>
      <li>Ger b&auml;ttre hastighet och prestanda.</li>
      <li>Har st&ouml;d f&ouml;r olika RAID-typer.</li>
    </ul>
  </li>
  <li><b>Flera volymer p&aring; RAID</b>
    <ul>
      <li>L&aring;ter dig skapa flera volymer p&aring; en diskgrupp.</li>
      <li>Har st&ouml;d f&ouml;r att allokera exakt m&auml;ngd kapacitet f&ouml;r varje volym.</li>
      <li>Ger &ouml;kad flexibilitet g&auml;llande lagringshantering.</li>
      <li>Har st&ouml;d f&ouml;r olika RAID-typer.</li>
    </ul>
  </li>
</ul>
</div>


<div class="section">
<h4>Innan du b&ouml;rjar:</h4>
<ul>
<li>Innan du b&ouml;rjar, s&auml;kerst&auml;ll att det inte finns n&aring;gon viktig data p&aring; h&aring;rddiskarna. All befintlig data kommer att tas bort under processen f&ouml;r skapandet.</li>
<li>G&aring; till sidan <b>HDD/SSD</b> och s&auml;kerst&auml;ll att statusen f&ouml;r varje h&aring;rddisk &auml;r <b>Normal</b> eller <strong>Ej initierat</strong>.</li>
</ul>
</div>

<div class="section enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">
<h4>Obs:</h4>
<ul>
<li>Den minsta storleken f&ouml;r en Btrfs-volym &auml;r 10GB.</li>
<li>Btrfs-volymer reserverar 4% mer plats f&ouml;r metadata.</li>
</ul>
</div>

<h4>Skapa en volym:</h4>
<ol>
<li>&Ouml;ppna <b>Lagringshanterare</b>.</li>
<img src="about:blank" class="help_image"/>
<li>G&aring; till <b>Volym</b> och klicka p&aring; <b>Skapa</b>.</li>
<img src="about:blank" class="help_image"/>


<li>Du kommer att se guiden f&ouml;r att skapa volym. V&auml;lj <strong>Snabb</strong> eller <strong>Anpassad</strong>, beroende p&aring; dina behov.</li>
<li>&Auml;ndra &ouml;nskade inst&auml;llningar.</li>
<li>V&auml;lj om tiden f&ouml;r &aring;tkomst av fil ska registreras:</li>
	  <ul>
      <li>Aktivering av alternativet <strong>Registrera tid f&ouml;r &aring;tkomst av fil</strong> &auml;r motsvarande att anv&auml;nda alternativet relatime f&ouml;r montering p&aring; Linux-system. Tiden f&ouml;r &aring;tkomst av fil uppdateras bara n&auml;r den senaste tiden f&ouml;r &aring;tkomst (atid) &auml;r innan nuvarande tid f&ouml;r &auml;ndring (mtid) eller &auml;ndrad tid (ctid). Tid f&ouml;r &aring;tkomst uppdateras om tiden f&ouml;r senast &aring;tkomst har passerat en dag.</li>
      <li>Avaktivering av alternativet <strong>Registrera tid f&ouml;r &aring;tkomst av fil</strong> &auml;r motsvarande att anv&auml;nda alternativet noatime f&ouml;r montering p&aring; Linux-system. Tiden f&ouml;r &aring;tkomst f&ouml;r filer eller mappar uppdateras inte, vilket f&aring;r minskad anv&auml;ndning av filsystem som resultat. V&auml;nligen observera att vissa applikationer kan vara beroende av tid f&ouml;r &aring;tkomst av fil f&ouml;r att fungera ordentligt.</li>
      </ul>
   <li>Klicka p&aring; knappen <strong>Till&auml;mpa</strong> f&ouml;r att bekr&auml;fta inst&auml;llningarna.</li>


<img src="about:blank" class="help_image"/>
</ol>

</body>
</html>
