<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Možnosti</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="leaf_user"></a>&Uacute;čet</h2>

<p>Karta &Uacute;čet nab&iacute;z&iacute; možnosti pro &uacute;pravu z&aacute;kladn&iacute;ch nastaven&iacute; &uacute;čtu, např&iacute;klad popisu, hesla, e-mailu a dvouf&aacute;zov&eacute;ho ověřen&iacute;. Tuto kartu je možn&eacute; zobrazit kliknut&iacute;m na ikonu ve tvaru lidsk&eacute; postavy v&nbsp;prav&eacute;m horn&iacute;m rohu plochy a volbou <strong>Vlastn&iacute;</strong>.</p>



<h3>&Uacute;prava nastaven&iacute; &uacute;čtu</h3>

<p>Upravit je možn&eacute; tato nastaven&iacute; &uacute;čtu:</p>
<ul>
<li><strong>Popis:</strong> Zadejte popis sv&eacute;ho &uacute;čtu. Uživatelsk&yacute; popis může obsahovat maxim&aacute;lně 64&nbsp;zobraziteln&yacute;ch znaků Unicode.</li>
<li><strong>Nov&eacute; heslo:</strong> Pokud chcete změnit heslo &uacute;čtu, zadejte nov&eacute; heslo a&nbsp;potvrďte ho v&nbsp;n&iacute;že uveden&eacute;m poli <strong>Potvrdit heslo</strong>. V&nbsp;heslech se rozli&scaron;uj&iacute; mal&aacute; a&nbsp;velk&aacute; p&iacute;smena a hesla mohou obsahovat maxim&aacute;lně 127&nbsp;zobraziteln&yacute;ch znaků včetně p&iacute;smen, č&iacute;sel, symbolů a&nbsp;mezer.</li>
<li><strong>E-mail:</strong> Zadejte e-mailovou adresu (pouze pro uživatele, kteř&iacute; nejsou spr&aacute;vci).</li>
<li><strong>Jazyk zobrazen&iacute;:</strong> Zadejte jazyk zobrazen&iacute; &uacute;čtu. Jazyk zobrazen&iacute;, kter&yacute; zde zad&aacute;te, bude m&iacute;t přednost před jazykem zadan&yacute;m v&nbsp;č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>M&iacute;stn&iacute; nastaven&iacute;</b> &gt; <b>Jazyk</b>.</li>
<li><strong>Form&aacute;t data</strong>: Zadejte datum podle va&scaron;ich požadavků a podle geografick&eacute; polohy.</li>
<li><strong>Form&aacute;t času</strong>: Stanovte, jestli se m&aacute; čas zobrazovat ve 12 nebo 24hodinov&eacute;m form&aacute;tu.</li>
</ul>
<p>Po proveden&iacute; změny nastaven&iacute; &uacute;čtu uložte kliknut&iacute;m na tlač&iacute;tko <b>OK</b>.</p>


<h3>Dvouf&aacute;zov&eacute; ověřen&iacute;</h3>

<p>Dvouf&aacute;zov&eacute; ověřen&iacute; poskytuje lep&scaron;&iacute; zabezpečen&iacute; &uacute;čtu DSM. Pokud je dvouf&aacute;zov&eacute; ověřen&iacute; povoleno, budete muset při přihla&scaron;ov&aacute;n&iacute; do syst&eacute;mu DSM zadat kromě hesla tak&eacute; k&oacute;d pro jednor&aacute;zov&eacute; ověřen&iacute;. Ověřovac&iacute; k&oacute;dy z&iacute;sk&aacute;te z&nbsp;ověřovac&iacute; aplikace nainstalovan&eacute; ve va&scaron;em mobiln&iacute;m zař&iacute;zen&iacute;. Když bude tedy někdo cht&iacute;t z&iacute;skat př&iacute;stup k&nbsp;va&scaron;emu &uacute;čtu, bude potřebovat nejen va&scaron;e uživatelsk&eacute; jm&eacute;no a heslo, ale tak&eacute; va&scaron;e mobiln&iacute; zař&iacute;zen&iacute;.</p>

<div class="section">
<h4>Požadavky:</h4>
<p>Dvouf&aacute;zov&eacute; ověřen&iacute; vyžaduje mobiln&iacute; zař&iacute;zen&iacute; a ověřovac&iacute; aplikaci s&nbsp;podporou protokolu TOTP (Time-based One-Time Password). Mezi takov&eacute; ověřovac&iacute; aplikace patř&iacute; Google Authenticator (Android/iPhone/BlackBerry) nebo Authenticator (Windows Phone).</p>
</div>

<h4>Povolen&iacute; dvouf&aacute;zov&eacute;ho ověřen&iacute;:</h4>

<ol>
<li>Přejděte na kartu <strong>Vlastn&iacute;</strong> &gt; <strong>&Uacute;čet</strong> a za&scaron;krtnut&iacute;m pol&iacute;čka <strong>Povolit dvouf&aacute;zov&eacute; ověřen&iacute;</strong> spusťte průvodce nastaven&iacute;m dvouf&aacute;zov&eacute;ho ověřen&iacute;.</li>
<li>Na prvn&iacute; obrazovce zadejte e-mailovou adresu. Na tuto e-mailovou adresu lze v&nbsp;př&iacute;padě ztr&aacute;ty mobiln&iacute;ho zař&iacute;zen&iacute; zaslat nouzov&eacute; ověřovac&iacute; k&oacute;dy.</li>
<li>St&aacute;hněte a nainstalujte ověřovac&iacute; aplikaci, např&iacute;klad Google Authenticator (Android/iPhone/BlackBerry) nebo Authenticator (Windows Phone).</li>
<li>Na n&aacute;sleduj&iacute;c&iacute; obrazovce otevřete ověřovac&iacute; aplikaci a naskenujte k&oacute;d QR. Př&iacute;padně je možn&eacute; kliknout na odkaz a ručně zadat tajn&yacute; kl&iacute;č.</li>
<li>Va&scaron;e ověřovac&iacute; aplikace pot&eacute; vygeneruje 6m&iacute;stn&yacute; ověřovac&iacute; k&oacute;d. Zad&aacute;n&iacute;m tohoto k&oacute;du do textov&eacute;ho pole průvodce potvrd&iacute;te spr&aacute;vnost konfigurac&iacute;. Pokud dojde k&nbsp;chybě, zkontrolujte, jestli je syst&eacute;mov&yacute; čas va&scaron;eho mobiln&iacute;ho zař&iacute;zen&iacute; synchronizov&aacute;n se syst&eacute;mov&yacute;m časem syst&eacute;mu DSM. Ověřovac&iacute; k&oacute;dy se nav&iacute;c pravidelně aktualizuj&iacute;, takže ověřte, jestli platnost v&aacute;mi zadan&eacute;ho ověřovac&iacute;ho k&oacute;du nevypr&scaron;ela.</li>
<li>Po dokončen&iacute; průvodce nastaven&iacute;m uložte nastaven&iacute; kliknut&iacute;m na možnost <strong>OK</strong>.</li>
</ol>



<h4>Přihl&aacute;&scaron;en&iacute; do syst&eacute;mu DSM pomoc&iacute; dvouf&aacute;zov&eacute;ho ověřen&iacute;:</h4>

<p>Pokud je povolen&eacute; dvouf&aacute;zov&eacute; ověřen&iacute;, budete při přihl&aacute;&scaron;en&iacute; do syst&eacute;mu DSM vyzv&aacute;ni k&nbsp;zad&aacute;n&iacute; 6m&iacute;stn&eacute;ho ověřovac&iacute;ho k&oacute;du.</p>

<ol>
<li>Na přihla&scaron;ovac&iacute; obrazovce syst&eacute;mu DSM zadejte uživatelsk&eacute; jm&eacute;no a heslo jako obvykle.</li>
<li>Po zobrazen&iacute; v&yacute;zvy k&nbsp;zad&aacute;n&iacute; ověřovac&iacute;ho k&oacute;du otevřete ověřovac&iacute; aplikaci na mobiln&iacute;m zař&iacute;zen&iacute;.</li>
<li>Vyhledejte a zadejte 6m&iacute;stn&yacute; ověřovac&iacute; k&oacute;d pro svůj &uacute;čet. Pokud dojde ke ztr&aacute;tě va&scaron;eho mobiln&iacute;ho zař&iacute;zen&iacute;, je možn&eacute; kliknout na odkaz <b>Ztr&aacute;ta telefonu?</b> a na va&scaron;i e-mailovou adresu bude odesl&aacute;n nouzov&yacute; k&oacute;d.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li><strong>Nastaven&iacute; SMTP:</strong> Abyste mohli obdržet nouzov&eacute; k&oacute;dy prostřednictv&iacute;m e-mailu, mus&iacute; b&yacute;t odpov&iacute;daj&iacute;c&iacute;m způsobem nastaven server SMTP. Přejděte do č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>Upozorněn&iacute;</b> nebo <b>Osobn&iacute;</b> &gt; <b>E-mailov&yacute; &uacute;čet</b> a zkontrolujte spr&aacute;vnost nastaven&iacute;.</li>
<li><strong>Omezen&iacute; nouzov&eacute;ho k&oacute;du:</strong> Na každ&eacute;ho uživatele se vztahuje limit 5&nbsp;nouzov&yacute;ch k&oacute;dů. Pokud tento limit překroč&iacute;te, mus&iacute;te před dal&scaron;&iacute;m přij&iacute;m&aacute;n&iacute;m nouzov&yacute;ch k&oacute;dů dvouf&aacute;zov&eacute; ověřen&iacute; zak&aacute;zat a pot&eacute; znovu povolit.</li>
<li>Dvouf&aacute;zov&eacute; ověřen&iacute; lze vynutit v&nbsp;syst&eacute;mu DSM a ve v&scaron;ech souvisej&iacute;c&iacute;ch mobiln&iacute;ch aplikac&iacute;ch Synology (např&iacute;klad DSM mobile a DS file).</li>
<li style="display: none;">Dvouf&aacute;zov&eacute; ověřov&aacute;n&iacute; se vztahuje tak&eacute; na v&scaron;echny služby souvisej&iacute;c&iacute; s&nbsp;protokolem SSH, např&iacute;klad Termin&aacute;l SSH, SFTP a rsync s&nbsp;&scaron;ifrov&aacute;n&iacute;m přenosu SSH. Jelikož ale služby Hyper Backup a Shared Folder Sync využ&iacute;vaj&iacute;c&iacute; rsync s&nbsp;&scaron;ifrov&aacute;n&iacute;m přenosu SSH dvouf&aacute;zov&eacute; ověřen&iacute; nepodporuj&iacute;, nebudou tyto dvě služby po povolen&iacute; dvouf&aacute;zov&eacute;ho ověřen&iacute; spr&aacute;vně fungovat.</li>

</ul>
</div>


<h4>Obnoven&iacute; uživatelsk&yacute;ch nastaven&iacute; dvouf&aacute;zov&eacute;ho ověřen&iacute;:</h4>

<p>Uživatel&eacute; patř&iacute;c&iacute; do skupiny <strong>administrators</strong> mohou obnovit nastaven&iacute; dvouf&aacute;zov&eacute;ho ověřen&iacute; jin&yacute;ch uživatelů.<ol>
<li>Přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Uživatel</strong>.</li>
<li>Dvakr&aacute;t klikněte na uživatele, jehož dvouf&aacute;zov&eacute; ověřen&iacute; chcete resetovat.</li>
<li>Na kartě <strong>&Uacute;daje uživatele</strong> klikněte na tlač&iacute;tko <strong>Povolit dvouf&aacute;zov&eacute; ověřen&iacute;</strong>.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Pokud nen&iacute; dostupn&yacute; uživatel patř&iacute;c&iacute; do skupiny <strong>administrators</strong>, je možn&eacute; obnovit nastaven&iacute; syst&eacute;mu DSM a zak&aacute;zat dvouf&aacute;zov&eacute; ověřen&iacute; stisknut&iacute;m fyzick&eacute;ho tlač&iacute;tka Reset na zař&iacute;zen&iacute; Synology NAS.</li>
</ul>
</div>


<h3>Aktivita &uacute;čtu</h3>
<p>Aktivita &uacute;čtu zobrazuje aktivitu přihl&aacute;&scaron;en&iacute; &uacute;čtu DSM, včetně aktu&aacute;ln&iacute;ch připojen&iacute;, zapamatovan&yacute;ch zař&iacute;zen&iacute; a historie přihl&aacute;&scaron;en&iacute;.</p>


<h4>Kontrola aktivity &uacute;čtu:</h4>
<p>Klikněte na tlač&iacute;tko <strong>Aktivita &uacute;čtu</strong>. Zobraz&iacute; se m&iacute;stn&iacute; okno s&nbsp;n&aacute;sleduj&iacute;c&iacute;mi kartami:<ul>
<li><strong>Připojen&iacute; uživatel&eacute;:</strong> Na t&eacute;to kartě se zobrazuj&iacute; n&aacute;sleduj&iacute;c&iacute; informace:<ul>
<li><strong>Datum a čas:</strong> Čas př&iacute;stupu k&nbsp;&uacute;čtu.</li>
<li><strong>N&aacute;zev klienta a IP&nbsp;adresa:</strong> N&aacute;zev a IP&nbsp;adresa zař&iacute;zen&iacute;, kter&eacute; k&nbsp;&uacute;čtu přistupovalo. N&aacute;zev klienta se zobraz&iacute; pouze v&nbsp;př&iacute;padě, že se k&nbsp;&uacute;čtu přistupovalo prostřednictv&iacute;m protokolu CIFS.</li>
<li><strong>Služba:</strong> Protokol použit&yacute; pro př&iacute;stup k&nbsp;&uacute;čtu.</li>
<li><strong>Zdroj:</strong> Syst&eacute;mov&eacute; prostředky využ&iacute;van&eacute; &uacute;čtem.</li>
</ul></li>

<li><strong>Zapamatovan&aacute; zař&iacute;zen&iacute;:</strong> Na t&eacute;to kartě se zobrazuje str&aacute;nka spr&aacute;vy zapamatovan&yacute;ch zař&iacute;zen&iacute;:<ul>
<li><strong>Aktu&aacute;ln&iacute; zař&iacute;zen&iacute; nen&iacute; zapamatov&aacute;no / je zapamatov&aacute;no:</strong> Rozhodnete-li se aktu&aacute;ln&iacute; zař&iacute;zen&iacute; zapamatovat, klikněte na možnost <strong>Zapamatovat toto zař&iacute;zen&iacute;</strong>. Při přihl&aacute;&scaron;en&iacute; do syst&eacute;mu DSM se pak u&nbsp;tohoto zař&iacute;zen&iacute; dvouf&aacute;zov&eacute; ověřen&iacute; nebude vyžadovat.</li>

<li><strong>Zastavit zapamatov&aacute;n&iacute; dal&scaron;&iacute;ch zař&iacute;zen&iacute;:</strong> Můžete ukončit zapamatov&aacute;n&iacute; dal&scaron;&iacute;ch zař&iacute;zen&iacute; (např. dal&scaron;&iacute;ch poč&iacute;tačů nebo mobiln&iacute;ch zař&iacute;zen&iacute;), kter&aacute; byla zapamatov&aacute;na. To znamen&aacute;, že při přihl&aacute;&scaron;en&iacute; do syst&eacute;mu DSM na těchto zař&iacute;zen&iacute;ch se dvouf&aacute;zov&eacute; ověřen&iacute; bude vyžadovat.</li>
</ul></li>


<li><strong>Historie přihl&aacute;&scaron;en&iacute;:</strong> Na t&eacute;to kartě se zobrazuj&iacute; posledn&iacute; relace přihl&aacute;&scaron;en&iacute; a n&aacute;sleduj&iacute;c&iacute; informace:<ul>
<li><strong>Datum a čas:</strong> Čas př&iacute;stupu k&nbsp;&uacute;čtu.</li>
<li><strong>Ud&aacute;lost:</strong> Zobrazuje uživatelsk&eacute; jm&eacute;no a IP&nbsp;adresu.</li>
</ul>
</li>
</ul>


<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Zař&iacute;zen&iacute; označen&eacute; jako zapamatovan&eacute; si syst&eacute;m zapamatuje pouze v&nbsp;př&iacute;padě, když se přihl&aacute;s&iacute;te pomoc&iacute; stejn&eacute;ho &uacute;čtu a ze stejn&eacute;ho prohl&iacute;žeče. V&nbsp;n&aacute;sleduj&iacute;c&iacute;ch sc&eacute;n&aacute;ř&iacute;ch budete k&nbsp;zad&aacute;n&iacute; jednor&aacute;zov&eacute;ho hesla pro dvouf&aacute;zov&eacute; ověřen&iacute; vyzv&aacute;ni i&nbsp;v&nbsp;př&iacute;padě, že jste dan&eacute; zař&iacute;zen&iacute; předt&iacute;m označili za zapamatovan&eacute;:</p>
<ul>
<li>Přihl&aacute;s&iacute;te se pomoc&iacute; stejn&eacute;ho &uacute;čtu, ale na jin&eacute;m prohl&iacute;žeči.</li>
<li>Z&nbsp;prohl&iacute;žeče byly odstraněny soubory cookie.</li>
<li>Při přihl&aacute;&scaron;en&iacute; jako uživatel A označ&iacute;te zař&iacute;zen&iacute; za zapamatovan&eacute; a pot&eacute; označ&iacute;te za zapamatovan&eacute; stejn&eacute; zař&iacute;zen&iacute;, když se přihl&aacute;s&iacute;te jako uživatel B. Když se znovu přihl&aacute;s&iacute;te jako uživatel A, mus&iacute;te zadat heslo pro dvouf&aacute;zov&eacute; ověřen&iacute;.</li>
</ul>

</div>


</body>
</html>