<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>E-mailov&yacute; &uacute;čet &ndash; N&aacute;pověda Synology DSM</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>E-mailov&yacute; &uacute;čet</h2>

<p>V&nbsp;č&aacute;sti <b>Vlastn&iacute;</b> &gt; <b>E-mailov&yacute; &uacute;čet</b> můžete přidat svoje e-mailov&eacute; &uacute;čty a ze zde přidan&yacute;ch e-mailov&yacute;ch adres pos&iacute;lat soubory uložen&eacute; ve službě File Station jako př&iacute;lohy. D&aacute;le můžete svůj e-mailov&yacute; &uacute;čet přidat v&nbsp;nab&iacute;dce <b>Nastaven&iacute;</b> &gt; <b>E-mailov&yacute; &uacute;čet</b> služby Drive a Calendar. Po přid&aacute;n&iacute; &uacute;čtu můžete prostřednictv&iacute;m služby Calendar odes&iacute;lat pozv&aacute;n&iacute; na ud&aacute;losti a e-mailov&aacute; upozorněn&iacute; při sd&iacute;len&iacute; souborů ve službě Drive.</p>
<p>Mezi podporovan&eacute; poskytovatele e-mailov&yacute;ch služeb patř&iacute; Gmail, Outlook a přizpůsoben&yacute; server SMTP.</p>

<h4>Přid&aacute;n&iacute; e-mailov&eacute;ho &uacute;čtu:</h4>
<ol>
<li>Klikněte na možnost <b>Přidat</b> a vyberte poskytovatele služeb e-mailov&eacute;ho &uacute;čtu, kter&eacute;ho chcete nastavit.</li>
<li>Zadejte svou e-mailovou adresu, heslo a jm&eacute;no odes&iacute;latele.</li>

<li>M&aacute;te-li nastaveno v&iacute;ce &uacute;čtů a chcete, aby služby File Station, Calendar a Drive použ&iacute;valy určit&yacute; e-mailov&yacute; &uacute;čet jako v&yacute;choz&iacute;, za&scaron;krtněte pol&iacute;čko <b>Použ&iacute;t tento e-mailov&yacute; &uacute;čet jako v&yacute;choz&iacute;</b>.</li>

<li>Pokud v&aacute;&scaron; poskytovatel e-mailov&yacute;ch služeb (Gmail a Outlook) takovou funkci podporuje, můžete kliknut&iacute;m na možnost <b>Synchronizovat kontakty</b> synchronizovat svoje e-mailov&eacute; kontakty do zař&iacute;zen&iacute; Synology NAS. Kontakty se budou synchronizovat z&nbsp;e-mailov&eacute;ho &uacute;čtu zadan&eacute;ho v&nbsp;okně pro ověřen&iacute;, nikoli z&nbsp;&uacute;čtu, kter&yacute; jste zadali v&nbsp;předchoz&iacute;m kroku. Pokud je tedy v&nbsp;okně ověřen&iacute; zobrazen jin&yacute; nebo nezam&yacute;&scaron;len&yacute; &uacute;čet, přepněte &uacute;čet ručně na požadovan&yacute; e-mailov&yacute; &uacute;čet nebo na dř&iacute;ve zadan&yacute; e-mailov&yacute; &uacute;čet.</li>
<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na možnost <b>Použ&iacute;t</b>.</li>
</ol>
	
<h4>&Uacute;pravy e-mailov&eacute;ho &uacute;čtu:</h4>
<p>Vyberte ze seznamu požadovan&yacute; e-mailov&yacute; &uacute;čet a klikněte na možnost <b>Upravit</b>.</p>

<h4>Odstraněn&iacute; e-mailov&eacute;ho &uacute;čtu:</h4>
<p>Vyberte ze seznamu požadovan&yacute; e-mailov&yacute; &uacute;čet a klikněte na možnost <b>Odstranit</b>.</p>
<div class="section">
<h4>Pozn&aacute;mka:</h4>	
<ul>
<li>Pokud ž&aacute;dn&eacute; jin&eacute; &uacute;čty neexistuj&iacute;, nelze v&yacute;choz&iacute; &uacute;čet odstranit. Chcete-li odstranit &uacute;čet, kter&yacute; je aktu&aacute;lně nastaven jako v&yacute;choz&iacute;, změňte nejprve v&yacute;choz&iacute; &uacute;čet na jin&yacute;.</li>
</ul>
</div>

<h4>Změna v&yacute;choz&iacute;ho &uacute;čtu:</h4>
<p>Ze seznamu vyberte e-mailov&yacute; &uacute;čet, kter&yacute; chcete nastavit jako v&yacute;choz&iacute;, a pot&eacute; klikněte na možnost <b>Nastavit jako v&yacute;choz&iacute;</b>.</p>


<h4>Odes&iacute;l&aacute;n&iacute; souborů jako př&iacute;loh:</h4>
<ol>
<li>Klikněte prav&yacute;m tlač&iacute;tkem na libovoln&eacute; soubory ve službě File Station a vyberte př&iacute;kaz <b>Odeslat jako př&iacute;lohy e-mailu</b>.</li>
<li>Pokud jste přidali v&iacute;ce e-mailov&yacute;ch &uacute;čtů, je možn&eacute; při odesl&aacute;n&iacute; souborů stanoven&eacute;mu př&iacute;jemci vybrat v&nbsp;rozev&iacute;rac&iacute;m seznamu požadovanou e-mailovou adresu odes&iacute;latele.</li>
</ol>
</body>
</html>
