<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" charset="utf-8">
<title>Centrum protokolů</title>

<link href="../../../../help/help.css" type="text/css" rel="stylesheet" />
<link href="../../../../help/scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../../../help/scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../../../help/scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Nastaven&iacute; archivu</h2>

<p>Str&aacute;nka <strong>Nastaven&iacute; archivu</strong> poskytuje možnosti konfigurace, jak a kde se archivuj&iacute; protokoly přijat&eacute; Centrem protokolů. N&iacute;že uveden&eacute; možnosti se použ&iacute;vaj&iacute; ke stanoven&iacute; um&iacute;stěn&iacute; &uacute;loži&scaron;tě a pravidel automatick&eacute;ho vytv&aacute;řen&iacute; archivů protokolů.</p>


<h3>C&iacute;l ukl&aacute;d&aacute;n&iacute; archivů</h3>

<p>C&iacute;l se t&yacute;k&aacute; složky, kde se ukl&aacute;daj&iacute; a archivuj&iacute; protokoly přijat&eacute; Centrem protokolů. Kliknut&iacute;m na možnost <strong>Vybrat um&iacute;stěn&iacute;</strong> se vybere složka.</p>
<p>Jestliže chcete, aby se m&iacute;stn&iacute; protokoly zař&iacute;zen&iacute; Synology NAS archivovaly do stejn&eacute;ho c&iacute;le, za&scaron;krtněte pol&iacute;čko označen&eacute; <strong>M&iacute;stn&iacute; protokoly archivovat do um&iacute;stěn&iacute; &uacute;loži&scaron;tě stanoven&eacute;ho v&yacute;&scaron;e</strong>. Ve vět&scaron;ině př&iacute;padů se t&iacute;m poskytuje v&iacute;ce &uacute;ložn&eacute;ho prostoru pro m&iacute;stn&iacute; protokoly, což umožn&iacute; udržovat &uacute;plněj&scaron;&iacute; syst&eacute;mov&eacute; protokoly.</p><!--DSM#61793: Describe how logs are archived in data volume--><div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>M&iacute;stn&iacute; protokoly (protokoly syst&eacute;mu, připojen&iacute; a přenosu souborů) se ukl&aacute;daj&iacute; do syst&eacute;mov&eacute;ho odd&iacute;lu, kter&yacute; m&aacute; omezen&eacute; &uacute;loži&scaron;tě. Povolen&iacute;m možnosti <strong>M&iacute;stn&iacute; protokoly archivovat do um&iacute;stěn&iacute; &uacute;loži&scaron;tě stanoven&eacute;ho v&yacute;&scaron;e</strong> se budou v&scaron;echny protokoly archivovat do stanoven&eacute;ho c&iacute;le podle <strong>Pravidel archivu</strong>. Pokud chcete proch&aacute;zet archivovan&eacute; m&iacute;stn&iacute; protokoly, klikněte na možnost <strong>Otevř&iacute;t archiv protokolů</strong> a vyberte položku <strong>SYNOSYSLOGDB__LOCALARCH.DB</strong>.</p>
</div>


<h3>Pravidla archivu</h3>

<p>Protokoly se archivuj&iacute; automaticky podle krit&eacute;ri&iacute; definovan&yacute;ch v&nbsp;č&aacute;sti <strong>Pravidla archivu</strong>. Protokoly je možn&eacute; archivovat automaticky, jestliže velikost datab&aacute;ze protokolů dos&aacute;hne stanoven&eacute; velikost, počet jednotliv&yacute;ch protokolů dos&aacute;hne stanoven&eacute; hodnoty nebo protokoly dos&aacute;hnou stanoven&eacute;ho st&aacute;ř&iacute;.</p>
   
<P>Pokud jste nepovolili funkci archivace protokolu, bude předchoz&iacute; protokol odstraněn v&nbsp;okamžiku, kdy nahromaděn&yacute; počet protokolů překroč&iacute; maxim&aacute;ln&iacute; počet uchov&aacute;van&yacute;ch protokolů nastaven&yacute; v&nbsp;datab&aacute;zi protokolů. V&nbsp;n&aacute;sleduj&iacute;c&iacute; tabulce naleznete maxim&aacute;ln&iacute; počet uchov&aacute;van&yacute;ch protokolů pro jednotliv&eacute; protokoly.</P> 
    
<table>
     <tr>
      <th width="40%">Protokol</th>
      <th width="60%">Maxim&aacute;ln&iacute; počet uchov&aacute;van&yacute;ch protokolů</th>
     </tr>
     <tr>
      <td align="center"><strong>AFP</strong></td>
      <td align="center">20&nbsp;000</td>
     </tr>
     <tr>
      <td align="center"><strong>File Station</strong></td>
	  <td align="center">20&nbsp;000</td>
     </tr>
     <tr>
      <td align="center"><strong>FTP</strong></td>
	  <td align="center">20&nbsp;000</td>
     </tr>
     <tr>
      <td align="center"><strong>SMB</strong></td>
      <td align="center">100&nbsp;000</td>
     </tr>
     <tr>
      <td align="center"><strong>WebDAV</strong></td>
      <td align="center">20&nbsp;000</td>
     </tr>
    </table>    

<h3>Form&aacute;t archivu</h3>
<p>Tato č&aacute;st obsahuje n&aacute;sleduj&iacute;c&iacute; možnosti.</p>
<ul>
<li><strong>Archivovat protokoly kromě v&yacute;choz&iacute;ho i&nbsp;v&nbsp;textov&eacute;m form&aacute;tu:</strong> Ulož&iacute; archivy nejen jako v&yacute;choz&iacute; soubory SQLite, ale i&nbsp;jako soubory prost&eacute;ho textu.</li>
<li><strong>Komprimovat archivy protokolů:</strong> Ulož&iacute; archivy protokolů jako komprimovan&eacute; soubory ve form&aacute;tu ZIP.</li>
<li><strong>Archivovat protokoly samostatně podle zař&iacute;zen&iacute;:</strong> Ukl&aacute;d&aacute; samostatn&eacute; archivy pro jednotliv&aacute; klientsk&aacute; zař&iacute;zen&iacute;, kter&aacute; odes&iacute;laj&iacute; protokoly na zař&iacute;zen&iacute; Synology NAS.</li>
</ul>

</body>
