<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Cloud Station kullanarak PC/Mac'imdeki verileri yedekleme</title>
</head>

<body class="tutorial-content-box" >

<h1>Cloud Station kullanarak PC/Mac'imdeki verileri yedekleme</h1>
<div class="tutorials_content">
<img src="../../images/Backup/1x/backup_from_PC/07_1_back_up_your_data_from_pc.png" />
<h2>Genel Bakış</h2>
<p>Cloud Station Server sadece sofistike bir platformlar arası senkronizasyon yazılımı değil, kullanıcılar onu kişisel bilgisayarlarını yedeklemenin daha akıllı bir y&ouml;ntemi olarak da kullanabilirler. Ger&ccedil;ek zamanlı bir yedekleme &ccedil;&ouml;z&uuml;m&uuml; olan Cloud Station Backup, anlık ve bant genişliği tasarruflu olup, tek bir dosyanın 32 ge&ccedil;miş s&uuml;r&uuml;m&uuml;ne kadar daha iyi koruma sağlar.</p>
<h3 class="list_head">Cloud Station Server'ın Synology NAS &uuml;zerinde kurulması</h3>
<ol>

<li><b>Paket Merkezi</b>'ne gidin, <b>Cloud Station Server</b>'i bulun ve ardından&nbsp;<strong>Kur</strong>'a tıklayın.</li>
 
<li><strong>Cloud Station Server</strong>'ı başlatın.</li>
<li><strong>Genel Bakış</strong>'a gidin ve <strong>Şimdi İndir</strong>'e <strong>Cloud Station Backup</strong> altında tıklayın. (Cloud Station Backup'ı <a href="https://www.synology.com/en-us/support/download" target="_blank">Synology İndirme Merkezi</a>'nden de indirebilirsiniz.)</li>
<img src="../../images/Backup/1x/backup_from_PC/download_backup.png" border="1" />
<li>Y&uuml;kleyiciyi bilgisayarınızda başlatarak Cloud Station Backup y&uuml;kleme talimatlarını takip edin. </li>
<li>Y&uuml;klemeden sonra <strong>Cloud Station Backup</strong>'ı bilgisayarınızda &ccedil;alıştırın. <strong>Şimdi Başlat</strong>'a tıklayın.</li>
<img src="../../images/Backup/1x/backup_from_PC/start_now.png" border="1" />
<li>Cloud Station Server &ccedil;alıştıran Synology NAS'ın adresini (veya QuickConnect ID'sini), kullanıcı adını ve parolayı girin. (Ayrıca sağ taraftaki arama simgesine de tıklayabilirsiniz; Cloud Station Backup otomatik olarak LAN dahilindeki diğer Synology NAS sunucuları arayacaktır). <strong>İleri</strong>'ye tıklayın.</li>
<img src="../../images/Backup/1x/backup_from_PC/enter_credentials.png" border="1" />
<li>Yedekleme kaynağınızı se&ccedil;in ve senkronize etmek istemediğiniz alt klas&ouml;rlerin işaretini kaldırın. </li>
<img src="../../images/Backup/1x/backup_from_PC/backup_settings_source.png" border="1" />
<li><strong>Se&ccedil;</strong>'e tıklayarak Synology NAS'ınızda bir klas&ouml;r se&ccedil;in. Cloud Station Backup se&ccedil;tiğiniz hedefte bilgisayar adınızla bir yedekleme klas&ouml;r&uuml; oluşturacaktır. <strong>home</strong> klas&ouml;r&uuml; varsayılan olarak hedef klas&ouml;r&uuml;n&uuml;z olarak se&ccedil;ilecektir. Liste &uuml;zerinde bulunmayan bir klas&ouml;r&uuml; kullanmak isterseniz, l&uuml;tfen sistem y&ouml;neticinize başvurun. Sistem y&ouml;neticileri <strong>Cloud Station Server paylaşımını y&ouml;net</strong> &ouml;zelliğine <a href="https://www.synology.com/en-global/knowledgebase/DSM/help/CloudStation/cloudstation" target="_blank">Cloud Station Server yardım</a> b&ouml;l&uuml;m&uuml;nde başvurabilirler.</li>
<img src="../../images/Backup/1x/backup_from_PC/backup_destination.png" border="1" />
<li>Senkronizasyon filtreleri veya kuralları oluşturmak isterseniz, <strong>Yedekleme kuralları</strong>'na tıklayın.</li>

<li>Yedekleme ayarlarınızı g&ouml;zden ge&ccedil;irmek i&ccedil;in <strong>İleri</strong>'ye tıklayın ve ardından <strong>Bitti</strong>'ye tıklayın.</li>
<img src="../../images/Backup/1x/backup_from_PC/summary.png" border="1" />
<li>Ana uygulamada yedekleme s&uuml;recinizi g&ouml;r&uuml;nt&uuml;leyebilirsiniz.</li>
<img src="../../images/Backup/1x/backup_from_PC/progress.png" border="1" />
</ol>

<h3 class="list_head">Senkronizasyonlu bir dosyanın &ouml;nceki bir s&uuml;r&uuml;m&uuml;n&uuml; Cloud Station Server'dan indirme veya geri y&uuml;kleme</h3>
<ol>
  <li><strong>Cloud Station Server </strong>&gt; <strong>S&uuml;r&uuml;m Ge&ccedil;mişi</strong>'ne gidin ve geri y&uuml;klemek istediğiniz dosya veya klas&ouml;r&uuml; bulun.</li>
  <img src="../../images/BuildCloud/1x/cloud_sync_files/version_history.png" border="1" />
  <li>Almak istediğiniz dosyayı se&ccedil;in ve <strong>Eylem</strong>'e tıklayın. <strong>&Ouml;nceki s&uuml;r&uuml;mlere g&ouml;zat</strong>'a tıklayın. Eğer bir dosya bilgisayarınızdan yanlışlıkla silinmişse veya kaldırılmışsa, geri y&uuml;klemek i&ccedil;in <strong>Geri Y&uuml;kle</strong>'ye tıklayabilirsiniz. </li>
  <img src="../../images/BuildCloud/1x/cloud_sync_files/browse_previous versions_server.png" border="1" />
<li>İndirmek istediğiniz dosyanın s&uuml;r&uuml;m&uuml;n&uuml; se&ccedil;erek <strong>İndir</strong>'e tıklayın. Ya da se&ccedil;ili s&uuml;r&uuml;m&uuml;n geri y&uuml;klenmesini istediğinizden eminseniz <strong>Geri Y&uuml;kle</strong>'ye tıklayın, ge&ccedil;erli s&uuml;r&uuml;m&uuml;n&uuml;z&uuml;n &uuml;zerine yazılır.</li>
    <img src="../../images/BuildCloud/1x/cloud_sync_files/previous_versions.png" border="1" />

</ol>


  <h3 class="list_head">5. Verilerinizin daha fazla korunması</h3>
  
<p>Verilerinizi korumaya ve yedeklemeye dair daha fazla y&ouml;ntem i&ccedil;in DSM'de sunulan diğer yedekleme hizmetleri hakkında ayrıntılı eğitimleri g&ouml;rmek amacıyla <a href="https://www.synology.com/knowledgebase/tutorials#BackupRestore" target="_blank">buraya</a> tıklayın.</p>

</div>
<div class="page-info">
  <ul>
    <li>Bu konudaki sonraki: <a href="backup_backup.html">Synology NAS sunucusundaki verilerinizi yedekleyin</a> </li>
  </ul>
</div>
</body>

</html>