<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Instalacja lub zakup pakiet&oacute;w &mdash; pomoc Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Package Center lets you download, install, and launch packages on your Synology NAS with a few simple clicks.">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Instalacja lub zakup pakiet&oacute;w</h2>

<p>Centrum pakiet&oacute;w zawiera r&oacute;żnego rodzaju aplikacje www, kt&oacute;re pozwalają rozszerzyć funkcjonalność urządzenia Synology NAS. Centrum pakiet&oacute;w umożliwia pobieranie, instalowanie i uruchamianie pakiet&oacute;w za pomocą kilku prostych kliknięć.</p>
<p>W poniższym artykule opisano proces instalowania pakiet&oacute;w w urządzeniu Synology NAS przy użyciu Centrum pakiet&oacute;w. Informacje dotyczące poszczeg&oacute;lnych pakiet&oacute;w można znaleźć <a href="http://www.synology.com/en-global/dsm/app_packages" target="_blank">tutaj</a>.</p>

<h4>Aby zainstalować lub zakupić pakiety:</h4>

<ol>

<li>Otw&oacute;rz aplikację <strong>Centrum pakiet&oacute;w</strong>.</li><img src="about:blank" class="help_image"/><li>Wybierz stronę <strong>Wszystkie pakiety</strong>, aby wyświetlić wszystkie dostępne pakiety.</li><img src="about:blank" class="help_image"/><div class="section">
<h4>Uwaga:</h4>
<ul>
	<li>Jeśli nie można znaleźć poszukiwanego pakietu, może on wymagać nowszej wersji DSM lub być dostępny wyłącznie dla modeli o określonych wymaganiach sprzętowych. Aby uzyskać dodatkowe informacje, skontaktuj się z producentem tego pakietu.</li>

</ul>
</div>
<li>Znajdź pakiety, kt&oacute;ry chcesz zainstalować, a następnie kliknij <strong>Zainstaluj</strong>. (W przypadku płatnych pakiet&oacute;w kliknij <strong>Kup</strong> lub <strong>Wypr&oacute;buj</strong>, aby połączyć się z kontem Synology, a następnie zakup pakiet przy użyciu karty kredytowej lub użyj wersji pr&oacute;bnej w celu dokonania oceny).</li><img src="about:blank" class="help_image"/><li>Po pomyślnym zainstalowaniu pakietu powinien on być widoczny w <strong>Menu gł&oacute;wnym</strong>.</li><img src="about:blank" class="help_image"/></ol>

<div class="section">
<h4>Zakup pakiet&oacute;w:</h4>
<p>Przed zakupem pakiet&oacute;w zapoznaj się z poniższymi uwagami.</p>

<ul>
	<li>Zarejestruj <a href="https://account.synology.com/register" target="_blank">Konto Synology</a>, aby uzyskać dostęp do innych funkcji, takich jak informacje przed zakupem oraz historia zakup&oacute;w. Podane informacje są wykorzystywane wyłącznie do usprawnienia obsługi w przyszłości.</li>
<li>Pakiety są domyślnie denominowane w dolarach amerykańskich. Po zalogowaniu się do konta Synology ceny będą wyświetlane w walucie zgodnej z ustawieniami użytkownika.</li>
</ul>
</div>

<div class="section">
<h4>Wyłączenie odpowiedzialności za przeliczanie walut:</h4>
<p>W przypadku transakcji obejmujących przeliczanie walut wydawca karty kredytowej/debetowej może nakładać dodatkowe opłaty, kt&oacute;re nie są odzwierciedlone w wyświetlanej cenie. Wszelkie zakupy mogą podlegać opłatom za przeliczenie walut lub opłatom międzynarodowym nakładanym przez wydawcę karty. Wydawca karty nalicza opłaty, za kt&oacute;re firma Synology nie zapewnia zwrotu koszt&oacute;w. Aby uzyskać dodatkowe informacje, skontaktuj się z wydawcą karty kredytowej/debetowej.</p></div>


<h4>Aby ręcznie zainstalować pakiety:</h4>
<ol>
<li>Aby zainstalować pakiet przez przesłanie pliku .spk (dostępnego w <a href="http://www.synology.com/support/download.php" target="_blank">Centrum pobierania</a> firmy Synology lub w witrynach innych firm), kliknij <b>Instalacja ręczna</b>, a następnie postępuj zgodnie z instrukcjami wyświetlanymi w kreatorze w celu zainstalowania nowego pakietu.</li><img src="about:blank" class="help_image"/></ol>


<h4>Aby wyszukać pakiet:</h4>
<ol>
<li>Wprowadź słowo kluczowe w pasku wyszukiwania w lewym g&oacute;rnym rogu, a następnie naciśnij klawisz Enter, aby rozpocząć wyszukiwanie.</li>
</ol>


<h4>Aby wybrać spos&oacute;b sortowania pakiet&oacute;w:</h4>
<p>Istnieje możliwość zmiany kolejności wyświetlania pakiet&oacute;w w Centrum pakiet&oacute;w. Kliknij menu rozwijane poniżej baneru i wybierz, aby sortować pakiety według jednej z następujących opcji:</p>
<ul>
<li><strong>Sortuj według nazwy</strong>: kliknij, aby sortować pakiety w kolejności alfabetycznej.</li>
<li><strong>Sortuj według aktualnej popularności</strong>: kliknij, aby sortować pakiety w kolejności aktualnych instalacji, zaczynając od najbardziej popularnych.</li>
</ul>


<h4>Aby ukryć zainstalowane pakiety:</h4>
<p>Wybierz dowolną kategorię, kliknij menu rozwijane poniżej baneru i wybierz opcję <strong>Ukryj zainstalowane pakiety</strong>. Ta opcja powoduje ukrycie pakiet&oacute;w, kt&oacute;re już zostały zainstalowane. Wyświetlane są wyłącznie pakiety, kt&oacute;re mogą być zainstalowane, zaktualizowane lub naprawione.</p>

</body>
</html>
