<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<title>DSM&nbsp;Mobile</title>
<link href="../help.css" rel="stylesheet" type="text/css" />
<link href="help.css" rel="stylesheet" type="text/css" />
<script src="../jslib/jquery.min.js"></script>
<script src="../jslib/mobile.js"></script>
</head>
<body><br><p>Avec DSM&nbsp;mobile, l&apos;<strong>admin</strong> (ou un utilisateur appartenant au groupe <strong>administrators</strong>) peut g&eacute;rer les param&egrave;tres DSM et v&eacute;rifier les informations DSM &agrave; l&apos;aide d&apos;un p&eacute;riph&eacute;rique iOS<sup>®</sup> (iPhone<sup>®</sup>, iPad<sup>®</sup> ou iPod touch<sup>®</sup>) ou Android<sup>®</sup>. Cette aide de DSM&nbsp;mobile met &agrave; votre disposition les rubriques et ressources suivantes permettant de vous assister au d&eacute;but de votre utilisation.</p>
	
<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>Vous trouverez ci-dessous les p&eacute;riph&eacute;riques mobiles et les navigateurs actuellement pris en charge&nbsp;:</p>
	<ul>
		<li>P&eacute;riph&eacute;riques mobiles&nbsp;: iPhone, iPad, et iPod sous iOS&nbsp;10 ou version ult&eacute;rieure et p&eacute;riph&eacute;riques sous Android&nbsp;6.0 ou version ult&eacute;rieure</li>
		<li>Navigateurs&nbsp;: Chrome, Safari</li>
	</ul>
</div>
	
<h2><a name="login" href="#">Connexion et d&eacute;connexion</a></h2>

<div name="contents" id="login" class="x-hidden-display">
<p>Une fois connect&eacute; au DSM &agrave; l&apos;aide de votre navigateur web sur votre p&eacute;riph&eacute;rique iOS ou Android, vous verrez l&apos;&eacute;cran de connexion dans lequel vous pouvez saisir les informations de votre compte DSM.</p>

<h4>Pour se connecter &agrave; DSM&nbsp;mobile&nbsp;:</h4>
<p>Saisissez vos identifiants d&apos;utilisateur DSM et appuyez sur <strong>Connexion</strong>. Si vous souhaitez enregistrer vos informations de connexion et vous connecter automatiquement la prochaine fois, activez l&apos;option <strong>Se souvenir de moi</strong> avant de vous connecter.</p>

<h4>Pour vous d&eacute;connecter de DSM&nbsp;mobile&nbsp;:</h4>
<ol>
	<li>Appuyez sur le bouton d&apos;option situ&eacute; dans l&apos;angle sup&eacute;rieur droit de la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android).</li>
	<li>Appuyez sur <strong>Param&egrave;tres</strong>, puis sur <strong>D&eacute;connexion</strong>.</li>
</ol>
</div>

<h2><a name="user" href="#" >G&eacute;rer les utilisateurs DSM</a></h2>

<div name="contents" id="user" class="x-hidden-display">
<p>Appuyez sur <strong>Utilisateur et groupe</strong> dans la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android) pour afficher la liste des utilisateurs.</p>

<h4>Pour cr&eacute;er un utilisateur&nbsp;:</h4>
<ol>
	<li>Appuyez sur <strong>+</strong> puis saisissez le nom de l&apos;utilisateur, son adresse &eacute;lectronique et le mot de passe du nouvel utilisateur.</li>
	<li>Activez l&apos;option <strong>Envoyer notification</strong> pour envoyer un e-mail de notification &agrave; l&apos;adresse e-mail de l&apos;utilisateur lorsque son compte utilisateur DSM est cr&eacute;&eacute;.<br><span class="note_head">Remarque&nbsp;: </span>Avant d&apos;envoyer une notification, assurez-vous que les param&egrave;tres de notification ont &eacute;t&eacute; configur&eacute;s sur votre Synology&nbsp;NAS. Connectez-vous &agrave; l&apos;&eacute;dition desktop de DSM &agrave; l&apos;aide du navigateur Web de votre ordinateur, puis acc&eacute;dez &agrave; <strong>Menu principal</strong>&nbsp;&gt; <strong>Panneau de configuration</strong>&nbsp;&gt; <strong>Notification</strong>&nbsp;&gt; <strong>E-mail</strong> pour modifier les param&egrave;tres.</li>
	<li>Appuyez sur <strong>Termin&eacute;</strong> pour confirmer ou appuyez sur la fl&egrave;che gauche pour annuler.</li>
</ol>

<h4>Pour d&eacute;tecter rapidement un utilisateur&nbsp;:</h4>
<p>Entrez le nom de l&apos;utilisateur dans le champ Recherche.</p>

<h4>Pour modifier les informations d&apos;un utilisateur&nbsp;:</h4>
<ol>
	<li>Appuyez sur le nom de l&apos;utilisateur et proc&eacute;dez comme suit&nbsp;:<ul>
			<li>Modifiez le nom de l&apos;utilisateur ou le mot de passe dans le champ <strong>Nom</strong> ou <strong>Mot de passe</strong>.</li>
		<li>Appuyez sur <strong>D&eacute;sactiver</strong> pour d&eacute;sactiver l&apos;utilisateur. Vous pouvez choisir d&apos;activer le compte de cet utilisateur plus tard sans perdre ses param&egrave;tres.</li>
		<li>Activez l&apos;option <strong>Administrateur</strong> pour ajouter l&apos;utilisateur au groupe <strong>admin</strong>. Tous les utilisateurs appartenant au groupe <strong>admin</strong> b&eacute;n&eacute;ficient de privil&egrave;ges administratifs leur permettant de modifier les param&egrave;tres de DSM sur DSM&nbsp;mobile ou le navigateur Web d&apos;un ordinateur.</li>
		</ul>
	</li>
	<li>Sous <strong>Privil&egrave;ges</strong>, effectuez l&apos;une des op&eacute;rations suivantes puis appuyez sur <strong>Retour</strong>&nbsp;:<ul>
			<li>Appuyez sur <strong>Dossier partag&eacute;</strong>, puis sur le nom d&apos;un dossier partag&eacute; pour modifier les privil&egrave;ges d&apos;acc&egrave;s de l&apos;utilisateur&nbsp;: <strong>Lecture/&eacute;criture</strong>&nbsp;: L&apos;utilisateur peut apporter des modifications aux fichiers et sous-dossiers du dossier partag&eacute;&nbsp;; <strong>Lecture seule</strong>&nbsp;: L&apos;utilisateur peut acc&eacute;der aux fichiers et sous-dossiers du dossier partag&eacute;, mais il ne peut pas y apporter de modifications. <strong>Aucun acc&egrave;s</strong>&nbsp;: L&apos;utilisateur ne peut pas acc&eacute;der aux fichiers et sous-dossiers du dossier partag&eacute;.<br><span class="note_head">Remarque&nbsp;: </span>Si des conflits de privil&egrave;ges se produisent, la priorit&eacute; du privil&egrave;ge sera&nbsp;: <span class="note_content">Aucun acc&egrave;s&nbsp;&gt; Lecture/&eacute;criture&nbsp;&gt; Lecture seule</span>.</li>
			<li>Appuyez sur <strong>Application</strong> pour modifier les privil&egrave;ges d&apos;acc&egrave;s de l&apos;utilisateur aux applications DSM.</li>
		</ul>
	</li>
	<li>Appuyez sur <strong>Termin&eacute;</strong> pour confirmer ou appuyez sur la fl&egrave;che gauche pour annuler.</li>
</ol>
</div>

<h2><a name="shared" href="#" >G&eacute;rer des dossiers partag&eacute;s</a></h2>

<div name="contents" id="shared" class="x-hidden-display">
<p>Appuyez sur <strong>Dossier partag&eacute;</strong> dans la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android) pour afficher la liste des dossiers partag&eacute;s sur votre Synology&nbsp;NAS.</p>

<h4>Pour cr&eacute;er un dossier partag&eacute;&nbsp;:</h4>
<ol>
	<li>Appuyez sur <strong>+</strong> puis saisissez le nom du nouveau dossier.</li>
	<li>Appuyez sur <strong>Termin&eacute;</strong> pour confirmer ou appuyez sur la fl&egrave;che gauche pour annuler.</li>
</ol>

<h4>Pour modifier un dossier partag&eacute;&nbsp;:</h4>
<p>Appuyez sur le nom du dossier partag&eacute; et proc&eacute;dez comme suit&nbsp;:</p>
<ul>
	<li>Modifiez le nom du dossier partag&eacute; dans le champ <strong>Nom</strong>.</li>
	<li>Appuyez sur <strong>Autorisations de l&apos;utilisateur</strong>, puis sur un utilisateur pour modifier ses privil&egrave;ges d&apos;acc&egrave;s au dossier partag&eacute;&nbsp;: <strong>Lecture/&eacute;criture</strong>&nbsp;: L&apos;utilisateur peut apporter des modifications aux fichiers et sous-dossiers du dossier partag&eacute;&nbsp;; <strong>Lecture seule</strong>&nbsp;: L&apos;utilisateur peut acc&eacute;der aux fichiers et sous-dossiers du dossier partag&eacute;, mais il ne peut pas y apporter de modifications. <strong>Aucun acc&egrave;s</strong>&nbsp;: L&apos;utilisateur ne peut pas acc&eacute;der aux fichiers et sous-dossiers du dossier partag&eacute;.<br><span class="note_head">Remarque&nbsp;: </span>Si des conflits de privil&egrave;ges se produisent, la priorit&eacute; du privil&egrave;ge sera&nbsp;: <span class="note_content">Aucun acc&egrave;s&nbsp;&gt; Lecture/&eacute;criture&nbsp;&gt; Lecture seule</span>.</li>
	<li>Vous pouvez &eacute;galement appuyer sur <strong>Autorisations des groupes</strong> pour configurer des privil&egrave;ges pour les groupes.<br><span class="note_head">Remarque&nbsp;: </span>Les permissions des groupes ont une priorit&eacute; sup&eacute;rieure aux permissions des utilisateurs.</li>
</ul>
</div>

<h2><a name="services" href="#" >Activer les services</a></h2>

<div name="contents" id="services" class="x-hidden-display">
<p>Appuyez sur <strong>Service</strong> dans la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android) pour activer ou d&eacute;sactiver les services du serveur Synology&nbsp;NAS.</p>

<h4>Pour g&eacute;rer les services LAN du serveur Synology&nbsp;NAS&nbsp;:</h4>
<ul>
	<li>Activez ou d&eacute;sactiver l&apos;un des services suivants&nbsp;:<ul>
		<li><strong>AFP</strong>&nbsp;: votre Synology&nbsp;NAS peut devenir un serveur de fichiers Mac sur le r&eacute;seau LAN.</li>
		<li><strong>Diffusion imprimante Bonjour</strong>&nbsp;: les clients Mac peuvent imprimer vers la ou les imprimantes USB connect&eacute;es &agrave; votre Synology&nbsp;NAS.</li>
		<li><strong>Service NFS</strong>&nbsp;: les clients Linux du r&eacute;seau LAN peuvent acc&eacute;der aux donn&eacute;es du Synology&nbsp;NAS.</li>
      	<li><strong>SMB</strong>&nbsp;: les clients Windows, Mac et Linux prenant en charge le protocole SMB/CIFS peuvent acc&eacute;der aux donn&eacute;es stock&eacute;es sur votre Synology&nbsp;NAS au sein du r&eacute;seau LAN.</li>
      	<li><strong>SSH/Telnet</strong>&nbsp;: votre Synology&nbsp;NAS peut prendre en charge les services de l&apos;interface de ligne de commande Telnet et SSH.</li>
		</ul>
	</li>
</ul>

<h4>Pour g&eacute;rer les services Internet du serveur Synology&nbsp;NAS&nbsp;:</h4>
<ul>
	<li>Activez ou d&eacute;sactiver l&apos;un des services suivants&nbsp;:<ul>
			<li><strong>FTP/FTPS</strong>&nbsp;: votre Synology&nbsp;NAS peut devenir un serveur FTP.</li>
			<li><strong>Service NTP</strong>&nbsp;: votre Synology&nbsp;NAS peut devenir un serveur de temps r&eacute;seau pour synchroniser l&apos;heure entre diff&eacute;rents p&eacute;riph&eacute;riques du r&eacute;seau et le Synology&nbsp;NAS via le r&eacute;seau.</li>
			<li><strong>rsync</strong>&nbsp;: vous pouvez sauvegarder des donn&eacute;es via rsync &agrave; partir d&apos;un Synology&nbsp;NAS ou de clients compatibles rsync sur votre Synology&nbsp;NAS.</li>
			<li><strong>SFTP</strong>&nbsp;: le transfert de fichiers est s&eacute;curis&eacute; pour les utilisateurs de DSM sans besoin de mots de passe, et le risque de fuite des identifiants de l&apos;utilisateur est r&eacute;duit.</li>
		</ul>
	</li>
</ul>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>Pour plus d&apos;informations sur les services mentionn&eacute;s ci-dessus, consultez l&apos;une des m&eacute;thodes suivantes&nbsp;:</p>
	<ul>
		<li><strong>Aide DSM</strong> (disponible en vous connectant &agrave; l&apos;&eacute;dition desktop de DSM &agrave; l&apos;aide du navigateur Web de votre ordinateur et en acc&eacute;dant &agrave; <strong>Menu principal</strong>&nbsp;&gt; <strong>Aide DSM</strong>)</li>
		<li><strong>Guide de l&apos;utilisateur de Synology&nbsp;DSM</strong> (disponible dans le <a href="http://www.synology.com/support/download.php" target="_blank">Centre de t&eacute;l&eacute;chargement</a> de Synology)</li>
	</ul>
</div>

</div>

<h2><a name="resourcemonitor" href="#" >Contr&ocirc;le des ressources du syst&egrave;me</a></h2>

<div name="contents" id="resourcemonitor" class="x-hidden-display">
<p>Appuyez sur <strong>Moniteur de ressources</strong> dans la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android) pour surveiller l&apos;utilisation du CPU et de la m&eacute;moire du serveur Synology&nbsp;NAS.</p>
</div>

<h2><a name="sysinfo" href="#" >Afficher les infos syst&egrave;me</a></h2>

<div name="contents" id="sysinfo" class="x-hidden-display">
<p>Appuyez sur <strong>Informations syst&egrave;me</strong> dans la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android) pour obtenir une vue d&apos;ensemble de l&apos;&eacute;tat de votre serveur Synology&nbsp;NAS.</p>

<h4>Pour afficher les informations syst&egrave;me de votre serveur Synology&nbsp;NAS&nbsp;:</h4>
<ol>
	<li>Proc&eacute;dez de l&apos;une des mani&egrave;res suivantes&nbsp;:<ul>
			<li>Appuyez sur <strong>G&eacute;n&eacute;ral</strong> pour afficher les informations de base de votre serveur Synology&nbsp;NAS, y compris le num&eacute;ro de s&eacute;rie, le nom du mod&egrave;le, la quantit&eacute; de m&eacute;moire physique, la version de DSM, ainsi que les informations sur la dur&eacute;e de fonctionnement et les temp&eacute;ratures.</li>
			<li>Appuyez sur <strong>R&eacute;seau</strong> pour afficher la configuration r&eacute;seau de votre serveur Synology&nbsp;NAS et l&apos;&eacute;tat de chaque interface r&eacute;seau.</li>
			<li>Appuyez sur <strong>Stockage</strong> pour afficher l&apos;utilisation du volume du Synology&nbsp;NAS.</li>
		</ul>
	</li>
	<li>Appuyez sur le bouton <strong>Actualiser</strong> dans l&apos;angle sup&eacute;rieur droit pour mettre &agrave; jour les informations syst&egrave;me.</li>
</ol>
</div>

<h2><a name="firmware" href="#" >Progiciel</a></h2>

<div name="contents" id="firmware" class="x-hidden-display">
<p>Appuyez sur <strong>Progiciel</strong> pour afficher votre version de DSM et la mettre &agrave; jour.</p>

<h4>Pour configurer les param&egrave;tres de mise &agrave; jour de DSM&nbsp;:</h4>
<ol>
	<li>Appuyez sur <strong>Mise &agrave; niveau de DSM</strong>.</li>
	<li>Choisissez l&apos;une des options suivantes&nbsp;:<ul>
			<li>Mises &agrave; jour importantes uniquement</li>
			<li>DSM le plus r&eacute;cent et toutes les mises &agrave; jour</li>
		</ul>
	</li>
	<li>Appuyez sur <strong>Termin&eacute;</strong>.</li>
</ol>

<h4>Pour t&eacute;l&eacute;charger les mises &agrave; jour disponibles&nbsp;:</h4>
<ol>
	<li>V&eacute;rifiez votre version de DSM dans <strong>&Eacute;tat</strong>.</li>
	<li>Si votre version de DSM n&apos;est pas &agrave; jour, appuyez sur le bouton <strong>T&eacute;l&eacute;charger</strong> qui s&apos;affiche en dessous de la section <strong>&Eacute;tat</strong> pour mettre &agrave; jour DSM.</li>
</ol>
</div>

<h2><a name="block" href="#" >Gestion du blocage des IP</a></h2>

<div name="contents" id="block" class="x-hidden-display">
<p>Appuyez sur <strong>Blocage d&apos;une adresse IP</strong> dans la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android) pour emp&ecirc;cher une connexion non autoris&eacute;e.</p>

<h4>Pour g&eacute;rer le blocage des IP&nbsp;:</h4>
<ol>
	<li>Appuyez sur le bouton de configuration, dans le coin sup&eacute;rieur droit.</li>
	<li>Activez l&apos;option <strong>Activer le blocage automatique</strong> pour activer le blocage des IP.</li>
	<li>Saisissez un nombre pour <strong>Tentatives de connexion</strong> et <strong>Dans les (minutes)</strong> pour bloquer une adresse IP apr&egrave;s un nombre sp&eacute;cifique d&apos;&eacute;checs de tentatives de connexion sous le nombre de minutes sp&eacute;cifi&eacute;.</li>
	<li>Vous pouvez activer l&apos;option <strong>Activer l&apos;expiration des blocages</strong> et sp&eacute;cifier <strong>D&eacute;bloquer apr&egrave;s (jours)</strong> pour d&eacute;bloquer une adresse IP apr&egrave;s le nombre de jours indiqu&eacute;. Si vous entrez «&nbsp;0&nbsp;» ici, l&apos;Adresse IP bloqu&eacute;e restera bloqu&eacute;e ind&eacute;finiment jusqu&apos;&agrave; ce que vous la retiriez de la liste des blocages.</li>
	<li>Appuyez sur <strong>Termin&eacute;</strong>.</li>
</ol>

<h4>Pour ajouter des adresses IP &agrave; la liste des autorisations/des blocages&nbsp;:</h4>
<ol>
	<li>Si vous souhaitez ajouter l&apos;IP autoris&eacute;e/bloqu&eacute;e &agrave; la liste, appuyez sur le bouton d&apos;ajout dans l&apos;angle sup&eacute;rieur droit, puis sur <strong>Liste des autorisations</strong> ou <strong>Liste des blocages</strong>.</li>
	<li>Apr&egrave;s avoir saisi l&apos;adresse&nbsp;IP, appuyez sur <strong>Termin&eacute;</strong>.</li>
</ol>
</div>


<h2><a name="package" href="#" >G&eacute;rer le Centre de paquets</a></h2>

<div name="contents" id="package" class="x-hidden-display">

<p>Synology a int&eacute;gr&eacute; des applications tierces et con&ccedil;ues par Synology dans des paquets pouvant &ecirc;tre install&eacute;s et activ&eacute;s facilement sur le serveur Synology&nbsp;NAS.</p>


<h4>Pour g&eacute;rer le Centre de paquets&nbsp;:</h4>
<p>Appuyez sur <strong>Centre de paquets</strong> dans la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android) pour afficher les informations du paquet, ex&eacute;cuter ou arr&ecirc;ter des paquets ou mettre &agrave; jour avec les derni&egrave;res versions.</p>


<h4>Pour ex&eacute;cuter ou arr&ecirc;ter les paquets install&eacute;s&nbsp;:</h4>
<p>Appuyez sur le commutateur situ&eacute; en regard d&apos;un paquet pour ex&eacute;cuter ou l&apos;interrompre.</p>

<h4>Pour afficher des paquets&nbsp;:</h4>
<p>Appuyez sur un paquet pour afficher les informations y aff&eacute;rentes.</p>
     
<h4>Pour mettre &agrave; jour des paquets&nbsp;:</h4>
<ol>
	<li>Appuyez sur l&apos;onglet <strong>Mise &agrave; jour</strong> pour afficher les versions des mises &agrave; jour actuellement disponibles.</li>
    <li>Appuyez sur le bouton situ&eacute; &agrave; droite d&apos;un paquet pour le mettre &agrave; jour avec la derni&egrave;re version.</li>   
</ol>
</div>


<h2><a name="log" href="#">Afficher les journaux ou les connexions actuelles</a></h2>

<div name="contents" id="log" class="x-hidden-display">
<p>Appuyez sur <strong>Journal</strong> dans la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android) pour surveiller les connexions actuelles ou afficher les journaux des services du Synology&nbsp;NAS.</p>

<h4>Pour surveiller les connexions actuelles&nbsp;:</h4>
<ul>
	<li>Appuyez sur <strong>[number] derniers journaux</strong> dans la section <strong>Aper&ccedil;u</strong> pour afficher la liste des derniers utilisateurs ayant acc&eacute;d&eacute; aux services du Synology&nbsp;NAS.</li>
</ul>

<h4>Pour consulter les enregistrements du journal d&apos;un service sp&eacute;cifique&nbsp;:</h4>
<ul>
	<li>Appuyez sur un &eacute;l&eacute;ment dans la section <strong>Journaux d&apos;&eacute;v&eacute;nements</strong> ou <strong>Journaux de transfert de fichiers</strong> pour voir la liste des journaux correspondants.</li>
</ul>

</div>
<h2><a name="launch" href="#">Lancer des applications mobiles</a></h2>
<div name="contents" id="launch" class="x-hidden-display">

<p>DSM&nbsp;mobile fournit un endroit facile d&apos;acc&egrave;s vous permettant de lancer des applications mobiles Synology install&eacute;es sur votre p&eacute;riph&eacute;rique iOS ou Android.</p>

<h4>Pour lancer les applications mobiles Synology avec DSM&nbsp;mobile&nbsp;:</h4>
<p>Appuyez sur l&apos;une des applications suivantes situ&eacute;es dans la section inf&eacute;rieure de la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android)&nbsp;:</p>
<ul>
	<li><strong>DS&nbsp;photo</strong> (disponible lorsque le service <strong>Photo&nbsp;Station</strong> est activ&eacute;)</li>
	<li><strong>DS&nbsp;audio</strong> (disponible lorsque le service <strong>Audio&nbsp;Station</strong> est activ&eacute;)</li>
	<li><strong>DS&nbsp;cam</strong> (disponible lorsque le service <strong>Surveillance&nbsp;Station</strong> est activ&eacute;)</li>
	<li><strong>DS&nbsp;file</strong> (disponible lorsque le service <strong>WebDAV</strong> est activ&eacute;)</li>
</ul>

<div class="section">
<h4>Remarque&nbsp;:</h4>
	<ul>
		<li>Pour plus d&apos;informations concernant ces applications, reportez-vous aux fichiers d&apos;Aide fournis avec les applications.</li>
     </ul> 
</div>
</div>

<h2><a name="restart" href="#">Configurer le serveur Synology&nbsp;NAS dans le menu action<br><span style="font-size:80%;">(red&eacute;marrer, &eacute;teindre ou &eacute;mettre des bips)</span></a></h2>

<div name="contents" id="restart" class="x-hidden-display">
<p>DSM&nbsp;mobile vous permet de red&eacute;marrer ou d&apos;&eacute;teindre votre serveur Synology&nbsp;NAS &agrave; l&apos;aide d&apos;un p&eacute;riph&eacute;rique iOS ou Android. De plus, lorsque plusieurs Synology&nbsp;NAS sont disponibles, vous pouvez rapidement identifier votre serveur Synology&nbsp;NAS en lui demandant d&apos;&eacute;mettre des bips.</p>

<h4>Pour configurer votre serveur Synology&nbsp;NAS avec le menu action&nbsp;:</h4>
<ol>
	<li>Appuyez sur le bouton d&apos;option situ&eacute; dans l&apos;angle sup&eacute;rieur droit de la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android).</li>
	<li>Proc&eacute;dez de l&apos;une des mani&egrave;res suivantes&nbsp;:<ul>
			<li>Appuyez sur <strong>Red&eacute;marrer</strong>, puis sur <strong>Oui</strong> pour red&eacute;marrer votre serveur Synology&nbsp;NAS.</li>
			<li>Appuyez sur <strong>&Eacute;teindre</strong>, puis sur <strong>Oui</strong> pour &eacute;teindre votre serveur Synology&nbsp;NAS.</li>
			<li>Appuyez sur <strong>Me trouver</strong> pour demander &agrave; votre serveur Synology&nbsp;NAS d&apos;&eacute;mettre un bip. Appuyez sur <strong>OK</strong> pour arr&ecirc;ter le signal sonore.</li>
		</ul>
	</li>
</ol>
</div>


<h2><a name="desktopedition" href="#">Basculer vers le mode bureau de DSM</a></h2>

<div name="contents" id="desktopedition" class="x-hidden-display">
<p>Appuyez sur l&apos;ic&ocirc;ne des param&egrave;tres et s&eacute;lectionnez <strong>Mode bureau</strong> pour acc&eacute;der au mode bureau de DSM.</p>

</div>




<h2><a name="contents12" href="#">Utiliser le gestionnaire de stockage</a></h2>
<div name="contents" id="contents12" class="x-hidden-display">
<p>Le <strong>Gestionnaire de stockage</strong> vous permet d&apos;afficher rapidement l&apos;utilisation et l&apos;&eacute;tat de sant&eacute; des volumes et des disques du syst&egrave;me.</p>

<h4>Pour afficher les informations des volumes&nbsp;:</h4>
	<ol>
		<li>Appuyez sur <strong>Gestionnaire de stockage</strong> dans la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android).</li>
		<li>Appuyez sur l&apos;onglet <strong>Volume</strong>.</li> 
		<li>Appuyez sur un volume dans la liste pour afficher ses informations d&eacute;taill&eacute;es.</li>
	</ol>

<h4>Pour afficher les informations sur le disque&nbsp;:</h4>
	<ol>
		<li>Appuyez sur <strong>Gestionnaire de stockage</strong> dans la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android).</li>
		<li>Appuyez sur l&apos;onglet <strong>HDD/SDD</strong>.</li>
		<li>Appuyez sur un disque dans la liste pour afficher son &eacute;tat de sant&eacute; et les informations S.M.A.R.T.</li>
	</ol>

<h4>Pour d&eacute;marrer ou arr&ecirc;ter le test S.M.A.R.T.&nbsp;:</h4>
	<ol>
		<li>Appuyez sur <strong>Gestionnaire de stockage</strong> dans la page d&apos;accueil (iPhone/iPod&nbsp;touch, t&eacute;l&eacute;phone Android) ou dans le panneau de gauche (iPad, tablette Android).</li>
		<li>Appuyez sur l&apos;onglet <strong>HDD/SDD</strong>.</li>
		<li>Appuyez sur un disque dans la liste pour afficher sa page d&apos;information.</li>
		<li>Appuyez sur <strong>S.M.A.R.T. Appuyez sur Test</strong> pour lancer un test S.M.A.R.T. ou sur <strong>Arr&ecirc;ter</strong> pour l&apos;arr&ecirc;ter.</li>
     </ol>
     
</div>


<h2><a name="contents11" href="#">Plus d&apos;informations</a></h2>

<div name="contents" id="contents11" class="x-hidden-display">
<p>Si vous avez besoin d&apos;informations de d&eacute;pannage ou si vous souhaitez en savoir plus sur Synology, appuyez sur les liens suivants pour acc&eacute;der aux ressources en ligne de Synology&nbsp;:</p>
<ul>
	<li><a href="https://www.synology.com/knowledgebase/faq" target="_blank">FAQ</a></li>
	<li><a href="http://forum.synology.com/wiki" target="_blank">Wiki</a></li>
	<li><a href="http://forum.synology.com" target="_blank">Forum</a></li>
	<li><a href="http://www.synology.com/support/download.php" target="_blank">Centre de t&eacute;l&eacute;chargement</a></li>
	<li><a href="https://myds.synology.com/support/support_form.php" target="_blank">Assistance technique</a></li>
</ul>
</div>


</body>
</html>