<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Auto Block- Synology DSM Hj&auml;lp</title> 
<meta name="author" content="Synology Inc.">
<meta name="description" content="The auto block feature helps improve the security of your Synology NAS by blocking the IP addresses of clients with too many failed login attempts.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Auto Block</h2>

<p>Funktionen auto block hj&auml;lper till att f&ouml;rb&auml;ttra s&auml;kerheten f&ouml;r din Synology NAS genom att blockera IP-adresser f&ouml;r klienter med f&ouml;r m&aring;nga misslyckade inloggningsf&ouml;rs&ouml;k. Det hj&auml;lper till att minska risken f&ouml;r intr&aring;ng p&aring; konton med brute-force-attacker.</p>

<p>Du kan ocks&aring; skapa och hantera en till&aring;ten lista f&ouml;r att l&auml;gga till IP-adresser som du betror eller en blockeringslista f&ouml;r att alltid f&ouml;rhindra s&auml;rskilda IP-adresser fr&aring;n att logga in.</p>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>Ett urval tj&auml;nster och filpaket har st&ouml;d f&ouml;r auto block, exempelvis f&ouml;ljande: DSM, SSH, Telnet, rsync, n&auml;tverkss&auml;kerhetskopiering, synkronisera delade mappar, FTP, WebDAV, File Station, Photo Station, Audio Station, Video Station, Download Station, Mail Server, Mail Station, Time Backup, VPN Server, Cloud Station och Synology mobile apps.</li>
</ul>
</div>

<h4>Aktivera auto block:</h4>
<ol>
	<li>&Ouml;ppna <strong>Kontrollpanel</strong> och g&aring; till <strong>S&auml;kerhet</strong> &gt; <strong>Auto Block</strong>.</li>
	<li>Markera <strong>Aktivera auto block</strong>.</li>
	<li>Ange antal misslyckade inloggningsf&ouml;rs&ouml;k i f&auml;ltet <strong>Inloggningsf&ouml;rs&ouml;k</strong> och antal minuter i f&auml;ltet <strong>Inom (minuter)</strong>. En IP-adress ska blockeras n&auml;r den &ouml;verskrider antal felaktiga inloggningsf&ouml;rs&ouml;k inom det specificerade antalet minutrarna.</li>
	<li>Markera <strong>Aktivera f&ouml;rfallotid f&ouml;r blockering</strong> och ange en siffra f&ouml;r att ta bort en blockerad IP-adress efter angivet antal dagar.</li>
	<li>Klicka p&aring; <strong>Till&auml;mpa</strong> f&ouml;r att spara inst&auml;llningarna.</li>
</ol>


<h3>Hantera Blockeringslista</h3>
<p>Klicka p&aring; <strong>Till&aring;ten lista/blockeringslista</strong> och g&aring; till fliken <strong>Blockeringslista</strong>. </p>

<h4>L&auml;gga till IP-adresser:</h4>
<p>V&auml;lj n&aring;gon av f&ouml;ljande fr&aring;n rullgardinsmenyn <strong>Skapa</strong>:</p>

<ul>
	<li><strong>L&auml;gg till IP-adress</strong>: Ange en IP-adress och st&auml;ll in utg&aring;ngstid.</li>
	<li><strong>Importera lista med IP-adresser</strong>: Importera en textfil som listar IP-adresser f&ouml;r att l&auml;gga till ett antal IP-adresser och s&auml;tt upp utg&aring;ngstiden, allt p&aring; en och samma g&aring;ng. Markera kryssrutan om du vill skriva &ouml;ver befintliga IP-adresser. Om det h&auml;r alternativet inte &auml;r markerat hoppas IP-adresser som &auml;r dubbletter &ouml;ver.<br />Om filen du valt har ett korrekt format kommer du att se alla IP-adresser i omr&aring;det f&ouml;r f&ouml;rhandsgranskning. Klicka p&aring; <strong>OK</strong> f&ouml;r att importera.</li>
</ul>

<div class="section"><h4>Obs:</h4>
<p>F&ouml;r att importera en fil m&aring;ste filen uppfylla f&ouml;ljande kriterium:</p>
<ul>
	<li>Filen m&aring;ste vara en enkel textfil.</li>
	<li>Varje rad i filen kan endast inneh&aring;llen en IP-adress.</li>
	<li>Linjer som kommenterats ut b&ouml;rjar med en # (br&auml;dg&aring;rdstecknet).</li>
</ul>
</div>

<h4>Radera blockerade IP-adresser:</h4>
<p>V&auml;lj de IP-adresser som du vill ta bort fr&aring;n listan och klicka p&aring; <strong>Ta bort</strong>.</p>


<h3>Hantera Till&aring;ten lista</h3>

<p>Klicka p&aring; <strong>Till&aring;ten lista/blockeringslista</strong> och g&aring; till fliken <strong>Till&aring;ten lista</strong>.</p>

<h4>L&auml;gga till IP-adresser:</h4>
<p>V&auml;lj n&aring;gon av f&ouml;ljande fr&aring;n rullgardinsmenyn <strong>Skapa</strong>:</p>
<ul>
	<li><strong>L&auml;gg till IP-adress</strong>: Ange en IP-adress, IP-intervall, subn&auml;t eller dom&auml;nnamn.</li>
	<li><strong>Importera lista med IP-adresser</strong>: Importera en textfil som listar IP-adresser f&ouml;r att l&auml;gga till ett antal IP-adresser, allt p&aring; en och samma g&aring;ng. Markera kryssrutan om du vill skriva &ouml;ver befintliga IP-adresser. Om det h&auml;r alternativet inte &auml;r markerat hoppas IP-adresser som &auml;r dubbletter &ouml;ver.<br />Om filen du valt har ett korrekt format kommer du att se alla IP-adresser i omr&aring;det f&ouml;r f&ouml;rhandsgranskning. Klicka p&aring; <strong>OK</strong> f&ouml;r att importera.</li>
</ul>

<div class="section"><h4>Obs:</h4>
<p>F&ouml;r att importera en fil m&aring;ste filen uppfylla f&ouml;ljande kriterium:</p>
<ul>
<li>Filen m&aring;ste vara en enkel textfil.</li>
<li>Varje rad f&ouml;r filen kan bara inneh&aring;lla antingen IP-adresser, ett IP-intervall (<em>192.168.1.1 - 192.168.1.10</em>), ett subn&auml;t (<em>192.168.1.1/255.255.0.0</em>) eller ett dom&auml;nnamn (<em>www.synology.com</em>).</li>
<li>Linjer som kommenterats ut b&ouml;rjar med en # (br&auml;dg&aring;rdstecknet).</li>
</ul>
</div>

<h4>Ta bort IP-adresser:</h4>
<p>V&auml;lj de IP-adresser som du vill ta bort fr&aring;n listan och klicka p&aring; <strong>Ta bort</strong>.</p>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>Om din Synology NAS-enhet befinner sig bakom en omv&auml;nd proxyserver, v&auml;nligen l&auml;gg till IP-adressen f&ouml;r den omv&auml;nda proxyservern till till&aring;ten lista.</li>
</ul>
</div>

</body>
</html>
