<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="wireless_ap"></a>Hotspot*</h2>

<p>Din Synology NAS-enhet st&ouml;der att skapa en hotspot f&ouml;r att dela dess Internetanslutning med andra enheter tr&aring;dl&ouml;st, om du har installerat en Wi-Fi USB-adapter eller om din Synology NAS har inbyggt Wi-Fi. Du kan st&auml;lla in din Synology NAS att vara en tr&aring;dl&ouml;s &aring;tkomstpunkt (access point (AP) eller tr&aring;dl&ouml;s router beroende p&aring; hur du vill anv&auml;nda Internet.</p>

<table>
	<tr>
		<th width="23%">Hotspotl&auml;ge</th>
		<th width="77%">Beskrivning</th>
	</tr>
	<tr>
		<th>Tr&aring;dl&ouml;s AP</th>
		<td>
			<ul>
				<li>Bryggar ditt LAN och WiFi-n&auml;tverk tillsammans.</li>
				<li>Ditt LAN och dina tr&aring;dl&ouml;sa klienter kommer att vara p&aring; samma lokala n&auml;tverk.</li>
				<li>Anv&auml;ndbart n&auml;r du redan har en router och vill anv&auml;nda din Synology NAS som en extra &aring;tkomstpunkt till ett befintligt n&auml;tverk.</li> 
				<li>Till&aring;ter delning av n&auml;tverksresurser, exempelvis DLNA-enheter, <span class="disable-grantley">skrivare, </span> Synology Web Assistant eller andra tj&auml;nster som f&ouml;rlitar sig p&aring; uts&auml;ndningar i n&auml;tverket.</li>
				<li>DHCP-server kommer att avaktiveras p&aring; Synology NAS-enheter som agerar tr&aring;dl&ouml;sa AP:s. F&ouml;r att &aring;teraktivera DHCP-server f&ouml;r din Synology NAS, ta bort Wi-Fi-donglar och starta om Synology NAS.</li>
				<li>F&ouml;r modeller med flera LAN-portar anv&auml;nds endast LAN 1 f&ouml;r att brygga tr&aring;dl&ouml;s AP.</li>
			</ul>
		</td>
	</tr>
	<tr>
		<th>Tr&aring;dl&ouml;s router</th>
		<td>
			<ul>
				<li>St&auml;ller in ett tr&aring;dl&ouml;st n&auml;tverk d&auml;r enheterna finns p&aring; ett privat subn&auml;t.</li>
			</ul>
		</td>
	</tr>
</table>

<div class="section"><h4>Obs:</h4>
<ol>
	<li>En del modeller kr&auml;ver anslutning av tr&aring;dl&ouml;sa donglar f&ouml;r att skapa hotspots. En komplett lista &ouml;ver tr&aring;dl&ouml;sa donglar som st&ouml;ds finns p&aring; <a href="https://www.synology.com/compatibility?search_by=category&category=usb_wifi_dongles&p=1&filter_ap_mode=yes&not_recommend_mode=false" target=_blank>www.synology.com</a>.</li>
	<li>F&ouml;r modeller som inte &auml;r DS213air har alternativet f&ouml;r Tr&aring;dl&ouml;s hotspot i DSM 4.3 bytt namn till &rdquo;Tr&aring;dl&ouml;s router&rdquo; i DSM 5.0 och senare.</li>
</ol>
</div>

<h3>Hantera hotspotinst&auml;llningar</h3>
<p>Detta avsnitt f&ouml;rklarar hur inst&auml;llningarna f&ouml;r hotspot aktiveras och hanteras p&aring; din Synology NAS.</p>

<h4>Att g&ouml;ra Synology NAS till en hotspot:</h4>
<ol>
	<li>G&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Tr&aring;dl&ouml;st</strong> &gt; <strong>N&auml;tverkskarta</strong>. V&auml;lj <strong>Tr&aring;dl&ouml;s AP</strong> eller <strong>Tr&aring;dl&ouml;s router</strong>.</li>
	<li>G&aring; till fliken <strong>Wi-Fi</strong> och klicka p&aring; <strong>Redigera</strong> f&ouml;r att hantera f&ouml;ljande inst&auml;llningar:
		<ul>
			<li><strong>Namn (SSID):</strong> Ange ett namn f&ouml;r det tr&aring;dl&ouml;sa n&auml;tverket.</li>
			<li><strong>Visa/D&ouml;lj:</strong> V&auml;lj huruvida det tr&aring;dl&ouml;sa n&auml;tverket &auml;r synligt f&ouml;r andra enheter eller inte.</li>
			<li><strong>Tr&aring;dl&ouml;st l&auml;ge:</strong> V&auml;lj tr&aring;dl&ouml;s standard. Varje standard har st&ouml;d f&ouml;r olika bandbredder och frekvenser.</li>
			<li><strong>Kanalbredd:</strong> V&auml;lj en kanalbredd (endast tillg&auml;ngligt om 802.11n tr&aring;dl&ouml;st l&auml;ge anv&auml;nds).</li>
			<li><strong>Kanal:</strong> V&auml;lj en kanal f&ouml;r det tr&aring;dl&ouml;sa n&auml;tverket. F&ouml;r b&auml;ttre prestanda, v&auml;lj en frekvens annan &auml;n den som anv&auml;nds av n&auml;rliggande n&auml;tverk.</li>
			<li><strong>&Ouml;verf&ouml;ringsstyrka:</strong> V&auml;lj en signalstyrka f&ouml;r det tr&aring;dl&ouml;sa n&auml;tverket.</li>
			<li><strong>Maximalt antal anslutningar:</strong> V&auml;lj hur m&aring;nga klienter som ska kunna ansluta till n&auml;tverket. Den h&ouml;gsta inst&auml;llningen f&ouml;r anslutningar &auml;r 256.</li>
			<li><strong>Aktivera WMM QoS:</strong> Wi-Fi Multimedia (WMM) QoS (Quality of Service) &ouml;ver Wi-Fi. Detta alternativ till&aring;ter det tr&aring;dl&ouml;sa n&auml;tverket att prioritera trafik och optimera hur resurser delas mellan program.</li>
		</ul>
	</li>
</ol>

<h4>St&auml;lla in ett tr&aring;dl&ouml;st schema:*</h4>
<p>Att aktivera ett tr&aring;dl&ouml;st n&auml;tverksschema till&aring;ter dig att ha kontroll &ouml;ver n&auml;r det tr&aring;dl&ouml;sa n&auml;tverket f&ouml;r din Synology NAS &auml;r aktivt och &aring;tkomligt.</p>
<ol>
	<li>G&aring; till fliken <strong>Wi-Fi</strong> och klicka p&aring; <strong>Redigera</strong>.</li>
	<li>Markera rutan <strong>Aktivera schema</strong>.</li>
	<li>Klicka p&aring; <strong>L&auml;gg till schema</strong>.</li>
	<li>P&aring; sk&auml;rmen f&ouml;r schema, v&auml;lj n&auml;r det tr&aring;dl&ouml;sa n&auml;tverket ska vara aktivt.</li>
</ol>

<h3>S&auml;kerhetsinst&auml;llningar</h3>
<p><strong>Kontrollpanel</strong> &gt; <strong>Tr&aring;dl&ouml;st</strong> &gt; <strong>Wi-Fi</strong> ger dig alternativ f&ouml;r att redigera s&auml;kerhetsinst&auml;llningarna f&ouml;r ditt tr&aring;dl&ouml;sa n&auml;tverk.</p>

<h4>St&auml;lla in ett tr&aring;dl&ouml;s s&auml;kerhet:</h4>
<ol>
	<li>Klicka p&aring; <strong>Redigera</strong>.</li>
	<li>V&auml;lj ett av f&ouml;ljande s&auml;kerhetsprotokoll fr&aring;n rullgardinsmenyn <strong>S&auml;kerhetsinst&auml;llningar</strong>:
		<ul>
			<li><strong>WEP:</strong> Ett grundl&auml;ggande s&auml;kerhetsprotokoll som kr&auml;ver att anv&auml;ndare anger ett l&ouml;senord f&ouml;r att f&aring; &aring;tkomst till det tr&aring;dl&ouml;sa n&auml;tverket men erbjuder minimalt med skydd.</li>
			<li><strong>WPA/WPA2 Personlig:</strong> Rekommenderas. Kr&auml;ver att anv&auml;ndaren anger ett l&ouml;senord f&ouml;r att f&aring; &aring;tkomst till det tr&aring;dl&ouml;sa n&auml;tverket och &auml;r mer s&auml;kert &auml;n WEP.</li>
			<li><strong>WPA/WPA2 F&ouml;retag:</strong>* Ett s&auml;kerhetsprotokoll som designats f&ouml;r f&ouml;retag som kr&auml;ver att anv&auml;ndarna autentiserar sig mot en extern autentiseringsserver.</li>
		</ul>
	</li>
</ol>

<h4>F&ouml;r att aktivera Wi-Fi Protected Setup:*</h4>
<p>Wi-Fi Protected Setup &auml;r en standard som f&ouml;respr&aring;kas av Wi-Fi Alliance f&ouml;r att f&ouml;renkla tr&aring;dl&ouml;sa s&auml;kerhetsinst&auml;llningar f&ouml;r anv&auml;ndare. Du kan anv&auml;nda en Push-knapp eller en PIN-kod f&ouml;r att se till att ditt Wi-Fi-n&auml;tverk &auml;r s&auml;kert. Klicka p&aring; <strong>WPS</strong> f&ouml;r att aktivera Wi-Fi Protected Setup.</p>

<h3>G&auml;stn&auml;tverk*</h3>
<p>F&ouml;rutom att skapa ett tr&aring;dl&ouml;st v&auml;rdn&auml;tverk har din Synology NAS ocks&aring; st&ouml;d f&ouml;r att skapa ett tr&aring;dl&ouml;st g&auml;stn&auml;tverk. Inst&auml;llningarna f&ouml;r g&auml;stn&auml;tverk kan begr&auml;nsas till att begr&auml;nsa &aring;tkomst f&ouml;r anv&auml;ndare, vilket &auml;r anv&auml;ndbart f&ouml;r f&ouml;retag eller andra institutioner som vill ge sina bes&ouml;kare &aring;tkomst till tr&aring;dl&ouml;st n&auml;tverk men vill f&ouml;rhindra dem fr&aring;n att f&aring; &aring;tkomst till v&auml;rdn&auml;tverket.</p>

<h4>F&ouml;r att aktivera g&auml;stn&auml;tverk:</h4>
<ol>
	<li>G&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Tr&aring;dl&ouml;st</strong> &gt; <strong>Wi-Fi</strong>.</li>
	<li>Klicka p&aring; <strong>Redigera</strong> f&ouml;r att hantera f&ouml;ljande inst&auml;llningar p&aring; fliken <strong>G&auml;stn&auml;tverk</strong>:
		<ul>
			<li><strong>Namn (SSID):</strong> Ange ett namn f&ouml;r det tr&aring;dl&ouml;sa n&auml;tverket.</li>
			<li><strong>Visa/D&ouml;lj:</strong> V&auml;lj huruvida det tr&aring;dl&ouml;sa n&auml;tverket &auml;r synligt f&ouml;r andra enheter eller inte.</li>
			<li><strong>Maximalt antal anslutningar:</strong> V&auml;lj hur m&aring;nga klienter som ska kunna ansluta till n&auml;tverket. Den h&ouml;gsta maximala inst&auml;llningen f&ouml;r anslutningar &auml;r 256.</li>
		</ul>
	</li>
</ol>

<h4>Inst&auml;llningar f&ouml;r s&auml;kerhet i g&auml;stn&auml;tverket:</h4>
<p>V&auml;lj ett av f&ouml;ljande s&auml;kerhetsprotokoll fr&aring;n rullgardinsmenyn <strong>S&auml;kerhetsinst&auml;llningar</strong>:</p>
<ul>
	<li><strong>WEP:</strong> Ett grundl&auml;ggande s&auml;kerhetsprotokoll som kr&auml;ver att anv&auml;ndare anger ett l&ouml;senord f&ouml;r att f&aring; &aring;tkomst till det tr&aring;dl&ouml;sa n&auml;tverket men erbjuder minimalt med skydd.</li>
	<li><strong>WPA/WPA2 Personlig:</strong> Rekommenderas. Kr&auml;ver att anv&auml;ndaren anger ett l&ouml;senord f&ouml;r att f&aring; &aring;tkomst till det tr&aring;dl&ouml;sa n&auml;tverket och &auml;r mer s&auml;kert &auml;n WEP.</li>
</ul>

<h4>Inst&auml;llningar f&ouml;r schema i g&auml;stn&auml;tverket:</h4>
<p>Att aktivera ett schema f&ouml;r g&auml;stn&auml;tverket till&aring;ter dig att ha kontroll &ouml;ver n&auml;r det tr&aring;dl&ouml;sa g&auml;stn&auml;tverket f&ouml;r din Synology NAS &auml;r aktivt och &aring;tkomligt.</p>

<ol>
	<li>Markera kryssrutan <strong>Aktivera schema f&ouml;r g&auml;stn&auml;tverk</strong>.</li>
	<li>Klicka p&aring; <strong>S&auml;tt g&auml;stschema</strong>.</li>
	<li>P&aring; sk&auml;rmen f&ouml;r schema, v&auml;lj n&auml;r det tr&aring;dl&ouml;sa g&auml;stn&auml;tverket ska vara aktivt.</li>
</ol>

<div class="section"><h4>Obs:</h4>
<ul>
<li>Den h&auml;r funktionen &auml;r endast tillg&auml;nglig p&aring; DS213air.</li>
<li>Det tr&aring;dl&ouml;sa g&auml;stn&auml;tverket kan inte vara aktivt under tidsperioder n&auml;r det tr&aring;dl&ouml;sa v&auml;rdn&auml;tverket &auml;r inaktiverat.</li>
</ul>
</div>

<h3>MAC-filterinst&auml;llning*</h3>
<p>MAC-filtrering (i <strong>Kontrollpanel</strong> &gt; <strong>Tr&aring;dl&ouml;st</strong>) specificerar vilka MAC-adresser som &auml;r till&aring;tna att f&aring; &aring;tkomst till det tr&aring;dl&ouml;sa n&auml;tverket, vilket till&aring;ter dig att blockera eller till&aring;ta &aring;tkomst f&ouml;r specifika enheter. Denna funktion styr bara &aring;tkomst till n&auml;tverket och inga &ouml;vriga krypteringsinst&auml;llningar.</p>

<h4>Skapa regler f&ouml;r MAC-filtrering:</h4>
<ol>
	<li>Ange beskrivningen och MAC-adressen f&ouml;r en enhet.</li>
	<li>V&auml;lj en &aring;tkomstpolicy:
		<ul>
			<li><strong>Neka:</strong> F&ouml;rhindrar att den specifika MAC-adressen f&aring;r &aring;tkomst till det tr&aring;dl&ouml;sa n&auml;tverket.</li>
			<li><strong>Till&aring;t:</strong> Till&aring;ter att de specifika MAC-adresserna f&aring;r &aring;tkomst till det tr&aring;dl&ouml;sa n&auml;tverket.</li>
		</ul> 
	</li>
</ol>

<h3>F&ouml;r&auml;ldrakontroll*</h3>
<p>Funktionen f&ouml;r&auml;ldrakontroll l&aring;ter dig kontrollera n&auml;r varje klientenhet, ansluten till det lokala n&auml;tverket f&ouml;r Synology NAS f&aring;r ha &aring;tkomst till Internet. Till exempel, om dina barns datorer eller mobila enheter ansluter till Internet genom Synology NAS, kan du konfigurera inst&auml;llningarna i f&ouml;r&auml;ldrakontrollen att begr&auml;nsa deras Internetanv&auml;ndning i enlighet med specifika enheter och tider.</p>

<h4>Aktivera f&ouml;r&auml;ldrakontroll:</h4>
<ol>
	<li>G&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Tr&aring;dl&ouml;st</strong> &gt; <strong>Inst&auml;llningar f&ouml;r f&ouml;r&auml;ldrakontroll</strong>.</li>
	<li>Klicka p&aring; knappen <strong>L&auml;gg till</strong> f&ouml;r att l&auml;gga till en klientenhet.
		<ul>
			<li><strong>Klientnamn:</strong> V&auml;lj en enheten som &auml;r ansluten till Synology NAS eller ange ett namn manuellt (t.ex. Louisas Laptop).</li>
			<li><strong>MAC-adress:</strong> Ange MAC-adressen f&ouml;r den enhet vars Internetanv&auml;ndning du vill kontrollera.</li>
			<li><strong>St&auml;lla in schema:</strong> V&auml;lj vilka tider den specificerade enhet ska vara till&aring;ten att ha &aring;tkomst till Internet&aring;tkomst genom Synology NAS.</li>
		</ul>
	</li>
</ol>

<h3>Anslutningslista*</h3>
<p>Listan med anslutningar (i <strong>Kontrollpanel</strong> &gt; <strong>Tr&aring;dl&ouml;st</strong>) visar information om enheter anslutna till Synology NAS. Enheter kan l&auml;ggas till direkt i MAC-filter h&auml;rifr&aring;n.</p>

<h4>F&ouml;r att l&auml;gga till enheter i MAC-filterlista:</h4>
<ol>
	<li>Markera kryssrutan invid enheten du vill l&auml;gga till i MAC-filter.</li>
	<li>Klicka p&aring; <strong>L&auml;gg till i MAC-filterlista</strong>.</li>
</ol>

<p>____<br /> * Endast tillg&auml;ngligt f&ouml;r vissa modeller.</p>

</body>
</html>