<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Dom&auml;n</h2>

<p>Din Synology NAS kan ansluta till en Windows-dom&auml;n. Efter att den anslutits till dom&auml;nen kan anv&auml;ndare logga in till Synology NAS genom att anv&auml;nda deras dom&auml;nkonton och -l&ouml;senord, vilket l&aring;ter den f&aring; &aring;tkomst till filer och anv&auml;nda applikationer p&aring; DSM, utan att behov av att komma ih&aring;g ytterligare en upps&auml;ttning anv&auml;ndarnamn och l&ouml;senord.</p>

<h4>Anslut till en dom&auml;n:</h4>
<ol>
	<li>G&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Katalogtj&auml;nst</strong> &gt; <strong>Dom&auml;n</strong>.</li>
	<li>Markera rutan <strong>Anslut till dom&auml;n</strong>.</li>
	<li>Ange dom&auml;nnamnet och specificera DNS-server i d&auml;rf&ouml;r avsedda f&auml;lt.</li>
	<li>Om n&ouml;dv&auml;ndigt, markera rutan <strong>Avancerade dom&auml;nalternativ</strong>. (Se h&auml;r nedanf&ouml;r f&ouml;r mer information.)</li>
	<li>Klicka p&aring; <strong>Till&auml;mpa</strong>.</li>
	<li>Ange anv&auml;ndarnamnet och l&ouml;senordet f&ouml;r dom&auml;nserverns administrat&ouml;r i popup-f&ouml;nstret.</li>
	<li>Klicka p&aring; <strong>OK</strong>.</li>
</ol>

<div class="section"><h4>DNS Server</h4>
<p>Det rekommenderas att du anger en DNS-server f&ouml;r att hj&auml;lpa din Synology NAS att s&ouml;ka efter dom&auml;nen. Om dom&auml;nen inte &auml;r registrerad p&aring; DNS-servern &auml;r det m&ouml;jligt att det misslyckas att g&aring; med i dom&auml;nen.</p>

<h4>Dom&auml;nservertyp</h4>
<p>Det h&auml;r f&auml;ltet visar den typ av dom&auml;n n&auml;r din Synology NAS ansluter till en dom&auml;n. Typen av dom&auml;n kommer att bli &rdquo;AD-dom&auml;n&rdquo;.</p>

<h4>Hanteringsl&auml;ge</h4>
<p>Det h&auml;r alternativet kommer att avg&ouml;ra hur du hanterar privilegierna f&ouml;r dom&auml;nanv&auml;ndare och -grupper. </p>
<ul>
	<li><strong>Betrodd dom&auml;n</strong>: Du kan hantera anv&auml;ndare och grupper i den anslutna dom&auml;nen s&aring;v&auml;l som i betrodda dom&auml;ner. Anv&auml;ndare och grupper kan filtreras med rullgardinslistan dom&auml;n.</li>
	<li><strong>Enkel dom&auml;n med OU</strong>: Endast anv&auml;ndare och grupper i den anslutna dom&auml;nen kommer att visas i detta l&auml;ge. Det h&auml;r l&auml;get l&aring;ter dig filtrera dom&auml;nanv&auml;ndare/dom&auml;ngrupper med rullgardinslistan OU (Organizational Unit).</li>
</ul>

<h4>Avancerade Dom&auml;nalternativ</h4>
<p>I de flesta fall beh&ouml;ver du inte fylla i n&aring;gra av de avancerade dom&auml;nalternativen. Avancerade dom&auml;nalternativ kr&auml;vs endast f&ouml;r specifika dom&auml;nmilj&ouml;er. </p>
<ul>
	<li><strong>DC IP/FQDN</strong>: Specificera en IP-adress eller FQDN f&ouml;r DC (Domain Controller) s&aring; kommer din Synology NAS att f&ouml;rs&ouml;ka kommunicera med den. Om det finns fler &auml;n en IP-adress eller FQDN, avgr&auml;nsa med ett komma (,) mellan var och en. L&auml;gg till en asterisk (*) efter den sista IP-adressen eller FQDN f&ouml;r DC om du vill, s&aring; kommer din Synology NAS att f&ouml;rs&ouml;ka kommunicera med andra DC om alla angivna misslyckats. Du m&aring;ste l&auml;gga till ett komma mellan asterisken och den sista IP-adressen eller FQDN.</li>
	<li><strong>Dom&auml;n NetBIOS-namn</strong>: Ange NetBIOS-namn f&ouml;r dom&auml;nen.</li>
	<li><strong>Dom&auml;n FQDN (DNS-namn)</strong>: Ange FQDN (DNS-namn) f&ouml;r dom&auml;nen.</li>
	<li><strong>Registrera gr&auml;nssnitt f&ouml;r DNS</strong>: Vid anslutning till en dom&auml;n kommer det NIC (Network Interface Card, p&aring; svenska n&auml;tverksgr&auml;nssnitt) som specificerats h&auml;r registreras med DNS-servern. V&auml;nligen observera att f&ouml;r det fall v&auml;rdnamnet f&ouml;r din Synology NAS inneh&aring;ller ett understreck (_) kommer registreringen att misslyckas eftersom understreck (_) inte kan anv&auml;ndas med DNS.</li>
	<li><strong>Uppdatera anv&auml;ndar-/grupplista</strong>: Specificera hur ofta din Synology NAS automatiskt uppdaterar dom&auml;nens lista &ouml;ver anv&auml;ndare/grupper. Du kan anpassa tidsperioden s&aring; att uppdateringar utf&ouml;rs dagligen, veckovis eller m&aring;nadsvis. Dessutom kan dom&auml;nens anv&auml;ndar-/grupplista uppdateras manuellt genom att g&aring; till fliken <strong>Dom&auml;nanv&auml;ndare</strong> och klicka p&aring; <strong>Uppdatera alla dom&auml;ner</strong>. V&auml;nligen observera att automatiska uppdatering p&aring;verkar systemets vilol&auml;ge.</li>
</ul>

<h4>Ansluta Endast l&auml;sbar dom&auml;nkontrollant</h4>
<p>F&ouml;r att ansluta din Synology NAS till en endast l&auml;sbar dom&auml;nkontrollant (RODC), beh&ouml;ver du specificera &rdquo;hela datorns namn&rdquo; (FQDN) om din l&auml;s- och skrivbara dom&auml;nkontrollant (RWDC) i f&auml;ltet <strong>DC IP/FQDN</strong>. Hela datorns namn ska anges i f&ouml;ljande format: <strong>Datornamn.Dom&auml;n</strong>, dvs. &rdquo;ad01.synology.com&rdquo;.</p>
</div>


<div class="section"><h4>Obs:</h4>
<ul>
	<li>Om din dom&auml;ns anv&auml;ndarnamn inkluderar &rdquo;%&rdquo; eller &rdquo;$&rdquo;, kanske du inte kan komma &aring;t din home-mapp. Be din dom&auml;nadministrat&ouml;r om ett nytt anv&auml;ndarnamn.</li>
	<li>Dom&auml;ngrupperna <strong>Dom&auml;nadministrat&ouml;rer</strong> och <strong>F&ouml;retagsadministrat&ouml;rer</strong> l&auml;ggs till den lokala gruppen <strong>Administrators</strong> automatiskt. D&auml;rf&ouml;r kommer dom&auml;nanv&auml;ndare i dessa grupper f&aring; administrativa privilegier p&aring; din Synology NAS, inklusive &aring;tkomst till filtj&auml;nster s&aring;som CIFS/FTP/AFP/WebDAV och andra DSM-applikationer.</li>
	<li>Du kan ocks&aring; konfigurera dom&auml;nanv&auml;ndares &aring;tkomstprivilegier till de delade mapparna p&aring; din Synology NAS. Se <a href="file_directory_service_user_group.html">h&auml;r</a> f&ouml;r mer information.</li>
</ul>
</div>

<h3>Dom&auml;nalternativ</h3>

<p>Detta avsnitt inneh&aring;ller f&ouml;ljande ytterligare alternativ f&ouml;r dom&auml;ner.</p>
<ul>
	<li><strong>DiskStation synkroniserar med en NTP-server varje g&aring;ng en dom&auml;nanv&auml;ndare loggar in</strong>: Att aktivera detta alternativ kommer att framtvinga synkronisering av tid mellan din Synology NAS och NTP-servern.</li>
	<li><strong>Aktivera serversignering</strong>: Om klienten har klientsignering aktiverat, m&aring;ste serversignering ocks&aring; vara aktiverat p&aring; din Synology NAS, s&aring; att anv&auml;ndare kan anv&auml;nda dom&auml;nens tj&auml;nster p&aring; ett normalt s&auml;tt.</li>
	<li><strong>H&auml;mta anv&auml;ndar-/grupplistor i NT4-kompatibelt l&auml;ge</strong>: Aktivering av detta alternativ l&aring;ter systemet h&auml;mta anv&auml;ndar-/grupplistor genom att anv&auml;nda l&auml;get NT4 RPC. Detta alternativ kan aktiveras om vissa av dom&auml;nens anv&auml;ndar-/grupplistor inte kan h&auml;mtas med standardinst&auml;llningarna.</li>
	<li><strong> Inaktivera administrat&ouml;rsbeh&ouml;righeter f&ouml;r dom&auml;n- och f&ouml;retagsadministrat&ouml;rer</strong>: En anv&auml;ndare med administrat&ouml;rsbeh&ouml;righeter kan ha full kontroll &ouml;ver din Synology NAS och dess filer. Aktivering av detta alternativ l&aring;ter dig begr&auml;nsa s&aring; att beh&ouml;righeter f&ouml;r dom&auml;n- och f&ouml;retagsadministrat&ouml;rer &auml;r desamma som f&ouml;r en vanlig anv&auml;ndare och att de d&auml;rf&ouml;r &auml;rver alla normala beh&ouml;righeter f&ouml;r fil/mapp.</li>
	<li><strong>R&auml;kna upp n&auml;stlade gruppniv&aring;er</strong>: Specificera antalet n&auml;stlade dom&auml;ngruppsanv&auml;ndare som kan r&auml;knas upp.</li>
</ul>

<h3>Kontroll av dom&auml;nstatus</h3>

<p>Du kan klicka p&aring; <strong>Kontroll av dom&auml;nstatus</strong> f&ouml;r att kontrollera statusen f&ouml;r anslutning mellan din DSM och dom&auml;nservern som den har anslutit till. F&ouml;r mer information om fels&ouml;kning, v&auml;nligen se f&ouml;ljande kontrollpunkter:</p>
<ul>
	<li><strong>Kontrollera om anslutningen fungerar ordentlig mellan Synology NAS och Active Directory Server</strong>: Synology NAS kunde inte kommunicera med Active Directory-servern.
		<ul>
			<li>Kontrollera att portarna 389, 139 och 445 fungerar ordentligt p&aring; Active Directory-servern.</li>
			<li>Kontrollera att tj&auml;nsten NTDS fungerar ordentligt p&aring; Active Directory-servern.</li>
		</ul>
	</li>
	<li><strong>Kontrollera om det finns v&auml;rdnamn som st&aring;r i konflikt i undern&auml;tet</strong>: Din Synology NAS har v&auml;rdnamn som redan finns i undern&auml;tet.
		<ul>
			<li>Om din Synology NAS &auml;r ansluten till subn&auml;tet med flera n&auml;tverksgr&auml;nssnitt fungerar din DSM ordentligt.</li>
			<li>Om din Synology NAS &auml;r ansluten till subn&auml;tet med ett enkelt n&auml;tverksgr&auml;nssnitt, v&auml;nligen &auml;ndra v&auml;rdnamnet f&ouml;r din Synology NAS och anslut den till dom&auml;nen igen.</li>
		</ul>
	</li>
	<li><strong>Kontrollera om anslutningen fungerar ordentlig mellan Synology NAS och Kerberos-server</strong>: Synology NAS kunde inte kommunicera med kerberos-servern.
		<ul>
			<li>Kontrollera att det finns korrekta Kerberos-DNS SRV-poster och tillh&ouml;rande A-poster p&aring; DNS-servern.</li>
			<li>Kontrollera att port 88 &auml;r tillg&auml;nglig p&aring; KDC-servern.</li>
		</ul>
	</li>
	<li><strong>Kontrollera om anslutningen fungerar ordentlig mellan Synology NAS och LDAP-server</strong>: Synology NAS kunde inte kommunicera med LDAP-servern.
		<ul>
			<li>Kontrollera att det finns korrekta LDAP-DNS SRV-poster och tillh&ouml;rande A-poster p&aring; DNS-servern.</li>
			<li>Kontrollera att port 389 fungerar ordentligt p&aring; LDAP-servern.</li>
		</ul>
	</li>
	<li><strong>Kontrollera om MTU &auml;r konfigurerat korrekt f&ouml;r att s&auml;kerst&auml;lla att anslutningen fungerar ordentligt mellan Synology NAS och dom&auml;nkontrollanten</strong>: En eller flera switchar tappade paket som &ouml;verf&ouml;rs mellan Synology NAS och Active Directory Server p&aring; grund av ogiltig MTU-storlek p&aring; paketen.
		<ul>
			<li>V&auml;nligen kontrollera inst&auml;llningarna f&ouml;r gr&auml;nssnitt mellan Synology NAS- och Active Directory Server.</li>
		</ul>
	</li>
	<li><strong>Kontrollera om tiden &auml;r synkad mellan Synology NAS och dom&auml;nen</strong>: Tiden p&aring; din Synology NAS &auml;r utdaterad i f&ouml;rh&aring;llande till dom&auml;nservern.
		<ul>
			<li>Du kan konfigurera tj&auml;nsten NTP p&aring; Synology NAS f&ouml;r att synka tiden med den dom&auml;nserver eller aktivera att <strong>Synology NAS synkroniserar med en NTP-server varje g&aring;ng en dom&auml;nanv&auml;ndare loggar</strong> in i <strong>Dom&auml;nalternativ</strong>.</li>
		</ul>
	</li>
</ul>

</body>
</html>