<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Avancerade inst&auml;llningar f&ouml;r anv&auml;ndare</h2>

<p>F&ouml;r att &auml;ndra avancerade inst&auml;llningar f&ouml;r anv&auml;ndare kan du g&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Anv&auml;ndare</strong> &gt; <strong>Avancerad</strong>. Nedanst&aring;ende alternativ &auml;r tillg&auml;ngliga. </p>

<h3>L&ouml;senordsinst&auml;llningar</h3>
<p>Du kan st&auml;lla in inst&auml;llningar som h&ouml;r till regler f&ouml;r l&ouml;senordss&auml;kerhet och -styrka f&ouml;r anv&auml;ndare p&aring; din Synology NAS.</p>

<h4>Att till&aring;ta anv&auml;ndare att &aring;terst&auml;lla gl&ouml;mda l&ouml;senord via e-post:</h4>
<ol>
	<li>Bocka f&ouml;r kryssrutan <strong>Till&aring;t anv&auml;ndare som inte &auml;r admin att &aring;terst&auml;lla gl&ouml;mda l&ouml;senord via e-post</strong>.</li>
	<li>Klicka p&aring; <strong>Till&auml;mpa</strong> f&ouml;r att spara inst&auml;llningarna.</li>
	<li>L&auml;nken med texten &rdquo;Gl&ouml;mt ditt l&ouml;senord?&rdquo; visas p&aring; inloggningssidan till DSM. N&auml;r l&ouml;senordet har gl&ouml;mts bort kan anv&auml;ndaren klicka p&aring; den h&auml;r l&auml;nken och ange anv&auml;ndarnamnet. I det h&auml;r fallet kommer systemet att skicka ett e-postmeddelande till anv&auml;ndaren, med en l&auml;nk till &aring;terst&auml;llning av det gl&ouml;mda l&ouml;senordet.</li>
</ol>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>Innan aktivering av detta alternativ, v&auml;nlig tillse att du redan aktiverat SMTP f&ouml;r e-postmeddelanden. F&ouml;r att g&ouml;ra detta, g&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Meddelande</strong>.</li>
	<li>F&ouml;r att erh&aring;lla meddelande fr&aring;n systemet, m&aring;ste anv&auml;ndare ha angett en e-postadress i avsnittet f&ouml;r anv&auml;ndarinformation i sitt konto.</li>
	<li>Anv&auml;ndare som h&ouml;r till gruppen <strong>administrators</strong> kan inte &aring;terst&auml;lla l&ouml;senord med detta alternativ.</li>
	<li>Dom&auml;nanv&auml;ndare kan inte &aring;terst&auml;lla l&ouml;senord med detta alternativ.</li>
	<li>LDAP-anv&auml;ndare kan &aring;terst&auml;lla l&ouml;senord med det h&auml;r alternativet, s&aring; l&auml;nge som Synology NAS agerar server f&ouml;r LDAP directory Server och uppfyller f&ouml;ljande villkor:
		<ul>
			<li>Versionen p&aring; filpaketet Synology <strong>Directory Server</strong> m&aring;ste vara 2457 eller h&ouml;gre.</li>
			<li>LDAP-anv&auml;ndare kan inte vara medlem av administrators, Directory Operators, Directory Consumers eller Directory Clients.</li>
			<li>Om Synology Directory Server &auml;r en <strong>Consumer</strong> m&aring;ste dess <strong>Provider</strong> uppfylla de villkor som n&auml;mns h&auml;r nedanf&ouml;r.</li>
			<li>Slutlig Provider m&aring;ste vara &aring;tkomlig via anv&auml;ndarens webbl&auml;sare och dess e-postmeddelanden m&aring;ste vara aktiverad.</li>
			<li>F&ouml;r att undvika att l&auml;nken f&ouml;r &aring;terst&auml;llning av l&ouml;senord anv&auml;nds av n&aring;gon annan m&aring;ste klickning p&aring; l&auml;nken ske fr&aring;n en IP-adress som &auml;r identiskt med den fr&aring;n vilken beg&auml;ran om &aring;terst&auml;llning av l&ouml;senord gjordes.</li>
		</ul>
	</li>
</ul>
</div>

<h4>Att tvinga anv&auml;ndare att byta l&ouml;senord vid &aring;terst&auml;llning av l&ouml;senord:</h4>
<ol>
	<li>Bocka f&ouml;r kryssrutan <strong>Framtvinga att anv&auml;ndare byter l&ouml;senord efter att administrat&ouml;ren har &aring;terst&auml;llt l&ouml;senordet</strong>.</li>
	<li>Klicka p&aring; <strong>Till&auml;mpa</strong> f&ouml;r att spara inst&auml;llningarna.</li>
	<li>N&auml;r administrat&ouml;ren byter l&ouml;senordet &aring;t en anv&auml;ndare &auml;r det obligatoriskt f&ouml;r anv&auml;ndare att &auml;ndra sitt l&ouml;senord vid n&auml;sta inloggning.</li>
</ol>

<h4>Aktivera regler f&ouml;r l&ouml;senordsstyrka:</h4>
<ol>
	<li>Bocka f&ouml;r kryssrutan <strong>Till&auml;mpa regler f&ouml;r l&ouml;senordsstyrka</strong>.</li>
	<li>Bocka f&ouml;r eller ta bort bocken i de f&ouml;ljande alternativen i enlighet med dina behov:
		<ul>
			<li><strong>Uteslut namn och beskrivning av anv&auml;ndaren fr&aring;n l&ouml;senordet</strong>: L&ouml;senordet f&aring;r inte inneh&aring;lla anv&auml;ndarens namn eller anv&auml;ndarens beskrivning. UTF-8-kodade tecken &auml;r uteslutna.</li>
			<li><strong>Inkludera b&aring;de gemener och versaler</strong>: L&ouml;senordet m&aring;ste inneh&aring;lla b&aring;de gemena (sm&aring;) och versala (stora) bokst&auml;ver.</li>
			<li><strong>Inkludera numeriskt tecken</strong>: L&ouml;senordet m&aring;ste inneh&aring;lla minst ett numeriskt tecken (0~9).</li>
			<li><strong>Inkludera specialtecken</strong>: L&ouml;senordet m&aring;ste inneh&aring;lla minst ett ASCII-specialtecken (dvs., <span class="note_content">~ ` ! @ # $ % ^ &amp; * ( ) - _ = + [ { ] } \ | ; : ' &quot; &lt; &gt; / ?</span>).</li>
			<li><strong>Uteslut vanliga l&ouml;senord</strong>: G&ouml;r att anv&auml;ndare inte kan anv&auml;nda vanliga l&ouml;senord s&aring;som <em>123456</em>, <em>password</em>, <em>qwerty</em>, etc.</li>
			<li><strong>Minsta l&auml;ngd p&aring; l&ouml;senord</strong>: L&ouml;senordet m&aring;ste vara minst det v&auml;rde som specificeras i textf&auml;ltet. L&ouml;senordets l&auml;ngd ska vara mellan 6 och 127 tecken.</li>
			<li><strong>L&ouml;senordshistorik</strong>: L&ouml;senordet m&aring;ste skilja sig &aring;t fr&aring;n de tidigare anv&auml;nda, hur m&aring;nga ska specificeras h&auml;r.</li>
		</ul>
	</li>
	<li>Klicka p&aring; <strong>Till&auml;mpa</strong> f&ouml;r att spara inst&auml;llningarna.</li>
</ol>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>Regler f&ouml;r l&ouml;senordsstyrka g&auml;ller endast nya l&ouml;senord. Till exempel, nya regler f&ouml;r l&ouml;senordsstyrka appliceras bara n&auml;r ett nytt konto skapas eller n&auml;r en befintligt anv&auml;ndare byter sitt l&ouml;senord. Befintliga l&ouml;senord och de som h&ouml;r till importerade anv&auml;ndare &auml;r undantagna fr&aring;n nya l&ouml;senordsregler.</li>
</ul>
</div>

<h3>L&ouml;senordet upph&ouml;r att g&auml;lla</h3>
<p>Du kan f&ouml;rb&auml;ttra s&auml;kerheten f&ouml;r anv&auml;ndare med funktionen f&ouml;rfallotid f&ouml;r l&ouml;senord f&ouml;r att tvinga anv&auml;ndare att &auml;ndra l&ouml;senord efter en specificerad tidsperiod.</p>

<h4>Att konfigurera schema f&ouml;r f&ouml;rfallotid f&ouml;r l&ouml;senord:</h4>
<ol>
	<li>Bocka f&ouml;r kryssrutan <strong>Aktivera f&ouml;rfallotid f&ouml;r l&ouml;senord</strong>.</li>
	<li>F&ouml;ljande alternativ finns att konfigurera:
		<ul>
			<li><strong>Maximal giltighetstid f&ouml;r l&ouml;senordet</strong>: Specificera antalet dagar efter vilka l&ouml;senordet upph&ouml;r att g&auml;lla.</li>
			<li><strong>Kortaste giltighetstid f&ouml;r l&ouml;senordet</strong>: Bocka f&ouml;r kryssrutan f&ouml;r att aktivera den h&auml;r funktionen och specificera antalet dagar innan anv&auml;ndaren har till&aring;telse att byta sitt l&ouml;senord.</li>
			<li><strong>Uppmana anv&auml;ndare att &auml;ndra l&ouml;senord innan giltigheten upph&ouml;r att g&auml;lla</strong>: Bocka f&ouml;r kryssrutan f&ouml;r att aktivera den h&auml;r funktionen och specificera antalet dagar innan l&ouml;senordet upph&ouml;r att g&auml;lla som anv&auml;ndaren, vid inloggning, ska uppmanas att &auml;ndra sitt l&ouml;senord.</li>
			<li><strong>Till&aring;t att anv&auml;ndare &auml;ndrar l&ouml;senord efter det upph&ouml;rt att g&auml;lla</strong>: Bocka f&ouml;r kryssrutan f&ouml;r att till&aring;ta anv&auml;ndare att logga in med sina nuvarande l&ouml;senord som upph&ouml;rt att g&auml;lla och &auml;ndra sina l&ouml;senord.</li>
			<li><strong>Skicka e-postmeddelanden om att giltigheten upph&ouml;rt</strong>: Bocka f&ouml;r kryssrutan f&ouml;r att meddela anv&auml;ndare, via e-postmeddelande, att deras l&ouml;senord upph&ouml;rt att g&auml;lla.</li>
		</ul>
	</li>
	<li>Klicka p&aring; <strong>Till&auml;mpa</strong> f&ouml;r att spara inst&auml;llningarna.</li>
</ol>

<h3>2-stegsverifikation</h3>
<p>2-stegsverifikation ger dig &ouml;kad s&auml;kerhet f&ouml;r anv&auml;ndare i DSM. Du kan framtvinga administrators i DSM eller alla anv&auml;ndare i DSM att aktivera deras 2-stegsverifikation f&ouml;r att ytterligare skydda deras konton.</p>

<h4>F&ouml;r att aktivera 2-stegsverifikation f&ouml;r anv&auml;ndare i DSM:</h4>
<ol>
	<li>Markera rutan <strong>Framtvinga 2-stegsverifikation f&ouml;r de f&ouml;ljande anv&auml;ndarna</strong> och v&auml;lj vilka anv&auml;ndare du vill till&auml;mpa detta p&aring;.</li>
	<li>Klicka p&aring; <strong>Till&auml;mpa</strong> f&ouml;r att spara inst&auml;llningarna.</li>
	<li>Med detta framtvingande till&auml;mpat kommer anv&auml;ndare som inte har aktiverat sin 2-stegsverifikation att bli ombedda att slutf&ouml;ra inst&auml;llningarna innan de kan logga in till DSM.</li>
</ol>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>Om du fortfarande inte har konfigurerat 2-stegsverifikation i <strong>Personlig</strong> &gt; <strong>Konto</strong> kommer installationsguiden f&ouml;r 2-stegsverifikation att startas f&ouml;r att hj&auml;lpa dig slutf&ouml;ra de n&ouml;dv&auml;ndiga inst&auml;llningarna innan du kan till&auml;mpa detta framtvingande.</li>
	<li>Avaktivering av framtvingad 2-stegsverifikation h&auml;r p&aring;verkar inte och avaktiverar heller inte inst&auml;llningarna f&ouml;r 2-stegsverifikation f&ouml;r varje anv&auml;ndare. Anv&auml;ndare kan beh&aring;lla sina inst&auml;llningar f&ouml;r 2-stegsverifikation eller g&aring; till <strong>Personlig</strong> &gt; <strong>Konto</strong> f&ouml;r att avaktivera dessa inst&auml;llningar.</li>
	<li style="display: none;">2-Stegsverifikation till&auml;mpas &auml;ven f&ouml;r alla SSH-relaterade tj&auml;nster, s&aring;dana som SSH-terminal, SFTP och rsync med SSH-&ouml;verf&ouml;ringskryptering. Eftersom Hyper Backup och Synkronisera delade mappar via rsync med SSH-kryptering inte har st&ouml;d f&ouml;r 2-stegsverifikation kommer dessa tv&aring; tj&auml;nster inte att kunna fungera normalt efter att 2-stegsverifikation &auml;r aktiverat.</li>
</ul>
</div>


<h3>Anv&auml;ndarhem</h3>

<p>Aktivera anv&auml;ndarhem f&ouml;r att skapa en personlig <strong>home</strong>-mapp f&ouml;r alla anv&auml;ndare undantaget <strong>guest</strong>. Alla anv&auml;ndare kan f&aring; &aring;tkomst till sin egen home-mapp via CIFS, AFP, FTP eller File Station.</p>

<p>Anv&auml;ndare som h&ouml;r till gruppen <strong>administrators</strong> kan f&aring; &aring;tkomst till alla personliga mappar som finns i den delade mapp som &auml;r standard i <strong>homes</strong>. Namnet p&aring; home-mappen &auml;r det samma som anv&auml;ndare.</p>

<h4>Aktivera tj&auml;nsten Anv&auml;ndarhem:</h4>
<ol>
	<li>Markera <strong>Aktivera tj&auml;nsten Anv&auml;ndarhem</strong>.</li>
	<li>Om det finns flera volymer, v&auml;lj var du vill att mappen <strong>homes</strong> ska lagras.</li>
	<li>Klicka p&aring; <strong>Till&auml;mpa</strong>.</li>
</ol>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>N&auml;r tj&auml;nsten anv&auml;ndarhem f&ouml;r lokala anv&auml;ndare avaktiveras kommer &auml;ven tj&auml;nsten anv&auml;ndarhem f&ouml;r dom&auml;nanv&auml;ndare att avaktiveras samtidigt.</li>
</ul>
</div>

<h4>Avaktivera tj&auml;nsten Anv&auml;ndarhem:</h4>
<ol>
	<li>Avmarkera <strong>Aktivera tj&auml;nsten Anv&auml;ndarhem</strong>.</li>
	<li>Klicka p&aring; <strong>Till&auml;mpa</strong> f&ouml;r att spara inst&auml;llningarna.</li>
</ol>

<p>Efter att tj&auml;nsten anv&auml;ndarhem &auml;r avaktiverat reserveras den delade mappen <strong>homes</strong> f&ouml;r administrat&ouml;rs&aring;tkomst.  Anv&auml;ndare kommer att kunna f&aring; &aring;tkomst till sina home-mappar igen n&auml;r tj&auml;nsten f&ouml;r anv&auml;ndarhem aktiveras igen.</p>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>F&ouml;r att radera den delade mappen <strong>homes</strong> m&aring;ste f&ouml;rst tj&auml;nsten anv&auml;ndarhem avaktiveras.</li>
	<li>Tj&auml;nsten Anv&auml;ndarhem f&ouml;r dom&auml;nanv&auml;ndare avaktiveras om tj&auml;nsten Anv&auml;ndarhem f&ouml;r lokala anv&auml;ndare avaktiveras.</li> 
</ul> 
</div>

</body>	
</html> 