<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>AFP</h2>
<p>I <strong>Kontrollpanel</strong> &gt; <strong>Filtj&auml;nster</strong> &gt; <strong>SMB/AFP/NFS</strong> kan du aktivera AFP-tj&auml;nst f&ouml;r att g&ouml;ra Synology NAS till en Mac-filserver (AFP-server).</p>

<h4>Aktivera Mac-filservice:</h4>
<ol>
	<li>Bocka f&ouml;r <strong>Aktivera tj&auml;nsten AFP</strong> f&ouml;r att g&ouml;ra Synology NAS till en Mac-filserver (AFP-server).</li>
	<li>Klicka p&aring; <strong>Till&auml;mpa</strong>.</li>
</ol>


<h3>Aktivera loggning av &ouml;verf&ouml;ring</h3>
<p>Att markera detta alternativ aktiverar loggning av fil&aring;tkomst&aring;g&auml;rder, inklusive skapande, radering, l&auml;sning, skrivning, flyttning och namnbyte f&ouml;r filer eller mappar via AFP &auml;ven k&auml;nt som Apple Filing Protocol.</p>

<h3>Avancerade inst&auml;llningar</h3>

<h4>Till&auml;mpa standardr&auml;ttigheter f&ouml;r UNIX:</h4>
<p>Aktivering av detta alternativ applicerar standardr&auml;ttigheterna f&ouml;r UNIX f&ouml;r att ladda upp eller skapa filer och mappar. Till&auml;mpade beh&ouml;righeter &auml;r de samma som de beh&ouml;righeter som appliceras av UNIX-kommandot <strong>umask</strong>. N&auml;r detta alternativ &auml;r aktiverat &auml;r beh&ouml;righeterna f&ouml;r UNIX 644 f&ouml;r filer och 755 f&ouml;r mappar. N&auml;r detta alternativ &auml;r avaktiverat &auml;r beh&ouml;righeterna f&ouml;r UNIX 666 f&ouml;r filer och 777 f&ouml;r mappar. Standardv&auml;rdet f&ouml;r umask &auml;r 022.</p>

<div class="section"><h4>Obs:</h4>
<p>Aktivering av detta alternativ kan orsaka problem med inkonsekventa beh&ouml;righeter mellan olika protokoll. F&ouml;r att undvika inkonsekvens rekommenderar vi att detta alternativ l&auml;mnas avaktiverat.</p>
</div>

<h4>Frig&ouml;r omedelbart resurser efter fr&aring;nkoppling:</h4>
<p>Aktivering av det h&auml;r alternativet frig&ouml;r omedelbart resurser n&auml;r anslutningen till AFP-server ov&auml;ntat kopplar fr&aring;n. Om du tar emot felmeddelandet &rdquo;Volymen anv&auml;nds&rdquo; n&auml;r Time Machine anv&auml;nds, v&auml;nligen aktivera det h&auml;r alternativet.</p>



<h4 class="disable-hi3535">Att s&ouml;ka efter filers inneh&aring;ll via Finder:</h4>
<p class="disable-hi3535">N&auml;r mappar &auml;r fullst&auml;ndigt indexerade och sedan monterade p&aring; din Mac-dator kan du anv&auml;nda Finder f&ouml;r att s&ouml;ka efter inneh&aring;ll i filerna de inneh&aring;ller.</p>
<ol class="disable-hi3535">
	<li>G&aring; till <strong>Universal Search</strong> &gt; <strong>Preferenser</strong> &gt; <strong>Filindexering</strong> &gt; <strong>Lista &ouml;ver indexerade mappar</strong> &gt; <strong>Skapa</strong> f&ouml;r att indexera specifika mappar och de filer de inneh&aring;ller efter filtyp.</li>
	<li>Klicka p&aring; <strong>OK</strong> f&ouml;r att utf&ouml;ra indexering.</li>
	<li>Montera de indexerade mapparna p&aring; din Mac-dator.</li>
	<li>P&aring; din Mac-dator, klicka p&aring; den &ouml;nskade monterade mappen i den v&auml;nstra panelen i Finder och anv&auml;nd Finder f&ouml;r att s&ouml;ka efter inneh&aring;ll i filerna den inneh&aring;ller.</li>
</ol>

<div class="section disable-hi3535"><h4>Obs:</h4>
<ul>
	<li>Anv&auml;nd Finder f&ouml;r att s&ouml;ka i monterade mappar. Spotlight p&aring; skrivbordet i Mac kan bara anv&auml;ndas f&ouml;r att s&ouml;ka efter lokala filer.</li>
	<li>P&aring; Mac OS X 10.9 och senare versioner har Finder st&ouml;d f&ouml;r att s&ouml;ka inom monterade mappar, per taggnamn och kategori.</li>
</ul>
</div>

</body>
</html>