<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Win/Mac/NFS</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SMB</h2>

<p>SMB (Server Message Block)-protokollet g&ouml;r att Windows-, Mac- och Linux-klienter som har st&ouml;d f&ouml;r SMB/CIFS f&aring;r &aring;tkomst till data lagrad p&aring; Synology NAS. Om du vill bl&auml;ddra bland filer p&aring; Synology NAS via Utforskaren eller montera delade mapparna som n&auml;tverksenheter, v&auml;nligen aktivera detta alternativ i <strong>Kontrollpanel</strong> &gt; <strong>Filtj&auml;nster</strong> &gt; <strong>SMB/AFP/NFS</strong>.</p>


<h4>Att aktivera SMB-protokoll:</h4>
<ol>
<li>
Bocka f&ouml;r <b>Aktivera SMB-tj&auml;nst</b>.
</li>
<li>
Klicka p&aring; <b>Till&auml;mpa</b>.
</li>
</ol>

<div class="section disable-hi3535">
<h4>Obs:</h4>
<p>Efter aktivering av SMB-protokollet kan du montera fullst&auml;ndigt indexerade mappar p&aring; din Mac-dator via SMB och anv&auml;nda Finder f&ouml;r att s&ouml;ka efter filernas inneh&aring;ll i de monterade mapparna.</p>
</div>


<h3>Arbetsgrupp</h3>
<p>Detta alternativ l&aring;ter dig designera systemet som en medlem av en specifik arbetsgrupp med syfte n&auml;tverkshantering.</p>

<div class="section">

<h4>Obs:</h4>
<ul>
<li>Arbetsgruppens namn kan inneh&aring;lla 1 till 15 tecken. Namnet kan inte inneh&aring;lla f&ouml;ljande tecken: [ ] ; : &quot; &lt; &gt; * + = \ / | ? ,</li>
<li>Om du anv&auml;nder en Mac med OS X 10.9 och din Synology NAS har anslutit till en Windowsdom&auml;n, kan du logga in genom att l&auml;gga till <strong>localhost\</strong> f&ouml;re det lokala anv&auml;ndarnamnet p&aring; din Synology NAS f&ouml;r att f&aring; &aring;tkomst till filer som lagras p&aring; Synology NAS via SMB-protokollet.</li>
</ul>
</div>

<h3 class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Till&aring;t inte &aring;tkomst till tidigare versioner</h3>
<p class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">I Utforskaren kan anv&auml;ndare f&aring; &aring;tkomst till &ouml;gonblicksbilder f&ouml;r mappar och filer genom att klicka p&aring; fliken <strong>Tidigare versioner</strong> i en delad mapp vilket m&ouml;jligg&ouml;r &aring;terst&auml;llning eller kopiering av data utan hj&auml;lp fr&aring;n en administrat&ouml;r. Om du v&auml;ljer <strong>Till&aring;t inte &aring;tkomst till tidigare versioner</strong> visar sidan &rdquo;Tidigare versioner&rdquo; inte n&aring;gon information.</p>

<div class="section enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><h4>Obs:</h4>
<ul>
	<li>Anv&auml;ndare har bara l&auml;sbeh&ouml;righet f&ouml;r kopian av snapshotet om, det vid den tiden snapshotet togs, de redan hade sina konton skapade och de hade tilldelats l&auml;sbeh&ouml;righet f&ouml;r den delade mappen f&ouml;r vilken det motsvarande snapshotet tagits.</li>
</ul>
</div>

<h3>Aktivera loggning av &ouml;verf&ouml;ring</h3>
<p>Att markera detta alternativ aktiverar loggning av fil&aring;tkomst&aring;tg&auml;rder, inklusive skapande, borttagning, l&auml;sning, skrivning, flyttning och namnbyte f&ouml;r filer eller mappar via protokollen CIFS/SMB, &auml;ven k&auml;nt som SMB-protokollet.</p>

<h3>Avancerade inst&auml;llningar</h3>
<p>Klicka p&aring; knappen <strong>Avancerade inst&auml;llningar</strong> f&ouml;r att se nedanst&aring;ende alternativ.</p>
<ul>
<li><strong>WINS Server</strong>: Microsoft Windows Internet Name Service (WINS) &auml;r en NetBIOS-tj&auml;nst f&ouml;r mappning av namn-till-IP-adress. Windows-anv&auml;ndare kommer att hitta systemet l&auml;ttare p&aring; TCP/IP-n&auml;tverk om systemet har konfigurerats f&ouml;r att registrera sig med en WINS-server.</li>
<li><strong>Max SMB-protokoll</strong>: Beroende p&aring; din n&auml;tverkskonfiguration, st&auml;ll in det senaste SMB-protokoll som st&ouml;ds av din Synology NAS.
  <ul>
  <li><strong>SMB1</strong>: SMB1 (&auml;ven kallad CIFS) har haft st&ouml;d sedan Windows NT.</li>
    <li><strong>SMB2</strong>: SMB2 har haft st&ouml;d sedan Windows Vista och &auml;r den f&ouml;rb&auml;ttrade versionen av SMB. SMB2 l&auml;gger till m&ouml;jligheten att sammanst&auml;lla flera SMB-&aring;tg&auml;rder till en enstaka f&ouml;rfr&aring;gan f&ouml;r att reducera antalet n&auml;tverkspaket och f&ouml;rb&auml;ttra prestandan.</li>
    <li><strong>SMB2 och Large MTU</strong>: Maximum transmission unit (MTU) (&ouml;versatt till svenska maximal &ouml;verf&ouml;ringsenhet) avser den st&ouml;rsta dataenhet som kan &ouml;verf&ouml;ras &ouml;ver ett kommunikationsprotokoll. F&ouml;r att kunna dra f&ouml;rdel av snabbare n&auml;tverksgr&auml;nssnitt, s&aring;som 1- eller 10-gigabit Ethernet, &ouml;kar Large MTU den maximala &ouml;verf&ouml;ringsenheten (MTU) till 1 megabyte (MB). Att aktivera Large MTU f&ouml;rb&auml;ttrar hastigheten och effektiviteten f&ouml;r stora fil&ouml;verf&ouml;ringar, medan det minskar antalet paket som beh&ouml;ver bearbetas.</li>
    <li><strong>SMB3</strong>: SMB3 har haft st&ouml;d sedan Windows 8 och Windows Server 2012. Det &auml;r den ut&ouml;kade versionen av SMB2. SMB3 st&ouml;der &ouml;verf&ouml;ring med AES-baserad filkryptering och f&ouml;rb&auml;ttrar p&aring; s&aring; s&auml;tt s&auml;kerheten f&ouml;r &ouml;verf&ouml;ringar med peer-to-peer.</li>
</ul>
<div class="section">
  <h4>Obs:</h4>
  <ul>
    <li>SMB2 st&ouml;ds av Windows Vista, Windows Server 2008 R2, Windows 7 och senare.</li>
    <li>Large MTU st&ouml;ds av Windows Server 2008 R2, Windows 7 och senare.</li>
    <li>F&ouml;r att g&ouml;ra MTU mer effektivt p&aring; din Windowsdator beh&ouml;ver du &auml;ndra datorns registerinst&auml;llningar. F&ouml;r mer information, v&auml;nligen se Microsoft tekniska support (s&aring;som denna <a href="http://technet.microsoft.com/en-us/library/ff625695(v=ws.10).aspx" target="_blank">artikel</a>).</li>
    </ul>
</div>
<li><strong>Min SMB-protokoll</strong>: Beroende p&aring; din n&auml;tverkskonfiguration, st&auml;ll in det tidigaste SMB-protokoll som st&ouml;ds av din Synology NAS.</li>
<li><strong>Transportkrypteringsl&auml;ge</strong>: N&auml;r SMB3 &auml;r aktiverat l&auml;gger SMB-protokollet till transportkryptering f&ouml;r att st&auml;rka s&auml;kerheten f&ouml;r fil&ouml;verf&ouml;ring.
  <ul>
    <li><b>Avaktivera</b>: Ingen transportkryptering till&auml;mpas.</li>
    <li><b>Auto</b>: Transportkryptering till&auml;mpas bara p&aring; klienter som har st&ouml;d f&ouml;r den h&auml;r funktionen.</li>
    <li><b>Framtvinga</b>: Transportkryptering till&auml;mpas alltid. Det g&ouml;r att klienter som saknar st&ouml;d f&ouml;r transportkryptering inte kan anv&auml;nda SMB-protokollet.</li>
  </ul>
</li>
<div class="section">
  <h4>Obs:</h4>
  <ul>
    <li>Transportkryptering st&ouml;ds av Windows 8, Windows Server 2012 och senare.</li>
    <li>Anonym inloggning f&ouml;r SMB-protokollet st&ouml;ds inte n&auml;r transportkryptering &auml;r aktiverat.</li>
    <li>N&auml;r transportkryptering &auml;r aktiverat, v&auml;nligen l&auml;mna <b>Avaktivera Opportunistic Locking</b> omarkerad f&ouml;r att undvika timeouts i applikationen.</li>
    </ul>
</div>
<li><strong>Avaktivera Opportunistic Locking</strong>: V&auml;lj f&ouml;r att aktivera &rdquo;Opportunistic Locking&rdquo; f&ouml;r CIFS s&aring; att klienten b&auml;ttre kan cacha filinneh&aring;ll och undvika mindre overhead f&ouml;r l&auml;sa/skriva. N&auml;r det h&auml;r alternativet &auml;r avaktiverat blir prestandan f&ouml;r databasapplikationer b&auml;ttre vid &aring;tkomst till databasfiler som lagras p&aring; Synology NAS via n&auml;tverk.
	<ul>
    <li><strong>Aktivera SMB2-l&aring;n</strong>: Aktivering av det h&auml;r alternativet till&aring;ter fler SMB2-relaterade inst&auml;llningar f&ouml;r att finjustera cachemekanism, som tillhandah&aring;lls av Opportunistic Locking, f&ouml;r klient.</li>
    </ul>

</li>



<li>
  <strong>Aktivera Local Master Browser</strong>: N&auml;r flera Windows-datorer finns i samma subn&auml;t kommer de att f&ouml;rhandla och v&auml;lja en dator som blir &rdquo;local master browser&rdquo;. Local master browser underh&aring;ller listan &ouml;ver andra datorer inom subn&auml;tet och delas delade resurser och delar denna lista med de andra datorerna. Detta alternativ l&aring;ter Synology NAS anta rollen som local master browser.
</li>

<div class="section">
<h4>Obs:</h4>
<p>Att aktivera denna funktion avaktiverar h&aring;rddiskens vilol&auml;gesmekanism och aktiverar &auml;ven guest-kontot utan l&ouml;senord.</p>
</div>


<li><strong>Aktivera modulen DirSort VFS</strong>: Sorterar mappnamnen och listar dem alfabetiskt. Aktivering av detta alternativ p&aring;verkar systemets prestanda.</li>

<li><strong>Vetofiler</strong>: D&ouml;ljer filer i enlighet med specifika kriteria. Kriteria kan inkludera jokertecken (*) och flera poster ska separeras med ett snedstreck (/). Till exempel: <i>/abc*/*.txt/*.conf/</i>. Aktivering av detta alternativ p&aring;verkar systemets prestanda.</li>

<li><strong>Till&aring;t symboliska l&auml;nkar i delade mappar</strong>: V&auml;lj f&ouml;r att till&aring;ta att symboliska l&auml;nkar pekar direkt p&aring; filer eller mappar inom samma delade mapp. Symboliska l&auml;nkar kan skapas genom att anv&auml;nda DSM terminal.
<ul>
	<li><strong>Till&aring;t symboliska l&auml;nkar mellan delade mappar</strong>: Markera f&ouml;r att till&aring;ta symboliska l&auml;nkar att peka p&aring; filer och mappar i olika delade mappar. Symboliska l&auml;nkar kan skapas genom att anv&auml;nda DSM terminal. Dock kan anv&auml;ndare utan privilegier f&aring; &aring;tkomst till m&aring;lets delade mappar f&ouml;r symboliska l&auml;nkar.</li>
</ul>
</li>


<li><strong>Aktivera modulen VFS f&ouml;r att konvertera specialtecken f&ouml;r Mac</strong>: V&auml;lj f&ouml;r att konvertera tecken, som reserverats f&ouml;r SMB (t.ex. &lt;   &gt;  &quot; * ?) i filnamn, till standard Latin n&auml;r filen skapas. S&aring;dana filer k&auml;nns igen via AFP.</li>
<li><strong>Aktivera modulen MSDFS VFS</strong>: L&aring;ter symboliska l&auml;nkar att peka till filer och mappar som finns p&aring; andra SMB-servrar. Med &auml;ldre versioner av Windows, s&aring;som Windows XP, beh&ouml;ver klienten och Synology NAS ansluta till en Windowsdom&auml;n innan detta alternativ aktiveras. F&ouml;r att f&aring; veta mer om att skapa MSDFS-l&auml;nkar, v&auml;nligen se <a href="http://www.samba.org/samba/docs/man/Samba-HOWTO-Collection/msdfs.html" target=_blank>h&auml;r</a>. V&auml;nligen observera att cache p&aring; klientenheten ska rensas efter att detta alternativ avaktiverats, i annat fall kan normala funktioner p&aring;verkas.</li>

<li><strong>Avaktivera flera anslutningar fr&aring;n samma IP-adress</strong>: N&auml;r detta alternativ &auml;r aktiverat till&aring;ter Synology NAS endast en anslutning per IP-adress fr&aring;n klienter som anv&auml;nder SMB-protokollet. N&auml;r flera klienter med samma IP-adress anv&auml;nder SMB-protokollet kommer Synology NAS beh&aring;lla den senaste och sl&auml;ppa alla &auml;ldre anslutningar. I en NAT-milj&ouml; kan klienten anv&auml;nda en enskild IP-adress, i s&aring;dant fall kan aktivering av detta alternativt p&aring;verka normala funktioner.</li>

<li><strong>Samla loggfiler &ouml;ver fels&ouml;kning</strong>: N&auml;r detta alternativ &auml;r aktiverat, kan detaljerade loggfiler lagras f&ouml;r fels&ouml;kningssyften. Aktivering av detta alternativ p&aring;verkar systemets prestanda.</li>
<li><strong>Till&auml;mpa standardr&auml;ttigheter f&ouml;r UNIX</strong>: Aktivera de h&auml;r alternativet f&ouml;r att applicera standardr&auml;ttigheterna f&ouml;r UNIX f&ouml;r att ladda upp eller skapa filer och mappar. Beh&ouml;righeter f&ouml;r UNIX kommer att vara 744 f&ouml;r filer och 755 f&ouml;r mappar. N&auml;r detta alternativ &auml;r avaktiverat &auml;r beh&ouml;righet f&ouml;r UNIX 777 f&ouml;r filer och mappar.</li>
<div class="section enable-eds14">
<h4>Obs:</h4>
<ul>
<li>Aktivering av detta alternativ kan orsaka problem med inkonsekventa beh&ouml;righeter mellan olika protokoll. F&ouml;r att undvika inkonsekvens rekommenderar vi att detta alternativ l&auml;mnas avaktiverat.</li>
</ul>
</div>
<div class="section disable-eds14">
<h4>Obs:</h4>
<ul>
  <li>F&ouml;r delade mappar d&auml;r Windows ACL aktiverats (alla utdelningar f&ouml;rutom &rdquo;photo&rdquo; och utdelningar p&aring; externa enheter), v&auml;nligen k&ouml;r kommandot <strong>chmod</strong> p&aring; din Linux- eller FTP-klient f&ouml;r att &auml;ndra typ av filbeh&ouml;righet fr&aring;n Windows ACL till UNIX.</li>
  <li>Aktivering av detta alternativ kan orsaka problem med inkonsekventa beh&ouml;righeter mellan olika protokoll. F&ouml;r att undvika inkonsekvens rekommenderar vi att detta alternativ l&auml;mnas avaktiverat.</li>
</ul>
</div>
<li><b>Reservera inte diskutrymme n&auml;r filer skapas</b>: Aktivera det h&auml;r alternativet f&ouml;r att inte till&aring;ta att diskutrymme reserveras n&auml;r filer skapas p&aring; din Synology NAS.</li>
<li><strong>Aktivera SMB-varaktiga referenser (fill&aring;sning mellan protokoll avaktiveras)</strong>: Aktivering av det h&auml;r alternativet l&aring;ter anv&auml;ndare &aring;terst&auml;lla f&ouml;rlorad SMB2-anslutning till denna Synology NAS efter tillf&auml;llig fr&aring;nkoppling; &ouml;ppnade filer f&ouml;rblir tillg&auml;ngliga under tiden n&auml;tverket &auml;r nere. Dock avaktiveras fill&aring;sning mellan protokoll s&aring; att anv&auml;ndare kan f&aring; &aring;tkomst till eller &auml;ndra en l&aring;st fil via andra protokoll &auml;n SMB2 (t.ex. AFP).</li>
<li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><b>Aktivera snabb klon f&ouml;r Btrfs</b>: Aktivering av det h&auml;r alternativet g&ouml;r att anv&auml;ndaren kan kopiera filer med snabbare hastigheter n&auml;r b&aring;de k&auml;llan och m&aring;let finns p&aring; samma Btrfs volym.</li>
<li><strong>Rensa SMB-cache</strong>: Klicka p&aring; denna knapp f&ouml;r att radera f&ouml;ljande SMB-cachefiler f&ouml;r fels&ouml;kningssyften:
  <ul>

<li>/var/cache/samba/netsamlogon_cache.tdb</li>
<li>/var/lib/samba/winbindd_cache.tdb</li>
<li>/var/lib/samba/share_info.tdb</li>
<li>/var/lib/samba/registry.tdb</li>
<li>/run/samba/connections.tdb</li>
<li>/run/samba/gencacche.tdb</li>
<li>/run/samba/gencache_notran.tdb</li>
</ul>
</li>

</ul>

</body>
</html>
