<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Skapa en Delad mapp - Synology DSM Hj&auml;lp</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Shared folders are the basic directories where you can store and manage files and folders on your Synology NAS. This article shows you how to create a shared folder.">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Skapa en Delad mapp</h2>
<p>Delade mappar &auml;r de grundl&auml;ggande mapparna d&auml;r du kan lagra och hantera filer och mappar p&aring; din Synology NAS. Innan du lagrar n&aring;gra filer beh&ouml;ver du skapa minst en delad mapp i DSM. </p>

<h4>S&aring; h&auml;r g&ouml;r du f&ouml;r att skapa en delad mapp:</h4>
<ol>
	<li>G&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Delad mapp</strong> och klicka p&aring; <strong>Skapa</strong>.<br /><img src="about:blank" class="help_image"/></li>
	<li>Specificera ett namn och en beskrivning av den delade mappen.<br /><img src="about:blank" class="help_image disable-bromolow disable-grantley disable-avoton disable-braswell disable-broadwell disable-kvmx64 disable-cedarview disable-apollolake disable-denverton"/><img src="about:blank" class="help_image enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"/></li>
	<li>V&auml;lj ett lagringsutrymme p&aring; vilken den delade mappen ska skapas (hoppa &ouml;ver detta alternativ om det bara finns ett lagringsutrymme).<br /><img src="about:blank" class="help_image disable-bromolow disable-grantley disable-avoton disable-braswell disable-broadwell disable-kvmx64 disable-cedarview disable-apollolake disable-denverton"/><img src="about:blank" class="help_image enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"/></li>
	<li>&Auml;ndra, om n&ouml;dv&auml;ndigt, f&ouml;ljande alternativ:<br /><img src="about:blank" class="help_image disable-bromolow disable-grantley disable-avoton disable-braswell disable-broadwell disable-kvmx64 disable-cedarview disable-apollolake disable-denverton"/><img src="about:blank" class="help_image enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"/>
		<ul>
			<li><strong>D&ouml;lj denna delade mapp i &rdquo;Mina n&auml;tverksplatser&rdquo;:</strong> F&ouml;rhindrar att den delade mappen visas under &rdquo;N&auml;tverk&rdquo; i Windows filutforskare. Detta alternativ p&aring;verkar inte &aring;tkomstprivilegierna f&ouml;r den delade mappen.
				<div class="section"><h4>Obs:</h4>
				<ul>
				<li>Att d&ouml;lja en delad mapp i &rdquo;Mina n&auml;tverksplatser&rdquo; p&aring;verkar inte dess &aring;tkomstr&auml;ttigheter. &Aring;tkomstr&auml;ttigheterna f&ouml;r en dold delad mapp &auml;ndras inte. Anv&auml;ndare som har r&auml;tt &aring;tkomstr&auml;ttigheter till den delade mappen kan fortfarande f&aring; &aring;tkomst till den genom att ange &rdquo;\\servernamn\namn p&aring; delad mapp&rdquo;.</li>
				</ul>
				</div>
			</li>
			<li><strong>D&ouml;lj undermappar och filer fr&aring;n anv&auml;ndare som saknar beh&ouml;righet:</strong> N&auml;r <strong>D&ouml;lj undermappar och filer fr&aring;n anv&auml;ndare som saknar beh&ouml;righet</strong> &auml;r aktiverat f&aring;r inte en anv&auml;ndare, utan l&auml;sr&auml;ttigheter, som f&ouml;rs&ouml;ker f&aring; &aring;tkomst till en delad mapp via protokollet Fildelning i Windows m&ouml;jlighet att se undermappar eller filer i den delade mappen. Detta f&ouml;rhindrar att anv&auml;ndare blir f&ouml;rvirrade n&auml;r de ansluter till sin Synology-produkt och ser ett stort antal filer och undermappar som de inte kan &ouml;ppna.
				<div class="section"><h4>Obs:</h4>
				<ul>
					<li>Denna funktion st&ouml;ds bara av protokollet Fildelning i Windows.</li>
					<li>Du kan &auml;ndra beh&ouml;righetsinst&auml;llningarna f&ouml;r varje mapp och fil i File Station genom att h&ouml;gerklicka p&aring; den. V&auml;lj <strong>Egenskaper</strong> i rullgardinsmenyn och klicka p&aring; fliken <strong>Beh&ouml;righet</strong>.</li>
					<li>Den delade mappen i sig sj&auml;lvt kommer inte att vara dold f&ouml;r anv&auml;ndare utan beh&ouml;righet genom aktivering av <strong>D&ouml;lj undermappar och filer fr&aring;n anv&auml;ndare som saknar beh&ouml;righet</strong>. Endast undermappar och filer inom den h&auml;r delade mappen kommer att vara dolda.</li>
				</ul>
				</div>
			</li>
		</ul>
	</li>
	<li><strong>Aktivera papperskorgen:</strong> N&auml;r filer i den delade mappen raderas kommer de att flyttas till en mapp som heter <strong>Papperskorg</strong>. &Aring;tkomst till papperskorgen kan &auml;ndras f&ouml;r anv&auml;ndare som h&ouml;r till gruppen <strong>administrators</strong>.</li>
	<a name="sharequota"></a><li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><strong>Aktivera kvot f&ouml;r delade mappar:</strong> F&ouml;r att specificera den maximala kapaciteten f&ouml;r varje delad mapp, markera <strong>Aktivera kvot f&ouml;r delade mappar</strong> och ange den maximala kapaciteten (dvs. 10 GB) i f&ouml;ljande f&auml;lt.
		<div class="section"><h4>Obs:</h4>
		<ul>
			<li>Endast n&auml;r lagringen anv&auml;nder filsystemet Btrfs kommer alternativet <strong>Aktivera kvot f&ouml;r delade mappar</strong> vara tillg&auml;ngligt f&ouml;r delade mappar.</li>
			<li>Den kombinerade anv&auml;ndningen av lagringen f&ouml;r alla anv&auml;ndares mappar <strong>home</strong> kan inte &ouml;verskrida kvoten f&ouml;r &rdquo;<strong>homes</strong>&rdquo;.</li>
		</ul>
		</div>
	</li>
	<a name="integrity_protection"></a><li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><strong>Aktivera avancerat dataintegritetsskydd:</strong> F&ouml;r att skydda en delad mapp med strategierna <strong>CRC32 checksum</strong> och <strong>kopiera vid skrivning</strong> kan du <strong>aktivera avancerat dataintegritetsskydd</strong> n&auml;r den delade mappen skapas. CRC32 checksum till&auml;mpas f&ouml;r att kontrollera att data f&ouml;rblir identiskt med hur de ursprungligen skrevs och meddelar anv&auml;ndaren om n&aring;gon korruption uppt&auml;cks. Kopiera vid skrivning hj&auml;lper till att f&ouml;rb&auml;ttra data&ouml;verensst&auml;mmelse vid onormal avst&auml;ngning av systemet.
		<div class="section"><h4>Obs:</h4>
		<ul>
			<li>Det h&auml;r alternativet &auml;r bara tillg&auml;ngligt f&ouml;r de volymer som anv&auml;nder filsystemet Btrfs.</li>
			<li>Du kan aktivera/avaktivera det h&auml;r alternativet f&ouml;r varje delad mapp n&auml;r den skapas. Det h&auml;r alternativet kan inte &auml;ndras n&auml;r den delade mappen v&auml;l har skapats.</li>
			<li>Om filer s&aring;som databaser konstant redigeras och uppdateras kan m&auml;ngden fragmenterade filer &ouml;ka beroende p&aring; kopiera vid skrivning. Det &auml;r att rekommendera att du avaktiverar det h&auml;r alternativet f&ouml;r att f&ouml;rb&auml;ttra prestandan.</li>
		</ul>
		</div>
	</li>
    <a name="btrfs_compression"></a><li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><strong>Aktivera filkomprimering</strong>: Data i den skapade delade mappen komprimeras automatiskt av Btrf-filsystemet f&ouml;r att spara p&aring; lagringsutrymmet. N&auml;r det h&auml;mtas f&ouml;r anv&auml;ndning blir data automatiskt dekomprimerat.
		<div class="section"><h4>Obs:</h4>
		<ul>
			<li>Det h&auml;r alternativet &auml;r endast tillg&auml;ngligt n&auml;r du skapar en delad mapp i en Btrfs-volym eller n&auml;r <strong>Avancerat skydd av dataintegritet</strong> &auml;r aktiverat.</li>
			<li>Det h&auml;r alternativet kan &auml;ndras n&auml;r den delade mappen har skapats.</li>
			<li>Komprimeringsniv&aring;n skiljer sig &aring;t mellan datatyper: Textfiler har den h&ouml;gsta niv&aring;n av komprimering medan multimediafiler (t.ex. bilder, musik eller videor) inte komprimeras lika bra eftersom de redan har komprimerats f&ouml;r utmatning.</li>
            <li>Det h&auml;r alternativet kan inte aktiveras om kryptering f&ouml;r delad mapp &auml;r aktiverat.</li>
		</ul>
		</div>
	</li>
	<li><strong>Kryptera denna delade mapp:</strong> Om du vill kryptera den delade mappen, g&ouml;r f&ouml;ljande:
		<ol>
			<li>Specificera och bekr&auml;fta en ny krypteringsnyckel. Krypteringsnyckeln kan inte inkludera komman (,) eller likhetstecken (=). </li>
			<li>Om n&ouml;dv&auml;ndigt, markera rutan <strong>L&auml;gg till krypteringsnyckel till Nyckelhanterare</strong> f&ouml;r att montera den krypterade mappen automatiskt n&auml;r systemet startas. Om detta alternativ &auml;r avaktiverat, kommer den krypterade mappen att vara omonterad n&auml;sta g&aring;ng Synology NAS startar om. F&ouml;r att se eller f&aring; &aring;tkomst till en omonterad delad mapp m&aring;ste du montera mappen manuellt genom att importera eller ange krypteringsnyckeln.</li>
		</ol>
	</li>
	<li>Klicka p&aring; <strong>OK</strong> f&ouml;r att slutf&ouml;ra.</li>
</ol>

<div class="section"><h4>Regler f&ouml;r namngivning av delade mappar:</h4>
<ul>
	<li>Delade mappars namn &auml;r skiftl&auml;gesk&auml;nsligt och kan inneh&aring;lla 1-32 tecken. Namn kan inte inneh&aring;lla f&ouml;ljande tecken: <strong>! &quot; # $ % &amp; ' ( ) * + , / : ; &lt;= &gt; ? @ [ ] \ ^ ` { } | ~</strong></li>
	<li>F&ouml;ljande namn &auml;r reserverade f&ouml;r systemanv&auml;ndning: <strong>.</strong>, <strong>..</strong>, <strong>global</strong>, <strong>home</strong>, <strong>homes</strong>, <strong>printers</strong>, <strong>public</strong>, <strong>satashare</strong>, <strong>surveillance</strong>, <strong>usbbackup</strong>, <strong>usbshare</strong>. </li>
	<li>Det f&ouml;rsta tecknet i en delad mapps namn f&aring;r inte vara ett minustecken eller ett mellanslag och det sista tecknet f&aring;r inte heller vara ett mellanslagstecken.</li>
	<li>Den delade mappens <strong>beskrivning</strong> &auml;r skiftl&auml;gesk&auml;nslig och kan inneh&aring;lla upp till 64 Unicode-tecken.</li>
</ul>
</div>


<div class="section"><h4>Kryptera delade mappar:</h4>
<p>AES 256-bit-krypteringen skyddar data genom att blockera alla oauktoriserade &aring;tkomstf&ouml;rs&ouml;k. N&auml;r en delad mapp &auml;r krypterad kan inte de som inte har krypteringsnyckeln f&aring; &aring;tkomst till eller &auml;ndra krypterad data, detta g&auml;ller &auml;ven om de tar bort h&aring;rddiskarna fr&aring;n din Synology Synology NAS och monterar den i annan enhet.</p>
</div>

<div class="section"><h4>Obs:</h4>
<ul>
	<li>Namnet p&aring; en fil eller en mapp i en krypterad delad mapp kan inte &ouml;verskrida 143 engelska tecken eller 47 asiatiska (CJK) tecken; om du anv&auml;nder dina delade mappar med Mac OS kan namnet p&aring; en fil eller mapp i en krypterad delad mapp inte &ouml;verskrida 130 engelska tecken eller 43 (CJK) tecken.</li>
	<li>Det g&aring;r inte att f&aring; &aring;tkomst till krypterade delade mappar via NFS.</li>
	<li>Om l&ouml;senord &aring;terst&auml;lls till standard genom att anv&auml;nda knappen reset som finns p&aring; Synology NAS kommer krypterade delade mappar att avmonteras och alternativet att automatisk montera krypterade delade mappar att avaktiveras.</li>
	<li class="enable-dockerx64">Krypterade delade mappar st&ouml;ds endast i l&auml;get h&ouml;gt privilegie. F&ouml;r att anv&auml;nda den h&auml;r funktionen, g&aring; till filpaketet Docker p&aring; din DSM som &auml;r v&auml;rd, v&auml;lj den <strong>Docker DSM</strong> som du vill aktivera krypterade delade mappar f&ouml;r, klicka p&aring; <strong>Redigera</strong> och markera rutan bredvid <strong>K&ouml;r container med h&ouml;gt privilegie</strong>.</li>
</ul>
</div>

</body>
</html>