<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Tj&auml;nstuppt&auml;ckt</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>




<h2>Tj&auml;nstuppt&auml;ckt</h2>

<p>Tj&auml;nstuppt&auml;ckt g&ouml;r att anv&auml;ndare kan hitta sin Synology NAS p&aring; n&auml;tverket via SSDP (Simple Service Discovery Protocol) och Bonjour-tj&auml;nster.</p>


<h4>Att g&ouml;ra din Synology NAS m&ouml;jlig att uppt&auml;cka via SSDP:</h4>

<p>SSDP-tj&auml;nsten g&ouml;r att anv&auml;ndare kan hitta Synology NAS via Windows n&auml;tverksidentifiering.</p>

<ol>
	<li>G&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Filtj&auml;nster</strong> &gt; <strong>Tj&auml;nstuppt&auml;ckt</strong> &gt; <strong>SSDP</strong>.</li>
    <li>V&auml;lj <strong>Aktivera uppt&auml;ckt av Windowsn&auml;tverk</strong>.</li>
    <li>Klicka p&aring; <strong>Till&auml;mpa</strong> f&ouml;r att spara inst&auml;llningarna.</li>
</ol>



<h4>Att g&ouml;ra s&aring; att det g&aring;r att uppt&auml;cka din Synology NAS via Bonjour-tj&auml;nsten:</h4>

<p>Bonjour-tj&auml;nsten g&ouml;r det m&ouml;jligt f&ouml;r anv&auml;ndare att hitta Synology NAS och utf&ouml;ra utskrifts- och s&auml;kerhetskopieringsuppgifter fr&aring;n Mac-datorn.</p>

<ol>
	<li>G&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Filtj&auml;nster</strong> &gt; <strong>Tj&auml;nstuppt&auml;ckt</strong> &gt; <strong>Bonjour</strong>.</li>
    <li>V&auml;lj <strong>Aktivera uppt&auml;ckt av Bonjour-tj&auml;nsten</strong>.</li>
    <li>Du kan v&auml;lj Bonjour-relaterade alternativ som passar dina behov:
    	<ul>
        <li><strong>Aktivera Bonjour Skrivars&auml;ndning</strong>: V&auml;lj att till&aring;ta att Mac-datorer hittar USB-skrivaren som &auml;r ansluten till din Synology NAS, f&ouml;r utskrift av dokument.</li>
        <li><strong>Aktivera uts&auml;ndning av Bonjour Time Machine via SMB</strong>: V&auml;lj att till&aring;ta att Mac Time Machine hittar din Synology NAS och s&auml;kerhetskopierar filer till delade mappar i DSM via SMB.</li>
        <li><strong>Aktivera uts&auml;ndning av Bonjour Time Machine via AFP</strong>: V&auml;lj att till&aring;ta att Mac Time Machine hittar din Synology NAS och s&auml;kerhetskopierar filer till delade mappar i DSM via AFP.</li>
        </ul>
    
    </li>
    <li>Om du har valt n&aring;got alternativ f&ouml;r Time Machine, klicka p&aring; <strong>St&auml;ll in mappar f&ouml;r Time Machine</strong> f&ouml;r att ange destinationsmappar f&ouml;r Time Machine-s&auml;kerhetskopieringar.</li>

<li>Klicka p&aring; <strong>Till&auml;mpa</strong> f&ouml;r att spara inst&auml;llningarna.</li>
</ol>


<div class="section">
<h4>Obs:</h4>

<ul>
	<li>Om du avaktiverar tj&auml;nsten SMB/AFP (I <strong>Kontrollpanel</strong> &gt; <strong>Filtj&auml;nster</strong> &gt; <strong>SMB/AFP/NFS</strong>) blir tillh&ouml;rande alternativ f&ouml;r Bonjour automatiskt avaktiverat.</li>
	<li>N&auml;r <strong>Aktivera uts&auml;ndning av Bonjour Time Machine</strong> via SMB &auml;r valt blir f&ouml;ljande alternativ aktiverade (i <strong>Kontrollpanel</strong> &gt; <strong>Filtj&auml;nster</strong> &gt; <strong>SMB/AFP/NFS</strong> &gt; <strong>Avancerade inst&auml;llningar</strong>):
    	<ul>
        <li><strong>Aktivera SMB 3</strong> (f&ouml;r <strong>Maximalt antal protokoll f&ouml;r Windows-filservice</strong>)</li>
        <li><strong>Opportunistic Locking</strong></li>
        <li><strong>Aktivera SMB2-l&aring;n</strong></li>
        <li><strong>Aktivera SMB-varaktiga referenser (fill&aring;sning mellan protokoll avaktiveras</strong>)</li>
      </ul>
    
    </li>
</ul>
</div>

</body>
</html>