<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Delad mapp</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Filindexering</h2>
<p>
Att indexera en delad mapp eller dess undermappar kan hjälpa dig att snabbt hitta filer och innehåll under filsökning.
</p>


<div class="section">
<h4>Obs:</h4>
<p>Fjärrmappar, molnmappar eller .iso-mappar som monterats på din Synology NAS kan inte indexeras.</p>
</div>


<h4>Att indexera mappar och filinneh&aring;ll:</h4>
<p>N&auml;r du indexerar en mapp indexerar File Station dess undermappar/filer efter namn och l&aring;ter dig s&ouml;ka efter objekt som efters&ouml;ks efter filnamn. Om du vidare indexerar efter filtyp indexerar File Station motsvarande filer inte bara efter namn utan &auml;ven efter inneh&aring;ll; p&aring; det h&auml;r s&auml;ttet kan du s&ouml;ka efter objekt som efters&ouml;ks efter filnamn och efter filinneh&aring;ll.
</p>


<ol>
<li>G&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Indexeringstj&auml;nst</strong> &gt; <strong>Filindexering</strong> och klicka p&aring; <strong>Lista &ouml;ver indexerade mappar</strong>.</li>
<li>I popup-f&ouml;nstret, klicka p&aring; <strong>Skapa</strong> &gt; <strong>V&auml;lj</strong> f&ouml;r att visa mappar som &auml;r klara att indexeras.</li>
<li>V&auml;lj de &ouml;nskade mapparna och klicka p&aring; <strong>V&auml;lj</strong>. F&ouml;r att skapa en ny mapp f&ouml;r indexering, klicka p&aring; <strong>Skapa mapp</strong> och forts&auml;tt.</li>
<li>Klicka p&aring; den mapp du vill indexera och klicka p&aring; <strong>V&auml;lj</strong>.</li>
<li>F&ouml;r att indexera specifika filtyper, g&aring; till <strong>Filtyp</strong> och v&auml;lj <strong>Bild</strong>, <strong>Ljud</strong>, <strong>Video</strong> eller <strong>Dokument</strong>. Om n&aring;gon filtyp (t.ex. <strong>Ljud</strong>) inte &auml;r markerad kan du bara s&ouml;ka filer under den typen (t.ex. ljudfiler) efter filnamn.</li>

<li>Klicka p&aring; <strong>OK</strong> f&ouml;r att slutf&ouml;ra indexeringen.</li>
</ol>

<div class="section">
<h4>Obs:</h4>
<ul>
<li>Du kan bara v&auml;lja upp till 1000 mappar f&ouml;r indexering; undermappar i de markerade mapparna blir inte inr&auml;knade.</li>
<li>Om du v&auml;ljer <strong>Aktivera s&ouml;kning av filinneh&aring;ll</strong> i File Station kan du s&ouml;ka bland filinneh&aring;ll i de indexerade mapparna.</li>
<li>Volymen som &auml;r v&auml;rd f&ouml;r den indexerade mappen m&aring;ste ha mer &auml;n 10 MB tillg&auml;ngligt utrymme. I annat fall pausas indexeringen. F&ouml;r att &aring;teruppta indexeringen, ut&ouml;ka volymen och klicka p&aring; <strong>Skapa nytt index</strong>.</li>
<li>Om du har indexerat en mapp och dess undermapp(ar) p&aring; samma g&aring;ng indexerar systemet endast undermappar(na) f&ouml;r att hush&aring;lla med systemresurser.</li>
<li class="disable-hi3535">N&auml;r mappar &auml;r fullst&auml;ndigt indexerade och sedan monterade p&aring; en Mac-dator med protokollen SMB eller AFP kan du anv&auml;nda Finder f&ouml;r att s&ouml;ka efter inneh&aring;ll i filerna.</li>
</ul>

</div>

<h4>Att radera indexerade mappar:</h4>

<ol>
<li>Gå till <strong>Kontrollpanel</strong> > <strong>Indexeringstjänst</strong> > <strong>Filindexering</strong> > <strong>Lista över indexerade mappar</strong> och välj önskad indexerad mapp(ar).</li>
<li>Klicka på <strong>Radera</strong> för att sluta indexera mapp(ar).</li>
</ol>

<h2>Skapa ett nytt filregister</h2>
<p>
Under normala omständigheter behöver du bara indexera en mapp en gång. Om en fil i en mapp matchar specifika sökkriteria men ändå inte hittas vid en filsökning kan du dock behöva skapa nytt index för filerna för att återskapa indexstrukturen.
</p>
<h4>Att skapa du ett nytt index i en delad mapp:</h4>
<ol>
<li>Gå till <strong>Kontrollpanel</strong> > <strong>Indexeringstjänst</strong> > <strong>Filindexering</strong> > <strong>Lista över indexerade mappar</strong>.</li>
<li>Välj listad mapp(ar) att skapa nytt index för.</li>
<li>Klicka på <b>Skapa nytt index</b>.</li>
</ol>

<div class="section">
<h4>Obs:</h4>
<p>File Station stöder inte indexering av filer på fjärrmappar eller externa lagringsenheter (t.ex. USB-diskar/SD-kort).</p>
</div>


<h2>Hantera filindexering via skrivbordet</h2>
<p>När filindexering börjar ser du <strong>Indexeringsförlopp</strong> (en ikon med ett flytande förstoringsglas) på aktivitetsfältet. Eftersom filindexering kräver mer CPU-resurser låter detta dig hushålla med CPU-resurser.</p>


<ul>
<li>För att pausa/fortsätta filindexering, klicka på knappen för uppspelning.</li>
<li>För att fördröja filindexering till en lämplig tid, välj det önskade alternativet från rullgardinsmenyn.</li>
<li>För att visa vilka mappar som har indexerats, klicka på <strong>Visa lista över indexerade mappar</strong>.</li>
</ul>

<div class="section">
<h4>Obs:</h4>
<ul>
<li>Om du pausar åtgärden för indexering kan den bara återupptas genom att klicka på knappen för uppspelning på skrivbordets aktivitetsfält.</li>
</ul>

</div>


</body>
</html>
