<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Delad mapp</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Redigera en krypterad mapp</h2>
<p>Efter att en mapp har krypterats kan du anv&auml;nda rullgardinsmenyn <b>Kryptering</b> f&ouml;r att redigera mappen.</p>
<h4>Posterna som visas i menyn beror p&aring; status av vald delad mapp:</h4>
<ul>
<li>Om du v&auml;ljer en okrypterad delad mapp kommer rullgardinsmenyn <b>Kryptering</b> att vara inaktiverad.</li>
<li>Om du v&auml;ljer en krypterad delad mapp som &auml;r monterad, kan du v&auml;lja <b>Avmontera</b> fr&aring;n rullgardinsmenyn <b>Kryptering</b> f&ouml;r att avmontera mappen, eller <b>Exportera nyckel</b> f&ouml;r att spara krypteringsnyckeln.</li>
<li>Om du v&auml;ljer en krypterad delad mapp som &auml;r omonterad kan du v&auml;lja <b>Montera</b> fr&aring;n rullgardinsmenyn <b>Kryptering</b> och sedan ange eller importera krypteringsnyckeln f&ouml;r att montera mappen f&ouml;r tilltr&auml;de.</li>
<li>Om du v&auml;ljer flera krypterade delade mappar som inte &auml;r monterade och deras krypteringsnycklar hanteras av <strong>Nyckelhanterare</strong>, kan du v&auml;lja <b>Montera</b> fr&aring;n rullgardinsmenyn <b>Kryptera</b> och sedan ange l&ouml;senfrasen f&ouml;r Nyckelhanterare f&ouml;r att montera dessa mappar f&ouml;r &aring;tkomst.</li>
</ul>

<ol>
<span class="note_head">Obs:</span>
<li><span  class="note_content">Det &auml;r mycket viktigt att komma ih&aring;g krypteringsnyckeln.</span> Det rekommenderas starkt att du exporterar och sparar krypteringsnyckeln. Om du gl&ouml;mmer eller tappar bort nyckeln finns det inget s&auml;tt att r&auml;dda den krypterade datan.</li>
<li>N&auml;r en krypterad delad mapp monteras kan du d&ouml;pa om den eller &auml;ndra dess volymplats. Du kan endast utf&ouml;ra &auml;ndringar efter att du avmonterat den.</li>
</ol>
</body>
</html>
