<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Externa enheter</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="usbprinter"></a>Skrivare</h2>
<p>Synology NAS kan bli en skrivarserver, vilket till&aring;ter klientdatorer eller mobila enheter att f&aring; &aring;tkomst till skrivare som &auml;r ansluta till Synology NAS. Dessutom har Apple Wireless Printing och Google Cloud Print st&ouml;d f&ouml;r att till&aring;ta dig att g&ouml;ra fj&auml;rrutskrift genom att anv&auml;nda iOS-enheter eller Googleprodukter och -tj&auml;nster.</p>
<p>Bes&ouml;k <a href="http://www.synology.com" target="_blank">www.synology.com</a> f&ouml;r kompatibla skrivare.</p>

<h3>Installera skrivare</h3>
<p>Se instruktionerna h&auml;r nedanf&ouml;r f&ouml;r att installera och ansluta en <span class="disable-rc18015xsp">USB- eller </span>n&auml;tverksskrivare till din Synology NAS.</p>


<h4 class="disable-rc18015xsp"><a id="t1"></a>Installera en USB-skrivare:</h4>
<ol class="disable-rc18015xsp">
<li>Sl&aring; p&aring; och anslut skrivaren till en USB-port p&aring; Synology NAS.</li>
<li>G&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Externa enheter</strong> &gt; <strong>Skrivare</strong>.</li>
<li>V&auml;lj den skrivare du vill installera. V&auml;nligen notera att Synology NAS inte kan k&auml;nna igen skrivare som anslutits via USB-hubbar.</li>
<li>Klicka p&aring; <b>Skrivarhanterare</b> och v&auml;lj <b>Installera skrivare</b>.</li>
<li>I dialogrutan, v&auml;lj ett av f&ouml;ljande l&auml;gen:
<ul>
<li><b>Network MFP:</b> Till&aring;ter klienter i det lokala n&auml;tverket att anv&auml;nda funktionerna utskrift, skanna och fax fr&aring;n din multifunktionsskrivare. Funktionerna skanna och faxa &auml;r endast tillg&auml;ngliga f&ouml;r Windows-datorer.</li>
<li><b>N&auml;tverksskrivare:</b> V&auml;lj detta l&auml;ge f&ouml;r skrivare som endast har st&ouml;d f&ouml;r utskrift om du vill klienterna endast ska kunna anv&auml;nda funktionen f&ouml;r utskrift.</li>
</ul>
</li>
<li>Konfigurera inst&auml;llningar f&ouml;r Apple Wireless eller Google Cloud Print (valfritt).</li>
<li>Klicka p&aring; <b>Spara</b>.</li>
</ol>

<div class="section disable-rc18015xsp">
<h4>Obs:</h4>
<ul>
<li>Endast en klient i taget kan ha &aring;tkomst till en network MFP.</li>
</ul>
</div>

<h4>Installera en n&auml;tverksskrivare:</h4>
<ol>
<li>Sl&aring; p&aring; och anslut n&auml;tverksskrivaren till samma lokala n&auml;tverk som din Synology NAS.</li>
<li>G&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Externa enheter</strong> &gt; <strong>Skrivare</strong>.</li>
<li>Klicka p&aring; <b>L&auml;gg till n&auml;tverksskrivare</b> och f&ouml;lj instruktionerna i installationsguiden.</li>
</ol>

<div class="section">
<h4>Obs:</h4>
<ul>
<li><strong>Skrivarnamn:</strong> Ett skrivarnamn m&aring;ste anges vid installation och kan inneh&aring;lla upp till 32 tecken, inklusive bokst&auml;ver, siffror och understreck.</li>
	<li><strong>Protokoll:</strong> I allm&auml;nhet anv&auml;nder HP:s n&auml;tverksskrivare Socket; Canon:s n&auml;tverksskrivare anv&auml;nder BJNP; de &ouml;vriga anv&auml;nder &ouml;verlag LPR.</li>
<li><strong>K&ouml;namn:</strong> Att ange ett k&ouml;namn kr&auml;vs f&ouml;r n&auml;tverksskrivare som anv&auml;nder LPR och IPP men &auml;r inte applicerbart f&ouml;r skrivare som anv&auml;nder Socket eller BJNP.</li>
<li><strong>Inte N&auml;tverk MFP:</strong> N&auml;tverksskrivare anslutna till Synology NAS kan f&ouml;r n&auml;rvarande inte anv&auml;nda l&auml;get network MFP.</li>
<li><strong>Inte USB-skrivare:</strong> USB-skrivare som delas med en Synology-produkt kan inte st&auml;llas in som n&auml;tverksskrivare.</li>
</ul>
</div>

<div class="disable-rc18015xsp">
<h4>Installera en PostScript USB-skrivare genom att anv&auml;nda en Mac:</h4>
<p><strong>F&ouml;r Mac OS 10.6.X:</strong></p>
<ol>
<li>F&ouml;lj stegen i <a href="system_externaldevice_printer.html#t1">Installera en USB-skrivare</a>.</li>
<li>P&aring; din Mac, g&aring; till <b>Systeminst&auml;llningar</b> &gt; <b>Skrivare &amp; Fax</b> och klicka sedan p&aring; <strong>+</strong> f&ouml;r att l&auml;gga till en ny skrivare.</li>
<li>V&auml;lj <strong>IP</strong>.</li>
<ul>
	<li>V&auml;lj <strong>Line Printer Daemon - LPD</strong> som <strong>Protokoll</strong>.</li>
	<li>Ange skrivarens IP-adress.</li>
	<li>Ange &rdquo;usbprinter&rdquo; i f&auml;ltet <strong>K&ouml;</strong>.</li>
	<li>V&auml;lj <strong>Generisk PostScript-skrivare</strong> f&ouml;r <strong>Skriv ut med</strong>.</li>
	<li>Klicka p&aring; <strong>L&auml;gg till</strong> f&ouml;r att slutf&ouml;ra.</li>
</ul>
</ol>
<div class="section">
<h4>Obs:</h4>
<ul>
<li>AppleTalk &auml;r st&ouml;ds inte l&auml;ngre av Mac OS 10.6.X. Om du beh&ouml;ver anv&auml;nda en AppleTalk-skrivare, l&auml;s den h&auml;r dokumentation f&ouml;r ett m&ouml;jligt s&auml;tt att ansluta den till din Mac-dator eller lokala n&auml;tverk. Om det inte finns n&aring;got s&auml;tt att ansluta skrivaren, anslut den till en Mac-dator med Mac OS 10.5.X eller tidigare, och st&auml;ll in den som delad.</li>
</ul>
</div>

<p><strong>F&ouml;r Mac OS 10.5.X:</strong></p>
<ol>
<li>F&ouml;lj stegen i <a href="system_externaldevice_printer.html#t1">Installera en USB-skrivare</a>.</li>
<li>P&aring; din Mac, g&aring; till <b>Systeminst&auml;llningar</b> &gt; <b>Skrivare &amp; Fax</b> och klicka sedan p&aring; <strong>+</strong> f&ouml;r att l&auml;gga till en ny skrivare.</li>
<li>V&auml;lj en metod.</li>
<ul>
	<li>Metod 1: <strong>AppleTalk</strong></li>
	<ul>
		<li>V&auml;lj <strong>Generisk PostScript-skrivare</strong> f&ouml;r <strong>Skriv ut med</strong>.</li>
		<li>Klicka p&aring; <strong>L&auml;gg till</strong> f&ouml;r att slutf&ouml;ra.</li>
	</ul>
	<li>Metod 2: <strong>IP</strong></li>
	<ul>
		<li>V&auml;lj <strong>Line Printer Daemon - LPD</strong> som Protokoll.</li>
		<li>Ange skrivarens IP-adress.</li>
		<li>Ange &rdquo;usbprinter&rdquo; i f&auml;ltet <strong>K&ouml;</strong>.</li>
		<li>V&auml;lj <strong>Generisk PostScript-skrivare</strong> f&ouml;r <strong>Skriv ut med</strong>.</li>
		<li>Klicka p&aring; <strong>L&auml;gg till</strong> f&ouml;r att slutf&ouml;ra.</li>
	</ul>
</ul>
</ol>
</div>

<h3>Hantera skrivare</h3>
<p>Fliken skrivare inneh&aring;ller f&ouml;ljande alternativ f&ouml;r att hantera <span class="disable-rc18015xsp">USB</span>- eller n&auml;tverksskrivare anslutna till Synology NAS.</p>

<ul>
<li><b>H&auml;mta information:</b> Visar information om den valda skrivaren s&aring;som enhetsnamn, tillverkare, status, etc.</li>
<li><strong>Ta bort:</strong> Tar bort och kopplar fr&aring;n en skrivare fr&aring;n Synology NAS.</li>
<li><strong>Skrivarhanterare:</strong> Inneh&aring;ller f&ouml;ljande alternativ:
<ul>
<li><strong>Installera skrivare</strong>: Redigera printerinst&auml;llningar s&aring;som Apple Wireless Printing eller Google Cloud Print (se h&auml;r nedanf&ouml;r f&ouml;r instruktioner).</li>
<li><strong>Reng&ouml;ra skrivarens rullar:</strong> Avbryter alla utskrifter p&aring; alla skrivare.</li>
<li><strong>Skriv ut testsida:</strong> Skriver ut en testsida f&ouml;r att s&auml;kerst&auml;lla att alla inst&auml;llningar &auml;r korrekta.</li>
<li><b>Frig&ouml;r skrivare:</b> Kopplar fr&aring;n skrivare och klient (endast f&ouml;r l&auml;get network MFP). N&auml;r en klient ansluter till en multifunktionsskrivare f&ouml;r att ta emot fax eller skanna filer kan denna uppgift ta l&aring;ng tid. Om n&ouml;dv&auml;ndigt kan anslutningen avbrytas f&ouml;r att till&aring;ta n&auml;sta klient i k&ouml; att f&aring; &aring;tkomst till skrivaren.</li>
</ul></li>
</ul>


<h4>Att aktivera Apple Wireless Printing:</h4>
<ol>
<li>G&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Externa enheter</strong> &gt; <strong>Skrivare</strong>.</li>
<li>V&auml;lj skrivare fr&aring;n enhetslistan.</li>
<li>Klicka p&aring; <b>Skrivarhanterare</b> &gt; <b>Installera skrivare</b>.</li>
<li>Markera kryssrutan <b>Aktivera Apple Wireless Printing</b>.</li>
<li>V&auml;lj din skrivares m&auml;rke och drivrutin.</li>
<li>Klicka p&aring; <b>Spara</b>.</li>
</ol>

<p>N&auml;r installationen &auml;r klar kan du skriva ut en testsida genom att klicka p&aring; <b>Skrivarhanterare</b> &gt; <b>Skriv ut testsida</b>.</li>

<div class="section">
<h4>Obs:</h4>
<ul>
<li>Aktivering av Apple Wireless Printing aktiverar ocks&aring; Bonjour Skrivars&auml;ndning f&ouml;r DSM.</li>
<li>Apple Wireless Printing finns tillg&auml;ngligt f&ouml;r iOS 4.2 eller senare.</li>
</ul>
</div>


<h4>Aktivera Google Cloud Print:</h4>
<ol>
<li>G&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Externa enheter</strong> &gt; <strong>Skrivare</strong>.</li>
<li>V&auml;lj skrivare fr&aring;n enhetslistan.</li>
<li>Klicka p&aring; <b>Skrivarhanterare</b> &gt; <b>Installera skrivare</b>.</li>
<li>Markera rutan <b>Aktivera Google Cloud Print</b>.</li>
<li>Ange f&ouml;ljande detaljer:
<ul>

<li>Information om ditt Google-konto.</li>
<li>Din skrivares m&auml;rke och drivrutin.</li>
</ul>
<li>Klicka p&aring; <b>Spara</b>.</li>
</ol>
<p>N&auml;r installationen &auml;r klar kan du skriva ut en testsida genom att klicka p&aring; <b>Skrivarhanterare</b> &gt; <b>Skriv ut testsida</b>.</li>
</p>
<p>F&ouml;r att hantera uppgifter f&ouml;r Google Cloud Print, klicka p&aring; l&auml;nken <a href="http://www.google.com/cloudprint/manage.html" target="_blank">Google Cloud Print</a>.</p>


<h3>&Aring;tkomst till skrivare</h3>
<p>Se avsnittet h&auml;r nedanf&ouml;r f&ouml;r att f&aring; &aring;tkomst till skrivare med PC eller Mac.</p>
<h4><a name="others"></a>&Aring;tkomst till skrivare med en Windowsdator:</h4>
<p>
B&auml;sta s&auml;ttet att f&aring; &aring;tkomst till utskriftstj&auml;nsten i Synology NAS-enheten &auml;r att uppr&auml;tta anslutningen till skrivaren med Synology Assistant. G&aring; till dess Hj&auml;lp f&ouml;r detaljerade anvisningar.
</p>

<p>Om Synology Assistant inte &auml;r installerat i datorn, se h&auml;r nedanf&ouml;r, f&ouml;r andra s&auml;tt att f&aring; &aring;tkomst till utskriftstj&auml;nsten i Synology NAS-enheten.</p>
<p><strong>Typ 1. Delad n&auml;tverksskrivare</strong></p>
<ol>
<li>P&aring; din PC, &ouml;ppna <b>N&auml;tverk </b>i Filutforskaren och dubbelklicka p&aring; Synology NAS.</li>

<li>Dubbelklicka p&aring; <span class="disable-rc18015xsp"><b>usbprinter</b> eller </span><b>n&auml;tverksskrivarnamn</b>; systemet uppmanar dig att installera den korrekta drivrutinen, klicka sedan p&aring; <b>Ja</b>.</li>

<li>V&auml;nligen erh&aring;ll skrivarens drivrutin fr&aring;n tillverkarens CD eller webbsida. V&auml;lj tillverkare och modell f&ouml;r skrivaren, eller klicka p&aring; <strong>Har disk</strong> f&ouml;r att v&auml;lja drivrutinens plats. Klicka sedan p&aring; <b>OK</b>.</li>
<li>Systemet startar n&auml;tverksskrivarens installation. N&auml;r installationen &auml;r klar kan du b&ouml;rja anv&auml;nda skrivaren. </li>
</ol>


<p><strong>Typ 2. LPR-port (rekommenderas)</strong></p>
<ol>
<li>P&aring; din PC, klicka p&aring; <b>Start</b> och g&aring; till <b>Enheter och skrivare.</b></li>
<li>Klicka p&aring; <b>L&auml;gg till skrivare</b>. </li>
	<li>V&auml;lj <strong>L&auml;gg till en n&auml;tverksskrivare, tr&aring;dl&ouml;s skrivare eller Bluetooth-skrivare.</strong> </li>
	<li>V&auml;lj <strong>Skrivaren jag vill anv&auml;nda finns inte med i listan.</strong></li>
<li>V&auml;lj <b>L&auml;gg till en skrivare med TCP/IP-adress eller v&auml;rdnamn</b>. Klicka p&aring; <b>N&auml;sta</b> f&ouml;r att forts&auml;tta.</li>
<li>V&auml;lj att Enheten ska vara <b>TCP/IP-enhet.</b></li>
<li>Ange IP-adress f&ouml;r Synology NAS. Klicka p&aring; <b>N&auml;sta</b> f&ouml;r att forts&auml;tta.</li>
<li>V&auml;lj <b>Typ av enhet:</b> <strong>Anpassa</strong> &gt; <strong>Inst&auml;llningar</strong> &gt; …. Klicka p&aring; <b>N&auml;sta</b> f&ouml;r att forts&auml;tta.</li>

<li>V&auml;lj <b>LPR</b> som protokoll; Ange <span class="disable-rc18015xsp"><b>usbprinter</b> eller </span><b>n&auml;tverksskrivarnamn</b> som k&ouml;namn,och markera kryssrutan <b>Byte-r&auml;kning f&ouml;r LPR aktiverad</b>. Klicka p&aring; <b>OK</b> f&ouml;r att forts&auml;tta.</li>

<li>V&auml;nligen erh&aring;ll skrivarens drivrutin fr&aring;n tillverkarens CD eller webbsida. V&auml;lj tillverkare och modell f&ouml;r skrivaren, eller klicka p&aring; <strong>Har disk</strong> f&ouml;r att v&auml;lja drivrutinens plats. Klicka sedan p&aring; <b>OK</b>.</li>
	<li>Systemet startar n&auml;tverksskrivarens installation. N&auml;r installationen &auml;r klar kan du b&ouml;rja anv&auml;nda skrivaren.</li>
</ol>

<h4>&Aring;tkomst till skrivare med en Mac:</h4>
<p>
Mac-anv&auml;ndare kan f&aring; &aring;tkomst till utskriftstj&auml;nsten p&aring; Synology NAS-enheten genom att aktivera DSM:s Bonjour-skrivars&auml;ndning och l&auml;gga till skrivaren i Systeminst&auml;llningar.</p>

<P>Se till att din Synology NAS anv&auml;nder en Postscript-skrivare innan du forts&auml;tter.
</p>

<p><strong>Steg 1. Aktivera DSM:s Bonjour-skrivars&auml;ndning</strong></p>
<ol>
<li>
Logga in p&aring; DSM som <b>admin</b> eller som en anv&auml;ndare tillh&ouml;rande gruppen <b>administrators</b>.
</li>
<li>
G&aring; till <b>Kontrollpanel</b> &gt; <strong>Filtj&auml;nster</strong> &gt; <b>Win/Mac/NFS</b>.
</li>
<li>
Markera <b>Aktivera Bonjour Skrivars&auml;ndning</b>.
</li>
</ol>

<p><strong>Steg 2. &Aring;tkomst till skrivare med Mac</strong></p>
<ol>
<li>
P&aring; din Mac, g&aring; till <b>Systeminst&auml;llningar</b> &gt; <b>Skriv ut &amp; Skanna</b> och klicka sedan p&aring; <b>+</b>.
</li>

<li>
V&auml;lj <span class="disable-rc18015xsp"><b>usbprinter[nummer]</b> eller </span><b>n&auml;tverksskrivarnamn</b> fr&aring;n rullgardinsmenyn. Din Mac konfigurerar skrivaren automatiskt.
</li>

</ol>



</body>
</html>
