<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Str&ouml;m</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Allm&auml;nt</h2>

<p>
<strong>Kontrollpanel</strong> &gt; <strong>H&aring;rdvara &amp; Str&ouml;m</strong> &gt; <strong>Allm&auml;nt</strong> tillhandah&aring;ller alternativ f&ouml;r att aktivera power recovery, Vakna med LAN (WOL) och minneskompression. Du kan ocks&aring; &auml;ndra ljudkontroll och l&auml;ge f&ouml;r fl&auml;kthastighet h&auml;r.
</p>

<h3>Minneslayout*</h3>
<p>F&ouml;ljande alternativ f&ouml;r minneslayout p&aring;verkar prestandan f&ouml;r videokonvertering:</p>
<ul>
<li><strong>Till&aring;t enkel 1080p-transkodning:</strong> Rekommenderas f&ouml;r b&auml;ttre &ouml;vergripande systemprestanda om 4K-videokonvertering aldrig anv&auml;nds.</li>
<li><strong>Till&aring;t enkel 4K-transkodning:</strong> Reserverar mer minne f&ouml;r videokonvertering, rekommenderas n&auml;r 4K-transkodning anv&auml;nds.</li>
</ul> 

<h3>
Str&ouml;m&aring;terst&auml;llning
</h3>
<p>Om systemet st&auml;ngs av p&aring; grund av str&ouml;mf&ouml;rlust, g&ouml;r str&ouml;m&aring;terst&auml;llningsfunktionen att systemet kan starta upp automatiskt d&aring; str&ouml;mmen &aring;terf&aring;s.</p>
<h3>Vakna med LAN*</h3>
<p>Aktivering av Vakna med LAN (WOL) l&aring;ter dig starta din Synology NAS &ouml;ver det lokala n&auml;tverket eller Internet genom att anv&auml;nda IP-adress (eller DDNS-v&auml;rdnamn) och MAC-adressen f&ouml;r din Synology NAS genom att anv&auml;nda en WOL-applikation, s&aring;som Synology Assistant DS finder eller valfri annan WOL-applikation.</p>
<p>Vakna med LAN fungerar endast efter att Synology NAS st&auml;ngts av ordentligt, genom att den fysiska <b>Str&ouml;m</b>knappen tryckts in eller klickning p&aring; <b>St&auml;ng av</b> i gr&auml;nssnittet f&ouml;r DSM. Ha n&auml;tsladden inkopplad i ett fungerande str&ouml;muttag efter avst&auml;ngning.</p>
<div class="section">
	<h4>Obs:</h4>
	<p class="disable-rc18015xsp">Funktionen WOL har inte st&ouml;d p&aring; 10GbE LAN-portar (om s&aring;dana finns p&aring; din Synology NAS).</p>
	<ul class="enable-rc18015xsp">
		<li>Funktionen WOL har inte st&ouml;d p&aring; 10GbE LAN-portar (om s&aring;dana finns p&aring; din Synology NAS).</li>
		<li>WOL-funktionen &auml;r som standard aktiverad p&aring; 1GbE LAN-portar f&ouml;r Synology NAS och kan inte avaktiveras.</li>
	</ul>
</div>
<h3>Fl&auml;kthastighetsl&auml;ge*</h3>
<p>F&ouml;ljande alternativ f&ouml;r fl&auml;kthastighetsl&auml;ge finns:</p>
<ul>
<li><strong>L&auml;get med full hastighet:</strong> Fl&auml;kten arbetar med full hastighet, vilket kyler ner Synology NAS mer men l&aring;ter mer.</li>
<li><strong>Kylningsl&auml;ge:</strong> Fl&auml;kten arbetar med hastighet, vilket kyler ner Synology NAS mer men l&aring;ter mer.</li>
<li><strong>Tyst l&auml;ge:</strong> Fl&auml;kten arbetar med l&aring;g hastighet, l&aring;ter mindre men Synology NAS kan komma att bli varmare.</li>
<li><strong>L&aring;geffektl&auml;ge:</strong> Fl&auml;kten arbetar med l&aring;g hastighet, l&aring;ter mindre men Synology NAS kan komma att bli varmare. Dessutom kommer fl&auml;kten att stanna n&auml;r Synology NAS &auml;r kyld, f&ouml;r att spara str&ouml;m. L&aring;geffektl&auml;ge &auml;r bara tillg&auml;ngligt p&aring; vissa modeller.</li>
</ul>
<h3>Ljudkontroll</h3>
<p>Synology NAS kan avge ett pipljud n&auml;r speciella h&auml;ndelser eller fel intr&auml;ffar. Klicka p&aring; kryssrutorna f&ouml;r listade h&auml;ndelser f&ouml;r att l&aring;ta Synology NAS g&ouml;ra dig uppm&auml;rksam n&auml;r fel intr&auml;ffar.</p>

<h4>F&ouml;r att stoppa pipljudet:</h4>
<ul>
<li>Om Synology NAS avger pipljud, klicka p&aring; knappen <strong>Pip av</strong> f&ouml;r att inaktivera det. </li>
</ul>



<h3>Minneskomprimering*</h3>
<p>Du kan aktivera Minneskomprimering f&ouml;r att f&ouml;rb&auml;ttra den allm&auml;nna svarbarheten vid last genom att komprimera de senaste anv&auml;nda data i minnet.</p>
<p>N&auml;r du har flera applikationer ig&aring;ng och minnet b&ouml;rjar bli fullt krymper den dynamiska minneskomprimeringen storlek f&ouml;r s&auml;llan anv&auml;nda poster i minnet, vilket minskar minnesanv&auml;ndning. N&auml;r posterna beh&ouml;vs igen kan de omedelbart dekomprimeras. Detta minskar behovet av att l&auml;sa och skriva minnesswapfiler p&aring; disk, vilket f&ouml;rb&auml;ttrar effektivitet och svarstid.</p>
<p>F&ouml;r att aktivera Minneskompression, markera helt enkelt kryssrutan.</p>

<h3>LED*</h3>

<p>I <strong>Kontrollpanel</strong> &gt; <strong>H&aring;rdvara &amp; Str&ouml;m</strong> &gt; <strong>Allm&auml;nt</strong> &gt; <strong>Ljusstyrkereglering f&ouml;r LED</strong>kan du justera ljusstyrkan f&ouml;r LED-indikatorerna p&aring; din Synology NAS.</p>

<div class="section">
<h4>Obs:</h4>
<p>Inst&auml;llningarna f&ouml;r ljusstyrka till&auml;mpas p&aring; alla LED-indikatorerna p&aring; din Synology NAS (dvs. str&ouml;m, STATUS, LAN, diskstatus osv.).</p>
</div>


<h4>Att st&auml;lla in ljusstyrkan f&ouml;r LED:</h4>
<p>Det finns nu fyra niv&aring;er av ljusstyrka tillg&auml;ngliga f&ouml;r LED-indikatorerna p&aring; din Synology NAS.</p>
<ol>
<li>Klicka och drag pekaren, p&aring; skalan f&ouml;r ljusstyrka, i n&aring;gon av riktningarna:
  <ul>
<li>&Aring;t h&ouml;ger: &Ouml;kar ljusstyrkan f&ouml;r LED.</li>
<li>&Aring;t v&auml;nster: Minskar ljusstyrkan f&ouml;r LED.</li>
</ul>
</li>
<li>Klicka p&aring; <strong>Till&auml;mpa</strong> f&ouml;r att spara inst&auml;llningen.</li>
</ol>



<h4>Att st&auml;lla in ljusstyrkan f&ouml;r LED efter schema:</h4>
<p>LED-indikatorerna kan &auml;ndra sin niv&aring; p&aring; ljusstyrka f&ouml;r en schemalagd tid.</p>

<ol>
<li>Klicka p&aring; <strong>L&auml;gg till schema</strong>.</li>
<li>Klicka p&aring; n&aring;gon av typerna av ljusstyrka h&auml;r nedanf&ouml;r:
<ul>
<li><strong>Standardljusstyrka</strong>: H&ouml;gsta ljusstyrka</li>
<li><strong>Justerad ljusstyrka</strong>: Den ljusstyrkeniv&aring; som specificerats p&aring; skalan f&ouml;r ljusstyrka</li>
<li><strong>Av</strong>: LED av</li>
</ul>
</li>
<li>Klicka p&aring; de &ouml;nskade perioderna f&ouml;r att anpassa schemat f&ouml;r ljusstyrka.</li>
<li>Klicka p&aring; <strong>OK</strong> och <strong>Till&auml;mpa</strong> f&ouml;r att spara inst&auml;llningarna.</li>
</ol>



<p>____<br> * Endast tillg&auml;ngligt f&ouml;r vissa modeller. </p>
</body>
</html>
