<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

	<h2>HDD/SSD</h2>
	<p>Dette afsnit s&aelig;tter dig i stand til at overv&aring;ge og forst&aring; status for de interne lagerdiske, der er installeret p&aring; Synology NAS. G&aring; til <strong>Lagerstyring</strong> &gt; <strong>HDD/SSD</strong> for at administrere disse valgmuligheder.</p>


	<h4>S&aring;dan kontrollerer du HDD/SSD-oplysninger:</h4>
	<ol>
		<li>G&aring; til fanen <b>HDD/SSD</b>.</li>
		<li>V&aelig;lg et drev i listen, og udvid det. Her kan du se S.M.A.R.T.-status, disk/RAID Group-oplysninger, modelnavn, serienummer, firmwareversion og temperatur.</li>
	</ol>	
	
	<h4>S&aring;dan kontrollerer du sundhedsoplysningerne:</h4>
    <ol>
      <li>G&aring; til fanen <b>HDD/SSD</b>.</li>
	  <li>V&aelig;lg et drev.</li>
      <li>Klik p&aring; <b>Sundhedsoplysninger</b>.</li>
	  <li>G&aring; til fanen <strong>Oversigt</strong> for at finde ud af, hvor mange timer disken har v&aelig;ret t&aelig;ndt og se den aktuelle temperatur, antal gentilslutninger/genidentifikationer og antal d&aring;rlige sektorer. Her kan du ogs&aring; se den generelle sundhedsstatus, S.M.A.R.T.-status og IronWolf Health*-status. Se nedenst&aring;ende tabel for en oversigt over den generelle disksundhedsstatus og den tilknyttede sundhedstilstand.</li>
      <li>G&aring; til fanen <strong>S.M.A.R.T.-oplysninger</strong> for yderligere at diagnosticere diskstatus.</li>
    </ol>

<table>
	<tr>
		<th>Diskstatus</th>
		<th>Sundhedstilstand</th>
	</tr>
	<tr>
		<td>Normal</td>
		<td>
			<p>Disken er i god tilstand eller ogs&aring; er advarslen om disken undertrykt eller deaktiveret.</p>
		</td>
	</tr>
	<tr>
		<td>Advarsel</td>
		<td>
			<p>Der er registreret problemer p&aring; disken og/eller antal d&aring;rlige sektorer har overskredet den angivne gr&aelig;nse. Selv om diske med denne status stadig kan serviceres, skal de overv&aring;ges.</p>
		</td>
	</tr>
	<tr>
		<td>Kritisk</td>
		<td>
			<p>En kritisk problem eller flere problemer er registreret p&aring; disken. Udskiftning af disken med det samme anbefales kraftigt.</p>
		</td>
	</tr>
	<tr>
		<td>Fejler</td>
		<td>
			<p>Flere kritiske problemer er registreret p&aring; disken. Diskintegritet er ikke garanteret, n&aring;r diske har denne sundhedsstatus.</p>
		</td>
	</tr>
	<tr>
		<td>Adgangsfejl</td>
		<td>
			<p>Diskkommunikationsfejl kan v&aelig;re &aring;rsag til, at disk afbryder fra systemet eller resulterede i alvorlige l&aelig;se/skrivefejl. Denne sundhedsstatus angiver normalt, at alvorlige problemer er opst&aring;et.</p>
		</td>
	</tr>
</table>



<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Ikke alle S.M.A.R.T.-funktioner underst&oslash;ttes p&aring; SAS-diske.</li>
</ul>
</div>

<h4>S&aring;dan &aelig;ndrer du diskadvarselsstatus:</h4>
<P>DSM overv&aring;ger hele tiden sundhedsstatus for dine diske og vil advare dig, n&aring;r der registreres problemer. Nogle problemer kan v&aelig;re mere alvorlige end andre. Ved visse problemer, der medf&oslash;rer sundhedsstatus <strong>Advarsel</strong> (under <strong>Sundhedsoplysninger</strong> &gt; <strong>Oversigt</strong>), kan advarslen &aelig;ndres ved at g&oslash;re f&oslash;lgende:</P>
<ol>
 <li>G&aring; til fanen <strong>HDD/SSD</strong>.</li>
 <li>V&aelig;lg disken med advarselsstatus, og klik p&aring; <strong>Sundhedsoplysninger</strong>.</li> 
 <li>Klik p&aring; <strong>Ret diskadvarsel</strong></li>
 <li>Klik p&aring; valgmuligheden <strong>Undertryk advarsel</strong> eller <strong>Deaktiver advarsel</strong> (du f&aring;r m&aring;ske disse to valgmuligheder, afh&aelig;ngigt af problemtypen): 
  <ul>
   <li><strong>Undertryk advarsel:</strong> Overv&aring;gning af de degraderede felt forts&aelig;ttes. Advarsler udl&oslash;ses dog kun, n&aring;r den v&aelig;rdi forts&aelig;tter med at degraderes.</li> 
   <li><strong>Deaktiver Advarsel:</strong> Overv&aring;gning af S.M.A.R.T.-feltet bliver permanent deaktiveret.</li>
  </ul>
 </li>
</ol>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>&AElig;ndring af diskadvarselsstatus vil ikke l&oslash;se problemer, der er opst&aring;et p&aring; disken og heller ikke forhindre dem i at ske igen. Derfor skal denne handling ikke ses som en langsigtet l&oslash;sning.</li>
<li>Bem&aelig;rk, at en advarsel vedr. S.M.A.R.T.-problemer normalt angiver, at der er opst&aring;et et problem p&aring; disken. Ignorering af advarslen kan medf&oslash;re datatab.</li>
<li>Visse S.M.A.R.T.-felter er udpeget som kritiske og kan ikke undertrykkes eller deaktiveres.</li>
</div>


	<h4>S&aring;dan starter du en S.M.A.R.T.-test:</h4>
	<P>S.M.A.R.T.-test vil unders&oslash;ge og rapportere status for dine drev og advare dig om mulige diskfejl. Vi anbefaler, at du med det samme &aelig;ndrer drevene, hvis der registreres fejl. </P>
    <ol>
      <li>G&aring; til fanen <strong>HDD/SSD</strong>.</li>
      <li>V&aelig;lg et drev.</li>
      <li>Klik p&aring; <b>S.M.A.R.T.-test</b>.</li>
      <li>V&aelig;lg en testtype, og klik p&aring; <strong>Start</strong> for at starte testen.</li>
      <li>De sidste testresultater vises i afsnittet <b>Testresultat</b>.</li>
      <li>G&aring; til fanen <strong>Historik</strong> for at se tidligere testresultater.</li>
    </ol>
<div class="section">
<h4>Bem&aelig;rk:</h4>
    <ul>
     <li>Den tid, der kr&aelig;ves til at k&oslash;re en S.M.A.R.T.-test kan variere, afh&aelig;ngigt af systemforbruget og diskkapacitet.</li> 
     <li>Testoutput er enten <strong>Normal</strong> eller <strong>Fejler</strong>.</li>
    </ul>
</div>

    <h4>S&aring;dan planl&aelig;gger du S.M.A.R.T.-test:</h4>
    <p>S.M.A.R.T-test kan planl&aelig;gges til at k&oslash;res automatisk p&aring; diske.</p>
    <ol>
      <li>G&aring; til fanen <strong>Testplanl&aelig;gger</strong>.</li>
      <li>Klik p&aring; <strong>Opret</strong> for at konfigurere en ny opgave.</li>
      <li>Ret f&oslash;lgende indstillinger p&aring; fanen <strong>Generelt</strong>:</li>
      <ul>
        <li><strong>Opgavenavn:</strong> Indtast et navn p&aring; opgaven.</li>
        <li><strong>S.M.A.R.T.-testtype:</strong>  V&aelig;lg at udf&oslash;re en hurtigtest eller udvidet test.</li>
        <li><strong>S.M.A.R.T.-testinterval:</strong> V&aelig;lg de HDD/SSD, der skal testes hver gang S.M.A.R.T.-testen udf&oslash;res.</li>
      </ul>
      <li>P&aring; fanen <strong>Plan</strong> &aelig;ndrer du f&oslash;lgende indstillinger:</li>
      <ul>
        <li><strong>Dato:</strong> Angiv datoen for udf&oslash;relse af S.M.A.R.T.-testen, som kan planl&aelig;gges til at k&oslash;re p&aring; visse dage i ugen (f.eks. dagligt, i weekender eller hver s&oslash;ndag) eller p&aring; bestemte datoer (f.eks. 21/11/2016).</li>
        <li><strong>Tid:</strong> Angiv frekvensen for den S.M.A.R.T.-test, der skal k&oslash;res p&aring; disken samt dens f&oslash;rste og sidste k&oslash;rselstidspunkt.</li>
      </ul>
      <li>Klik p&aring; <strong>OK</strong> for at afslutte.</li>
    </ol>

<div class="section">
<h4>Bem&aelig;rk:</h4>
   <ul>
    <li>Hvis S.M.A.R.T.-testen ikke er planlagt til at k&oslash;re p&aring; en specifik diske, vil knappen <strong>Planl&aelig;g S.M.A.R.T.-test</strong> blive vist i <strong>Sundhedsoplysninger</strong> &gt; <strong>Oversigt</strong> for den disk.</li> 
   </ul>
</div>

<h4>S&aring;dan aktiverer du advarsel om beskadiget sektor*:</h4>
<ol>
	<li>G&aring; til fanen <b>Generelt</b>.</li>
	<li>Marker <b>Aktiver advarsel om beskadiget sektor</b>. Som standard er denne funktion aktiveret.</li>
	<li>Angiv gr&aelig;nsen i feltet <b>Antal beskadigede sektorer</b>. Status for en harddisk &aelig;ndres til <b>Advarsel</b>, n&aring;r antallet af beskadigede sektorer n&aring;r den her angivne v&aelig;rdi.</li>
	<li>Klik p&aring; <b>Anvend</b>.</li>
</ol>

<h4>Aktiver advarsel om disklevetid*: </h4>
<ol>
	<li>G&aring; til fanen <b>Generelt</b>.</li>
	<li>Marker <b>Aktiver advarsel om disklevetid</b>. Som standard er denne funktion aktiveret.</li>
	<li>Angiv gr&aelig;nsen i feltet <b>Levetidsprocent (%)</b>. Status for SSD &aelig;ndres til <b>Advarsel</b>, n&aring;r den ansl&aring;ede livstid er under den her angivne v&aelig;rdi.</li>
	<li>Klik p&aring; <b>Anvend</b>.</li>
</ol>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Disklevetidsadvarsel underst&oslash;ttes kun p&aring; SSD'er.</li>
<li>V&aelig;rdien af diskens levetid er genereres direkte fra S.M.A.R.T-oplysninger. Hvis disken ikke underst&oslash;tter denne S.M.A.R.T.-attribut, underst&oslash;ttes denne funktion ikke.</li>
</ul>
</div>

<h4>S&aring;dan udf&oslash;rer du Benchmark*:</h4>
<ol>
	<li>G&aring; til fanen <b>HDD/SSD</b>.</li>
	<li>V&aelig;lg et drev, og klik p&aring; <b>Benchmark</b>.</li>
	<li>I det vindue, der vises, klikker du p&aring; <b>K&oslash;r test nu</b> for at starte test af ydeevne. Resultater vises her, n&aring;r testen er f&aelig;rdig.</li>
	<li>Sammenlign resultatet med foreg&aring;ende test ved at klikke p&aring; <b>V&aelig;lg</b> i feltet <b>Sammenlignet test</b> for at v&aelig;lge den &oslash;nskede logfil.</li>
</ol>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
	<li>Sekventielt output, tilf&aelig;ldig IOPS og latens er inkluderet i testen af ydeevne, som tager ca. 18 minutter.</li>
	<li>Der er to testtyper: <b>grundl&aelig;ggende</b> og <b>udvidet</b>.
	<ul>
		<li>Ved diske, der bruges til RAID, kan du kun udf&oslash;re grundl&aelig;ggende test, og data p&aring; diskene bliver ikke p&aring;virket. Du kan dog ikke teste skriveydeevne p&aring; HDD'er, der anvendes til RAID.</li>
		<li>I de resterende tilf&aelig;lde udf&oslash;res udvidet test for at forbedre pr&aelig;cisionen. Teste af ydeevne garanterer dog ikke dataintegritet. Derfor skal du s&oslash;rge for, at der ikke er vigtige data p&aring; diskene, f&oslash;r du udf&oslash;rer Benchmark.</li>
	</ul>
    </li>
	<li>Du kan ikke udf&oslash;re test p&aring; mere end tre diske ad gangen, eller n&aring;r der kun er en disk for at sikre systemtilg&aelig;ngelighed. Hvis diskudnyttelsen derudover overstiger 5 %, vil systemet bede dig bekr&aelig;fte igen, f&oslash;r du forts&aelig;tter med test af ydeevne for at sikre, testens pr&aelig;cision.</li>
	<li>Benchmark-resultater kan sammenlignes med tidligere test. N&aring;r forskellen er st&oslash;rre end 5 %, bliver du advaret.</li>
    <li>Disk Benchmark k&oslash;rer med lav prioritet i DSM for at sikre minimal p&aring;virkning af andre tjenester, n&aring;r den k&oslash;rer. Viste tal kan variere, afh&aelig;ngigt af systembelastning og konfiguration. Disse tal skal kun bruges som reference til overslag for diskfunktionalitet og kan ikke sammenlignes blandt forskellige modeller eller DSM-versioner.</li>
</ul>
</div>


<h4>S&aring;dan udf&oslash;rer du Secure Erase:</h4>
<ol>
<li>G&aring; til fanen <b>HDD/SSD</b>.</li>
<li>V&aelig;lg et drev, og klik p&aring; <b>Secure Erase</b>.</li>
</ol>


<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Secure Erase kan ikke udf&oslash;res p&aring; diske i udvidelsesenheder.</li>
<li>Secure Erase vil fjerne alle data fuldst&aelig;ndigt fra dit drev. S&oslash;rg for, at den valgte disk ikke bruges, eller der er udf&oslash;rt backup p&aring; data, f&oslash;r du g&oslash;r det.</li>
<li>N&aring;r systemet udf&oslash;rer Secure Erase, bliver den valgte disk midlertidigt l&aring;st og s&aring; automatisk l&aring;st op, n&aring;r operationen er fuldf&oslash;rt.</li>
<li>Hvis Secure Erase standset ukorrekt under operationen, kan du genudf&oslash;re Secure Erase direkte fra brugerinterfacet. Hvis diskene fjernes eller bruges andetsteds, n&aring;r de stadig er l&aring;st, skal du indtaste adgangskoden &quot;synology&quot; for at l&aring;se diskene op.</li>
</ul>
</div>

<h4>S&aring;dan opdaterer du S.M.A.R.T.-database:</h4>
<p>S.M.A.R.T.-databasen indeholder oplysninger relateret til sikker driftstemperatur og S.M.A.R.T.-feltnavne for en disk. Databasen opdateres regelm&aelig;ssigt og opdateres automatisk, n&aring;r en disk udskiftes. Denne operation skal kun udf&oslash;res, n&aring;r regelm&aelig;ssig eller automatisk databaseopdatering mislykkes.</p>

<ol>
<li>G&aring; til fanen <strong>Generelt</strong>.</li>
<li>Rul ned til afsnittet <strong>S.M.A.R.T.-database</strong>.</li>
<li>Klik p&aring; <strong>Opdater nu</strong>.</li>
</ol>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>S.M.A.R.T.-databasen kan kun opdateres en gang hver 24 timer.</li>
<li>S.M.A.R.T. -databasen bliver automatisk opdateret, n&aring;r der inds&aelig;ttes en ny disk i din Synology NAS.</li>
<li>Opdatering af S.M.A.R.T.-database p&aring;virker ikke og forbedrer heller ikke diskkompatibilitet og ydeevne.</li>
<li>Udf&oslash;r kun denne operation, n&aring;r flere v&aelig;rdier i S.M.A.R.T.-oplysninger ikke kan identificeres, eller n&aring;r Synology-supportteamet anbefaler at g&oslash;re det.</li>
</ul>
</div>


	<h3>Aktivering af skrive-cache-underst&oslash;ttelse for HDD</h3>
	<p>Aktivering af skrive-cache-underst&oslash;ttelse forbedrer ydelse p&aring; din Synology NAS. Kun visse harddiskmodeller underst&oslash;tter denne funktion. Hvis du vil sikre databeskyttelsen med skrive-cache-underst&oslash;tter, anbefales brug af en UPS-enhed kraftigt. Vi foresl&aring;r ogs&aring;, at systemet slukkes korrekt hver gang efter brug. Deaktivering af skrive-cache vil reducere mulighederne for datatab, der skyldes unormale str&oslash;mudfald, men systemydelsen vil falde.</p>

	<h4>S&aring;dan aktiverer du skrive-cache-underst&oslash;ttelse: </h4>
	<ol>
		<li>G&aring; til fanen <b>Cache-styring</b>.</li>
		<li>Marker <b>Aktiver skrive-cache</b>. Som standard er denne funktion aktiveret.</li>
		<li>Klik p&aring; <b>Anvend</b>.</li>
	</ol>


    
    
<p>____<br> * Findes kun p&aring; bestemte modeller. </p>

</body>
</html>
