<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Diskenhed</h2>
<p>Diskeenheder er grundl&aelig;ggende lagerpladser, hvor brugere kan oprette delte mapper, iSCSI LUN (almindelige filer), gemme data eller installere pakker. F&oslash;r diskenheder oprettes, skal du s&oslash;rge for, at du allerede har oprettet en RAID Group. Yderligere oplysninger om RAID-grupper findes under <a href="raid.html">RAID Group</a>.
</p>

<h4>S&aring;dan opretter du en diskenhed:</h4>
<ol>
	<li>S&oslash;rg for, at din Synology NAS har en eksisterende RAID Group med plads, der kan allokeres.</li>
	<li>Klik p&aring; knappen <strong>Opret</strong>.</li>
	<li>V&aelig;lg en RAID Group, som du kan oprette diskenheden p&aring;.</li>
	<li>Ret &oslash;nskede indstillinger.</li>
	<li>Angiv st&oslash;rrelsesallokeringen for diskenheden. (indstilling af st&oslash;rrelse er utilg&aelig;ngelig med diskenheder oprettet p&aring; RAID Group for enkelte diskenheder eller iSCSI LUN).</li>
    <li>V&aelig;lg, om du vil registrere filadgangstid:</li>
	  <ul>
      <li>Aktivering af valgmuligheden <strong>Registrer filadgangstid</strong> er lig med at bruge valgmuligheden relatime p&aring; Linux-systemer. Filadgangstid opdateres kun, n&aring;r den sidste adgangstid (atime) ligger f&oslash;r den aktuelle &aelig;ndringstid (mtime) eller &aelig;ndringtid (ctime). Adgangstid bliver ogs&aring; opdateret, hvis den sidste adgangstid er &aelig;ldre end en dag.</li>
      <li>Deaktivering af valgmuligheden <strong>Registrer filadgangstid</strong> er lig med at bruge valgmuligheden noatime p&aring; Linux-systemer. Adgangstid for filer og mapper bliver ikke opdateret, hvilket medf&oslash;rer reduceret filsystemforbrug. Bem&aelig;rk, at nogle programmer kan afh&aelig;nge af filadgangstid for at fungere korrekt.</li>
      </ul>
    <li>Klik p&aring; knappen <strong>Anvend</strong> for af bekr&aelig;fte indstillinger.</li>


</ol>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>Den maksimale diskenhedsst&oslash;rrelse, der kan allokeres, er 200 TB.</li>
	<li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Mindste allokerede st&oslash;rrelse til en Btrfs-diskenhed skal v&aelig;re mindst 10 GB.</li>
    <li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Btrfs-diskenheder vil reservere 4 % af pladsen til metadata.</li>
</ul>
</div>

<h4>S&aring;dan fjerner du en diskenhed:</h4>
<ol>
	<li>V&aelig;lg den diskenhed, du vil fjerne.</li>
	<li>Klik p&aring; knappen <strong>Fjern</strong>, og f&oslash;lg guiden for at fuldf&oslash;re processen.</li>
</ol>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>Fjernelse af en diskenhed vil slette alle eksisterende data p&aring; denne diskenhed.</li>
</ul>
</div>

<h4>S&aring;dan gennemtvinger du tilknytning af en diskenhed:</h4>
<p>Hvis cachen p&aring; en diskenhed mangler, vil systemet ikke tilknytte diskenheden ved start. Hvis cachen ikke kan gendannes, og du vil have adgang til diskenheden, kan du klikke p&aring; <strong>Gennemtving tilknytning</strong>. </p>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>Denne funktion er kun tilg&aelig;ngelig p&aring; bestemte modeller.</li>
</ul>
</div>

<h4>S&aring;dan repareres en diskenhed:</h4>
<p>Hvis diskenhedens status er <strong>Degraderet</strong>, skal du g&aring; til fanen <strong>RAID Group</strong> og finde den relevante RAID Group. F&oslash;lg s&aring; de foresl&aring;ede instruktioner til at repareret den.</p>

<h4>S&aring;dan udvider du st&oslash;rrelsen af en diskenhed</h4>
<ul>
	<li>For diskenheden, der er oprettet p&aring; en RAID Group til flere diskenheder eller iSCSI LUN'er (blokniveau) 
		<ol>
			<li>V&aelig;lg den diskenhed, du vil udvide.</li>
			<li>Klik p&aring; <strong>Rediger</strong>.</li>
			<li>Indtast den ny st&oslash;rrelse, og klik p&aring; <strong>OK</strong> for at udvide.</li>
		</ol>
	</li>
	<li>Ved diskenhed oprettet p&aring; en RAID Group til &eacute;n diskenhed eller iSCSI LUN (blokniveau) skal du se i afsnittet <strong>S&aring;dan udvider du st&oslash;rrelsen af en RAID Group</strong> under <a href="raid.html">RAID Group</a>. Diskenheden bliver udvidet efter den underliggende RAID Group er udvidet.</li>
</ul>

<h3>SSD TRIM</h3>
<p>Hvis en diskenhed kun best&aring;r af SSD'er (Solid State Drives), anbefaler vi at aktivere SSD TRIM. Denne funktion forbedrer l&aelig;se- og skriveydelsen af diskenheder, der er oprettet p&aring; SSD'er, for&oslash;ger effektiviteten samt forl&aelig;nger levetiden for dine SSD'er.</p>

<h4>S&aring;dan aktiverer du SSD TRIM:</h4>
<ol>
	<li>&Aring;bn <strong>Lagerstyring</strong>, og g&aring; til <strong>Diskenhed</strong>.</li>
	<li>V&aelig;lg en diskenhed, som kun best&aring;r af SSD'er, og klik p&aring; knappen <strong>Konfigurer</strong>.</li>
	<li>I det vindue, der vises, g&aring;r du til fanen <strong>SSD TRIM</strong> og markerer feltet <strong>Aktiver TRIM</strong>.</li>
	<li>Klik p&aring; knappen <strong>Angiv plan</strong> for at v&aelig;lge, hvorn&aring;r systemet vil udf&oslash;re SSD TRIM.</li>
	<li>Klik p&aring; <strong>OK</strong>.</li>
</ol>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>SSD TRIM er kun tilg&aelig;ngelig p&aring; visse Synology NAS-modeller og RAID-typer. </li>
	<li>Nogle SSD-modeller kan ikke udf&oslash;re SSD TRIM p&aring; RAID 5-<span class="enable-grantley">,</span> <span class="disable-grantley">og </span>RAID 6<span class="enable-grantley">- og RAID F1</span>-diskenheder. Der henvises til kompatibilitetslisten p&aring; Synologys <a href="https://www.synology.com/" target="_blank">officielle websted</a>.</li>
	<li>SSD TRIM kan ikke aktiveres i f&oslash;lgende situationer:
		<ul>
			<li>Diskenheden tilknyttes med SSD-cache.</li>
			<li>Pakken <strong>Time Backup</strong> installeres.</li>
		</ul>
	</li>
	<li>SSD TRIM kan ikke aktiveres p&aring; iSCSI LUN'er med blokniveau.</li>
	<li>Systemydelse bliver p&aring;virket, n&aring;r der udf&oslash;res SSD TRIM. Den tid, der er brug for, til at f&aelig;rdigg&oslash;re udf&oslash;relsen af TRIM varierer, afh&aelig;ngigt af diskenhedsst&oslash;rrelsen og SSD-modellen.</li>
	<li>N&aring;r TRIM er aktiveret p&aring; en diskenhed, bliver den ogs&aring; aktiveret p&aring; andre diskenheder, der er oprettet i den samme diskgruppe eller RAID-gruppe.</li>
</ul>
</div>


<h3>Scrubbing af filsystem*</h3>
<p>Scrubbing af filsystem er en datavedligeholdelsesfunktion, der unders&oslash;ger diskenheder. Hvis der registreres data, der er inkonsekvente med kontrolsummen, vil filstien bliver optaget i Logcenter, og det anbefales, at du bruger en backup til at reparere dataene.</p>

<p>Vi anbefaler regelm&aelig;ssig udf&oslash;relse af scrubbing af filsystem for at sikre datakonsekvens.</p>

<h4>S&aring;dan udf&oslash;rer du scrubbing af filsystem:</h4>
<ol>
	<li>&Aring;bn <strong>Lagerstyring</strong>, og g&aring; til <strong>Diskenhed</strong>.</li>
	<li>V&aelig;lg den diskenhed, hvor du vil udf&oslash;re scrubbing af filsystem.</li>
	<li>Klik p&aring; <strong>Administrer</strong>.</li>
	<li>V&aelig;lg <strong>Scrubbing af filsystem</strong>.</li>
</ol>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>Scrubbing af filsystem kan kun udf&oslash;res p&aring; diskenheder i filsystemet <strong>Btrfs</strong>.</li>
	<li>Scrubbing af filsystem kan kun udf&oslash;res, n&aring;r status for diskenheden er <strong>Normal</strong>.</li>
	<li>Luk ikke systemet, f&oslash;r scrubbing af filsystem er f&aelig;rdig. Hvis systemet lukkes ned f&oslash;r fuldf&oslash;relse, skal du manuelt genstarte scrubbing af filsystemet fra starten.</li>
</ul>
</div>

<h3>Defragmentering af filsystem*</h3>
<p>Hvis dine data &aelig;ndres hele tiden, vil m&aelig;ngden af defragmenterede filer &oslash;ges i filsystemet, s&aring; du f&aring;r langsommere adgang til filer p&aring; harddisken. Udf&oslash;relse af defragmentering af filsystem kan forbedre ydelsen.</p>

<h4>S&aring;dan udf&oslash;rer du defragmentering af filsystem:</h4>
<ol>
	<li>&Aring;bn <strong>Lagerstyring</strong>, og g&aring; til <strong>Diskenhed</strong>.</li>
	<li>V&aelig;lg den diskenhed, hvor du vil udf&oslash;re defragmentering af filsystem.</li>
	<li>Klik p&aring; <strong>Administrer</strong>.</li>
	<li>V&aelig;lg <strong>Defragmentering af filsystem</strong>.</li>
</ol>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>Defragmentering af filsystem kan kun udf&oslash;res p&aring; diskenheder i filsystemet <strong>Btrfs</strong>.</li>
	<li>Defragmentering af filsystem kan kun udf&oslash;res, n&aring;r status for diskenheden er <strong>Normal</strong>.</li>
	<li>Luk ikke systemet, f&oslash;r defragmentering af filsystem er f&aelig;rdig. Hvis systemet lukkes ned f&oslash;r fuldf&oslash;relse, skal du manuelt genstarte defragmentering af filsystemet fra starten.</li>
	<li>Diskenhedsbrug kan for&oslash;ges, hvis diskenheden indeholder billeder af delte mapper.</li>
</ul>
</div>

<p>____<br /> *Kun tilg&aelig;ngeligt p&aring; visse modeller.</p>

</body>
</html>