<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Tilf&oslash;j en disk for at udvide lagerkapaciteten</h2>

<p>Hvis der er tomme diskb&aring;se p&aring; din Synology NAS, kan du installere yderligere diske og tilf&oslash;je dem til en eksisterende diskenhed eller diskgruppe. Denne artikel giver dig oplysninger om udvidelse af en eksisterende diskenhed eller diskgruppe ved at installere yderligere diske.</p>

<h3>F&oslash;r du begynder</h3>

<p>F&oslash;r du begynder, skal du sikre, at den disk, du vil tilf&oslash;je, opfylder f&oslash;lgende st&oslash;rrelseskrav:</p>
<ul>
	<li><strong>For SHR:</strong> Kapaciteten p&aring; den disk, som du vil tilf&oslash;je, skal v&aelig;re lig med eller st&oslash;rre end den st&oslash;rste disk p&aring; diskenheden eller i diskgruppen eller lige med enhver disk i p&aring; diskenheden eller i diskgruppen. Hvis din SHR-diskenhed f.eks. best&aring;r af tre diske &ndash; henholdsvis 2 TB, 1,5 TB og 1 TB &ndash; skal kapaciteten for den nye disk v&aelig;re mindst 2 TB eller lig med 1,5 TB eller 1 TB.</li>
	<li><strong>For RAID 5<span class="enable-grantley">,</span> <span class="disable-grantley">og </span>RAID 6<span class="enable-grantley"> og RAID F1</span>:</strong> Kapaciteten p&aring; den disk, som du vil tilf&oslash;je, skal v&aelig;re lig med eller st&oslash;rre end den mindste disk p&aring; diskenheden eller i diskgruppen. Hvis din diskenhed f.eks. best&aring;r af tre diske &ndash; henholdsvis 2 TB, 1,5 TB og 1 TB &ndash; skal kapaciteten for den nye disk v&aelig;re mindst 1 TB.</li>
</ul>

<div class="section"><h4>Check status for diskenhed</h4>
<p>S&oslash;rg for, at status for din diskenhed eller diskgruppe er <strong>Normal</strong>. Hvis det ikke er tilf&aelig;ldes, skal du f&oslash;rste reparere den.</p>
</div>

<h3>Tilf&oslash;j en disk til en diskenhed eller diskgruppe</h3>
<p>Harddiske kan tilf&oslash;jes til f&oslash;lgende RAID-typer: </p>
<ul>
	<li>Synology Hybrid RAID (SHR)</li>
	<li>JBOD</li>
	<li>RAID 5</li>
	<li>RAID 6</li>
</ul>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>For SHR-diskenheder udvides lagerkapaciteten kun, n&aring;r der tilf&oslash;jes diske til en diskenhed med to eller flere diske.</li>
</ul>
</div>

<h4>S&aring;dan tilf&oslash;jer du en disk til en diskenhed eller diskgruppe:</h4>

<ol>
	<li>Sluk for din Synology NAS. (Du kan springe dette trin over hvis Synology NAS underst&oslash;tter hot-swapping).</li>
	<li>Inds&aelig;t en nye disk i en tom diskb&aring;s.</li>

<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
	<li>Undg&aring; af skade dig selv eller din Synology NAS ved at f&oslash;lge diskinstallationsvejledningen i <em>Hurtiginstallationsvejledning</em> til dit Synology-produkt.</li>
</ul>
</div>

<li>T&aelig;nd for din Synology NAS.</li>
	<li>Log ind p&aring; DSM med en konto fra gruppen <strong>administrators</strong>.</li>
	<li>&Aring;bn <strong>Lagerstyring</strong>.<br /><img src="about:blank" class="help_image" /></li>
	<li>I det tilf&aelig;lde skal du g&oslash;re f&oslash;lgende:
		<ul>
			<li>Hvis du udvider &eacute;n diskenhed, skal du g&aring; til fanen <strong>Diskenhed</strong>. V&aelig;lg den diskenhed, du vil udvide. Klik p&aring; <strong>Administrer</strong>, og forts&aelig;t til n&aelig;ste trin.<br /><img src="about:blank" class="help_image" /></li>
			<li>Hvis du udvider en diskgruppe, skal du g&aring; til fanen <strong>Diskgruppe</strong>. V&aelig;lg den diskgruppe, du vil udvide. Klik p&aring; <strong>Administrer</strong>, og forts&aelig;t til n&aelig;ste trin.<br /><img src="about:blank" class="help_image" /></li>
		</ul>
	</li>
	<li>V&aelig;lg <strong>Udvid diskenheden (eller diskgruppen) ved at tilf&oslash;je harddiske</strong>. Klik derefter p&aring; <strong>N&aelig;ste</strong>.<br /><img src="about:blank" class="help_image" /></li>
	<li>V&aelig;lg de diske, som du vil udvide diskenhed eller diskgruppen med. Du kan tilf&oslash;je diske ved at markere de tilh&oslash;rende afkrydsningsfelter. Klik derefter p&aring; <strong>N&aelig;ste</strong>.<br /><img src="about:blank" class="help_image" /></li>
	<li>F&oslash;lg trinnene i guiden for at afslutte.</li>
</ol>

</body>
</html>