<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Opret en diskenhed - Synology DSM - Hj&aelig;lp</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article walks you through the steps to create a volume on Synology NAS using Storage Manager.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Opret en diskenhed</h2>

<p>Denne artikel forklarer, hvordan du opretter en diskenhed p&aring; din Synology NAS. Du kan v&aelig;lge en af f&oslash;lgende metoder ved oprettelse af en ny diskenhed:</p>

<ul>
  <li><b>Kvik:</b> Dette er den bedste metode for begyndere. V&aelig;lg denne metode, hvis du automatisk vil optimere lagerkapaciteten og ydelsen uden at t&aelig;nke p&aring; tekniske aspekter, f.eks. RAID-niveauer. </li>

<li><b>Tilpasset</b>: For avancerede brugere, som vil kontrollere de finere aspekter af diskenhedsoprettelse, f.eks. RAID-typer og kapacitetsallokering. Denne mulighed underst&oslash;tter forskellige RAID-typer, s&aring; du kan oprette enkelt eller flere diskenhed(er), og der er valgmuligheder til at allokere specifikke kapacitetsm&aelig;ngder til hver diskenhed (kun n&aring;r der oprettes flere diskenheder p&aring; RAID).
</li>
</ul>

<div class="section">
<h4>Enkel eller flere diskenheder p&aring; RAID?</h4>
<p>Du kan v&aelig;lge en af f&oslash;lgende muligheder ved oprettelse af en diskenhed med tilpasset tilstand:</p>
<ul>
  <li><b>Enkelt diskenhed p&aring; RAID</b>
    <ul>
      <li>Opretter en diskenhed med hele den tilg&aelig;ngelige kapacitet for de valgte harddiske.</li>
      <li>Giver h&oslash;jere hastighed og bedre ydelse.</li>
      <li>Underst&oslash;tter forskellige RAID-typer.</li>
    </ul>
  </li>
  <li><b>Flere diskenheder p&aring; RAID</b>
    <ul>
      <li>S&aelig;tter dig i stand til at oprette flere diskenheder i en diskgruppe.</li>
      <li>Underst&oslash;tter allokering af bestemt kapacitetsm&aelig;ngde p&aring; hver diskenhed.</li>
      <li>Giver bedre lagerstyringsfleksibilitet.</li>
      <li>Underst&oslash;tter forskellige RAID-typer.</li>
    </ul>
  </li>
</ul>
</div>


<div class="section">
<h4>F&oslash;r du begynder:</h4>
<ul>
<li>S&oslash;rg for, at der ikke er vigtige data p&aring; harddiskene. Alle eksisterende data bliver slettet under oprettelsesprocessen.</li>
<li>G&aring; til siden <b>HDD/SSD</b>, og s&oslash;rg for, at status for hver harddisk er <b>Normal</b> eller <strong>Ikke initialiseret</strong>.</li>
</ul>
</div>

<div class="section enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Mindste st&oslash;rrelse til en Btrfs-diskenhed er 10 GB.</li>
<li>Btrfs-diskenheder vil reservere 4 % af pladsen til metadata.</li>
</ul>
</div>

<h4>S&aring;dan opretter du en diskenhed:</h4>
<ol>
<li>&Aring;bn <b>Lagerstyring</b>.</li>
<img src="about:blank" class="help_image"/>
<li>G&aring; til <b>Diskenhed</b>, og klik p&aring; <b>Opret</b>.</li>
<img src="about:blank" class="help_image"/>


<li>Du ser oprettelsesguiden til diskenhed V&aelig;lg <strong>Kvik</strong> eller <strong>Tilpasset</strong>, afh&aelig;ngigt af behovene.</li>
<li>Ret &oslash;nskede indstillinger.</li>
<li>V&aelig;lg, om du vil registrere filadgangstid:</li>
	  <ul>
      <li>Aktivering af valgmuligheden <strong>Registrer filadgangstid</strong> er lig med at bruge valgmuligheden relatime p&aring; Linux-systemer. Filadgangstid opdateres kun, n&aring;r den sidste adgangstid (atime) ligger f&oslash;r den aktuelle &aelig;ndringstid (mtime) eller &aelig;ndringtid (ctime). Adgangstid bliver ogs&aring; opdateret, hvis den sidste adgangstid er &aelig;ldre end en dag.</li>
      <li>Deaktivering af valgmuligheden <strong>Registrer filadgangstid</strong> er lig med at bruge valgmuligheden noatime p&aring; Linux-systemer. Adgangstid for filer og mapper bliver ikke opdateret, hvilket medf&oslash;rer reduceret filsystemforbrug. Bem&aelig;rk, at nogle programmer kan afh&aelig;nge af filadgangstid for at fungere korrekt.</li>
      </ul>
   <li>Klik p&aring; knappen <strong>Anvend</strong> for af bekr&aelig;fte indstillinger.</li>


<img src="about:blank" class="help_image"/>
</ol>

</body>
</html>
