<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>High Availability</title>


 </head>
 <body>
<h2>Lagringsstatus</h2>
	<p>Denna sida inneh&aring;ller status f&ouml;r lagringsvolymer och iSCSI LUNs (blockniv&aring;) p&aring; den aktiva och den passiv servern i high-availability-klustret.</p>
    <p>Eftersom kapacitet och konfiguration p&aring; de motsvarande volymerna och iSCSI LUNs (blockniv&aring;) p&aring; den aktiva och den passiva servern m&aring;ste vara identiska, visas volymer och iSCSI LUN (blockniv&aring;) p&aring; de tv&aring; servrarna tillsammans som en enda enhet. Om du d&auml;rf&ouml;r vill se status f&ouml;r volymer och iSCSI LUNs (blockniv&aring;) p&aring; b&aring;de den aktiva och den passiva servern m&aring;ste du g&aring; till sidan <b>Lagringsstatus</b> [vid &aring;tkomst till ett high-availability-kluster &auml;r endast volymer och iSCSI LUNs (blockniv&aring;) p&aring; den aktiva servern m&ouml;jliga att se via <b>Lagringshanterare</b>].</p>

    <p>Denna sida inneh&aring;ller f&ouml;ljande information:</p>
		<ul>
			<li><b>Namn:</b> Visar namn p&aring; volymer och iSCSI LUNs (blockniv&aring;).</li>
			<li><b>Anv&auml;nds:</b> Visar procentuell anv&auml;ndning av kapacitet p&aring; volymer och iSCSI LUNs (blockniv&aring;).</li>
			<li><b>Anv&auml;nds/Totalt utrymme:</b>  Visar total och anv&auml;nd kapacitet p&aring; volymer och iSCSI LUNs (blockniv&aring;).</li>
            <li><b>Status:</b> Visar status p&aring; volymer, iSCSI LUNs (blockniv&aring;) och SSD-cachar.</li>
            <li><b>Beskrivning:</b> Visar beskrivning &ouml;ver fel och annan information som ber&ouml;r volym, iSCSI LUN (blockniv&aring;) och SSD-cache.</li>
		</ul>
<h4>Reparera en felaktig volym eller iSCSI LUN (blockniv&aring;):</h4>
	<ul>
		<li>Om en h&aring;rdisk i n&aring;gon av servrarna har kraschat kan du g&aring; till sidan <a href="disk.html">Diskstatus</a> f&ouml;r att avg&ouml;ra vilken h&aring;rddisk som har kraschat och beh&ouml;ver bytas ut. Om s&aring; &auml;r fallet, v&auml;nligen g&ouml;r f&ouml;ljande:
        	<ol>
            	<li>Byt ut den kraschade h&aring;rddisken (f&ouml;r stegvis v&auml;gledning, se <i>Snabb installationsguide</i> f&ouml;r din Synology-produkt).</li>
                <li>G&aring; till sidan <b>Lagringsstatus</b> och klicka p&aring; <b>Reparera</b>.</li>
            </ol>
        </li>
        <li>Om den passiva servern &auml;r offline, kommer status f&ouml;r volymer och iSCSI LUNs (blockniv&aring;) att indikera att ett fel har intr&auml;ffar och ingen av diskarna p&aring; den passiva servern visas p&aring; sidan f&ouml;r Diskstatus. Om s&aring; &auml;r fallet, kan du f&ouml;rs&ouml;ka l&ouml;sa problemet genom att g&ouml;ra f&ouml;ljande:
        	<ol>
            	<li>Tillse att den passiva servern &auml;r p&aring;slagen.</li>
                <li>Kontrollera alla str&ouml;mk&auml;lllor.</li>
                <li>Unders&ouml;k alla anslutningar.</li>
            </ol>
        </li>
        <li>Om ett filsystemfel uppst&aring;r p&aring; en volym eller iSCSI LUN (blockniv&aring;) p&aring; n&aring;gon av servrarna, v&auml;nligen g&ouml;r f&ouml;ljande:
        	<ul>
            	<li>G&aring; till sidan <b>Lagringsstatus</b>.</li>
                <li>Klicka p&aring; <b>Reparera.</b></li>
            </ul>
        </li>
	</ul>

<p><span class="note_head">Obs:</span>  Maxgr&auml;nsen f&ouml;r antalet volymer och iSCSI LUNs (blockniv&aring;) p&aring; ett high-availability-kluster &auml;r 64.</p>



<h3>Kvorumserver</h3>
<p>Kvorumservrar kan hj&auml;lpa till att minska risken f&ouml;r redundans-klyvningsfel. I upps&auml;ttningar med redundans-klyvning kan du tilldela en till server som kvorumserver s&aring; l&auml;nge som den ansluter till b&aring;de aktiv och passiv server. Till exempel &auml;r en gatewayserver eller DNS-server ett l&auml;mpligt val som kvorumserver eftersom den kan ansluta till b&aring;de den aktiva och den passiva servern. V&auml;nligen observera att kvorumservern endast tillhandah&aring;ller pingtj&auml;nster och att det inte kr&auml;vs n&aring;gon installation av applikationer. H&auml;r nedanf&ouml;r &aring;terfinns f&ouml;rh&aring;llanden som f&ouml;ljer av att en kvorumserver aktiveras:</p>

<ul>
<li>Om den passiva servern inte kan ansluta till b&aring;de den aktiva och kvorumservrar blir inte redundans utf&ouml;rd f&ouml;r att f&ouml;rhindra redundans-klyvningsfel.</li>
<li>Om den aktiva servern inte kan ansluta till kvorumservern n&auml;r den passiva servern kan, utl&ouml;ses en &ouml;verg&aring;ng f&ouml;r att s&auml;kerst&auml;lla b&auml;ttre tillg&auml;nglighet.</li>
</ul>

 </body>
</html>
