<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>HDD/SSD</h2>
<p>Esta secci&oacute;n le permite supervisar y comprender el estado de las unidades de almacenamiento interno instaladas en su Synology NAS. Vaya a&nbsp;<b>Administrador de almacenamiento</b>&nbsp;&gt;&nbsp;<b>HDD/SSD</b> para administrar estas opciones.</p>


<ul>
	<li><a href="#Statuses">Informaci&oacute;n y estados de las unidades</a></li>
	<li><a href="#Analytics">Pruebas y an&aacute;lisis de las unidades</a></li>
	<li><a href="#Tests">Programaci&oacute;n y administraci&oacute;n de pruebas de las unidades</a></li>
	<li><a href="#Settings">Estado de advertencia y configuraci&oacute;n de las unidades</a></li>
	<li><a href="#Erase">Secure Erase</a></li>
	<li><a href="#Drive">Desactivaci&oacute;n o activaci&oacute;n de las unidades</a></li>
	<li><a href="#Status">Estado de los indicadores LED de las unidades</a></li>
	<li><a href="#Cache">Cach&eacute; de escritura</a></li>
	<li><a href="#Database">Base de datos de unidades</a></li>
</ul>


<h3><a name="Statuses"></a>Informaci&oacute;n y estados de las unidades</h3>
<p>Para obtener m&aacute;s informaci&oacute;n sobre la informaci&oacute;n y el estado de cada unidad, vaya a <b>Administrador de almacenamiento</b>&nbsp;&gt;&nbsp;<b>HDD/SSD</b>.</p>

<h4>Para comprobar la informaci&oacute;n de HDD/SSD:</h4>
	<ol>
		<li>Vaya a la pesta&ntilde;a <b>HDD/SSD</b>.</li>
		<li>Seleccione una unidad de la lista y exp&aacute;ndala. Aqu&iacute; ver&aacute; el estado de salud, la informaci&oacute;n del grupo de almacenamiento, el nombre del modelo, el n&uacute;mero de serie, la versi&oacute;n de firmware, la temperatura y otra informaci&oacute;n.</li>
	</ol>	
	
<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>Recomendamos encarecidamente el uso de unidades incluidas en la <a href="https://www.synology.com/compatibility?search_by=category&category=hdds&p=1" target=blank>lista de compatibilidad de productos de Synology</a> para evitar problemas. El uso de unidades incompatibles puede reducir el rendimiento del sistema e incluso provocar la p&eacute;rdida de datos en su Synology NAS.</li>
	</ul>
</div>

<h4>Para comprobar la informaci&oacute;n de estado:</h4>
	<ol>
		<li>Vaya a la pesta&ntilde;a <b>HDD/SSD</b>.</li>
		<li>Seleccione una unidad.</li>
		<li>Haga clic en <b>Informaci&oacute;n de estado</b>.</li>
		<li>Vaya a la pesta&ntilde;a <b>Visi&oacute;n general</b> para comprobar cu&aacute;ntas horas ha estado encendida la unidad, as&iacute; como para ver su temperatura actual, el recuento de reconexiones/reidentificaciones y el recuento de sectores defectuosos.</li>
		<li>Vaya a la pesta&ntilde;a <b>S.M.A.R.T.</b> para realizar pruebas de diagn&oacute;stico en la unidad compatible y ver los atributos de S.M.A.R.T. En la secci&oacute;n <b>Prueba de S.M.A.R.T.</b>, puede ejecutar una prueba de S.M.A.R.T. inmediatamente y ver los resultados de la prueba y el programa; en la secci&oacute;n <b>Atributo de S.M.A.R.T.</b>, puede ver los detalles de los valores de atributos de S.M.A.R.T.</li>
		<li>Vaya a la pesta&ntilde;a <b>Estado de IronWolf</b> para realizar pruebas de diagn&oacute;stico a la unidad compatible.</li>
		<li>Vaya a la pesta&ntilde;a <b>Historial</b> para ver y exportar los resultados de diagn&oacute;stico de estado y para ver el historial de los principales atributos de S.M.A.R.T.</li>
	</ol>

	<table>
		<tr>
			<th>Estado de la unidad</th>
			<th>Estado</th>
		</tr>
		<tr>
			<td>En buen estado</td>
			<td>O bien la unidad se encuentra en buen estado, o bien se ha eliminado o deshabilitado la advertencia acerca de la unidad.</td>
		</tr>
		<tr>
			<td>Advertencia</td>
			<td>Se han detectado problemas o los sectores defectuosos han aumentado en esta unidad. Recomendamos supervisar la unidad aunque pueda seguir funcionando correctamente.</td>
		</tr>
		<tr>
			<td>Cr&iacute;tico</td>
			<td>Se han detectado varios problemas o un problema cr&iacute;tico en la unidad. Se recomienda encarecidamente sustituir la unidad de inmediato.</td>
		</tr>
		<tr>
			<td>Con errores</td>
			<td>Se han detectado varios problemas cr&iacute;ticos en la unidad. No se garantiza la integridad de la unidad cuando se encuentra en este estado.</td>
		</tr>
		<tr>
			<td>Error de acceso</td>
			<td>Los errores de comunicaci&oacute;n con la unidad pueden haber causado que esta se haya desconectado del sistema o haber provocado un error grave de lectura-escritura. Este estado generalmente indica que se han producido problemas graves.</td>
		</tr>
	</table>

<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>No se admiten todas las funciones de S.M.A.R.T. en las unidades SAS o en las SSD NVMe.</li>
		<li>La prueba de estado de IronWolf solo se admite en ciertas unidades Seagate.</li>
	</ul>
</div>



<h3><a name="Analytics"></a>Pruebas y an&aacute;lisis de las unidades</h3>
<p>Las siguientes pruebas y an&aacute;lisis pueden llevarse a cabo en las unidades instaladas si su modelo de unidad y Synology&nbsp;NAS son compatibles con estas funciones,</p>

<h4>Para iniciar la prueba de S.M.A.R.T.:</h4>
<p>La secci&oacute;n de prueba de S.M.A.R.T. examinar&aacute; las unidades y le notificar&aacute; su estado para avisarle de los posibles errores. Se recomienda cambiar las unidades lo antes posible si no se supera la prueba.</p>
	<ol>
		<li>Vaya a la pesta&ntilde;a <b>HDD/SSD</b>.</li>
		<li>Seleccione una unidad.</li>
		<li>Haga clic en <b>Informaci&oacute;n de estado</b>.</li>
		<li>Vaya a la pesta&ntilde;a <b>S.M.A.R.T.</b></li>
		<li>Elija un tipo de prueba y haga clic en <b>Iniciar</b> para comenzar la prueba.</li>
		<li>Los resultados de la &uacute;ltima prueba se muestran en la secci&oacute;n <b>Resultado de la prueba</b>.</li>
		<li>Vaya a la pesta&ntilde;a <b>Historial</b> para acceder a los resultados de pruebas anteriores.</li>
	</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>El tiempo necesario para ejecutar una prueba de S.M.A.R.T. puede variar en funci&oacute;n del uso del sistema y la capacidad de la unidad.</li> 
		<li>El resultado de la prueba puede ser <b>Normal</b> o <b>Con errores</b>.</li>
		<li>Las SSD NVMe tienen incorporado un mecanismo de supervisi&oacute;n y, por lo tanto, no son compatibles con la prueba de S.M.A.R.T. ni con la advertencia de sectores defectuosos.</li>
	</ul>
</div>

<h4>Para iniciar la prueba de estado de IronWolf:</h4>
<p>La gesti&oacute;n del estado de Seagate IronWolf utiliza datos de telemetr&iacute;a de unidades adicionales, los cuales contienen m&aacute;s informaci&oacute;n que la prueba de S.M.A.R.T. Se recomienda seguir las sugerencias que aparecen en cada estado de resultado de la prueba. S&oacute;lo disponible en determinados modelos.</p>
	<ol>
		<li>Vaya a la pesta&ntilde;a <b>HDD/SSD</b>.</li>
		<li>Seleccione una unidad.</li>
		<li>Haga clic en <b>Informaci&oacute;n de estado</b>.</li> 
		<li>Vaya a la pesta&ntilde;a <b>Estado de IronWolf</b>.</li>
		<li>Haga clic en <b>Iniciar</b> para comenzar la prueba. La secci&oacute;n <b>Resultado de la prueba</b> muestra los &uacute;ltimos resultados de la prueba.</li>
		<li>Vaya a la pesta&ntilde;a <b>Historial</b> para acceder a los resultados de pruebas anteriores.</li>
	</ol>
	
<p>Consulte la siguiente tabla para obtener una visi&oacute;n general de los c&oacute;digos de resultado de la prueba de estado de IronWolf.</p>
	<table>
		<tr>
			<th>C&oacute;digos de resultado de la gesti&oacute;n del estado de IronWolf</th>
			<th>Definici&oacute;n</th>
		</tr>
		<tr>
			<td>100</td>
			<td>Se ha detectado una temperatura de funcionamiento anormalmente elevada. Aseg&uacute;rese de que los puertos de ventilaci&oacute;n trasera no est&eacute;n bloqueados e intente reducir la temperatura ambiente. Si la temperatura contin&uacute;a siendo elevada, vaya a <b>Panel de control</b> &gt; <b>Hardware y alimentaci&oacute;n</b> &gt; <b>Modo de velocidad del ventilador</b> para aumentar la velocidad del funcionamiento del ventilador. Si este problema persiste, p&oacute;ngase en contacto con el equipo de asistencia de Synology.</td>
		</tr>
		<tr>
			<td>101</td>
			<td>Se ha detectado un problema de conexi&oacute;n entre su Synology NAS y la interfaz del disco duro. Aseg&uacute;rese de que la unidad est&aacute; instalada correctamente en la bandeja de la unidad o el chasis, y que la bandeja est&aacute; instalada correctamente en su Synology NAS. Si este problema persiste, p&oacute;ngase en contacto con el equipo de asistencia de Synology.</td>
		</tr>
		<tr>
			<td>102</td>
			<td>Se ha detectado un exceso de golpes en la unidad. Aseg&uacute;rese de que el disco duro y Synology NAS est&aacute;n colocados en una superficie estable. Si este problema persiste, p&oacute;ngase en contacto con el equipo de asistencia de Synology.</td>
		</tr>
		<tr>
			<td>105</td>
			<td>Se ha detectado una vibraci&oacute;n excesiva. Aseg&uacute;rese de que Synology NAS est&aacute; colocado sobre una superficie estable. Si este problema persiste, p&oacute;ngase en contacto con el equipo de asistencia de Synology.</td>
		</tr>
		<tr>
			<td>106</td>
			<td>Se ha detectado un exceso de restablecimientos del host. Aseg&uacute;rese de que la unidad est&aacute; correctamente instalada en el chasis o en la bandeja de disco. Le recomendamos realizar un ciclo de energ&iacute;a. Si este problema persiste, p&oacute;ngase en contacto con el equipo de asistencia de Synology.</td>
		</tr>
		<tr>
			<td>200, 201, 202 y 203</td>
			<td>Para comprobar el estado de su unidad, es recomendable someterla a la prueba extendida de S.M.A.R.T. Si este problema persiste, p&oacute;ngase en contacto con el distribuidor o el fabricante del disco.</td>
		</tr>
	</table>

<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>El tiempo necesario para realizar una prueba de estado de IronWolf puede variar en funci&oacute;n del uso del sistema.</li>
		<li>El rendimiento del sistema se puede reducir temporalmente al realizar la prueba de estado de IronWolf.</li>
		<li>Los c&oacute;digos de resultado de la prueba de estado de IronWolf se presentan junto con las medidas recomendadas. Es posible que se a&ntilde;adan nuevos c&oacute;digos de resultado en futuras actualizaciones de DSM.</li>
	</ul>
</div>


<h4>Para llevar a cabo una prueba de rendimiento:</h4>
<p>Tenga en cuenta que esta prueba solo est&aacute; disponible en determinados modelos de Synology&nbsp;NAS de las series <b>XS</b> y <b>XS+</b>. Siga los pasos que se indican a continuaci&oacute;n para realizar una prueba en una unidad:</p>
<ol>
	<li>Vaya a la pesta&ntilde;a <b>HDD/SSD</b>.</li>
	<li>Seleccione una unidad y haga clic en <b>Prueba de rendimiento</b>.</li>
	<li>En la ventana que aparece, haga clic en <b>Ejecutar prueba ahora</b> para realizar la prueba de rendimiento. Los resultados se mostrar&aacute;n aqu&iacute; cuando la prueba haya terminado.</li>
	<li>Para comparar el resultado con pruebas anteriores, haga clic en <b>Seleccionar</b> en el campo <b>Prueba comparada</b> para elegir el registro deseado.</li>
</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>Rendimiento secuencial, IOPS aleatorio y latencia se incluyen en la prueba de rendimiento, que tarda aproximadamente 18 minutos.</li>
		<li>Existen dos tipos de pruebas: <b>b&aacute;sica</b> y <b>extendida</b>.<ul>
				<li>Para las unidades utilizadas por RAID, solo se pueden llevar a cabo pruebas b&aacute;sicas y los datos de las unidades no se ver&aacute;n afectados. Sin embargo, no es posible probar rendimiento de escritura para discos duros utilizados para RAID.</li>
				<li>En los dem&aacute;s casos, las pruebas extendidas se realizar&aacute;n para mejorar la precisi&oacute;n. No obstante, las pruebas de rendimiento no garantizan la integridad de los datos. Por consiguiente, aseg&uacute;rese de que no hay datos importantes en las unidades antes de llevar a cabo pruebas de rendimiento.</li>
			</ul>
		</li>
		<li>A fin de garantizar la disponibilidad del sistema, no es posible llevar a cabo pruebas en m&aacute;s de tres unidades de una sola vez ni cuando hay una &uacute;nica unidad restante en los modelos xs/xs+. Adem&aacute;s, cuando la utilizaci&oacute;n de la unidad sobrepase el 5&nbsp;%, el sistema le solicitar&aacute; que vuelva a confirmar antes de continuar con la prueba de rendimiento para garantizar la precisi&oacute;n de la prueba.</li>
		<li>Los resultados de la prueba de rendimiento se pueden comparar con pruebas anteriores. Cuando la diferencia es mayor que 5 %, recibir&aacute; un aviso.</li>
		<li>La prueba de rendimiento de unidad se ejecuta con una prioridad baja en DSM para garantizar el m&iacute;nimo impacto sobre los dem&aacute;s servicios durante su ejecuci&oacute;n. Las cifras presentadas pueden variar en funci&oacute;n de la configuraci&oacute;n y la carga del sistema. Estas cifras solamente deben servir a modo de referencia para estimar la funcionalidad de la unidad y no se pueden comparar entre distintos modelos o versiones de DSM.</li>
	</ul>
</div>



<h3><a name="Tests"></a>Programaci&oacute;n y administraci&oacute;n de pruebas de las unidades</h3>
<p>La prueba de S.M.A.R.T. y la prueba de estado de IronWolf se pueden programar para que se ejecuten autom&aacute;ticamente en las unidades. Tenga en cuenta que estas pruebas solo son compatibles con determinados modelos. Puede consultar <a href="#Analytics">Pruebas y an&aacute;lisis de las unidades</a> para obtener informaci&oacute;n relevante y seguir los pasos que se indican a continuaci&oacute;n para programar y administrar las pruebas.</p>

<h4>Para programar pruebas de S.M.A.R.T.:</h4>
<p>Las pruebas de S.M.A.R.T. se pueden programar para que se ejecuten autom&aacute;ticamente en las unidades.</p>
	<ol>
		<li>Vaya a la pesta&ntilde;a <b>Programador de pruebas</b>.</li>
		<li>Haga clic en <b>Crear</b> para configurar una nueva tarea.</li>
		<li>Modifique las siguientes opciones en la pesta&ntilde;a <b>General</b>:<ul>
				<li><b>Nombre de la tarea:</b> introduzca un nombre para la tarea.</li>
				<li><b>La base de datos de S.M.A.R.T.:</b> elija entre realizar una prueba r&aacute;pida o una prueba ampliada.</li>
				<li><b>La base de datos de S.M.A.R.T.:</b> elija qu&eacute; HDD/SSD probar cada vez que se realice la prueba de S.M.A.R.T.</li>
			</ul>
		</li>
		<li>En la pesta&ntilde;a <b>Programa</b>, modifique las siguientes opciones:<ul>
				<li><b>Fecha:</b> indique la fecha en la que desea realizar la prueba de S.M.A.R.T., las cuales se pueden programar para que se ejecuten en determinados d&iacute;as de la semana (por ejemplo, diariamente, los fines de semana o todos los domingos) o en fechas concretas (p. ej., 2016/11/21).</li>
				<li><b>Hora:</b> especifique la frecuencia de la prueba de S.M.A.R.T. en las unidades, as&iacute; como la hora de su primera y &uacute;ltima ejecuci&oacute;n.</li>
			</ul>
		</li>
		<li>Haga clic en <b>Aceptar</b> para terminar.</li>
	</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>Si la prueba de S.M.A.R.T. no est&aacute; programada para ejecutarse en una unidad espec&iacute;fica, el bot&oacute;n <b>Programar prueba de S.M.A.R.T.</b> aparecer&aacute; en la secci&oacute;n <b>Informaci&oacute;n de estado</b> &gt; <b>Informaci&oacute;n general</b> de esa unidad.</li> 
		<li>Si no se ha programado la prueba de estado de IronWolf ni la prueba de S.M.A.R.T. para que se ejecuten en una unidad, el bot&oacute;n <b>Programar prueba de unidad</b> aparecer&aacute; en <b>Informaci&oacute;n de estado</b> &gt; <b>Informaci&oacute;n general</b> de dicha unidad.</li>
		<li>Las SSD NVMe tienen incorporado un mecanismo de supervisi&oacute;n y, por lo tanto, no son compatibles con la prueba de S.M.A.R.T. ni con la advertencia de sectores defectuosos.</li>
	</ul>
</div>

<h4>Para programar pruebas de estado de IronWolf:</h4>
<p>Es posible programar las pruebas de estado de IronWolf para que se ejecuten autom&aacute;ticamente en las unidades.</p>
	<ol>
		<li>Vaya a la pesta&ntilde;a <b>Programador de pruebas</b>.</li>
		<li>Haga clic en <b>Crear</b> para configurar una nueva tarea.</li>
		<li>En la pesta&ntilde;a <b>General</b>, modifique las siguientes opciones:<ul>
				<li><b>Nombre de la tarea:</b> introduzca un nombre para la tarea.</li>
				<li><b>Prueba de estado de IronWolf:</b> Seleccione la HDD/SSD a la que le gustar&iacute;a realizar la prueba o bien seleccione todas las unidades compatibles para que la prueba se ejecute en todas ellas.</li>
			</ul>
		</li>
		<li>Vaya a la pesta&ntilde;a <b>Programar</b> para modificar las siguientes opciones:<ul>
				<li><b>Fecha:</b> Indique la fecha en la que desea realizar la prueba de estado de IronWolf, las cuales se pueden programar para que se ejecuten en determinados d&iacute;as de la semana (por ejemplo, diariamente, los fines de semana o todos los domingos) o en fechas concretas (p. ej., 2016/11/21).</li>
				<li><b>Hora:</b> Especifique la frecuencia de la prueba de estado de IronWolf en las unidades, as&iacute; como la hora de su primera y &uacute;ltima ejecuci&oacute;n.</li>
			</ul>
		</li>
		<li>Haga clic en <b>Aceptar</b> para terminar.</li>
	</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>Si no se ha programado la prueba de estado de IronWolf para que se ejecute en una unidad espec&iacute;fica, el bot&oacute;n <b>Programar prueba de estado de IronWolf</b> aparecer&aacute; en <b>Informaci&oacute;n de estado</b> &gt; <b>Informaci&oacute;n general</b> de dicha unidad.</li>
		<li>Si no se ha programado la prueba de estado de IronWolf ni la prueba de S.M.A.R.T. para que se ejecuten en una unidad, el bot&oacute;n <b>Programar prueba de unidad</b> aparecer&aacute; en <b>Informaci&oacute;n de estado</b> &gt; <b>Informaci&oacute;n general</b> de dicha unidad.</li>
		<li>La prueba de estado de IronWolf solo est&aacute; disponible en discos duro Seagate de la serie IronWolf.</li>
	</ul>
</div>



<h3><a name="Settings"></a>Estado de advertencia y configuraci&oacute;n de las unidades</h3>
<p>Puede habilitar o deshabilitar la configuraci&oacute;n de advertencia de la unidad relevante cuando sea necesario. Siga los pasos que se indican a continuaci&oacute;n para conocer las instrucciones detalladas.</p>

<h4>Para modificar el estado de advertencia de la unidad:</h4>
<p>DSM supervisa constantemente el estado de sus unidades y le avisar&aacute; en cuanto se detecten problemas. Algunos problemas pueden ser m&aacute;s graves que otros. Para ciertos problemas que originan un estado de <b>Advertencia</b> (en <b>Informaci&oacute;n de estado</b> &gt; <b>Informaci&oacute;n general</b>), es posible modificar la advertencia del siguiente modo:</p>
	<ol>
		<li>Vaya a la pesta&ntilde;a <b>HDD/SSD</b>.</li>
		<li>Seleccione la unidad en estado de alerta y, a continuaci&oacute;n, haga clic en <b>Informaci&oacute;n de estado</b>.</li> 
		<li>Haga clic en <b>Modificaci&oacute;n de advertencia de la unidad</b>.</li>
		<li>Haga clic en la opci&oacute;n <b>Eliminar advertencia</b> o <b>Deshabilitar advertencia</b> (es posible que se encuentre con estas dos opciones, en funci&oacute;n del tipo de problema):<ul>
				<li><b>Eliminar advertencia:</b> se seguir&aacute; supervisando el campo degradado; sin embargo, las advertencias solo se activar&aacute;n si su valor contin&uacute;a degrad&aacute;ndose.</li> 
				<li><b>Deshabilitar advertencia:</b> la supervisi&oacute;n del campo de S.M.A.R.T. quedar&aacute; permanentemente deshabilitada.</li>
			</ul>
		</li>
	</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>La modificaci&oacute;n del estado de advertencia de unidad no resolver&aacute; los problemas de la unidad, ni evitar&aacute; que ocurran; por lo tanto, esta acci&oacute;n no debe contemplarse como una soluci&oacute;n a largo plazo.</li>
		<li>Tenga en cuenta que un aviso relativo a problemas de S.M.A.R.T. suele indicar la unidad ha sufrido alg&uacute;n problema. Ignorar la advertencia podr&iacute;a ocasionar una p&eacute;rdida de datos.</li>
		<li>Algunos campos de S.M.A.R.T. se han designado como cr&iacute;ticos, por lo que no se pueden eliminar o deshabilitar.</li>
	</ul>
</div>

<h4>Para habilitar la advertencia de sectores defectuosos:</h4>
<p>La habilitaci&oacute;n de la advertencia de sectores defectuosos puede alertarle cuando se detecten sectores defectuosos en la unidad, de modo que pueda tomar las medidas oportunas al instante. Esta opci&oacute;n est&aacute; habilitada por defecto, pero solo est&aacute; disponible en determinados modelos.</p>
	<ol>
		<li>Vaya a la pesta&ntilde;a <b>Configuraci&oacute;n</b>.</li>
		<li>Marque <b>Habilitar advertencia de sectores defectuosos</b>. De forma predeterminada, esta funci&oacute;n est&aacute; habilitada.</li>
		<li>Haga clic en <b>Aplicar</b>.</li>
	</ol>

<h4>Para habilitar la notificaci&oacute;n de vida &uacute;til de la SSD:</h4>
<p>La notificaci&oacute;n de vida &uacute;til de la SSD puede avisarle cuando la vida &uacute;til estimada de una SSD alcanza un valor especificado, lo que le permite realizar las acciones correspondientes al instante. Esta opci&oacute;n est&aacute; habilitada de forma predeterminada, pero solo es compatible con determinadas SSD.</p>
	<ol>
		<li>Vaya a <b>HDD/SSD</b> &gt; <b>Configuraci&oacute;n</b>.</li>
		<li>Vaya a la secci&oacute;n <b>Notificaci&oacute;n de vida &uacute;til estimada de la SSD</b> para activar la notificaci&oacute;n de vida &uacute;til.<ul>
				<li>Marque <b>Habilitar notificaci&oacute;n de vida &uacute;til de la SSD</b> y establezca un valor en el campo <b>Vida &uacute;til (%)</b>. El sistema enviar&aacute; una notificaci&oacute;n para avisarle cuando la vida &uacute;til estimada de la SSD alcance el valor especificado.</li>
				<li>Marque <b>Habilitar notificaci&oacute;n de vida &uacute;til estimada (basada en tiempo) de SSD de Synology</b> y establezca un valor en el campo <b>Vida &uacute;til (meses)</b>. El sistema enviar&aacute; una notificaci&oacute;n para avisarle cuando la vida &uacute;til estimada de la SSD alcance el valor especificado. Esta funci&oacute;n es exclusiva de las unidades SSD de Synology.</li>
			</ul>
		</li>
		<li>Haga clic en <b>Aplicar</b>.</li>
	</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>El valor del ciclo de vida de la SSD se genera directamente a partir de la informaci&oacute;n de S.M.A.R.T. Si la SSD no es compatible con el atributo de S.M.A.R.T. correspondiente, esta funci&oacute;n no estar&aacute; disponible.</li>
		<li>La vida &uacute;til de una SSD de Synology se calcula en funci&oacute;n de su carga de trabajo de E/S reciente. En el caso de las SSD reci&eacute;n montadas, el sistema puede tardar hasta 24 horas en generar un resultado.</li>
		<li>La vida &uacute;til de la SSD de Synology solo se muestra en la pesta&ntilde;a <b>HDD/SSD</b> y en <b>Informaci&oacute;n de salud</b> cuando la vida &uacute;til estimada (basada en tiempo) de la SSD desciende hasta el valor especificado.</li>
	</ul>
</div>



<h3><a name="Erase"></a>Secure Erase</h3>
<p>Puede ejecutar Secure Erase si desea borrar todos los datos de una unidad espec&iacute;fica. Sin embargo, tenga en cuenta que Secure Erase eliminar&aacute; permanentemente todos los datos almacenados en su disco. Aseg&uacute;rese de que la unidad seleccionada no est&aacute; en uso y de que se han realizado copias de seguridad de los datos antes de ejecutar Secure Erase.</p>

<h4>Para realizar Secure Erase:</h4>
	<ol>
		<li>Vaya a la pesta&ntilde;a <b>HDD/SSD</b>.</li>
		<li>Seleccione una unidad y haga clic en <b>Acci&oacute;n</b> &gt; <b>Secure Erase</b>.</li>
	</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>Secure Erase no se puede realizar en discos en unidades de expansi&oacute;n.</li>
		<li>Secure Erase eliminar&aacute; permanentemente todos los datos almacenados en su disco. Aseg&uacute;rese de que el disco elegido no est&aacute; en uso y de que se han realizado copias de seguridad de los datos antes de hacerlo.</li>
		<li>Cuando el sistema realiza Secure Erase, el disco seleccionado se bloquear&aacute; temporalmente y se desbloquear&aacute; autom&aacute;ticamente cuando la operaci&oacute;n se haya completado.</li>
		<li>Si Secure Erase se detiene de manera incorrecta durante la operaci&oacute;n, se puede volver a ejecutar directamente en la interfaz de usuario. Si los discos se eliminan o se utilizan en otras partes, todav&iacute;a estar&aacute;n bloqueados; introduzca la contrase&ntilde;a &apos;synology&apos; para desbloquear los discos.</li>
	</ul>
</div>



<h3><a name="Drive"></a>Desactivaci&oacute;n o activaci&oacute;n de las unidades</h3>
<p>Una unidad que est&aacute; asignada a un grupo de almacenamiento se puede desactivar cuando sea necesario, eliminando de esta forma la unidad del grupo de almacenamiento, el volumen y la partici&oacute;n del sistema que tenga asociados.</p>

<h4>Para desactivar una unidad:</h4>
	<ol>
		<li>Vaya a la pesta&ntilde;a <b>HDD/SSD</b>.</li>
		<li>Seleccione una unidad y haga clic en <b>Acci&oacute;n</b> &gt; <b>Desactivar</b>.</li>
	</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>Solo se pueden desactivar las unidades que se utilizan en grupos de almacenamiento. Una vez desactivadas, las unidades se eliminar&aacute;n de los grupos de almacenamiento.</li>
		<li>Despu&eacute;s de desactivar una unidad, el estado del indicador LED de la unidad pasar&aacute; a &quot;alerta&quot;.</li>
	</ul>
</div>

<h4>Para activar una unidad:</h4>
<p>El estado de asignaci&oacute;n de una unidad desactivada cambiar&aacute; a <b>No iniciado</b>, lo que significa que DSM no est&aacute; instalado en esta unidad y esta se puede asignar a un grupo de almacenamiento. Realice una de las siguientes operaciones para activar la unidad:</p>
	<ul>
		<li>Retire la unidad de la ranura y, a continuaci&oacute;n, ins&eacute;rtela de nuevo en la ranura.</li>
		<li>Reinicie el sistema.</li>
	</ul>



<h3><a name="Status"></a>Estado de los indicadores LED de las unidades</h3>
<p>Si desea eliminar una unidad de Synology NAS, puede cambiar temporalmente el indicador de unidad de color verde est&aacute;tico a naranja est&aacute;tico. Esto le permite identificar al instante en qu&eacute; ranura se encuentra una unidad, y as&iacute; evitar que pueda extraer la unidad equivocada.</p>

<h4>Para localizar la ranura de unidad en la que est&aacute; insertada una unidad:</h4>
	<ol>
		<li>Vaya a la pesta&ntilde;a <b>HDD/SSD</b>.</li>
		<li>Seleccione una unidad y haga clic en <b>Localizar unidad</b>.</li>
		<li>Haga clic en el men&uacute; desplegable y seleccione el tiempo que desea que el indicador de unidad permanezca en color naranja est&aacute;tico:</li>
		<li>Haga clic en <b>Localizar</b> para cambiar el indicador de unidad de la ubicaci&oacute;n de la unidad al color naranja est&aacute;tico. <br><span class="note_head">Observaci&oacute;n:</span> Puede hacer clic en <b>Restaurar</b> para restaurar el indicador de la unidad al color verde est&aacute;tico.</li>
	</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>El estado del indicador mencionado aqu&iacute; no se aplica a la ranura de la tarjeta adaptadora en los modelos de Synology NAS compatibles con la adici&oacute;n de tarjetas adaptadoras (por ejemplo, DS1816+). Esto se debe a que dicha ranura no se ha dise&ntilde;ado con un estado de indicador correspondiente.</li>
	</ul>
</div>



<h3><a name="Cache"></a>Cach&eacute; de escritura</h3>
<p>Al habilitar la compatibilidad con escritura en cach&eacute;, se optimiza el rendimiento del sistema de su Synology NAS. Solo ciertos modelos de HDD son compatibles con esta funci&oacute;n. Para garantizar la protecci&oacute;n de los datos al usar la compatibilidad con escritura en cach&eacute;, se recomienda el uso de un dispositivo UPS. Tambi&eacute;n le sugerimos que apague el sistema correctamente despu&eacute;s de cada uso. Al deshabilitar la escritura en cach&eacute;, se reducen las posibilidades de perder datos debido a cortes de corriente an&oacute;malos.</p>

<h4>Para habilitar la compatibilidad con escritura en cach&eacute;:</h4>
<p>Siga los pasos que se indican a continuaci&oacute;n para habilitar la cach&eacute; de escritura:</p>
	<ol>
		<li>Vaya a la pesta&ntilde;a <b>HDD/SSD</b>.</li>
		<li>Seleccione una unidad y haga clic en <b>Acci&oacute;n</b> &gt; <b>Configurar</b>.</li>
		<li>Marque <b>Habilitar cach&eacute; de escritura</b> y haga clic en <b>Aplicar</b>. De forma predeterminada, esta funci&oacute;n est&aacute; habilitada.</li>
	</ol>



<h3><a name="Database"></a>Base de datos de unidades</h3>
<p>La base de datos S.M.A.R.T. contiene informaci&oacute;n relativa a la temperatura de funcionamiento segura y a los nombres de campo de S.M.A.R.T. de una unidad. La base de datos se actualiza peri&oacute;dicamente y autom&aacute;ticamente al sustituir una unidad. Esta operaci&oacute;n solo debe ejecutarse cuando la actualizaci&oacute;n peri&oacute;dica o autom&aacute;tica de la base de datos falle.</p>

<h4>Para actualizar la base de datos de S.M.A.R.T.:</h4>
<p>Siga los pasos que se indican a continuaci&oacute;n para actualizar la base de datos de unidades:</p>
	<ol>
		<li>Vaya a la pesta&ntilde;a <b>Configuraci&oacute;n</b>.</li>
		<li>Despl&aacute;cese hacia abajo hasta la secci&oacute;n <b>Base de datos de S.M.A.R.T.</b></li>
		<li>Haga clic en <b>Actualizar ahora</b>.</li>
	</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
	<ul>
		<li>La base de datos de S.M.A.R.T. solo se puede actualizar una vez cada 24 horas.</li>
		<li>La base de datos de S.M.A.R.T. se actualizar&aacute; autom&aacute;ticamente al insertar una unidad nueva en su Synology NAS.</li>
		<li>Actualizaci&oacute;n de la base de datos de S.M.A.R.T. no afecta ni mejora el rendimiento y la compatibilidad de las unidades.</li>
		<li>Ejecute esta operaci&oacute;n solo cuando se desconozcan varios valores de la informaci&oacute;n de S.M.A.R.T. o cuando el equipo de soporte de Synology le recomiende hacerlo.</li>
	</ul>
</div>



</body>
</html>