 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<title>Expansi&oacute;n</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Data scrubbing is a data maintenance feature that inspects volumes or disk groups and repairs any detected data inconsistencies.">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Expansi&oacute;n</h2>
	<p>En la p&aacute;gina <b>Expansi&oacute;n</b>, encontrar&aacute; el gr&aacute;fico que representa el Synology NAS y las unidades de expansi&oacute;n conectadas, lo que le permite ver inmediatamente el estado de la conexi&oacute;n entre los dispositivos. Synology NAS puede conectar hasta dos unidades de expansi&oacute;n a trav&eacute;s de cables SAS.</p> 

<h4>Visualizaci&oacute;n del estado de la conexi&oacute;n</h4>
<p>Cuando Synology NAS est&eacute; conectado en una unidad de expansi&oacute;n a trav&eacute;s de cables SAS, vaya a <b>Expansi&oacute;n</b> &gt; <b>Descripci&oacute;n general de la expansi&oacute;n</b> para ver el estado de la conexi&oacute;n.</p>

<ul>
	<li>Etiqueta <b>Fuera</b>: esta etiqueta indica que un cable SAS est&aacute; conectado desde un dispositivo (por ejemplo, el controlador unificado) a otro dispositivo (por ejemplo, una unidad de expansi&oacute;n).</li>
	<li>Etiqueta <b>Dentro</b>: esta etiqueta indica que un cable SAS est&aacute; conectado a un dispositivo (por ejemplo, una unidad de expansi&oacute;n) desde otro dispositivo (por ejemplo, el controlador unificado).</li>
	<li><b>Sin expansiones</b>: este mensaje aparece si no se ha conectado ninguna unidad de expansi&oacute;n a su Synology NAS.</li>
	<li>Aparecer&aacute; un mensaje en el gr&aacute;fico si se producen problemas de conexi&oacute;n.</li>
</ul>


</body>
</html>
