<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Hot Spare</h2>
<p>Las unidades Hot Spare son unidades en espera capaces de reparar un grupo de almacenamiento degradado sustituyendo autom&aacute;ticamente un disco defectuoso. Las unidades Hot Spare se pueden asignar de forma global para proteger cualquier grupo de almacenamiento dentro de su Synology NAS, siempre que el grupo de almacenamiento cumpla los criterios siguientes:</p>
<ul>
	<li>El tipo de RAID del grupo de almacenamiento debe ser un tipo con protecci&oacute;n de datos (p. ej., RAID 1, RAID 5, RAID 6, RAID 10, RAID F1</span>).</li>
	<li>El tama&ntilde;o del disco Hot Spare debe ser superior o igual al tama&ntilde;o del disco m&aacute;s peque&ntilde;o del grupo de almacenamiento.</li>
</ul>

<h4>Para configurar unidades Hot Spare:</h4>
<ol>
<li>Haga clic en <strong>Administrar</strong>.</li>
<li>Aparece un cuadro de di&aacute;logo que muestra el estado Hot Spare de cada grupo de almacenamiento, as&iacute; como las unidades disponibles. El estado del grupo de almacenamiento incluye lo siguiente:</li>
<ul>
<li><strong>Asignado:</strong> el grupo de almacenamiento est&aacute; protegido por al menos una unidad Hot Spare asignada.</li>
<li><strong>Disponible:</strong> hay unidades disponibles que pueden proteger el grupo de almacenamiento, pero a&uacute;n no se ha asignado ninguna Hot Spare.</li>
<li><strong>No disponible:</strong> no hay unidades Hot Spare disponibles que puedan proteger el grupo de almacenamiento.</li>
</ul>
<li>La secci&oacute;n <strong>Unidades disponibles</strong> muestra las unidades que se pueden asignar como unidades Hot Spare. Para asignar una unidad Hot Spare, active la casilla que hay junto a la unidad que desea asignar como Hot Spare.</li>
<li>Haga clic en <strong>Aplicar</strong> para guardar la configuraci&oacute;n.</li>
</ol>
<div class="section">
<h4>Observaci&oacute;n:</h4> 
<ul>
<li>Cuando una unidad se asigna como unidad Hot Spare, todos los datos de la unidad se borran. Antes de asignar una unidad Hot Spare, aseg&uacute;rese de que la unidad no contiene datos importantes.</li>
<li>Un volumen RAID compuesto por HDD no ser&aacute; reparado autom&aacute;ticamente por las unidades Hot Spare SSD y viceversa.</li>
<li>Recomendamos elegir unidades compatibles para utilizar como Hot Spare con el fin de evitar problemas en Synology NAS.</li>
</ul>
</div>

<h4>Para configurar los ajustes de Hot Spare para el grupo de almacenamiento:</h4>
<ol>
<li>Haga clic en <strong>Configurar</strong>.</li>
<li>En la pesta&ntilde;a <strong>Grupo de almacenamiento</strong>, se indicar&aacute;n los grupos de almacenamiento que pueden protegerse con unidades Hot Spare. Si desmarca las casillas, los grupos de almacenamiento correspondientes no ser&aacute;n reparados autom&aacute;ticamente por las unidades Hot Spare cuando se degraden.</li>
<li>En la pesta&ntilde;a <strong>Hot Spare entre dispositivos</strong>, puede permitir que las unidades Hot Spare de un dispositivo reparen un RAID degradado ubicado en un dispositivo distinto.</li>
<li>Haga clic en <strong>Aceptar</strong> para guardar la configuraci&oacute;n.</li>
</ol>

</body>
</html>
