<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
	<h2>Informaci&oacute;n general</h2>
	<p>La informaci&oacute;n general muestra el estado general de los espacios de almacenamiento, incluido el estado general de todos los espacios, el estado del volumen, el estado del grupo de almacenamiento y la informaci&oacute;n de la unidad.</p>

		<h4>Estado del almacenamiento</h4>
        <p>Hay tres tipos de estados:</p>
	  	<ul>
				<li><b>En buen estado</b>: todos los espacios de almacenamiento (volumen o grupo de almacenamiento) son normales.</li>
				<li><B>Atenci&oacute;n</B>: un espacio de almacenamiento (volumen o grupo de almacenamiento) se ha degradado, la SSD de cach&eacute; se ha averiado o una partici&oacute;n del sistema ha fallado.</li>
				<li><b>Peligro</b>: se ha averiado un espacio de almacenamiento (volumen o grupo de almacenamiento).</li>
			</ul>
			<p>Si se producen varios problemas al mismo tiempo, el estado se mostrar&aacute; en el orden siguiente: 1) Espacios de almacenamiento (volumen o grupo de almacenamiento); 2) cach&eacute; de SSD; y 3) partici&oacute;n del sistema. Si se produce un problema, siga las instrucciones que se indican debajo del estado.</p>
		
		<h4>Selector de grupos de almacenamiento</h4>
	<p>El selector de grupos de almacenamiento enumera todos los grupos de almacenamiento. Seleccione un grupo de almacenamiento para ver sus detalles.</p>
		
		<h4>Estado del volumen</h4>
	<p>Esta secci&oacute;n muestra la capacidad utilizada de los vol&uacute;menes del grupo de almacenamiento seleccionado. Si el uso total alcanza el valor cr&iacute;tico de volumen, el gr&aacute;fico circular se volver&aacute; rojo; con el valor de advertencia, se volver&aacute; naranja y, de lo contrario, permanecer&aacute; en azul. Los valores cr&iacute;tico y de advertencia se pueden modificar en <strong>Panel de control</strong> &gt; <strong>Notificaci&oacute;n</strong> &gt; <strong>Avanzada</strong> &gt; <strong>Almacenamiento interno</strong> &gt; <strong>Volumen lleno</strong>.</p>
		
	<h4>Grupo de almacenamiento/volumen</h4>
	<p>Cuando no se selecciona un grupo de almacenamiento espec&iacute;fico, se muestran los detalles de todos los grupos de almacenamiento. Cuando se selecciona un grupo de almacenamiento espec&iacute;fico, se muestran los detalles y el volumen del grupo de almacenamiento espec&iacute;fico.</p>
		
		<h4>Informaci&oacute;n de la unidad</h4>
        <p>En esta secci&oacute;n se muestra la informaci&oacute;n de la unidad y del hardware. Puede consultar cu&aacute;ntas unidades est&aacute;n utilizando los espacios de almacenamiento, el n&uacute;mero de unidades de recambio y el n&uacute;mero de ranuras de disco duro disponibles.</p>
        
</body>
</html>
