<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Volumen</h2>
<p>Los vol&uacute;menes son espacios de almacenamiento b&aacute;sico en los que el usuario puede crear carpetas compartidas o iSCSI LUN (archivo normal), guardar datos o instalar paquetes. Antes de crear cualquier volumen, aseg&uacute;rese de que ya ha creado un RAID Group. Para obtener m&aacute;s informaci&oacute;n sobre RAID Group, consulte <a href="raid.html">RAID Group</a>.</p>

<h4>Para crear un volumen:</h4>
<ol>
	<li>Aseg&uacute;rese de que Synology NAS tiene un RAID Group existente con espacio asignable.</li>
	<li>Haga clic en el bot&oacute;n <strong>Crear</strong>.</li>
	<li>Elija un RAID Group en el que crear el volumen.</li>
	<li>Modifique la configuraci&oacute;n que desee.</li>
	<li>Ajuste la asignaci&oacute;n de tama&ntilde;o del volumen (El ajuste de la asignaci&oacute;n de tama&ntilde;o no est&aacute; disponible para vol&uacute;menes creados en un RAID Group para vol&uacute;menes &uacute;nicos o iSCSI LUN).</li>
    <li>Haga clic en el bot&oacute;n <strong>Aplicar</strong> para confirmar la configuraci&oacute;n.</li>


</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>El tama&ntilde;o m&aacute;ximo de volumen que se puede asignar es 200 TB.</li>
	<li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">El tama&ntilde;o m&iacute;nimo asignado a un volumen Btrfs debe ser al menos de 10 GB.</li>
    <li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Los vol&uacute;menes Btrfs reservar&aacute;n un 4&nbsp;% de espacio para los metadatos.</li>
</ul>
</div>

<h4>Para quitar un volumen:</h4>
<ol>
	<li>Seleccione el volumen que desea quitar.</li>
	<li>Haga clic en el bot&oacute;n <strong>Quitar</strong> y siga el asistente para completar el proceso.</li>
</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>Al eliminar un volumen, se borrar&aacute;n todos los datos existentes del volumen.</li>
</ul>
</div>

<h4>Para realizar el montaje forzoso de un volumen:</h4>
<p>Si falta la cach&eacute; de un volumen, el sistema no montar&aacute; el volumen al arrancar. Si no se puede recuperar la cach&eacute; y desea acceder al volumen, puede hacer clic en <strong>Montaje forzoso</strong>.</p>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>Esta funci&oacute;n solo est&aacute; disponible en determinados modelos.</li>
</ul>
</div>

<h4>Para reparar un volumen:</h4>
<p>Si el estado del volumen es <strong>Degradado</strong>, vaya a la pesta&ntilde;a <strong>RAID Group</strong> y busque el RAID Group adecuado. A continuaci&oacute;n, siga las instrucciones sugeridas para repararlo.</p>

<h4>Para ampliar el tama&ntilde;o de un volumen</h4>
<ul>
	<li>Para vol&uacute;menes creados en un RAID Group para m&uacute;ltiples vol&uacute;menes o iSCSI LUN (nivel de bloques).<ol>
			<li>Seleccione el volumen que desea ampliar.</li>
			<li>Haga clic en <strong>Editar</strong>.</li>
			<li>Introduzca el nuevo tama&ntilde;o y haga clic en <strong>OK</strong> para ampliarlo.</li>
		</ol>
	</li>
	<li>Para vol&uacute;menes creados en un RAID Group para un &uacute;nico volumen/iSCSI LUN (nivel de bloques), consulte la secci&oacute;n <strong>Para ampliar el tama&ntilde;o de un RAID Group</strong> de <a href="raid.html">RAID Group</a>, el tama&ntilde;o del volumen se ampliar&aacute; una vez que se haya ampliado el RAID Group subyacente.</li>
</ul>

<div class="section">
<h4>Observaci&oacute;n:</h4>
<p>Si los vol&uacute;menes se utilizan como destinos replicados de <strong>Snapshot Replication</strong>, el rendimiento de r&eacute;plica se puede mejorar ajustando la configuraci&oacute;n de <strong>Frecuencia de registro de la hora de acceso al archivo</strong>, en la ventana <strong>Editar</strong>, una vez creados los vol&uacute;menes:</p>
<ul>
	<li><strong>Diario</strong>: La hora de acceso a los archivos se actualiza diariamente o al modificar el archivo, al igual que en la mayor&iacute;a de los sistemas operativos. Algunas de las funciones de las aplicaciones dependen de la precisi&oacute;n de la hora de acceso al archivo. Si selecciona <strong>Diario</strong>, tendr&aacute; un impacto en el rendimiento de r&eacute;plica, pero es recomendable si se utiliza cualquiera de las siguientes funciones o aplicaciones con frecuencia:<ul>
			<li><strong>Hora de acceso menos reciente</strong> en el <strong>Analizador de almacenamiento</strong></li>
			<li><strong>Consejero de cach&eacute; de SSD</strong> en el <strong>Administrador de almacenamiento</strong></li>
			<li>Las aplicaciones de terceros que dependen del <strong>registro de la hora de acceso al archivo</strong>.</li>
		</ul>
	<li><strong>Mensual</strong>: La hora de acceso a los archivos se actualiza mensualmente o al modificar el archivo. Esta opci&oacute;n se traduce en una peque&ntilde;a mejora en el rendimiento de la r&eacute;plica, mientras que las aplicaciones que dependen del <strong>registro de la hora de acceso al archivo</strong> seguir&aacute;n funcionando, aunque con menor precisi&oacute;n.</li>
	<li><strong>Nunca</strong>: Recomendado si busca mejorar el rendimiento de la r&eacute;plica y no necesita aplicaciones que dependan del <strong>registro de la hora de acceso al archivo</strong> diariamente.</li>
</ul>
</div>

<h3>SSD TRIM</h3>
<p>Si un volumen est&aacute; formado completamente por SSD (Unidades de estado s&oacute;lido), recomendamos habilitar el SSD TRIM. Esta caracter&iacute;stica mejora el rendimiento de lectura y escritura de vol&uacute;menes creados en SSD, aumentando la eficiencia adem&aacute;s de ampliar la vida &uacute;til de las SSD.</p>

<h4>Para habilitar SSD TRIM:</h4>
<ol>
	<li>Abra <strong>Administrador de almacenamiento</strong> y vaya a <strong>Volumen</strong>.</li>
	<li>Seleccione un volumen que est&eacute; formado completamente por SSD y a continuaci&oacute;n haga clic en el bot&oacute;n <strong>Configurar</strong>.</li>
	<li>En la ventana que aparecer&aacute;, vaya a la pesta&ntilde;a <strong>SSD TRIM</strong> y marque la casilla <strong>Habilitar TRIM</strong>.</li>
	<li>Haga clic en el bot&oacute;n <strong>Establecer el programa</strong> para elegir cuando el sistema realizar&aacute; el SSD TRIM.</li>
	<li>Haga clic en <strong>OK</strong>.</li>
</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>SSD TRIM solo est&aacute; disponible en algunos modelos de Synology NAS y tipos de RAID.</li>
	<li>Algunos modelos de SSD no son capaces de realizar SSD TRIM en vol&uacute;menes RAID 5<span class="enable-grantley">,</span> <span class="disable-grantley"></span>RAID 6<span class="enable-grantley"> y RAID F1</span>. Consulte la lista de compatibilidad en el <a href="https://www.synology.com/" target="_blank">sitio web oficial</a> de Synology.</li>
	<li>SSD TRIM no se puede habilitar en las siguientes situaciones:<ul>
			<li>El volumen se ha montado con cach&eacute; de SSD.</li>
			<li>El paquete <strong>Time Backup</strong> est&aacute; instalado.</li>
		</ul>
	</li>
	<li>SSD TRIM no se puede habilitar con iSCSI LUN a nivel de bloques.</li>
	<li>El rendimiento del sistema se ver&aacute; afectado cuando se est&eacute; realizando SSD TRIM. El tiempo necesario para realizar TRIM depende del tama&ntilde;o del volumen y del modelo de SSD.</li>
	<li>Cuando TRIM est&aacute; habilitado en un volumen, tambi&eacute;n lo estar&aacute; en otros vol&uacute;menes creados en el mismo Grupo de unidades o RAID Group.</li>
</ul>
</div>


<h3>Depuraci&oacute;n del sistema de archivos*</h3>
<p>La depuraci&oacute;n del sistema de archivos consiste en una funci&oacute;n de mantenimiento de datos que inspecciona vol&uacute;menes. Si se detectan datos que no son coherentes con la suma de comprobaci&oacute;n, la ruta de archivo se registrar&aacute; en el Centro de registros y se recomienda utilizar una copia de seguridad para reparar los datos.</p>

<p>Recomendamos realizar regularmente la depuraci&oacute;n del sistema de archivos para garantizar la coherencia de los datos.</p>

<h4>Para realizar la depuraci&oacute;n del sistema de archivos:</h4>
<ol>
	<li>Abra <strong>Administrador de almacenamiento</strong> y vaya a <strong>Volumen</strong>.</li>
	<li>Seleccione el volumen en el que se va a realizar la depuraci&oacute;n del sistema de archivos.</li>
	<li>Haga clic en <strong>Administrar</strong>.</li>
	<li>Seleccione <strong>Depuraci&oacute;n del sistema de archivos</strong>.</li>
</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>La depuraci&oacute;n del sistema de archivos solo se puede llevar a cabo en vol&uacute;menes del sistema de archivos <strong>Btrfs</strong>.</li>
	<li>La depuraci&oacute;n del sistema de archivos solo se puede realizar cuando el estado del volumen es <strong>Normal</strong>.</li>
	<li>No apague el sistema hasta que finalice la depuraci&oacute;n del sistema de archivos. Si el sistema se apaga antes de que el proceso termine, tendr&aacute; que reiniciar manualmente la depuraci&oacute;n del sistema de archivos desde el principio.</li>
</ul>
</div>

<h3>Desfragmentaci&oacute;n del sistema de archivos*</h3>
<p>Si los datos sufren modificaciones constantemente, aumentar&aacute; la cantidad de archivos fragmentados en el sistema de archivos, lo que dar&aacute; lugar a una disminuci&oacute;n del rendimiento de acceso a los archivos almacenados en las unidades. Llevar a cabo una desfragmentaci&oacute;n del sistema de archivos puede mejorar el rendimiento.</p>

<h4>Para realizar una desfragmentaci&oacute;n del sistema de archivos:</h4>
<ol>
	<li>Abra <strong>Administrador de almacenamiento</strong> y vaya a <strong>Volumen</strong>.</li>
	<li>Seleccione el volumen en el que se va a realizar la desfragmentaci&oacute;n del sistema de archivos.</li>
	<li>Haga clic en <strong>Administrar</strong>.</li>
	<li>Seleccione <strong>Desfragmentaci&oacute;n del sistema de archivos</strong>.</li>
</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>La desfragmentaci&oacute;n del sistema de archivos solo se puede llevar a cabo en vol&uacute;menes del sistema de archivos <strong>Btrfs</strong>.</li>
	<li>La desfragmentaci&oacute;n del sistema de archivos solo se puede realizar cuando el estado del volumen es <strong>Normal</strong>.</li>
	<li>No apague el sistema hasta que finalice la desfragmentaci&oacute;n del sistema de archivos. Si el sistema se apaga antes de que el proceso termine, tendr&aacute; que reiniciar manualmente la desfragmentaci&oacute;n del sistema de archivos desde el principio.</li>
	<li>El uso del volumen puede aumentar si el volumen contiene instant&aacute;neas de carpetas compartidas.</li>
</ul>
</div>

<p>____<br />*Solo disponible en ciertos modelos.</p>

</body>
</html>