<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Grupo de almacenamiento</h2>

<p>Se pueden agregar una o m&aacute;s unidades a una &uacute;nica unidad de almacenamiento denominada grupo de almacenamiento, que puede estar protegido por RAID. Cada tipo de RAID ofrece un nivel de protecci&oacute;n de datos diferente. Para obtener una lista general de los tipos de RAID compatibles con Synology NAS, consulte la secci&oacute;n <a href="general.html">General</a>. Despu&eacute;s de crear un grupo de almacenamiento, puede crear uno o varios vol&uacute;menes dentro del mismo. Un volumen es una unidad de almacenamiento de datos y se puede ampliar si el grupo de almacenamiento asociado contiene espacio asignable. Se debe crear al menos un volumen para poder empezar a almacenar datos en su Synology NAS.</p>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>Recomendamos el uso de unidades incluidas en la <a href="https://www.synology.com/compatibility?search_by=category&category=hdds&p=1" target=blank>Lista de compatibilidad con productos de Synology</a> para evitar problemas. El uso de unidades incompatibles puede reducir el rendimiento del sistema e incluso provocar la p&eacute;rdida de datos.</li>
	<li>Un grupo de almacenamiento se debe componer de unidades del mismo tipo. Es decir, no se puede crear un grupo de almacenamiento con una combinaci&oacute;n de unidades SATA y SAS.</li>
	<li>Para los modelos de Synology NAS compatibles con RAID Group, un grupo de almacenamiento <b>RAID 5</b>, <b>RAID 6</b> o <b>RAID F1</b> compatible con m&uacute;ltiples vol&uacute;menes puede contener varias <b>matrices RAID</b>. Cada una de las matrices RAID que pertenezca al mismo grupo de almacenamiento ser&aacute; del mismo tipo (p. ej., RAID 5, RAID 6 o RAID F1). El n&uacute;mero m&aacute;ximo de unidades para cada matriz RAID es 6, 12 o 24. Puede fijar el n&uacute;mero m&aacute;ximo de unidades mientras crea el grupo de almacenamiento y el n&uacute;mero no podr&aacute; modificarse posteriormente. Cuando se asigna un n&uacute;mero m&aacute;ximo de unidades a una matriz RAID, la siguiente unidad que se a&ntilde;ada al grupo de almacenamiento puede asignarse a una nueva matriz RAID. La nueva matriz RAID debe contener el n&uacute;mero m&iacute;nimo de unidades necesarias para ese tipo de RAID concreto (p. ej., tres unidades para RAID 5 y RAID F1, y cuatro unidades para RAID 6).</li>
	<li>Si desea utilizar una unidad determinada para crear un grupo de almacenamiento, pero la unidad no aparece en el <strong>Asistente para la creaci&oacute;n de un grupo de almacenamiento</strong>, vaya a la p&aacute;gina <strong>HDD/SSD</strong> para comprobar el estado de la unidad.</li>
</ul>
</div>

</body>
</html>


	