 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Crear un nuevo grupo de almacenamiento: Ayuda de Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article walks you through the steps to create a Storage Pool on Synology NAS using Storage Manager.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Crear un nuevo grupo de almacenamiento</h2>
<div class="section"><h4>Importante:</h4>
<ul>
	<li>Antes de comenzar, aseg&uacute;rese de que no hay datos importantes en las unidades en las que se va a crear el grupo de almacenamiento. Todos los datos existentes se eliminar&aacute;n durante el proceso de creaci&oacute;n.</li>
	<li>Vaya a la p&aacute;gina <strong>HDD/SSD</strong> y aseg&uacute;rese de que el estado de cada unidad es <strong>Iniciado</strong> o <strong>No iniciado</strong>.</li>
	<li>Recomendamos el uso de unidades incluidas en la <a href="https://www.synology.com/compatibility" target=blank>lista de compatibilidad de productos de Synology</a> para evitar problemas. El uso de unidades incompatibles puede reducir el rendimiento del sistema o incluso provocar la p&eacute;rdida de datos en su Synology NAS.</li>
</ul>
</div>

<h4>Para crear un grupo de almacenamiento:</h4>
<ol>
	<li>Abra <strong>Administrador de almacenamiento</strong>.</li>
	<li>Vaya a <strong>Grupo de almacenamiento</strong> y haga clic en el bot&oacute;n <strong>Crear</strong>.</li>
	<li>Seleccione el tipo de grupo de almacenamiento:<ul>
			<li><strong>Mejor rendimiento</strong>: este tipo de grupo de almacenamiento solo admite un volumen, pero ofrece un mejor rendimiento.</li>
			<li><strong>Mayor flexibilidad</strong>: este tipo de grupo de almacenamiento admite varios vol&uacute;menes, Synology Hybrid RAID (SHR) y la funci&oacute;n RAID Group.</li>
		</ul>
	</li>
	<li>Configure las propiedades del grupo de almacenamiento:<ul>
			<li>Descripci&oacute;n del grupo de almacenamiento: descripci&oacute;n de este grupo de almacenamiento.</li>
			<li>Tipo de RAID: cada tipo de RAID ofrece un nivel de protecci&oacute;n de datos diferente. Para obtener m&aacute;s informaci&oacute;n, consulte <a href="general.html">General</a>.</li>
			<li>N&uacute;mero m&iacute;nimo de unidades por RAID: el n&uacute;mero m&iacute;nimo de unidades necesario para el tipo de RAID seleccionado.</li>
			<li>N&uacute;mero m&aacute;ximo de unidades por RAID: un mayor n&uacute;mero de unidades por RAID aumenta la probabilidad de error del RAID. Le recomendamos que ajuste el l&iacute;mite de unidades en un &uacute;nico RAID y utilice RAID Group para establecer un equilibrio entre la seguridad de los datos y la capacidad del grupo de almacenamiento.</li>
			<li>Funci&oacute;n de RAID Group: si la funci&oacute;n RAID Group es compatible con el tipo de RAID seleccionado. Mientras que un solo RAID tiene un l&iacute;mite de unidades, la funci&oacute;n de RAID Group permite que su bloque de almacenamiento se componga de varios RAID, aumentando su capacidad y redundancia de la unidad. RAID Group es compatible con RAID 5, RAID 6 y RAID F1.</li>
		</ul>
	</li>
	<li>Siga los pasos restantes del asistente para finalizar la creaci&oacute;n del grupo de almacenamiento.</li>
</ol>

<div class="section"><h4>Observaci&oacute;n:</h4>
<ul>
	<li>SHR (Synology Hybrid RAID) est&aacute; disponible solo en modelos espec&iacute;ficos. Para obtener m&aacute;s informaci&oacute;n, visite el <a href="https://www.synology.com/" target="_blank">sitio web de Synology</a>.</li>
	<li>Las funciones N&uacute;mero m&aacute;ximo de unidades por RAID y RAID Group solo est&aacute;n disponibles en modelos espec&iacute;ficos. Para obtener m&aacute;s informaci&oacute;n, visite el <a href="https://www.synology.com/" target="_blank">sitio web de Synology</a>.</li>
	<li>El n&uacute;mero m&aacute;ximo de unidades por RAID que se pueden cambiar solo si el tipo de RAID seleccionado es compatible con la funci&oacute;n RAID Group.</li>
	<li>Si el tipo de RAID del grupo de almacenamiento es RAID 5, RAID 6, RAID F1, SHR (m&aacute;s de tres unidades) o SHR-2, el sistema ejecutar&aacute; la resincronizaci&oacute;n RAID en el grupo de almacenamiento para mejorar la velocidad de acceso y la resistencia de los datos.</li>
</ul>
</div>

</body>
</html>