
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Ressourceoverv&aring;gning</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Ydelsesalarm*</h2>
<h4>S&aring;dan opretter du en ydelsesalarmregel:</h4>
<ol>
<li>G&aring; til <strong>Indstillinger</strong> &gt; <strong>Indstillinger</strong>, og s&oslash;rg for, at du har markeret <strong>Aktiver ydelsesalarm</strong>.</li>
<li>G&aring; til <strong>Indstillinger</strong> &gt; <strong>Regler for ydelsesalarm</strong>.</li>
<li>Klik p&aring; knappen <b>Opret</b>.</li>
<li>F&oslash;lgende regelindstillinger er tilg&aelig;ngelige:</li>
<ul>
<li><strong>Ressource</strong>: V&aelig;lg den ressource, du vil anvende reglen p&aring;.</li>
<li><strong>Type</strong>: V&aelig;lg den type regel, du vil oprette.</li>
<li><strong>Niveau</strong>: V&aelig;lg alarmniveauet.</li>
<li><strong>St&oslash;rre end</strong>: Angiv den maksimale procent for din regeltype, hvor systemet vil underrette dig, hvis det er oversteget.</li>
</ul>
<li>Marker <strong>Aktiveret</strong>, hvis du vil aktivere denne regel med det samme.</li>
<li>Klik p&aring; <strong>OK</strong> for at tilf&oslash;je reglen.</li>
</ol>


<div class="section">
<h4>Mekanisme for ydelsesalarmer:</h4>
<p>Ydelsesalarmer vil fungere via f&oslash;lgende mekanisme for at minimere falske alarmer og forhindre overdrevent forbrug af systemressourcer inden for et kort tidsrum.</p>
<ol>
	<li>Ydelsesalarmtjenesten vil kontrollere alle regler hver fem minutter. Der udl&oslash;ses ingen handling, hvis alle de overv&aring;gede v&aelig;rdier ligger under de t&aelig;rskler, du har angivet.</li>
	<li>N&aring;r en overv&aring;get v&aelig;rdi overstiger t&aelig;rsklen, bliver en alarm ikke udl&oslash;st med det samme. Systemet vil i stedet kontrollere reglen fem gang mere med 30 sekunders mellemrum.</li>
	<li>Efter &aelig;ndringen i intervall&aelig;ngde vil en alarm s&aring; udl&oslash;ses, hvis den overv&aring;gede v&aelig;rdi overstiger t&aelig;rsklen fem konsekutive gange. Hvis den overv&aring;gede v&aelig;rdi dog ligger under t&aelig;rsklen i en af disse fem kontroller, bliver intervall&aelig;ngden &aelig;ndret tilbage til fem minutter.</li>
</ol>
<p>Derfor vil en alarm seneste blive udl&oslash;st 450 sekunder efter den f&oslash;rste registrering af begivenheden for &eacute;n begivenhede.</p>

<h4>Alarmniveauer:</h4>
<p>Ydelsesalarmer udl&oslash;ser forskellige handlinger, afh&aelig;ngigt af alarmniveauerne.</p>
<ul>
	<li><strong>Advarsel:</strong> Der genereres en advarselsmeddelelse i systemloggen, men der udl&oslash;ses ikke nogen systemunderretning.</li>
	<li><strong>Kritiske</strong>: Der genereres ikke kun en meddelelse i systemloggen, men der udl&oslash;ses ogs&aring; systemunderretninger.</li>
</ul>
<p>Logfiler over ydelsesalarmer kan ses p&aring; fanen <strong>Ydelsesalarm</strong> eller i DSMs <strong>Logcenter</strong>.</p>
</div>


<h4>S&aring;dan f&aring;r du vist ydelsesalarmer:</h4>
<ul>
<li>G&aring; til <strong>Ydelsesalarm</strong> for at se alle udl&oslash;ste ydelsesalarmer.</li>
<li>Klik p&aring; <strong>Opdater</strong> for at f&aring; de mest opdaterede alarmer.</li>
</ul>

<h4>S&aring;dan eksporterer du ydelsesalarmer:</h4>
<ol>
<li>G&aring; til <strong>Ydelsesalarm</strong>.</li>
<li>Klik p&aring; pilen ved siden af knappen <strong>Eksporter</strong>.</li>
<li>Du kan v&aelig;lge at eksportere alarmer som <strong>HTML</strong> eller <strong>CSV</strong>.</li>
</ol>
<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
<li>Underst&oslash;ttelse af <strong>Ydelsesalarmer</strong> varierer mellem Synology NAS-modellerne. Yderligere oplysninger findes under <a href="http://www.synology.com/" target="_blank">www.synology.com</a>.</li>
</ul>
</div>

<p>____<br />*Findes kun p&aring; bestemte modeller</p>

</body>
</html>
