
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Ressourceoverv&aring;gning</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1><a name="leaf_update"></a>Ressourceoverv&aring;gning</h1>
<p class="disable-dockerx64">Ressourceoverv&aring;gning s&aelig;tter dig i stand til at overv&aring;ge CPU-brug, hukommelsesbrug, diskudnyttelse og netv&aelig;rks-flow. Du kan v&aelig;lge at overv&aring;ge i realtid eller se de foreg&aring;ende data.</p>
<p class="enable-dockerx64">Ressourceoverv&aring;gning s&aelig;tter dig i stand til at overv&aring;ge CPU-brug, hukommelsesbrug og netv&aelig;rks-flow. Du kan v&aelig;lge at overv&aring;ge i realtid eller se de foreg&aring;ende data.</p>
<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Foreg&aring;ende data vises kun, hvis <strong>Aktiver brugshistorik</strong> er markeret p&aring; fanen <strong>Indstillinger</strong>.</li>
<li class="enable-dockerx64">Ved Docker DSM angiver <strong>CPU og hukommelse</strong> forbrugsoplysninger om <strong>Docker Host</strong>.</li>
</ul>
</div>
<h2>Ydeevne</h2>
<p>Klik p&aring; fanen <strong>Ydeevne</strong> for at se ressourceudnyttelsesdata. Detaljeret dato, tidspunkt og oplysninger om diagram bliver vist, n&aring;r musen flyttes over.</p>

<h3>CPU</h3>
<p>Du kan se den generelle CPU-udnyttelse for <strong>Bruger</strong>, <strong>System</strong> og <strong>I/O vent</strong>. CPU-belastning kan v&aelig;re h&oslash;j, n&aring;r Ressourceoverv&aring;gning lige er startet, fordi systemet skal indsamle ressourcedata og indl&aelig;se UI-siden p&aring; samme tid.</p>
<p><strong>Bruger</strong> viser den procent af CPU, der anvendes til at k&oslash;re brugerprogrammer. <strong>System</strong> viser procenten af CPU, der anvendes i kernen af systemet, hardware/software IRQ'er. <strong>I/O vent</strong> viser procenten af CPU bruge p&aring; I/O vent.</p>
<p><strong>Udnyttelse</strong> er summen af <strong>Bruger</strong> og <strong>System</strong> CPU-brug.</p>
<p>Belastningsgennemsnittet inden for 1, 5 og 15 minutter vises. Det viser k&oslash;k&oslash;rselsl&aelig;ngden (dvs. summen af antallet af processer, der aktuelt k&oslash;rer plus antal, der skal k&oslash;re). </p>
<div class="section">
<h4>Forklaring af ord</h4>
<ul>
<li><b>I/O vent</b>: I/O vent angiver, at CPU'en er inaktiv og bruges ikke af noget program. </li>
<p>I/O vent er normal adf&aelig;rd. Da hastigheden p&aring; CPU'en er meget hurtigere end I/O, er det almindeligt, at CPU'en venter p&aring; overf&oslash;rsel af diske, eller netv&aelig;rket fuldf&oslash;res. Hvis procenten for I/O vent dog er meget stor, betyder det, at CPU'en det meste af tiden venter p&aring; I/O vent og bliver ikke brugt. Du kan bruge mere effektive diskgruppekonfigurationer (dvs. SHR eller RAID 5) p&aring; netv&aelig;rkskonfigurationer (dvs. Binding) for at opn&aring; bedre ydeevne.</p> 
</ul>
</div>
<h3>Hukommelse</h3>
<p>Den samlede hukommelsesudnyttelse af fysisk hukommelse og swap-plads vises. Hukommelsesbrug forbliver h&oslash;j, fordi systemet lagrer data, der ofte gives adgang til i cache, s&aring; data hurtigt kan hentes uden at g&aring; ind p&aring; harddisken. Cache-hukommelse frig&oslash;res, n&aring;r den samlede hukommelse ikke er nok.</p>
<p>H&oslash;j swap-pladsudnyttelse angiver utilstr&aelig;kkelig systemhukommelse og vil ogs&aring; p&aring;virke systemet ydeevne. Du kan se swap-ind- og swap-ud-hastigheden ved at v&aelig;lge <strong>Swap</strong> i rullemenuen &oslash;verst. </p>

<h3>Netv&aelig;rk</h3>
<p>Diagrammet over netv&aelig;rksflow'et viser sendte og modtagne data i KB pr. sek. Hvis PPPoE er tilsluttet, vil overf&oslash;rselshastigheden ogs&aring; blive vist p&aring; diagrammet.</p>

<h3 class="disable-dockerx64">Disk</h3>
<p class="disable-dockerx64">Du kan v&aelig;lge at se den generelle diskudnyttelse, overf&oslash;rselshastighed eller IOPS ved at klikke p&aring; rullemenuen &oslash;verst p&aring; diagrammet. Du kan klikke p&aring; <strong>Vis alt</strong> nederst for at v&aelig;lge flere diske ved at markere afkrydsningsfelterne for at tilf&oslash;je deres data til diagrammet.</p>


<h3 class="disable-eds14 disable-dockerx64">Diskenhed</h3>
<p class="disable-eds14 disable-dockerx64">Denne side viser generel overf&oslash;rselsstatus for diskenheder. Klik p&aring; rullemenuen over diagrammet for at se overf&oslash;rselsudnyttelse, overf&oslash;rselshastighed eller IOPS. Klik p&aring; knappen <strong>Vis alt</strong> for at v&aelig;lge individuelle diskenheder, og tilf&oslash;j dem til diagrammet.</p>

<h3 class="disable-eds14 disable-dockerx64">iSCSI</h3>
<p class="disable-eds14 dixable-dockerx64">Denne side viser den generel status for aktuelt k&oslash;rende iSCSI LUN'er. Klik p&aring; rullemenuen over diagrammet for at v&aelig;lge en LUN og se dens status. Der vises som standard tre diagrammer, som er <strong>Gennemstr&oslash;mning</strong>, <strong>IOPS</strong> og <strong>Latens</strong>. F&aring; mere detaljerede oplysninger ved at klikke p&aring; knappen <strong>V&aelig;lg diagrammer</strong> for at v&aelig;lge andre diagrammer, som du vil se.</p>


<h2>Proces</h2>
<p>Klik p&aring; fanen <strong>Proces</strong> for at se CPU- og hukommelsesudnyttelse for hver proces for at s&aelig;nke CPU-belastningen.</p>
<p>Proces<strong>status</strong> indeholder <strong>K&oslash;rer</strong>, <strong>Sover</strong> og <strong>Standset</strong>. Linux-&aelig;kvivalenter til processtatus er <strong>k&oslash;rer</strong>, <strong>stoppet/sporer</strong>, <strong>sover</strong>. </p>
<p><strong>Sover</strong> kan efterf&oslash;lges af et bogstav med detaljerede oplysninger, f.eks. 'D' for diskslumring, 'Z' for zombie, 'X' for d&oslash;d.</p>

<h2>Tilsluttede brugere</h2>
<p> P&aring; denne fane kan du se og administrere de klienter, som aktuelt har forbindelse til systemet og adgang til ressourcer. Dette afsnit viser klienter, der har forbindelse via HTTP, TELNET, SSH, SMB/CIFS, AFP, FTP og NFS.</p>
<h4>S&aring;dan administrerer du aktuelle forbindelser:</h4>
<ul>
<li>Klik p&aring; <b>Gem</b> for at eksportere den aktuelle liste til en HTML-fil.</li>
<li>Klik p&aring; <b>Opdater</b> for at opdatere listen.</li>
<li>Klik p&aring; <b>Dr&aelig;b forbindelse</b> for at standse brugeren i at f&aring; adgang til ressourcen. Den afbrudte bruger skal godkende igen for at f&aring; adgang til ressourcen.</li>
<li>Klik p&aring; <b>Deaktiver bruger</b> for at deaktivere brugeren. Hvis du vil aktivere brugeren igen, skal du g&aring; til <b>Hovedmenu</b> &gt; <b>Kontrolpanel</b> &gt; <b>Bruger</b>.</li>
</ul>
<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Valgmuligheden <strong>Dr&aelig;b forbindelse</strong> fungerer ikke med NFS-klienter.</li>
<li>Hvis NFS-klienter ikke afbryder delte mapper korrekt, bliver de m&aring;ske stadig vist i listen over tilsluttede brugere.</li>
<li>Hvis Synology NAS genstarter, bliver NFS-klienter, der tidligere var tilsluttet ikke vist i listen over tilsluttede brugere.</li>
</ul>
</div>


<h2>Hastighedsgr&aelig;nse</h2>
<p>P&aring; fanen <strong>Hastighedsgr&aelig;nse</strong> kan du se og administrere listen over filoverf&oslash;rselsprocesser, som brugte hastighedsgr&aelig;nsen p&aring; Synology NAS.</p>
<h4>S&aring;dan opdaterer du listen:</h4>
<p>Klik p&aring; <strong>Opdater</strong> for at genindl&aelig;se siden og f&aring; de senest opdaterede poster.</p>
<h4>S&aring;dan stopper du en filoverf&oslash;rselsproces:</h4>
<p>Klik p&aring; <b>Dr&aelig;b forbindelse</b> for at standse filoverf&oslash;rslen. Du skal starte filoverf&oslash;rslen igen for at fuldf&oslash;re processen.</p>


<h2>Indstillinger</h2>
<p>Klik p&aring; <strong>Indstillinger</strong> for at konfigurere f&oslash;lgende muligheder:</p>
<ul>
<li>V&aelig;lg <strong>Realtidsvarighed</strong> i minutter i rullemenuen.</li>
<li>Marker<strong> Aktiver brugshistorik</strong>, hvis du vil se foreg&aring;ende data. N&aring;r den er tilsluttet, kan du skifte mellem <strong>Realtid</strong>, <strong>1 dag</strong>, <strong>1 uge</strong>, <strong>1 m&aring;ned</strong> og <strong>1 &aring;r</strong> i rullemenuen &oslash;verst til h&oslash;jre, n&aring;r du ser ydelsesdiagrammer.</li> 
<li>Marker <strong>Aktiver ydelsesbegivenhed</strong>, hvis du vil overv&aring;ge systemydelsen.</li>
</ul>

<p>Klik p&aring; <strong>Anvend</strong> for af gemme indstillingerne.</p>

<h2>Ydelsesalarmer</h2>
<h4>S&aring;dan opretter du en ydelsesalarm:</h4>
<ol>
<li>G&aring; til <strong>Indstillinger</strong> &gt; <strong>Regel for ydelsesalarm</strong>.</li>
<li>Klik p&aring; knappen <b>Opret</b>.</li>
<li>F&oslash;lgende regelindstillinger er tilg&aelig;ngelige:</li>
<ul>
<li><strong>Ressource</strong>: V&aelig;lg den ressource, du vil anvende reglen p&aring;.</li>
<li><strong>Type</strong>: V&aelig;lg den type regel, du vil oprette.</li>
<li><strong>Niveau</strong>: V&aelig;lg alarmniveauet.</li>
<li><strong>St&oslash;rre end</strong>: Angiv den maksimale procent for din regeltype, hvor systemet vil underrette dig, hvis det er oversteget.</li>
</ul>
<li>Marker <strong>Aktiveret</strong>, hvis du vil aktivere denne regel med det samme.</li>
<li>Klik p&aring; <strong>OK</strong> for at tilf&oslash;je reglen.</li>
</ol>


<div class="section">
<h4>Mekanisme til ydelsesalarmer:</h4>
<p>Ydelsesalarmer vil fungere via f&oslash;lgende mekanisme for at minimere falske alarmer og for at forhindre for h&oslash;jt forbrug af systemressourcer inden for et kort tidsrum.</p>
<ol>
	<li>Ydelsesalarmtjenesten vil kontrollere alle regler hver 5. minut. Ingen handling udl&oslash;ses, his alle de overv&aring;gede v&aelig;rdier ligger under de t&aelig;rskler, som du har angivet.</li>
	<li>N&aring;r en overv&aring;get v&aelig;rdi overstiger t&aelig;rsklen, bliver en alarm ikke udl&oslash;st &oslash;jeblikkeligt. I stedet vil systemet kontrollere reglen fem gange til med 30 sekunders interval.</li>
	<li>Efter &aelig;ndringen i intervall&aelig;ngde og den overv&aring;gede v&aelig;rdi overstiger t&aelig;rsklen fem konsekutive gange, bliver der udl&oslash;st en alarm. Hvis den overv&aring;gende v&aelig;rdi dog falder under t&aelig;rsklen under en af disse fem kontroller, bliver intervall&aelig;ngden &aelig;ndret tilbage til fem minutter.</li>
</ol>
<p>Derfor bliver en alarm for &eacute;n begivenhed senest udl&oslash;st 450 sekunder efter den f&oslash;rste registrering af begivenheden.</p>

<h4>Alarmniveauer:</h4>
<p>Ydelsesalarmer vil udl&oslash;se forskellige handlinger, afh&aelig;ngigt af alarmniveauerne.</p>
<ul>
	<li><strong>Advarsel:</strong> Genererer en advarselsmeddelelse i systemlogfilen, men udl&oslash;ser ikke nogen systemunderretning.</li>
	<li><strong>Kritiske</strong>: Genererer ikke alene en meddelelse i systemlogfilen, men udl&oslash;ser ogs&aring; systemunderretninger.</li>
</ul>
<p>Logfiler over ydelsesalarmer kan ses p&aring; fanen <strong>Ydelsesalarm</strong> eller i DSM's <strong>Logcenter</strong>.</p>
</div>


<h4>S&aring;dan f&aring;r du vist ydelsesalarmer:</h4>
<ul>
<li>Klik p&aring; fanen <strong>Ydelsesalarm</strong> for at f&aring; vist alle udl&oslash;ste ydelsesalarmer.</li> 
<li>Klik p&aring; <strong>Opdater</strong> for at f&aring; de mest opdaterede alarmer.</li>
</ul>

<h4>S&aring;dan eksporterer du ydelsesalarmer:</h4>
<ol>
<li>Klik p&aring; pilen ved siden af knappen <strong>Eksporter</strong>.</li>
<li>Du kan v&aelig;lge at eksportere alarmer som <strong>HTML</strong> eller <strong>CSV</strong>.</li>
</ol>
<div class="section"><h4>Bem&aelig;rk:</h4>
<ul>
<li>Underst&oslash;ttelse af <strong>Ydelsesalarmer</strong> varierer mellem Synology NAS-modellerne. Yderligere oplysninger findes under <a href="http://www.synology.com/" target="_b +lank">www.synology.com</a>.</li>
</ul>
</div>
</body>
</html>
