
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Ressourceoverv&aring;gning</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Ydeevne</h2>
<p>Klik p&aring; fanen <strong>Ydeevne</strong> for at se ressourceudnyttelsesdata. Detaljeret dato, tidspunkt og oplysninger om diagram bliver vist, n&aring;r musen flyttes over.</p>

<h3>CPU</h3>
<p>Du kan se den generelle CPU-udnyttelse for <strong>Bruger</strong>, <strong>System</strong> og <strong>I/O vent</strong>. CPU-belastning kan v&aelig;re h&oslash;j, n&aring;r Ressourceoverv&aring;gning lige er startet, fordi systemet skal indsamle ressourcedata og indl&aelig;se UI-siden p&aring; samme tid.</p>
<p><strong>Bruger</strong> viser den procent af CPU, der anvendes til at k&oslash;re brugerprogrammer. <strong>System</strong> viser procenten af CPU, der anvendes i kernen af systemet, hardware/software IRQ'er. <strong>I/O vent</strong> viser procenten af CPU bruge p&aring; I/O vent.</p>
<p><strong>Udnyttelse</strong> er summen af <strong>Bruger</strong> og <strong>System</strong> CPU-brug.</p>
<p>Belastningsgennemsnittet inden for 1, 5 og 15 minutter vises. Det viser k&oslash;k&oslash;rselsl&aelig;ngden (dvs. summen af antallet af processer, der aktuelt k&oslash;rer plus antal, der skal k&oslash;re). </p>
<div class="section">
<h4>Forklaring af ord</h4>
<ul>
<li><b>I/O vent</b>: I/O vent angiver, at CPU'en er inaktiv og bruges ikke af noget program. </li>
<p>I/O vent er normal adf&aelig;rd. Da hastigheden p&aring; CPU'en er meget hurtigere end I/O, er det almindeligt, at CPU'en venter p&aring; overf&oslash;rsel af diske, eller netv&aelig;rket fuldf&oslash;res. Hvis procenten for I/O vent dog er meget stor, betyder det, at CPU'en det meste af tiden venter p&aring; I/O vent og bliver ikke brugt. Du kan bruge mere effektive diskgruppekonfigurationer (dvs. SHR eller RAID 5) p&aring; netv&aelig;rkskonfigurationer (dvs. Binding) for at opn&aring; bedre ydeevne.</p> 
</ul>
</div>
<h3>Hukommelse</h3>
<p>Den samlede hukommelsesudnyttelse af fysisk hukommelse og swap-plads vises. Hukommelsesbrug forbliver h&oslash;j, fordi systemet lagrer data, der ofte gives adgang til i cache, s&aring; data hurtigt kan hentes uden at g&aring; ind p&aring; harddisken. Cache-hukommelse frig&oslash;res, n&aring;r den samlede hukommelse ikke er nok.</p>
<p>H&oslash;j swap-pladsudnyttelse angiver utilstr&aelig;kkelig systemhukommelse og vil ogs&aring; p&aring;virke systemet ydeevne. Du kan se swap-ind- og swap-ud-hastigheden ved at v&aelig;lge <strong>Swap</strong> i rullemenuen &oslash;verst. </p>

<h3>Netv&aelig;rk</h3>
<p>Diagrammet over netv&aelig;rksflow'et viser sendte og modtagne data i KB pr. sek. Hvis PPPoE er tilsluttet, vil overf&oslash;rselshastigheden ogs&aring; blive vist p&aring; diagrammet.</p>

<h3 class="disable-dockerx64">Disk</h3>
<p class="disable-dockerx64">Du kan v&aelig;lge at se den generelle diskudnyttelse, overf&oslash;rselshastighed eller IOPS ved at klikke p&aring; rullemenuen &oslash;verst p&aring; diagrammet. Du kan klikke p&aring; <strong>Vis alt</strong> nederst for at v&aelig;lge flere diske ved at markere afkrydsningsfelterne for at tilf&oslash;je deres data til diagrammet.</p>


<h3 class="disable-eds14 disable-dockerx64">Diskenhed</h3>
<p class="disable-eds14 disable-dockerx64">Denne side viser generel overf&oslash;rselsstatus for diskenheder. Klik p&aring; rullemenuen over diagrammet for at se overf&oslash;rselsudnyttelse, overf&oslash;rselshastighed eller IOPS. Klik p&aring; knappen <strong>Vis alt</strong> for at v&aelig;lge individuelle diskenheder, og tilf&oslash;j dem til diagrammet.</p>

<h3 class="disable-eds14 disable-dockerx64">iSCSI</h3>
<p class="disable-eds14 dixable-dockerx64">Denne side viser den generel status for aktuelt k&oslash;rende iSCSI LUN'er. Klik p&aring; rullemenuen over diagrammet for at v&aelig;lge en LUN og se dens status. Der vises som standard tre diagrammer, som er <strong>Gennemstr&oslash;mning</strong>, <strong>IOPS</strong> og <strong>Latens</strong>. F&aring; mere detaljerede oplysninger ved at klikke p&aring; knappen <strong>V&aelig;lg diagrammer</strong> for at v&aelig;lge andre diagrammer, som du vil se.</p>

</body>
</html>
