<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Kontakt podpory</title>



<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>



</head>
<body>

<h2>Kontakt podpory</h2>
<p>Centrum podpory společnosti Synology je obs&aacute;hl&yacute; zdroj informac&iacute;, kter&yacute; v&aacute;m pomůže vyře&scaron;it jak&yacute;koli potenci&aacute;ln&iacute; probl&eacute;m se zař&iacute;zen&iacute;m Synology NAS po celou dobu jeho z&aacute;ruky. S&nbsp;radost&iacute; v&aacute;m pomůžeme zajistit a&nbsp;udržovat optim&aacute;ln&iacute; v&yacute;kon zař&iacute;zen&iacute; Synology NAS. Pokud chcete využ&iacute;vat tuto službu a&nbsp;vytvořit tiket, přejděte do nab&iacute;dky <b>Centrum podpory</b> &gt; <b>Kontakt podpory</b>.</p>

<h4>Před vytvořen&iacute;m nov&eacute;ho tiketu si nejprve přečtěte n&aacute;sleduj&iacute;c&iacute; informace:</h4>
<ul>
<li>Před vytvořen&iacute;m nov&eacute;ho tiketu doporučujeme kvůli &uacute;spoře času prohledat <a href="https://www.synology.com/support" target="_blank">Znalostn&iacute; datab&aacute;zi</a>. Va&scaron;e dotazy již byly pravděpodobně zodpovězeny, a&nbsp;proto jsme vytvořili čl&aacute;nek, ve kter&eacute;m najdete shrnut&iacute;.</li>
<li>Chcete-li zah&aacute;jit nov&yacute; tiket technick&eacute; podpory ze syst&eacute;mu DSM, mus&iacute;te se přihl&aacute;sit do sv&eacute;ho <a href="https://account.synology.com/" target="_blank">&uacute;čtu Synology</a>.</li>
<li>Na nov&eacute;m tiketu je potřeba vyplnit ve&scaron;ker&aacute; požadovan&aacute; pole.</li>
<li>Kvůli př&iacute;padn&yacute;m nedorozuměn&iacute;m uveďte informace na tiketu v&nbsp;<b>angličtině</b> nebo <b>č&iacute;n&scaron;tině</b>.</li>
</ul>

<h4>Tipy pro vytvořen&iacute; nov&eacute;ho tiketu:</h4>
<ul>
<li>Popi&scaron;te probl&eacute;m, kter&yacute; chcete nahl&aacute;sit, a&nbsp;nezapomeňte uv&eacute;st v&scaron;echny kroky, kter&eacute; jste podnikli, abyste probl&eacute;m vyře&scaron;ili. Nezapomeňte tak&eacute; uv&eacute;st podrobnosti, kter&eacute; by mohly pomoci technikům z&nbsp;oddělen&iacute; podpory společnosti Synology probl&eacute;m l&eacute;pe rozpoznat. Pokud je to možn&eacute;, uveďte oč&iacute;slovan&eacute; kroky a&nbsp;sn&iacute;mky obrazovky, kter&eacute; reprodukuj&iacute; situaci.</li>
<li>N&aacute;&scaron; syst&eacute;m podpory odstran&iacute; př&iacute;lohy, kter&eacute; přes&aacute;hnou 20 MB.</li>
</ul>

<h4>Co se stane po odesl&aacute;n&iacute; tiketu:</h4>
<ul>
<li>Kr&aacute;tce po odesl&aacute;n&iacute; tiketu v&aacute;s bude kontaktovat technik z&nbsp;oddělen&iacute; podpory společnosti Synology.</li>
<li>Pokud jste neobdrželi ž&aacute;dnou odpověď, ujistěte se, že va&scaron;e e-maily neblokuje bezpečnostn&iacute; software na poč&iacute;tači nebo v&nbsp;s&iacute;ti.</li>
<li>Každ&yacute; tiket m&aacute; jedinečn&yacute; identifik&aacute;tor, kter&yacute; je obsažen v&nbsp;předmětu e-mailů odeslan&yacute;ch jako odpovědi na tento tiket.</li>
<li>Na&scaron;i technici z&nbsp;oddělen&iacute; podpory v&aacute;s mohou pož&aacute;dat o&nbsp;povolen&iacute; vzd&aacute;len&eacute;ho př&iacute;stupu k&nbsp;zař&iacute;zen&iacute; Synology NAS, aby mohli spustit diagn&oacute;zu z&nbsp;centra společnosti Synology. Podrobnosti najdete v&nbsp;č&aacute;sti <a href="support_services.html">Služby podpory</a>.</li>
</ul>

</body>
</html>