<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Automatisk blokkering - Synology DSM Hjelp</title> 
<meta name="author" content="Synology Inc.">
<meta name="description" content="The auto block feature helps improve the security of your Synology NAS by blocking the IP addresses of clients with too many failed login attempts.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Automatisk blokkering</h2>

<p>Funksjonen automatisk blokkering bidrar til &aring; forbedre sikkerheten til din Synology NAS ved &aring; blokkere IP-adressene til klienter med for mange mislykkede p&aring;loggingsfors&oslash;k. Dette bidrar til &aring; redusere risikoen for at kontoer blir overtatt med &quot;r&aring; makt&quot;.</p>

<p>Du kan ogs&aring; opprette og administrere en liste over tillatte for &aring; legge til IP-adresser som du stoler p&aring;, eller en blokkeringsliste for alltid &aring; hindre bestemte IP-adresser i &aring; logge inn.</p>

<div class="section"><h4>Merk:</h4>
<ul>
	<li>Ulike tjenester og pakker st&oslash;tter automatisk blokkering, som de f&oslash;lgende: DSM, SSH, Telnet, rsync, nettverkssikkerhetskopiering, synkronisering av delt mappe, FTP, WebDAV, File Station, Photo Station, Audio Station, Video Station, Download Station, Mail Server, Mail Station, Time Backup, VPN Server, Cloud Station og Synology-mobilprogrammer.</li>
</ul>
</div>

<h4>Slik aktiverer du automatisk blokkering:</h4>
<ol>
	<li>&Aring;pne <strong>Kontrollpanel</strong> og g&aring; til <strong>Sikkerhet</strong> &gt; <strong>Automatisk blokkering</strong>.</li>
	<li>Merk av for <strong>Aktiver automatisk blokkering</strong>.</li>
	<li>Angi antall mislykkede p&aring;loggingsfors&oslash;k i feltet <strong>P&aring;loggingsfors&oslash;k</strong> og antall minutter i feltet <strong>Innenfor (minutter)</strong>. En IP-adresse blir blokkert n&aring;r den overskrider antall mislykkede p&aring;loggingsfors&oslash;k innenfor spesifisert antall minutter.</li>
	<li>Merk av <strong>Aktiver utl&oslash;psdato for blokkering</strong> og angi et tall for &aring; fjerne en blokkert IP-adresse etter et angitt antall dager.</li>
	<li>Klikk p&aring; <strong>Bruk</strong> for &aring; lagre innstillingene.</li>
</ol>


<h3>Administrere blokkeringsliste</h3>
<p>Klikk p&aring; <strong>Tillat/blokker-liste</strong> og g&aring; til fanen <strong>Blokkeringsliste</strong>. </p>

<h4>Slik legger du til IP-adresser:</h4>
<p>Velg en av f&oslash;lgende fra rullegardinmenyen <strong>Opprett</strong>:</p>

<ul>
	<li><strong>Legg til IP-adresse</strong>: Angi en IP-adresse og still inn utl&oslash;pstiden.</li>
	<li><strong>Importer liste over IP-adresser</strong>: Importer en tekstfil som lister opp IP-adresser for &aring; legge til flere IP-adresser og stille inn utl&oslash;pstiden samtidig. Merk av i boksen hvis du vil overskrive eksisterende IP-adresser. Hvis dette alternativet ikke er valgt, blir dupliserte IP-adresser hoppet over.<br />Hvis filen du velger har riktig format, kan du se alle IP-adressene i forh&aring;ndsvisningsomr&aring;det. Klikk p&aring; <strong>OK</strong> for &aring; importere.</li>
</ul>

<div class="section"><h4>Merk:</h4>
<p>For &aring; importere en fil, m&aring; filen m&oslash;te f&oslash;lgende kriterier:</p>
<ul>
	<li>Filen m&aring; v&aelig;re en vanlig tekstfil.</li>
	<li>Hver linje i filen kan inneholde kun &eacute;n IP-adresse.</li>
	<li>Kommentarlinjer begynner med et # (pundtegn).</li>
</ul>
</div>

<h4>Slik fjerner du blokkerte IP-adresser:</h4>
<p>Velg IP-adressene du vil fjerne fra listen og klikk p&aring; <strong>Fjern</strong>.</p>


<h3>Administrere liste over tillatte</h3>

<p>Klikk p&aring; <strong>Tillat/blokker-liste</strong> og g&aring; til fanen <strong>Liste over tillatte</strong>.</p>

<h4>Slik legger du til IP-adresser:</h4>
<p>Velg en av f&oslash;lgende fra rullegardinmenyen <strong>Opprett</strong>:</p>
<ul>
	<li><strong>Legg til IP-adresse</strong>: Angi en IP-adresse, et IP-omr&aring;de, et delnett eller et domenenavn.</li>
	<li><strong>Importer liste over IP-adresser</strong>: Importer en tekstfil som lister opp IP-adresser for &aring; legge til flere IP-adresser samtidig. Merk av i boksen hvis du vil overskrive eksisterende IP-adresser. Hvis dette alternativet ikke er valgt, blir dupliserte IP-adresser hoppet over.<br />Hvis filen du velger har riktig format, kan du se alle IP-adressene i forh&aring;ndsvisningsomr&aring;det. Klikk p&aring; <strong>OK</strong> for &aring; importere.</li>
</ul>

<div class="section"><h4>Merk:</h4>
<p>For &aring; importere en fil, m&aring; filen m&oslash;te f&oslash;lgende kriterier:</p>
<ul>
<li>Filen m&aring; v&aelig;re en vanlig tekstfil.</li>
<li>Hver linje i filen kan kun inneholde enten en IP-adresse, et IP-omr&aring;de (<em>192.168.1.1 - 192.168.1.10</em>), et delnett (<em>192.168.1.1/255.255.0.0</em>) eller et domenenavn (<em>www.synology.com</em>).</li>
<li>Kommentarlinjer begynner med et # (pundtegn).</li>
</ul>
</div>

<h4>Slik fjerner du IP-adresser:</h4>
<p>Velg IP-adressene du vil fjerne fra listen og klikk p&aring; <strong>Fjern</strong>.</p>

<div class="section"><h4>Merk:</h4>
<ul>
	<li>Hvis din Synology NAS-enhet er bak en omvendt proxyserver, m&aring; du legge til IP-adressen til denne omvendte proxyserveren i listen over tillatte.</li>
</ul>
</div>

</body>
</html>
