<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="wireless_ap"></a>Hotspot*</h2>

<p>Din Synology NAS-enhet st&oslash;tter oppretting av et hotspot for &aring; dele Internett-tilkoblingen med andre enheter tr&aring;dl&oslash;st dersom du har installert en Wi-Fi USB-adapter eller om din Synology NAS har integrert Wi-Fi. Du kan angi din Synology NAS som et tr&aring;dl&oslash;st tilgangspunkt (AP) eller en tr&aring;dl&oslash;s ruter, avhengig av hvordan du &oslash;nsker &aring; bruke Internett.</p>

<table>
	<tr>
		<th width="23%">Hotspot-modus</th>
		<th width="77%">Beskrivelse</th>
	</tr>
	<tr>
		<th>Tr&aring;dl&oslash;st tilgangspunkt</th>
		<td>
			<ul>
				<li>Oppretter bro mellom ditt LAN- og Wi-Fi-nettverk.</li>
				<li>Dine LAN-klienter og tr&aring;dl&oslash;se klienter vil v&aelig;re p&aring; det samme lokale nettverket.</li>
				<li>Gjelder n&aring;r du allerede har en ruter og vil bruke din Synology NAS som et ekstra tilgangspunkt til et eksisterende nettverk.</li> 
				<li>Lar deg dele nettverksressurser, som DLNA-enheter, <span class="disable-grantley">skrivere, </span>Synology Web Assistant eller andre tjenester som krever nettverkskringkastinger.</li>
				<li>DHCP-server vil bli deaktivert p&aring; Synology NAS-enheter som fungerer som tr&aring;dl&oslash;se tilgangspunkt. For &aring; gjenaktivere DHCP-server for din Synology NAS, fjerner du Wi-Fi-dongler og starter Synology NAS p&aring; nytt.</li>
				<li>P&aring; modeller med flere LAN-porter, vil kun LAN 1 bli brukt til &aring; opprette bro med tr&aring;dl&oslash;st tilgangspunkt.</li>
			</ul>
		</td>
	</tr>
	<tr>
		<th>Tr&aring;dl&oslash;s ruter</th>
		<td>
			<ul>
				<li>Setter opp et tr&aring;d&oslash;st nettverk der enheter er p&aring; et privat delnett.</li>
			</ul>
		</td>
	</tr>
</table>

<div class="section"><h4>Merk:</h4>
<ol>
	<li>Visse modeller krever tilkobling av tr&aring;dl&oslash;se dongler for &aring; opprette hotspoter. Hvis du vil se en liste over st&oslash;ttede tr&aring;dl&oslash;se dongler, kan du g&aring; til <a href="https://www.synology.com/compatibility?search_by=category&category=usb_wifi_dongles&p=1&filter_ap_mode=yes&not_recommend_mode=false" target=_blank>www.synology.com</a>.</li>
	<li>For ikke-DS213air-modeller, vil alternativet Tr&aring;dl&oslash;st hotspot i DSM 4.3 hete &quot;Tr&aring;dl&oslash;s ruter&quot; i DSM 5.0 og nyere.</li>
</ol>
</div>

<h3>Administrere hotspot-innstillinger</h3>
<p>Denne seksjonen forklarer hvordan du aktiverer og administrerer innstillinger for hotspot p&aring; din Synology NAS.</p>

<h4>Slik gj&oslash;r du Synology NAS om til et hotspot:</h4>
<ol>
	<li>G&aring; til <strong>Kontrollpanel</strong> &gt; <strong>Tr&aring;dl&oslash;s</strong> &gt; <strong>Nettverkskart</strong>. Velg <strong>Tr&aring;dl&oslash;st AP</strong> eller <strong>Tr&aring;dl&oslash;s ruter</strong>.</li>
	<li>G&aring; til fanen <strong>Wi-Fi</strong> og klikk p&aring; <strong>Rediger</strong> for &aring; administrere f&oslash;lgende innstillinger:
		<ul>
			<li><strong>Navn (SSID):</strong>Skriv inn et navn for det tr&aring;dl&oslash;se nettverket.</li>
			<li><strong>Vis/Skjul:</strong> Velg om det tr&aring;dl&oslash;se nettverket skal v&aelig;re synlig for andre enheter.</li>
			<li><strong>Tr&aring;dl&oslash;s modus:</strong> Velg en tr&aring;dl&oslash;s standard. Hver standard st&oslash;tter forskjellige b&aring;ndbredder og frekvenser.</li>
			<li><strong>Kanalbredde:</strong> Velg en kanalbredde (kun tilgjengelig med 802.11n tr&aring;dl&oslash;s modus).</li>
			<li><strong>Kanal:</strong>Velg en frekvens for det tr&aring;dl&oslash;se nettverket. For bedre ytelse kan du velge en frekvens som ikke brukes av n&aelig;rliggende nettverk.</li>
			<li><strong>Overf&oslash;ringskraft:</strong> Velg en signalstyrke for det tr&aring;dl&oslash;se nettverket.</li>
			<li><strong>Maks. tilkoblinger:</strong> Velg hvor mange klientenheter som kan koble seg til nettverket. Det h&oslash;yeste antallet tilkoblinger er 256.</li>
			<li><strong>Aktiver WMM QoS:</strong> Wi-Fi Multimedia (WMM) QoS (kvalitet p&aring; tjeneste) over Wi-Fi. Dette alternativet lar det tr&aring;dl&oslash;se nettverket prioritere trafikk og optimere hvordan ressurser deles p&aring; programmer.</li>
		</ul>
	</li>
</ol>

<h4>Slik setter du opp en tr&aring;dl&oslash;s tidsplan:*</h4>
<p>Aktivering av en tr&aring;dl&oslash;s nettverkstidsplan lar deg kontrollere n&aring;r det tr&aring;dl&oslash;se nettverket for din Synology NAS er aktivt og tilgjengelig.</p>
<ol>
	<li>G&aring; til fanen <strong>Wi-Fi</strong> og klikk p&aring; <strong>Rediger</strong>.</li>
	<li>Merk av for <strong>Aktiver tidstabell</strong>.</li>
	<li>Klikk p&aring; <strong>Stille inn tidsplan</strong>.</li>
	<li>P&aring; tidsplanskjermen velger du n&aring;r det tr&aring;dl&oslash;se nettverket skal v&aelig;re aktivt.</li>
</ol>

<h3>Sikkerhetsinnstillinger</h3>
<p><strong>Kontrollpanel</strong> &gt; <strong>Tr&aring;dl&oslash;s</strong> &gt; <strong>Wi-Fi</strong> gir deg alternativer for &aring; redigere sikkerhetsinnstillingene for ditt tr&aring;dl&oslash;se nettverk.</p>

<h4>Slik setter du opp tr&aring;dl&oslash;s sikkerhet:</h4>
<ol>
	<li>Klikk p&aring; <strong>Rediger</strong>.</li>
	<li>Velg en av f&oslash;lgende sikkerhetsprotokoller fra rullegardinmenyen <strong>Sikkerhetsinnstillinger</strong>:
		<ul>
			<li><strong>WEP:</strong> En grunnleggende sikkerhetsprotokoll som krever at brukere angir passord for &aring; f&aring; tilgang til det tr&aring;dl&oslash;se nettverket, men yter minimal beskyttelse.</li>
			<li><strong>WPA/WPA2 personlig:</strong>Anbefalt. Krever at brukere angir passord for &aring; f&aring; tilgang til det tr&aring;dl&oslash;se nettverket og er tryggere enn WEP.</li>
			<li><strong>WPA/WPA2 virksomhet:</strong>* En sikkerhetsprotokoll som er utviklet for virksomheter og krever at brukere autentiseres gjennom en ekstern autentiseringsserver.</li>
		</ul>
	</li>
</ol>

<h4>Slik aktiverer du Wi-Fi Protected Setup:*</h4>
<p>Wi-Fi Protected Setup er en standard som markedsf&oslash;res av Wi-Fi Alliance for &aring; forenkle tr&aring;dl&oslash;se sikkerhetsinnstillinger for brukere. Du kan bruke en Push-knapp eller et PIN-nummer for &aring; holde Wi-Fi-nettverket ditt sikret. Klikk p&aring; <strong>WPS</strong> for &aring; aktivere Wi-Fi Protected Setup.</p>

<h3>Gjestenettverk*</h3>
<p>I tillegg til oppretting av et tr&aring;dl&oslash;st vertsnettverk, st&oslash;tter din Synology NAS ogs&aring; opprettingen av et tr&aring;dl&oslash;st gjestenettverk. Innstillingene for gjestenettverket kan begrenses til &aring; begrense brukeres tilgang, noe som er nyttig for virksomheter eller andre institusjoner som vil tilby et tr&aring;dl&oslash;st nettverk til bes&oslash;kende, men forhindre at de f&aring;r tilgang til vertsnettverket.</p>

<h4>Slik aktiverer du gjestenettverket:</h4>
<ol>
	<li>G&aring; til <strong>Kontrollpanel</strong> &gt; <strong>Tr&aring;dl&oslash;s</strong> &gt; <strong>Wi-Fi</strong>.</li>
	<li>Klikk p&aring; <strong>Rediger</strong> for &aring; administrere f&oslash;lgende innstillinger under fanen <strong>Gjestenettverk</strong>:
		<ul>
			<li><strong>Navn (SSID):</strong>Skriv inn et navn for det tr&aring;dl&oslash;se nettverket.</li>
			<li><strong>Vis/Skjul:</strong> Velg om det tr&aring;dl&oslash;se nettverket skal v&aelig;re synlig for andre enheter.</li>
			<li><strong>Maks. tilkoblinger:</strong> Velg hvor mange klientenheter som kan koble seg til nettverket. Det h&oslash;yeste antallet tilkoblinger er 256.</li>
		</ul>
	</li>
</ol>

<h4>Slik setter du opp sikkerhet for gjestenettverk:</h4>
<p>Velg en av f&oslash;lgende sikkerhetsprotokoller fra rullegardinmenyen <strong>Sikkerhetsinnstillinger</strong>:</p>
<ul>
	<li><strong>WEP:</strong> En grunnleggende sikkerhetsprotokoll som krever at brukere angir passord for &aring; f&aring; tilgang til det tr&aring;dl&oslash;se nettverket, men yter minimal beskyttelse.</li>
	<li><strong>WPA/WPA2 personlig:</strong>Anbefalt. Krever at brukere angir passord for &aring; f&aring; tilgang til det tr&aring;dl&oslash;se nettverket og er tryggere enn WEP.</li>
</ul>

<h4>Slik setter du opp en plan for gjestenettverk:</h4>
<p>Aktivering av en gjestenettverkplan lar deg kontrollere n&aring;r det tr&aring;dl&oslash;se gjestenettverket for din Synology NAS er aktivt og tilgjengelig.</p>

<ol>
	<li>Merk av for <strong>Aktiver gjestenettverkplan</strong>.</li>
	<li>Klikk p&aring; <strong>Angi gjesteplan</strong>.</li>
	<li>P&aring; tidsplanskjermen velger du n&aring;r det tr&aring;dl&oslash;se gjestenettverket skal v&aelig;re aktivt.</li>
</ol>

<div class="section"><h4>Merk:</h4>
<ul>
<li>Denne funksjonen er kun tilgjengelig p&aring; DS213air.</li>
<li>Det tr&aring;dl&oslash;se gjestenettverket kan ikke v&aelig;re aktivt i perioder n&aring;r det tr&aring;dl&oslash;se vertsnettverket er deaktivert.</li>
</ul>
</div>

<h3>MAC-filterinnstilling*</h3>
<p>MAC-filter (i <strong>Kontrollpanel</strong> &gt; <strong>Tr&aring;dl&oslash;s</strong>) spesifiserer hvilke MAC-adresser som skal f&aring; tilgang til det tr&aring;dl&oslash;se nettverket og lar deg blokkere eller gi tilgang til spesifikke enheter. Denne funksjonen kontrollerer kun nettverkstilgang, ikke andre krypteringsinnstillinger.</p>

<h4>Slik oppretter du regler for MAC-filter:</h4>
<ol>
	<li>Angi beskrivelsen og MAC-adressen til en enhet.</li>
	<li>Velg en tilgangspolicy:
		<ul>
			<li><strong>Avsl&aring;:</strong> Nekter den spesifiserte MAC-adressen tilgang til det tr&aring;dl&oslash;se nettverket.</li>
			<li><strong>Tillat:</strong> Tillater at de spesifiserte MAC-adressene f&aring;r tilgang til det tr&aring;dl&oslash;se nettverket.</li>
		</ul> 
	</li>
</ol>

<h3>Foreldrekontroll*</h3>
<p>Funksjonen foreldrekontroll lar deg kontrollere n&aring;r hver klientenhet som er tilkoblet Synology NASs lokale nettverk har tilgang til Internett. For eksempel, hvis dine barns datamaskiner eller mobile enheter kobler seg til Internett gjennom Synology NAS, vil du kunne konfigurere innstillinger for foreldrekontroll for &aring; begrense deres Internett-bruk i henhold til spesifikke enheter og tidspunkt.</p>

<h4>Slik aktiverer du foreldrekontroll:</h4>
<ol>
	<li>G&aring; til <strong>Kontrollpanel</strong> &gt; <strong>Tr&aring;dl&oslash;s</strong> &gt; <strong>Innstillinger for foreldrekontroll</strong>.</li>
	<li>Klikk p&aring; knappen <strong>Legg til</strong> for &aring; legge til en klientenhet.
		<ul>
			<li><strong>Klientnavn:</strong> Velg en enhet som er tilkoblet Synology NAS eller angi et navn manuelt (f.eks. Louisas b&aelig;rbare).</li>
			<li><strong>MAC-adresse:</strong> Angi MAC-adressen til enheten hvis Internett-bruk du &oslash;nsker &aring; kontrollere.</li>
			<li><strong>Stille inn tidsplan:</strong> Velg hvilke tidspunkter den spesifiserte enheten skal ha tilgang til Internett gjennom Synology NAS.</li>
		</ul>
	</li>
</ol>

<h3>Tilkoblingsliste*</h3>
<p>Tilkoblingslisten (i <strong>Kontrollpanel</strong> &gt; <strong>Tr&aring;dl&oslash;s</strong>) viser informasjon om enheter som er tilkoblet Synology NAS. Enheter kan legges direkte til i MAC-filterlisten herfra.</p>

<h4>Slik legger du til enheter i MAC-filterlisten:</h4>
<ol>
	<li>Merk av i boksen ved siden av enheten som du vil legge til i MAC-filteret.</li>
	<li>Klikk p&aring; <strong>Legg til i MAC-filterliste</strong>.</li>
</ol>

<p>____<br /> * Bare tilgjengelig p&aring; bestemte modeller.</p>

</body>
</html>