<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>AFP</h2>
<p>I <strong>Kontrollpanel</strong> &gt; <strong>Filtjenester</strong> &gt; <strong>SMB/AFP/NFS</strong> kan du aktivere AFP-tjeneste for &aring; omgj&oslash;re Synology NAS til en Mac-filserver (AFP-server).</p>

<h4>Aktiver Mac-filtjeneste:</h4>
<ol>
	<li>Merk av for <strong>Aktiver AFP-tjeneste</strong> hvis du vil gj&oslash;re Synology NAS til en Mac-filserver (AFP-server).</li>
	<li>Klikk p&aring; <strong>Bruk</strong>.</li>
</ol>


<h3>Aktivere overf&oslash;ringslogger</h3>
<p>Hvis du merker av for dette alternativet, aktiveres logging av filtilgangsoperasjoner, inkludert oppretting, sletting, lesing, skriving, flytting og endring av navn p&aring; filer eller mapper gjennom AFP, ogs&aring; kjent som Apple Filing Protocol.</p>

<h3>Avanserte innstillinger</h3>

<h4>Bruk standard UNIX-tillatelser:</h4>
<p>Aktivering av dette alternativet tar i bruk standard UNIX-tillatelser n&aring;r du laster opp eller oppretter filer og mapper. Tillatelser som brukes er de samme som tillatelsene som brukes av UNIX-kommandoen <strong>umask</strong>. N&aring;r dette alternativet er aktivert, er UNIX-tillatelser 644 for filer og 755 for mapper. N&aring;r dette alternativet er deaktivert, er UNIX-tillatelser 666 for filer og 777 for mapper. Standard umask-verdi er 022.</p>

<div class="section"><h4>Merk:</h4>
<p>Aktivering av dette alternativet kan for&aring;rsake problemer med inkonsekvente tillatelser mellom forskjellige protokoller. For &aring; unng&aring; inkonsekvens, foresl&aring;r vi at dette alternativet er deaktivert.</p>
</div>

<h4>Frigi ressurser umiddelbart etter frakobling:</h4>
<p>Aktivering av dette alternativet frigir ressurser umiddelbart n&aring;r AFP-servertilkoblingen uventet blir avbrutt. Hvis du mottar &quot;Volum i bruk&quot;-feilmeldinger mens du bruker Time Machine, aktiverer du dette alternativet.</p>



<h4 class="disable-hi3535">Slik s&oslash;ker du etter filinnhold med Finder:</h4>
<p class="disable-hi3535">N&aring;r mappene er indeksert og montert p&aring; Mac-datamaskinen din, kan du bruke Finder til &aring; s&oslash;ke etter innhold i iboende filer.</p>
<ol class="disable-hi3535">
	<li>G&aring; til <strong>Universal Search</strong> &gt; <strong>Preferanser</strong> &gt; <strong>Filindeksering</strong> &gt; <strong>Indeksert mappeliste</strong> &gt; <strong>Opprett</strong> for &aring; indeksere spesifikke mapper og iboende filer etter filtype.</li>
	<li>Klikk p&aring; <strong>OK</strong> for &aring; utf&oslash;re indekseringen.</li>
	<li>Monter de indekserte mappene p&aring; Mac-datamaskinen din.</li>
	<li>P&aring; Mac-datamaskinen din klikker du p&aring; &oslash;nsket montert mappe i panelet til venstre i Finder og bruker Finder til &aring; s&oslash;ke etter innhold i iboende filer.</li>
</ol>

<div class="section disable-hi3535"><h4>Merk:</h4>
<ul>
	<li>Bruk Finder til &aring; s&oslash;ke i monterte mapper. Spotlight p&aring; Mac-skrivebordet kan kun brukes til &aring; s&oslash;ke etter lokale filer.</li>
	<li>I Mac OS X 10.9 og nyere versjoner har Finder st&oslash;tte for s&oslash;k i monterte mapper etter taggnavn og kategori.</li>
</ul>
</div>

</body>
</html>