<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Opprette en delt mappe - Synology DSM Hjelp</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Shared folders are the basic directories where you can store and manage files and folders on your Synology NAS. This article shows you how to create a shared folder.">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Opprette en delt mappe</h2>
<p>Delte mapper er grunnleggende kataloger hvor du kan lagre og administrere filer og mapper p&aring; din Synology NAS. F&oslash;r du lagrer filer, m&aring; du opprette minst &eacute;n delt mappe i DSM. </p>

<h4>Slik oppretter du en delt mappe:</h4>
<ol>
	<li>G&aring; til <strong>Kontrollpanel</strong> &gt; <strong>Delt mappe</strong> og klikk p&aring; <strong>Opprett</strong>.<br /><img src="about:blank" class="help_image"/></li>
	<li>Spesifiser et navn og en beskrivelse for den delte mappen.<br /><img src="about:blank" class="help_image disable-bromolow disable-grantley disable-avoton disable-braswell disable-broadwell disable-kvmx64 disable-cedarview disable-apollolake disable-denverton"/><img src="about:blank" class="help_image enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"/></li>
	<li>Velg et lagringsomr&aring;de hvor du vil opprette den delte mappen (hopp over dette trinnet hvis det kun eksisterer ett lagringsomr&aring;de).<br /><img src="about:blank" class="help_image disable-bromolow disable-grantley disable-avoton disable-braswell disable-broadwell disable-kvmx64 disable-cedarview disable-apollolake disable-denverton"/><img src="about:blank" class="help_image enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"/></li>
	<li>Endre f&oslash;lgende alternativer, om n&oslash;dvendig:<br /><img src="about:blank" class="help_image disable-bromolow disable-grantley disable-avoton disable-braswell disable-broadwell disable-kvmx64 disable-cedarview disable-apollolake disable-denverton"/><img src="about:blank" class="help_image enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"/>
		<ul>
			<li><strong>Skjul denne delte mappen i &rdquo;Mine nettverkssteder&rdquo;:</strong> Forhindrer at den delte mappen vises under &quot;Nettverk&quot; i Windows-filutforsker. Dette alternativet p&aring;virker ikke tilgangsrettighetene til den delte mappen.
				<div class="section"><h4>Merk:</h4>
				<ul>
				<li>&Aring; skjule en delt mappe i Mine nettverkssteder har ingen innvirkning p&aring; tilgangsrettighetene. Tilgangsrettighetene til den skjulte delte mappen vil forbli uforandret. Brukere som har tilstrekkelige tilgangsrettigheter til den delte mappen, kan fremdeles f&aring; tilgang til den ved &aring; skrive inn &quot;\\server name\shared folder name&quot;.</li>
				</ul>
				</div>
			</li>
			<li><strong>Skjul undermapper og filer for brukere uten tillatelser:</strong>N&aring;r <strong>Skjul undermapper og filer for brukere uten tillatelser</strong> er aktivert, kan ikke en bruker uten leserettigheter som pr&oslash;ver &aring; &aring;pne en delt mappe gjennom Windows File Sharing-protokoll se undermapper eller filer i den delte mappen. Dette forhindrer at brukere blir forvirret n&aring;r de kobler seg til Synology-produktene sine og st&oslash;ter p&aring; et stort antall filer og undermapper som de ikke kan &aring;pne.
				<div class="section"><h4>Merk:</h4>
				<ul>
					<li>Denne funksjonen st&oslash;ttes kun med Windows File Sharing-protokoll.</li>
					<li>Du kan endre rettighetsinnstillinger for hver mappe og fil i File Station ved &aring; h&oslash;yreklikke p&aring; dem. Velg <strong>Egenskaper</strong> i rullegardinmenyen og klikk p&aring; fanen <strong>Tillatelse</strong>.</li>
					<li>Selve den delte mappen vil ikke bli skjult for brukere uten tillatelser ved &aring; aktivere <strong>Skjul undermapper og filer for brukere uten tillatelser</strong>. Kun undermappene og filene i denne delte mappen vil bli skjult.</li>
				</ul>
				</div>
			</li>
		</ul>
	</li>
	<li><strong>Aktiver papirkurv:</strong> N&aring;r filer i den delte mappen slettes, vil de bli flyttet til en mappe med navnet <strong>#recycle</strong>. Tilgang til papirkurven kan begrenses til brukere som tilh&oslash;rer gruppen <strong>administrators</strong>.</li>
	<a name="sharequota"></a><li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><strong>Aktiver kvote for delt mappe:</strong> For &aring; spesifisere maksimumskapasiteten for hver mappe, merker du av for <strong>Aktiver kvote for delt mappe</strong> og angir maksimumskapasiteten (f.eks. 10 GB) i f&oslash;lgende felt.
		<div class="section"><h4>Merk:</h4>
		<ul>
			<li>Kun n&aring;r lagringsomr&aring;det bruker Btrfs-filsystemet vil alternativet <strong>Aktiver kvote for delt mappe</strong> v&aelig;re tilgjengelig for delte mapper.</li>
			<li>Det kombinerte lagringsforbruket til alle brukernes <strong>home</strong>-kataloger kan ikke overskride kvoten for &quot;<strong>homes</strong>&quot;.</li>
		</ul>
		</div>
	</li>
	<a name="integrity_protection"></a><li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><strong>Aktiver avansert beskyttelse av dataintegritet:</strong> For &aring; beskytte en delt mappe med <strong>CRC32 checksum</strong> og <strong>kopier-ved-skriving</strong>, kan du <strong>aktivere avansert beskyttelse av dataintegritet</strong> ved opprettingen av den delte mappen. CRC32 checksum brukes til &aring; kontrollere om dataene er identiske med da de opprinnelig ble skrevet, og vil varsle brukeren hvis datakorrupsjon oppdages. Kopier-ved-skriving bidrar til &aring; forbedre datakonsistens ved unormale systemavslutninger.
		<div class="section"><h4>Merk:</h4>
		<ul>
			<li>Dette alternativet er kun tilgjengelig for volumene som bruker Btrfs-filsystemet.</li>
			<li>Du kan aktivere/deaktivere dette alternativet for hver delt mappe ved oppretting. Dette alternativet kan ikke endres etter at den delte mappen er opprettet.</li>
			<li>Hvis filer, f.eks. databaser, endres og oppdateres kontinuerlig, kan andelen fragmenterte filer &oslash;ke pga. kopiering ved skriving. Det blir anbefalt at du deaktiverer dette alternativet for &aring; forbedre ytelsen.</li>
		</ul>
		</div>
	</li>
    <a name="btrfs_compression"></a><li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><strong>Aktiver filkomprimering</strong>: Data i den opprettede delte mappen blir automatisk komprimert av Btrfs-filsystemet for &aring; spare lagringsplass. N&aring;r dataene hentes for bruk, blir de pakket ut automatisk.
		<div class="section"><h4>Merk:</h4>
		<ul>
			<li>Dette alternativet er kun tilgjengelig n&aring;r du oppretter en delt mappe i et Btrfs-volum, eller n&aring;r <strong>Avansert beskyttelse av dataintegritet</strong> er aktivert.</li>
			<li>Dette alternativet kan ikke endres etter at den delte mappen er opprettet.</li>
			<li>Komprimeringsgraden varierer i henhold til datatyper: Tekstfiler har den h&oslash;yeste komprimeringsgraden, mens multimediafiler (f.eks. bilder, musikk eller videoer) muligens ikke kan komprimeres s&aring; mye siden de allerede er komprimert for utdata.</li>
            <li>Dette alternativet kan ikke aktiveres hvis kryptering av delt mappe er aktivert.</li>
		</ul>
		</div>
	</li>
	<li><strong>Krypter denne delte mappen:</strong> Dersom du &oslash;nsker &aring; kryptere den delte mappen, gj&oslash;r du som f&oslash;lger:
		<ol>
			<li>Spesifiser og bekreft en ny krypteringsn&oslash;kkel. Krypteringsn&oslash;kkelen kan ikke inneholde komma (,) eller er-lik-tegn (=). </li>
			<li>Om n&oslash;dvendig, merker du av for <strong>Legg til krypteringsn&oslash;kkel i N&oslash;kkelbehandling</strong> for &aring; montere den krypterte mappen automatisk n&aring;r systemet starter opp. Hvis dette alternativet er deaktivert, vil den krypterte delte mappen v&aelig;re umontert neste gang Synology NAS starter. Hvis du vil vise eller f&aring; tilgang til en demontert delt mappe, m&aring; du montere mappen manuelt ved &aring; importere eller angi krypteringsn&oslash;kkelen.</li>
		</ol>
	</li>
	<li>Klikk p&aring; <strong>OK</strong> for &aring; fullf&oslash;re.</li>
</ol>

<div class="section"><h4>Navneregler for delt mappe:</h4>
<ul>
	<li>Navn p&aring; delte mapper skiller mellom store og sm&aring; bokstaver og kan inneholde 1-32 tegn. Navn kan ikke inneholde f&oslash;lgende tegn: <strong>! &quot; # $ % &amp; ' ( ) * + , / : ; &lt;= &gt; ? @ [ ] \ ^ ` { } | ~</strong></li>
	<li>F&oslash;lgende navn er reservert for systembruk: <strong>.</strong>, <strong>..</strong>, <strong>global</strong>, <strong>home</strong>, <strong>homes</strong>, <strong>printers</strong>, <strong>public</strong>, <strong>satashare</strong>, <strong>surveillance</strong>, <strong>usbbackup</strong>, <strong>usbshare</strong>. </li>
	<li>Det f&oslash;rste tegnet i et delt mappenavn kan ikke v&aelig;re et minustegn eller et mellomrom, og det siste tegnet kan ikke v&aelig;re et mellomrom.</li>
	<li>Den delte mappen <strong>description</strong> skiller mellom store og sm&aring; bokstaver og kan best&aring; av inntil 64 visbare Unicode-tegn.</li>
</ul>
</div>


<div class="section"><h4>Kryptere delte mapper:</h4>
<p>AES 256-bit-kryptering beskytter data ved &aring; blokkere alle ikke-autoriserte tilgangsfors&oslash;k. N&aring;r en delt mappe er kryptert, vil ikke personer uten krypteringsn&oslash;kkelen f&aring; tilgang til eller kunne endre de krypterte dataene selv om de fjerner harddiskene fra din&nbsp;Synology NAS og monterer dem p&aring; en annen enhet.</p>
</div>

<div class="section"><h4>Merk:</h4>
<ul>
	<li>Navnet p&aring; filer eller mapper i krypterte delte mapper kan ikke overskride 143 engelske tegn eller 47 asiatiske (CJK) tegn; hvis du &aring;pner delte mapper i Mac OS, kan ikke navnet p&aring; filer eller mapper i krypterte delte mapper overskride 130 engelske tegn eller 43 asiatiske (CJK) tegn. </li>
	<li>Du f&aring;r ikke tilgang til krypterte, delte mapper via NFS.</li>
	<li>Hvis passord blir gjenopprettet til standard med reset-knappen p&aring; Synology NAS, vil krypterte delte mapper bli demontert, og alternativet for &aring; montere krypterte delte mapper automatisk vil bli deaktivert.</li>
	<li class="enable-dockerx64">Krypterte delte mapper st&oslash;ttes kun i utvidede rettigheter-modus. For &aring; bruke denne funksjonen, g&aring;r du til Docker-pakken p&aring; verts-DSM, velger den <strong>Docker DSM</strong> du vil aktivere krypterte delte mapper for, klikker p&aring; <strong>Rediger</strong> og merker av for <strong>Utf&oslash;r container med utvidede rettigheter</strong>.</li>
</ul>
</div>

</body>
</html>