<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Delt mappe</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Filindeks</h2>
<p>
Indeksering av en delt mappe eller undermapper gjør at du raskt kan finne iboende filer og innhold med filsøk.
</p>


<div class="section">
<h4>Merk:</h4>
<p>Eksterne mapper, skymapper eller .iso-mapper som er montert til din Synology NAS kan ikke indekseres.</p>
</div>


<h4>Slik indekserer du mapper og filinnhold:</h4>
<p>N&aring;r du indekserer en mappe, vil File Station indeksere den og iboende undermappper/filer etter navn slik at du enkelt kan s&oslash;ke etter elementer etter filnavn. Hvis du indekserer videre etter filtype, vil File Station indeksere korresponderende filer etter innhold i tillegg til navn; da kan du s&oslash;ke etter elementer etter filnavn og filinnhold.
</p>


<ol>
<li>G&aring; til <strong>Kontrollpanel</strong> &gt; <strong>Indekseringstjeneste</strong> &gt; <strong>Filindeksering</strong> og klikk p&aring; <strong>Indeksert mappeliste</strong>.</li>
<li>I vinduet som &aring;pnes klikker du p&aring; <strong>Opprett</strong> &gt; <strong>Velg</strong> for &aring; vise mapper som er klare for indeksering.</li>
<li>Velg &oslash;nsket mappe og klikk p&aring; <strong>Velg</strong>. For &aring; opprette en ny mappe for indeksering, klikker du p&aring; <strong>Opprett mappe</strong> og fortsetter.</li>
<li>Klikk p&aring; mappen du vil indeksere og deretter p&aring; <strong>Velg</strong>.</li>
<li>For &aring; indeksere spesifikke filtyper, g&aring;r du til <strong>Filtype</strong> og velger <strong>Bilde</strong>, <strong>Lyd</strong>, <strong>Video</strong>, eller <strong>Dokument</strong>. Hvis en filtype (f.eks. <strong>Lyd</strong>) ikke er valgt, kan du kun s&oslash;ke etter filer av den typen (f.eks. lydfiler) med filnavn.</li>

<li>Klikk p&aring; <strong>OK</strong> for &aring; fullf&oslash;re indekseringen.</li>
</ol>

<div class="section">
<h4>Merk:</h4>
<ul>
<li>Du kan kun velge opptil 1000 mapper for indeksering; undermapper i de valgte mappene er ikke inkludert i dette antallet.</li>
<li>Hvis du velger <strong>Aktiver s&oslash;k i filinnhold</strong> i File Station, kan du s&oslash;ke i filinnholdet i de indekserte mappene.</li>
<li>Volumet som verter den indekserte mappen m&aring; ha minst 10 MB ledig plass. Ellers vil indekseringen bli stanset. For &aring; gjenoppta indekseringen, utvider du volumet og klikker p&aring; <strong>Re-indekser</strong>.</li>
<li>Hvis du indekserer en mappe og undermappen(e) i den samtidig, vil systemet kun indeksere undermappen(e) for &aring; spare systemressurser.</li>
<li class="disable-hi3535">N&aring;r mappene er indeksert og montert p&aring; en Mac-datamaskin via SMB- eller AFP-protokoll, kan du bruke Finder til &aring; s&oslash;ke etter filinnhold.</li>
</ul>

</div>


<h4>Slik sletter du indekserte mapper:</h4>

<ol>
<li>Gå til <strong>Kontrollpanel</strong> > <strong>Indekseringstjeneste</strong> > <strong>Filindeksering</strong> > <strong>Indeksert mappeliste</strong> og velg de aktuelle indekserte mappene.</li>
<li>Klikk på <strong>Slett</strong> for å avslutte indeksering av mappene.</li>
</ol>

<h2>Ang-indeks filer</h2>
<p>
Re-indeksering av filer kreves ikke under normale omstendigheter. Hvis filer i en mappe samsvarer med spesifikke søkekriterier, men ikke dukker opp i filsøket, må du imidlertid kanskje utføre en re-indeksering for å rekonstruere indeksstrukturen.
</p>
<h4>Slik re-indekserer du filer i en delt mappe:</h4>
<ol>
<li>Gå til <strong>Kontrollpanel</strong> > <strong>Indekseringstjeneste</strong> > <strong>Filindeksering</strong> > <strong>Indeksert mappeliste</strong>.</li>
<li>Velg mappene på listen som du vil re-indeksere.</li>
<li>Klikk på <b>Re-indekser</b>.</li>
</ol>

<div class="section">
<h4>Merk:</h4>
<p>File Station støtter ikke filindeksering på eksterne mapper eller eksterne lagringsenheter (f.eks. USB-stasjoner/SD-kort).</p>
</div>


<h2>Administrer filindeksering via skrivebord</h2>
<p>Når filindekseringen starter, finner du <strong>Indekseringsfremdrift</strong> (et svevende forstørrelsesglassikon) på oppgavelinjen. Siden filindeksering trenger flere CPU-ressurser, kan du her tilpasse CPU-ressursene.</p>


<ul>
<li>For å pause/gjenoppta filindekseringen, klikker du på avspillingsknappen.</li>
<li>For å utsette filindekseringen til et mer egnet tidspunkt, velger du alternativet i rullegardinmenyen.</li>
<li>For å se mappene som indekseres, klikker du på <strong>Vis indeksert mappeliste</strong>.</li>
</ul>

<div class="section">
<h4>Merk:</h4>
<ul>
<li>Hvis du pauser indekseringshandlingen, kan den kun gjenopptas ved å klikke på avspillingsknappen på skrivebordets oppgavelinje.</li>
</ul>

</div>


</body>
</html>
