<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Domene</h2>

<p>Din Synology NAS kan knytte seg til et Windows-domene. N&aring;r domenet er tilknyttet, kan domenebrukere logge inn p&aring; Synology NAS ved hjelp av domenekontoene og passordene sine, slike at de kan f&aring; tilgang til filer og bruke DSM-programmer uten &aring; m&aring;tte huske et nytt sett med brukernavn og passord.</p>

<h4>Slik kobler du deg til et domene:</h4>
<ol>
	<li>G&aring; til <strong>Kontrollpanel</strong> &gt; <strong>Katalogtjeneste</strong> &gt; <strong>Domene</strong>.</li>
	<li>Merk av for <strong>Koble til domene</strong>.</li>
	<li>Angi domenenavnet og spesifiser DNS Server i egnede felt.</li>
	<li>Om n&oslash;dvendig, merker du av for <strong>Avanserte domenealternativer</strong>. (Se nedenfor for detaljer.)</li>
	<li>Klikk p&aring; <strong>Bruk</strong>.</li>
	<li>Skriv inn brukernavn og passord til administratoren til domeneserveren i popup-vinduet.</li>
	<li>Klikk p&aring; <strong>OK</strong>.</li>
</ol>

<div class="section"><h4>DNS Server</h4>
<p>Det anbefales at du angir en DNS-server for &aring; hjelpe Synology NAS med &aring; s&oslash;ke etter domenet. Hvis domenet ikke er registrert p&aring; DNS Server, kan imidlertid fremgangsm&aring;ten for &aring; knytte seg til et domene mislykkes.</p>

<h4>Domeneservertype</h4>
<p>Dette feltet viser domenetypen n&aring;r Synology NAS blir koblet til et domene. Domenetypen vil v&aelig;re &quot;AD-domene&quot;.</p>

<h4>Administrasjonsmodus</h4>
<p>Dette alternativet vil avgj&oslash;re hvordan du administrerer rettighetene til domenebrukere og grupper. </p>
<ul>
	<li><strong>P&aring;litelig domene</strong>: Du kan administrere brukere og grupper i det felles domenet og i p&aring;litelige domener. Brukere og grupper kan filtreres med rullegardinlisten for domene.</li>
	<li><strong>Enkelt domene med OU</strong>: Kun brukere og grupper i det felles domenet vil vises i denne modusen. Denne modusen lar deg filtrere domenebrukere/domenegrupper med rullegardinlisten OU (Organizational Unit - organisatorisk enhet).</li>
</ul>

<h4>Avanserte domenealternativer</h4>
<p>I de fleste tilfeller trenger du ikke fylle ut noen av de avanserte domenealternativene. Avanserte domenealternativer er bare n&oslash;dvendige i visse nettverksmilj&oslash;er. </p>
<ul>
	<li><strong>DC IP/FQDN</strong>: Angi en DC (Domain Controller) IP-adresse eller FQDN, s&aring; vil Synology NAS pr&oslash;ve &aring; kommunisere med den. Hvis det er mer enn &eacute;n IP-adresse eller FQDN, m&aring; du sette inn et komma (,) mellom hver av dem. Hvis du vil, kan du legge til en stjerne (*) etter siste DC IP-adresse eller FQDN, s&aring; vil Synology NAS pr&oslash;ve &aring; kommunisere med den andre DC-en hvis alle de angitte mislykkes. Du m&aring; legge til et komma mellom stjernen og siste IP-adresse eller FQDN.</li>
	<li><strong>Domene-NetBIOS-navn</strong>: Angi NetBIOS-navnet til domenet.</li>
	<li><strong>Domene-FQDN (DNS-navn)</strong>: Angi FQDN (DNS-navnet) til domenet.</li>
	<li><strong>Registrer DNS-grensesnitt</strong>: N&aring;r man kobler til et domene, blir nettverkskortet (NIC) som er spesifisert her registrert med DNS Server. V&aelig;r oppmerksom p&aring; at dersom vertsnavnet til Synology NAS inkluderer en understrek (_), vil registreringen mislykkes fordi understreker (_) ikke kan brukes med DNS.</li>
	<li><strong>Oppdater bruker-/gruppeliste</strong>: Spesifiser hvor ofte Synology NAS skal oppdatere liste over domenebrukere/-grupper. Du kan egendefinere tidsperioden til &aring; utf&oslash;re oppdateringer daglig, ukentlig eller m&aring;nedlig. I tillegg kan lister over domenebrukere/-grupper oppdateres manuelt ved &aring; g&aring; til fanen <strong>Domenebruker</strong> og klikke p&aring; <strong>Oppdater alle domener</strong>. V&aelig;r oppmerksom p&aring; at automatiske oppdateringer vil ha innvirkning p&aring; systemdvale.</li>
</ul>

<h4>Koble til skrivebeskyttet domenekontroller</h4>
<p>For &aring; koble din Synology NAS til en skrivebeskyttet domenekontroller (RODC), m&aring; du spesifisere &quot;fullt datamaskinnavn&quot; (FQDN) for din skrivebeskyttede domenekontroller (RWDC) i feltet <strong>DC IP/FQDN</strong>. Det fulle datamaskinnavnet m&aring; v&aelig;re i f&oslash;lgende format: <strong>Datamaskinnavn.Domene</strong>, f.eks. &quot;ad01.synology.com&quot;.</p>
</div>


<div class="section"><h4>Merk:</h4>
<ul>
	<li>Hvis brukernavnet for domenet inkluderer &quot;%&quot; eller &quot;$&quot;, vil du kanskje ikke f&aring; tilgang til home-mappen. Be domeneadministratoren gi deg et nytt brukernavn.</li>
	<li>Domenegruppene <strong>Domeneadminer</strong> og <strong>Selskapsadminer</strong> vil automatisk bli lagt til den lokale gruppen <strong>administrators</strong>. Derfor vil domenebrukere i disse gruppene ha administrative rettigheter p&aring; Synology NAS, inkludert tilgang til filtjenester som CIFS/FTP/AFP/WebDAV og andre DSM-programmer.</li>
	<li>Du kan ogs&aring; konfigurere domenebrukernes tilgangsrettigheter til de delte mappene p&aring; Synology NAS. Se <a href="file_directory_service_user_group.html">her</a> for mer informasjon.</li>
</ul>
</div>

<h3>Domenealternativer</h3>

<p>Dette avsnittet inkluderer de ytterligere domenealternativene nedenfor.</p>
<ul>
	<li><strong>DiskStation vil synkronisere med en NTP-server hver gang n&aring;r en domenebruker logger seg p&aring;</strong>: Aktivering av dette alternativet vil tvangssynkronisere tiden mellom Synology NAS og NTP-server.</li>
	<li><strong>Aktiver serversignering</strong>: Hvis klienten har aktivert klientsignering, m&aring; serversignering ogs&aring; v&aelig;re aktivert p&aring; Synology NAS, slik at brukere kan bruke domenetjenestene som normalt.</li>
	<li><strong>F&aring; bruker-/gruppelister med NT4-kompatibelmodus</strong>: Aktivering av dette alternativet lar systemet hente lister over brukere/grupper ved hjelp av NT4 RPC-modus. Dette alternativet kan aktiveres hvis enkelte lister over domenebrukere/-grupper ikke kan hentes med vanlige innstillinger.</li>
	<li><strong>Deaktiver administratorrettigheter for domene- og virksomhetsadminer</strong>: En bruker med administratorrettigheter kan ha fullstendig kontroll over din Synology NAS og filene p&aring; den. Aktivering av dette alternativet vil la deg begrense rettighetene til domene- og virksomhetsadminer til de samme som for en normal bruker, og dermed gi dem alle fil-/mappetillatelser som normale brukere f&aring;r.</li>
	<li><strong>Spesifiser nestede gruppeniv&aring;er</strong>: Spesifiser antall nestede domenegruppemedlemmer som kan listes opp.</li>
</ul>

<h3>Kontroll av domenestatus</h3>

<p>Du kan klikke p&aring; <strong>Kontroll av domenestatus</strong> for &aring; kontrollere statusen til tilkoblingen mellom DSM og domeneserveren den er tilknyttet. For mer informasjon om feils&oslash;king kan du se de f&oslash;lgende kontrollelementer:</p>
<ul>
	<li><strong>Kontroller at tilkoblingen mellom Synology NAS og Active Directory-serveren fungerer som den skal</strong>: Synology NAS kan ikke kommunisere med Active Directory-serveren.
		<ul>
			<li>Kontroller at portene 389, 139 og 445 fungerer som de skal p&aring; Active Directory-serveren.</li>
			<li>Kontroller at NTDS-tjenesten fungerer som den skal p&aring; Active Directory-serveren.</li>
		</ul>
	</li>
	<li><strong>Kontroller om det eksisterer vertsnavn i konflikt p&aring; delnettet</strong>: Synology NAS-enheten din har et vertsnavn som allerede eksisterer p&aring; delnettet.
		<ul>
			<li>Hvis Synology NAS-enheten er tilkoblet delnettet med flere nettverksgrensesnitt, vil DSM fungere som det skal.</li>
			<li>Hvis Synology NAS-enheten er tilkoblet delnettet med kun ett nettverksgrensesnitt, m&aring; du endre vertsnavnet p&aring; Synology NAS-enheten og koble den til domenet p&aring; nytt.</li>
		</ul>
	</li>
	<li><strong>Kontroller at tilkoblingen mellom Synology NAS og Kerberos-serveren fungerer som den skal</strong>: Synology NAS kan ikke kommunisere med Kerberos-serveren.
		<ul>
			<li>Kontroller at riktig Kerberos DNS SRV-post og relatert A-post er satt opp p&aring; DNS-serveren.</li>
			<li>Kontroller at port 88 er tilgjengelig p&aring; KDC-serveren.</li>
		</ul>
	</li>
	<li><strong>Kontroller at tilkoblingen mellom Synology NAS og LDAP-serveren fungerer som den skal</strong>: Synology NAS kan ikke kommunisere med LDAP-serveren.
		<ul>
			<li>Kontroller at riktig LDAP DNS SRV-post og relatert A-post er satt opp p&aring; DNS-serverne.</li>
			<li>Kontroller at port 389 er tilgjengelig p&aring; LDAP-serveren.</li>
		</ul>
	</li>
	<li><strong>Kontroller at MTU er riktig konfigurert for &aring; forsikre deg om at tilkoblingen mellom Synology NAS og domenekontroller fungerer som normalt</strong>: &Eacute;n eller flere svitsjer droppet pakker som ble overf&oslash;rt mellom Synology NAS og Active Directory Server pga. ugyldig MTU-st&oslash;rrelse p&aring; pakkene.
		<ul>
			<li>Kontroller grensesnittinnstillingene for svitsjer mellom Synology NAS og Active Directory Server.</li>
		</ul>
	</li>
	<li><strong>Kontroller at tiden er synkronisert mellom Synology NAS og domenet</strong>: Tiden p&aring; Synology NAS-enheten din er ikke synkronisert med domeneserveren.
		<ul>
			<li>Du kan sette opp NTP-tjeneste p&aring; Synology NAS for &aring; synkronisere tiden med domeneserveren, eller aktivere alternativet <strong>Synology NAS vil synkronisere med en NTP-server hver gang en domenebruker logger inn</strong> i <strong>Domenealternativer</strong>.</li>
		</ul>
	</li>
</ul>

</body>
</html>