<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Avanserte brukerinnstillinger</h2>

<p>For &aring; endre avanserte brukerinnstillinger, kan du g&aring; til <strong>Kontrollpanel</strong> &gt; <strong>Bruker</strong> &gt; <strong>Avansert</strong>. Alternativene nedenfor er tilgjengelige. </p>

<h3>Passordinnstillinger</h3>
<p>Du kan sette opp innstillinger for passordsikkerhet og regler for passordstyrke for brukere p&aring; din Synology NAS.</p>

<h4>Slik lar du brukere som ikke er admin tilbakestille glemte passord via e-post:</h4>
<ol>
	<li>Merk av for <strong>Tillat at brukere som ikke er admin kan tilbakestille glemte passord via e-post</strong>.</li>
	<li>Klikk p&aring; <strong>Bruk</strong> for &aring; lagre innstillingene.</li>
	<li>Koblingen &laquo;Glemt passordet ditt?&raquo; blir vist p&aring; DSM-innloggingssiden. N&aring;r passordet er glemt, kan brukeren klikke p&aring; denne koblingen og angi brukernavnet. I s&aring; tilfelle, vil systemet sende en e-post med en kobling for &aring; tilbakestille det glemte passordet.</li>
</ol>

<div class="section"><h4>Merk:</h4>
<ul>
	<li>F&oslash;r du aktiverer dette alternativet, m&aring; du forsikre deg om at du allerede har aktivert SMTP-e-postvarslinger. For &aring; gj&oslash;re dette, g&aring;r du til <strong>Kontrollpanel</strong> &gt; <strong>Varsling</strong>.</li>
	<li>For &aring; motta meldinger fra systemet, m&aring; brukere oppgi en e-postadresse i kontoseksjonen for brukerinformasjon.</li>
	<li>Brukere som tilh&oslash;rer gruppen <strong>administrators</strong> kan ikke tilbakestille passord med dette alternativet.</li>
	<li>Domenebrukere kan ikke tilbakestille passord med dette alternativet.</li>
	<li>LDAP-brukere kan tilbakestille passord med dette alternativet, s&aring; lenge Synology NAS tjener som LDAP-katalogserver og oppfyller f&oslash;lgende betingelser:
		<ul>
			<li>Synology <strong>Directory Server</strong>-pakkeversjonen m&aring; v&aelig;re 2457 eller nyere.</li>
			<li>LDAP-bruker kan ikke v&aelig;re medlem av gruppene administrators, Directory Operators, Directory Consumers eller Directory Clients.</li>
			<li>Hvis Synology Directory Server er en <strong>Consumer</strong>, m&aring; <strong>Provider</strong> oppfylle betingelsene som er beskrevet ovenfor.</li>
			<li>Den siste Provider-serveren m&aring; v&aelig;re tilgjengelig fra brukerens nettleser, og epostvarslinger m&aring; v&aelig;re aktivert.</li>
			<li>For &aring; unng&aring; at koblingen for &aring; tilbakestille glemt passord blir brukt av noen andre, m&aring; koblingen klikkes p&aring; fra IP-adressen som ble brukt til &aring; be om nytt passord.</li>
		</ul>
	</li>
</ul>
</div>

<h4>Slik tvinger du brukere til &aring; endre passord ved tilbakestilling av passord:</h4>
<ol>
	<li>Merk av for <strong>Tving brukere til &aring; endre passord etter at administrator har tilbakestilt passordet</strong>.</li>
	<li>Klikk p&aring; <strong>Bruk</strong> for &aring; lagre innstillingene.</li>
	<li>N&aring;r administratoren endrer passordet til en bruker, m&aring; brukeren endre passordet sitt ved neste innlogging.</li>
</ol>

<h4>Slik aktiverer du regler for passordstyrke:</h4>
<ol>
	<li>Merk av for <strong>Bruk regler for passordstyrke</strong>.</li>
	<li>Merk av eller fjern avmerking for f&oslash;lgende alternativer i henhold til dine behov:
		<ul>
			<li><strong>Ekskluder navn og beskrivelse av bruker fra passord</strong>: Passordet m&aring; ikke inneholde brukernavnet eller brukerbeskrivelsen. Men UTF-8 utvidede tegn er ekskludert.</li>
			<li><strong>Inkluder blanding av sm&aring; og store bokstaver</strong>: Passordet m&aring; inneholde b&aring;de store og sm&aring; bokstaver.</li>
			<li><strong>Inkluder numerisk tegn</strong>: Passordet m&aring; inneholde minst ett numerisk tegn (0~9).</li>
			<li><strong>Inkluder spesialtegn</strong>: Passordet m&aring; inneholde minst ett ASCII-spesialtegn (dvs. <span class="note_content">~ ` ! @ # $ % ^ &amp; * ( ) - _ = + [ { ] } \ | ; : ' &quot; &lt; &gt; / ?</span>).</li>
			<li><strong>Ekskluder vanlige passord</strong>: Hindre brukere i &aring; angi vanlige passord, som <em>123456</em>, <em>password</em>, <em>qwerty</em>, osv.</li>
			<li><strong>Minimal passordlengde</strong>: Passordet m&aring; minst v&aelig;re verdien som er spesifisert i tekstfeltet. Lengden m&aring; v&aelig;re et tall mellom 6 og 127.</li>
			<li><strong>Passordhistorikk</strong>: Passordet kan ikke v&aelig;re brukt tidligere. Antall passord som inkluderes i historikken spesifiseres her.</li>
		</ul>
	</li>
	<li>Klikk p&aring; <strong>Bruk</strong> for &aring; lagre innstillingene.</li>
</ol>

<div class="section"><h4>Merk:</h4>
<ul>
	<li>Regler for passordstyrke gjelder kun for nye passord. For eksempel, nye regler for passordstyrke gjelder kun n&aring;r man oppretter en ny brukerkonto eller n&aring;r en eksisterende bruker endrer passordet sitt. Eksisterende passord og de som tilh&oslash;rer importerte brukerkontoer er unntatt de nye passordreglene.</li>
</ul>
</div>

<h3>Utl&oslash;pstid for passord</h3>
<p>Du kan &oslash;ke sikkerheten til brukerkontoer ved &aring; bruke funksjonen for passordutl&oslash;p til &aring; tvinge brukere til &aring; endre passord etter en spesifisert tidsperiode.</p>

<h4>Slik setter du opp tidsplan for passordutl&oslash;p:</h4>
<ol>
	<li>Merk av for <strong>Aktiver utl&oslash;pstid for passord</strong>.</li>
	<li>F&oslash;lgende alternativer kan konfigureres:
		<ul>
			<li><strong>Maksimum gyldighetsperiode for passord</strong>: Spesifiser antall dager f&oslash;r passordet utl&oslash;per.</li>
			<li><strong>Minimum gyldighetsperiode for passord</strong>: Merk av i boksen for &aring; aktivere denne funksjonen og spesifiser antall dager f&oslash;r brukere f&aring;r tillatelse til &aring; endre passordene sine.</li>
			<li><strong>Be brukere endre passord ved innlogging f&oslash;r utl&oslash;p</strong>: Merk av i boksen for &aring; aktivere denne funksjonen og spesifiser antall dager f&oslash;r passordutl&oslash;pet brukere skal f&aring; p&aring;minnelse om &aring; endre passordet ved innlogging.</li>
			<li><strong>La brukere endre passord etter utl&oslash;p</strong>: Merk av i boksen for &aring; la brukere logge inn med passordet sitt som er utl&oslash;pt for &aring; endre passordene sine.</li>
			<li><strong>Send e-postvarsling om utl&oslash;pstid</strong>: Merk av i boksen for &aring; varsle brukere om passordutl&oslash;p via e-post.</li>
		</ul>
	</li>
	<li>Klikk p&aring; <strong>Bruk</strong> for &aring; lagre innstillingene.</li>
</ol>

<h3>2-trinnsverifikasjon</h3>
<p>2-trinnsverifikasjon gir deg forbedret sikkerhet for DSM-brukerkontoer. Du kan tvinge DSM-administratorer eller alle DSM-brukere til &aring; aktivere 2-trinnsverifikasjon for ytterligere beskyttelse for kontoene deres.</p>

<h4>Slik tvinger du gjennom 2-trinnsverifikasjon for DSM-brukere:</h4>
<ol>
	<li>Merk av for <strong>Bruk 2-trinnsverifikasjon for f&oslash;lgende brukere</strong> og velg hvilke brukere du vil ta i bruk dette for.</li>
	<li>Klikk p&aring; <strong>Bruk</strong> for &aring; lagre innstillingene.</li>
	<li>N&aring;r alternativet er tatt i bruk, vil brukere som ikke har aktivert 2-trinnsverifikasjon bli bedt om &aring; fullf&oslash;re innstillingene f&oslash;r de kan logge seg inn p&aring; DSM.</li>
</ol>

<div class="section"><h4>Merk:</h4>
<ul>
	<li>Hvis du ikke har konfigurert 2-trinnsverifikasjon enn&aring; i <strong>Personlig</strong> &gt; <strong>Konto</strong>, vil oppsettveiviseren for 2-trinnsverifikasjon &aring;pnes for &aring; hjelpe deg med &aring; fullf&oslash;re de p&aring;krevde innstillingene f&oslash;r du kan ta i bruk dette alternativet.</li>
	<li>Deaktivering av tvunget 2-trinnsverifikasjon her vil ikke p&aring;virke eller deaktivere innstillingene for 2-trinnsverifikasjon for hver bruker.  Brukere kan beholde sine innstillinger for 2-trinnsverifikasjon, eller g&aring; til <strong>Personlig</strong> &gt; <strong>Konto</strong> for &aring; deaktivere disse innstillingene.</li>
	<li style="display: none;">2-trinnsverifikasjon blir ogs&aring; brukt p&aring; alle SSH-relaterte tjenester, som SSH-terminal, SFTP og rsync med SSH-overf&oslash;ringskryptering. Men siden Hyper Backup og Synkronisering av delt mappe via rsync med SSH-overf&oslash;ringskryptering ikke st&oslash;tter 2-trinnsverifikasjon, vil ikke disse to tjenestene fungere som normalt n&aring;r 2-trinnsverifikasjon er aktivert.</li>
</ul>
</div>


<h3>Brukerhjem</h3>

<p>Aktiver brukerhjem for &aring; opprette en personlig <strong>home</strong>-mappe for hver bruker, unntatt for <strong>guest</strong>. Alle brukere kan f&aring; tilgang til sin egen home-mappe via CIFS, AFP, FTP eller File Station.</p>

<p>Brukere som tilh&oslash;rer <strong>administrators</strong>-gruppen har tilgang til alle personlige mapper som ligger i den delte standardmappen <strong>homes</strong>. Navnet p&aring; home-mappen er det samme som brukerkontoen.</p>

<h4>Slik aktiverer du brukerhjemtjenesten:</h4>
<ol>
	<li>Merk av for <strong>Aktiver brukerhjemtjeneste</strong>.</li>
	<li>Hvis det finnes flere volum, velger du hvor du vil at mappen <strong>homes</strong> skal lagres.</li>
	<li>Klikk p&aring; <strong>Bruk</strong>.</li>
</ol>

<div class="section"><h4>Merk:</h4>
<ul>
	<li>S&aring; snart den lokale brukerhjemtjenesten er deaktivert, vil hjemtjenesten for domenebrukeren bli deaktivert samtidig.</li>
</ul>
</div>

<h4>Slik deaktiverer du brukerhjemtjenesten:</h4>
<ol>
	<li>Fjern avmerkingen for <strong>Aktiver brukerhjemtjeneste</strong>.</li>
	<li>Klikk p&aring; <strong>Bruk</strong> for &aring; lagre innstillingene.</li>
</ol>

<p>Hvis brukerhjemtjenesten deaktiveres, vil den delte mappen <strong>homes</strong> bli reservert for administratortilgang.  Brukere vil f&aring; tilgang til sine home-mapper p&aring; nytt n&aring;r brukerhjemtjenesten aktiveres igjen.</p>

<div class="section"><h4>Merk:</h4>
<ul>
	<li>For &aring; slette <strong>homes</strong> delte mappe, m&aring; brukerhjemtjenesten deaktiveres f&oslash;rst.</li>
	<li>Brukerhjemtjenestene for domenebruker kan bli deaktivert, dersom den lokale brukerhjemtjenesten er deaktivert.</li> 
</ul> 
</div>

</body>	
</html> 