<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Win/Mac/NFS</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SMB</h2>

<p>SMB-protokollen (Server Message Block) gir Windows-, Mac- og Linux-klienter med st&oslash;tte for SMB/CIFS tilgang til data som er lagret p&aring; Synology NAS. Hvis du vil bla gjennom filer p&aring; Synology NAS via Windows Explorer eller montere delte mapper som nettverksstasjoner, aktiverer du dette alternativet i <strong>Kontrollpanel</strong> &gt; <strong>Filtjenester</strong> &gt; <strong>SMB/AFP/NFS</strong>.</p>


<h4>Slik aktiverer du SMB-protokoll:</h4>
<ol>
<li>
Merk av for <b>Aktiver SMB-tjeneste</b>.
</li>
<li>
Klikk p&aring; <b>Bruk</b>.
</li>
</ol>

<div class="section disable-hi3535">
<h4>Merk:</h4>
<p>N&aring;r du har aktivert SMB-protokollen, kan du montere indekserte mapper p&aring; Mac-datamaskinen din via SMB og bruke Finder til &aring; s&oslash;ke etter filinnholdet i de monterte mappene.</p>
</div>


<h3>Arbeidsgruppe</h3>
<p>Dette alternativet lar deg tilordne systemet som et medlem av en bestemt arbeidsgruppe for nettverksadministrative form&aring;l.</p>

<div class="section">

<h4>Merk:</h4>
<ul>
<li>Navnet p&aring; en arbeidsgruppe kan inneholde fra 1 til 15 tegn. Navnet kan ikke inneholde f&oslash;lgende tegn: [ ] ; : &quot; &lt; &gt; * + = \ / | ? ,</li>
<li>Hvis du bruker en Mac som kj&oslash;rer OS X 10.9, og din Synology NAS er tilknyttet et Windows-domene, kan du logge inn ved &aring; legge til <strong>localhost\</strong> foran ditt lokale Synology NAS-brukernavn for &aring; f&aring; tilgang til filer som lagres p&aring; Synology NAS via SMB-protokollen.</li>
</ul>
</div>

<h3 class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">Nekt tilgang til Tidligere versjoner</h3>
<p class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton">I Windows Utforsker kan brukere aksessere snapshots av mapper eller filer ved &aring; klikke p&aring; fanen <strong>Tidligere versjoner</strong> i en delt mappe, slik at de kan gjenopprette eller kopiere data uten hjelp fra administrator. Hvis du velger <strong>Nekt tilgang til Tidligere versjoner</strong>, vil ikke siden &quot;Tidligere versjoner&quot; vise noe informasjon.</p>

<div class="section enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><h4>Merk:</h4>
<ul>
	<li>Brukerekan kun aksessere en tidligere versjon hvis brukerkontoen allerede er opprettet n&aring;r snapshotet som korresponderer med den tidligere versjonen blir tatt og de har lesetillatelse for den delte mappen som det korresponderende snapshotet tilh&oslash;rer.</li>
</ul>
</div>

<h3>Aktivere overf&oslash;ringslogger</h3>
<p>Hvis du merker av for dette alternativet, aktiveres logging av filtilgangsoperasjoner, inkludert oppretting, sletting, lesing, skriving, flytting og endring av navn p&aring; filer eller mapper gjennom SMB-protokollen.</p>

<h3>Avanserte innstillinger</h3>
<p>Klikk p&aring; knappen <strong>Avanserte innstillinger</strong> for &aring; se alternativene nedenfor.</p>
<ul>
<li><strong>WINS-server</strong>: Microsoft Windows Internet Name Service (WINS) er en NetBIOS navn- til-IP-adresse-tilordningstjeneste. Windows-brukere kan lettere lokalisere systemet p&aring; TCP/IP-nettverk hvis systemet er konfigurert til &aring; registrere hos en WINS-server.</li>
<li><strong>Maksimum SMB-protokoll</strong>: Avhengig av nettverkskonfigurasjonen din, kan du angi den nyeste SMB-protokollen som st&oslash;ttes av din Synology NAS.
  <ul>
  <li><strong>SMB1</strong>: SMB1 (ogs&aring; kalt CIFS) har v&aelig;rt st&oslash;ttet siden Windows NT.</li>
    <li><strong>SMB2</strong>: SMB2 har v&aelig;rt st&oslash;ttet siden Windows Vista og er den forbedrede versjonen av SMB. SMB2 tilf&oslash;rer evnen til &aring; samle flere SMB-handlinger i &eacute;n enkelt foresp&oslash;rsel for &aring; redusere antallet nettverkspakker og forbedre ytelsen.</li>
    <li><strong>SMB2 og stor MTU</strong>: Maximum transmission unit (MTU, maksimum overf&oslash;ringsenhet) refererer til den st&oslash;rste dataenheten som kan sendes over en kommunikasjonsprotokoll. For &aring; dra nytte av raskere nettverksgrensesnitt, som 1- eller 10-gigabit Ethernet, &oslash;ker Large MTU maksimum overf&oslash;ringsenhet (MTU) til 1 megabyte (MB). Aktivering av Large MTU forbedrer hastigheten og effektiviteten til store filoverf&oslash;ringer og reduserer antallet pakker som m&aring; behandles.</li>
    <li><strong>SMB3</strong>: SMB3 har v&aelig;rt st&oslash;ttet siden Windows 8 og Windows Server 2012. Det er den forbedrede versjonen av SMB2. SMB3 st&oslash;tter overf&oslash;ring av AES-basert filkryptering og tilbyr dermed sikrere node-to-node-filoverf&oslash;ring.</li>
</ul>
<div class="section">
  <h4>Merk:</h4>
  <ul>
    <li>SMB2 st&oslash;ttes av Windows Vista, Windows Server 2008 R2, Windows 7 og nyere.</li>
    <li>Stor MTU st&oslash;ttes av Windows Server 2008 R2, Windows 7 og nyere.</li>
    <li>For &aring; gj&oslash;re stor MTU effektiv med din Windows-datamaskin, vil du m&aring;tte endre registerinnstillingene p&aring; datamaskinen din. For mer informasjon, se Microsofts tekniske kundest&oslash;tte (som denne <a href="http://technet.microsoft.com/en-us/library/ff625695(v=ws.10).aspx" target="_blank">artikkelen</a>).</li>
    </ul>
</div>
<li><strong>Minimum SMB-protokoll</strong>: Avhengig av nettverkskonfigurasjonen din, kan du angi den eldste SMB-protokollen som st&oslash;ttes av din Synology NAS.</li>
<li><strong>Transportkrypteringsmodus</strong>: N&aring;r SMB3 er aktivert, vil SMB-protokollen legge til transportkryptering for &aring; forbedre sikkerheten ved filoverf&oslash;ring.
  <ul>
    <li><b>Deaktiver</b>: Ingen transportkryptering vil bli tatt i bruk.</li>
    <li><b>Auto</b>: Transportkryptering vil kun bli tatt i bruk for klienter som st&oslash;tter denne funksjonen.</li>
    <li><b>Tving</b>: Transportkryptering vil alltid bli tatt i bruk. Dette vil f&oslash;re til at klienter som ikke st&oslash;tter transportkryptering ikke vil kunne bruke SMB-protokollen.</li>
  </ul>
</li>
<div class="section">
  <h4>Merk:</h4>
  <ul>
    <li>Transportkryptering st&oslash;ttes p&aring; Windows 8, Windows Server 2012 og nyere.</li>
    <li>Anonym p&aring;logging for SMB-protokollen st&oslash;ttes ikke n&aring;r transportkryptering er aktivert.</li>
    <li>N&aring;r transportkryptering er aktivert, m&aring; du la <b>Deaktiver Opportunistic Locking</b> v&aelig;re uavmerket for &aring; unng&aring; at programmet blir tidsavbrutt.</li>
    </ul>
</div>
<li><strong>Aktiver Opportunistic Locking</strong>: Velg &aring; aktivere &quot;Opportunistic Locking&quot; for CIFS, slik at klienten bedre kan bufre filinnhold og unng&aring; sm&aring; lese/skrive-kostnader. N&aring;r dette alternativet ikke er valgt, vil databaseprogrammer yte bedre ved aksessering av databasefiler som er lagret p&aring; Synology NAS via nettverk.
	<ul>
    <li><strong>Aktiver SMB2-leie</strong>: Aktivering av dette alternativet gir deg flere SMB2-relaterte innstillinger for &aring; finjustere klientbuffermekanismen som tilbys av Opportunistic Locking.</li>
    </ul>

</li>



<li>
  <strong>Aktiver Local Master Browser</strong>: N&aring;r flere Windows-datamaskiner eksisterer p&aring; det samme delnettet, vil de forhandle og velge &eacute;n datamaskin som &quot;local master browser.&quot; Valgt Local Master Browser bevarer lister over de andre datamaskinene p&aring; delnettet og deres delte ressurser, og deler disse listene med de andre datamaskinene. Dette alternativet lar Synology NAS ta rollen som Local Master Browser.
</li>

<div class="section">
<h4>Merk:</h4>
<p>Aktivering av denne funksjonen deaktiverer dvalemodus for harddisker og aktiverer gjestekontoen uten passord.</p>
</div>


<li><strong>Aktiver DirSort VFS-modul</strong>: Sorterer mappenavn og lister dem opp alfabetisk. Aktivering av dette alternativet p&aring;virker systemytelsen.</li>

<li><strong>Veto filer</strong>: Skjuler filer i henhold til spesifiserte kriterier. Kriterier kan inkludere jokertegn (*), og flere oppf&oslash;ringer m&aring; separeres med skr&aring;strek (/). For eksempel: <i>/abc*/*.txt/*.conf/</i>. Aktivering av dette alternativet p&aring;virker systemytelsen.</li>

<li><strong>Tillat symbolske koblinger innad i delte mapper</strong>: Aktivering av dette alternativet lar symbolske koblinger peke mot filer eller mapper innad i den samme delte mappen. Symbolske koblinger kan opprettes ved hjelp av DSM-terminal.
<ul>
	<li><strong>Tillat symbolske koblinger mellom delte mapper</strong>: Velg for &aring; la symbolske koblinger peke mot filer og mapper i andre delte mapper. Symbolske koblinger kan opprettes ved hjelp av DSM-terminal. Brukere uten rettigheter kan imidlertid f&aring; tilgang til de delte m&aring;lmappene via de symbolske koblingene.</li>
</ul>
</li>


<li><strong>Aktiver VFS-modul for &aring; konvertere Mac-spesialtegn</strong>: Velg for &aring; konvertere SMB-reserverte tegn (f.eks. &lt;   &gt;  &quot; * ?) i filnavn til Grunnleggende latin under filopprettingen. Slike filer kan gjenkjennes via AFP.</li>
<li><strong>Aktiver MSDFS VFS-modul</strong>: Lar symbolske koblinger peke mot filer og mapper p&aring; andre SMB-servere. Med eldre versjoner av Windows, som Windows XP, m&aring; klienten og Synology NAS tilknyttes et Windows-domene f&oslash;r du aktiverer dette alternativet. For &aring; finne ut mer om oppretting av MSDFS-koblinger, se <a href="http://www.samba.org/samba/docs/man/Samba-HOWTO-Collection/msdfs.html" target=_blank>her</a>. V&aelig;r oppmerksom p&aring; at bufferen til klientenheten b&oslash;r t&oslash;mmes etter deaktivering av dette alternativet, ellers kan normal ytelse bli p&aring;virket.</li>

<li><strong>Deaktiver flere tilkoblinger fra den samme IP-adressen</strong>: N&aring;r dette alternativet er aktivert, vil Synology NAS kun tillate &eacute;n tilkobling per IP-adresse fra klienter som bruker SMB-protokollen. N&aring;r flere klienter med den samme IP-adressen bruker SMB-protokollen, vil Synology NAS beholde den nyligste tilkoblingen og avbryte alle andre tilkoblinger. I et NAT-milj&oslash; kan brukeren bruke en enkelt IP-adresse, og da vil aktivering av dette alternativet kunne p&aring;virke den normale ytelsen.</li>

<li><strong>Samle feils&oslash;kingslogger</strong>: N&aring;r dette alternativet er aktivert, vil detaljerte logger bli lagret for feils&oslash;kingsform&aring;l. Aktivering av dette alternativet p&aring;virker systemytelsen.</li>
<li><strong>Bruk standard UNIX-tillatelser</strong>: Aktiver dette alternativet for &aring; ta i bruk standard UNIX-tillatelser n&aring;r du laster opp eller oppretter filer og mapper. UNIX-tillatelsen vil v&aelig;re 744 for filer og 755 for mapper. N&aring;r dette alternativet er deaktivert, er UNIX-tillatelsen 777 for filer og mapper.</li>
<div class="section enable-eds14">
<h4>Merk:</h4>
<ul>
<li>Aktivering av dette alternativet kan for&aring;rsake problemer med inkonsekvente tillatelser mellom forskjellige protokoller. For &aring; unng&aring; inkonsekvens, foresl&aring;r vi at dette alternativet er deaktivert.</li>
</ul>
</div>
<div class="section disable-eds14">
<h4>Merk:</h4>
<ul>
  <li>For Windows ACL-aktiverte delte mapper (alle delinger unntatt &quot;photo&quot; og delinger p&aring; eksterne disker) m&aring; du kj&oslash;re kommandoen <strong>chmod</strong> p&aring; Linux- eller FTP-klienten din for &aring; endre mappe- og filtillatelsestyper fra Windows ACL til UNIX.</li>
  <li>Aktivering av dette alternativet kan for&aring;rsake problemer med inkonsekvente tillatelser mellom forskjellige protokoller. For &aring; unng&aring; inkonsekvens, foresl&aring;r vi at dette alternativet er deaktivert.</li>
</ul>
</div>
<li><b>Ikke reserver diskplass ved oppretting av filer</b>: Aktiver dette alternativet for &aring; hindre at diskplass blir reservert ved oppretting av filer p&aring; din Synology NAS .</li>
<li><strong>Aktiver varige referanser i SMB (fill&aring;sing p&aring; tvers av protokoller blir deaktivert)</strong> Aktivering av dette alternativet lar brukere gjenopprette brutte SMB2-tilkoblinger p&aring; Synology NAS etter midlertidig frakobling. &Aring;pnede filer vil fortsatt v&aelig;re tilgjengelige under nettverksbruddet. Fill&aring;sing p&aring; tvers av protokoller blir imidlertid deaktivert slik at brukere kan aksessere eller endre en l&aring;st fil via ikke-SMB2-protokoller (f.eks. AFP).</li>
<li class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64 enable-cedarview enable-apollolake enable-denverton"><b>Aktiver rask kloning for Btrfs</b>: Aktivering av dette alternativet lar brukere kopiere filer hurtigere n&aring;r b&aring;de kilden og m&aring;let er p&aring; samme Btrfs-volum.</li>
<li><strong>T&oslash;m SMB-buffer</strong>: Klikk p&aring; denne knappen for &aring; slette f&oslash;lgende SMB-bufferfiler for feils&oslash;kingsform&aring;l:
  <ul>

<li>/var/cache/samba/netsamlogon_cache.tdb</li>
<li>/var/lib/samba/winbindd_cache.tdb</li>
<li>/var/lib/samba/share_info.tdb</li>
<li>/var/lib/samba/registry.tdb</li>
<li>/run/samba/connections.tdb</li>
<li>/run/samba/gencacche.tdb</li>
<li>/run/samba/gencache_notran.tdb</li>
</ul>
</li>

</ul>

</body>
</html>
