<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Str&oslash;m</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Generelt</h2>

<p>
<strong>Kontrollpanel</strong> &gt; <strong>Maskinvare &amp; str&oslash;m</strong> &gt; <strong>Generelt</strong> gir deg alternativer for &aring; aktivere str&oslash;mgjenoppretting, Wake on LAN (WOL) og minnekomprimering. Du kan ogs&aring; endre piplydkontroll og viftehastighetsmodus her.
</p>

<h3>Minnelayout*</h3>
<p>F&oslash;lgende layoutalternativer for minne p&aring;virker videotranskodingens ytelse:</p>
<ul>
<li><strong>Tillat enkel 1080p-transkoding:</strong> Anbefalt for bedre generell systemytelse hvis 4K-videotranskoding ikke skal brukes.</li>
<li><strong>Tillat enkel 4K-transkoding:</strong> Reserverer mer minne for videotranskoding. Anbefalt ved bruk av 4K-transkoding.</li>
</ul> 

<h3>
Str&oslash;mgjenoppretting
</h3>
<p>Hvis systemet sl&aring;s av p&aring; grunn av et uventet str&oslash;mbrudd, gj&oslash;r str&oslash;mgjenopprettingsfunksjonen at systemet startes opp igjen automatisk n&aring;r str&oslash;mmen har kommet tilbake.</p>
<h3>Wake on LAN*</h3>
<p>Aktivering av Wake on LAN (WOL) lar deg sl&aring; p&aring; din Synology NAS over det lokale nettverket eller Internett ved &aring; angi IP-adressen (eller DDNS-vertsnavnet) og MAC-adressen til din Synology NAS ved hjelp av et WOL-program, som Synology Assistant, DS finder eller et annet WOL-program.</p>
<p>Wake on LAN fungerer kun etter at Synology NAS er sl&aring;tt av p&aring; riktig m&aring;te ved &aring; trykke inn den fysiske <b>Str&oslash;m</b>-knappen eller ved &aring; klikke p&aring; <b>Sl&aring; av</b> i DSM-grensesnittet. La str&oslash;mledningen v&aelig;re tilkoblet et fungerende str&oslash;muttak etter at du har sl&aring;tt av.</p>
<div class="section">
	<h4>Merk:</h4>
	<p class="disable-rc18015xsp">WOL-funksjonen st&oslash;ttes ikke av 10GbE LAN-porter (dersom tilgjengelig p&aring; din Synology NAS).</p>
	<ul class="enable-rc18015xsp">
		<li>WOL-funksjonen st&oslash;ttes ikke av 10GbE LAN-porter (dersom tilgjengelig p&aring; din Synology NAS).</li>
		<li>WOL-funksjonen er aktivert som standard i 1GbE LAN-porter for Synology NAS og kan ikke deaktiveres.</li>
	</ul>
</div>
<h3>Viftehastighetsmodus*</h3>
<p>F&oslash;lgende alternativer for viftehastighet er tilgjengelig:</p>
<ul>
<li><strong>Fullhastighetsmodus:</strong> Viften drives ved full hastighet og holder Synology NAS kj&oslash;ligere, men lager mer st&oslash;y.</li>
<li><strong>Kj&oslash;lemodus:</strong> Viften drives ved h&oslash;y hastighet og holder Synology NAS kj&oslash;ligere, men lager mer st&oslash;y.</li>
<li><strong>Stille modus:</strong> Viften drives ved lavere hastighet og lager mindre st&oslash;y men Synology NAS kan bli varmere.</li>
<li><strong>Lavstr&oslash;msmodus:</strong> Viften drives ved lavere hastighet og lager mindre st&oslash;y men Synology NAS kan bli varmere. I tillegg, n&aring;r Synology NAS er kj&oslash;lig, vil viften stoppes helt for &aring; spare str&oslash;m. Lavstr&oslash;mmodus er kun tilgjengelig p&aring; bestemte modeller.</li>
</ul>
<h3>Pipelydkontroll</h3>
<p>Synology NAS kan avgi en pipelyd n&aring;r bestemte hendelser eller feil oppst&aring;r. Merk av for de opplistede hendelsene for &aring; la Synology NAS varsle deg n&aring;r det oppst&aring;r feil.</p>

<h4>Slik stanser du pipelyden:</h4>
<ul>
<li>Hvis Synology NAS avgir pipelyd, klikker du p&aring; knappen <strong>Pipelyd av</strong> for &aring; deaktivere den. </li>
</ul>



<h3>Minnekomprimering*</h3>
<p>Du kan aktivere minnekomprimering for &aring; forbedre den generelle reaksjonstiden til systemet under lasting ved &aring; komprimere de minst nylige brukte dataene i minnet.</p>
<p>N&aring;r flere programmer kj&oslash;rer og minnet begynner &aring; bli brukt opp, vil den dynamiske minnekomprimeringen redusere st&oslash;rrelsen p&aring; sjelden brukte elementer i minnet, og dermed minimalisere minneforbruket. N&aring;r det er behov for elementene igjen, kan de pakkes ut igjen umiddelbart. Dette reduserer behovet for &aring; lese og skrive minnebyttefiler p&aring; disken og forbedrer effektiviteten og reaksjonstiden.</p>
<p>For &aring; aktivere minnekomprimering, bare merker du av i boksen.</p>

<h3>LED*</h3>

<p>I <strong>Kontrollpanel</strong> &gt; <strong>Maskinvare &amp; str&oslash;m</strong> &gt; <strong>Generelt</strong> &gt; <strong>LED-lysstyrkekontroll</strong> kan du justere lysstyrken til LED-indikatorene p&aring; din Synology NAS.</p>

<div class="section">
<h4>Merk:</h4>
<p>Lysstyrkeinnstillingene tas i bruk for alle LED-indikatorene p&aring; din Synology NAS (dvs. Av/p&aring;, STATUS, LAN, diskstatus osv.).</p>
</div>


<h4>Slik justerer du LED-lysstyrke:</h4>
<p>Det finnes n&aring; fire tilgjengelige lysstyrkeniv&aring;er for LED-indikatorer p&aring; din Synology NAS.</p>
<ol>
<li>Klikk og dra pekeren p&aring; lysstyrkeskalaen i begge retningene:
  <ul>
<li>Til h&oslash;yre: &Oslash;kt LED-lysstyrke.</li>
<li>Til venstre: Redusert LED-lysstyrke.</li>
</ul>
</li>
<li>Klikk p&aring; <strong>Bruk</strong> for &aring; lagre innstillingene.</li>
</ol>



<h4>Slik justerer du LED-lysstyrke etter tidsplan:</h4>
<p>LED-indikatorene kan endre lysstyrkeniv&aring;ene sine etter en tidsplan.</p>

<ol>
<li>Klikk p&aring; <strong>Angi tidsplan</strong>.</li>
<li>Klikk p&aring; en av lysstyrketypene nedenfor:
<ul>
<li><strong>Standard lysstyrke</strong>: Full lysstyrke</li>
<li><strong>Justert lysstyrke</strong>: Lysstyrkeniv&aring;et som er spesifisert p&aring; lysstyrkeskalaen</li>
<li><strong>Av</strong>: LED av</li>
</ul>
</li>
<li>Klikk p&aring; &oslash;nskede tidsperioder for &aring; tilpasse lysstyrkeplanen.</li>
<li>Klikk p&aring; <strong>OK</strong> og deretter p&aring; <strong>Bruk</strong> for &aring; lagre innstillingene.</li>
</ol>



<p>____<br> * Bare tilgjengelig p&aring; bestemte modeller. </p>
</body>
</html>
