<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Eksterne enheter</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="usbprinter"></a>Skrivere</h2>
<p>Synology NAS kan gj&oslash;res om til en skriverserver som lar klientdatamaskiner eller mobile enheter f&aring; tilgang til skrivere som er tilkoblet Synology NAS. I tillegg lar st&oslash;tte for Apple Wireless Printing og Google Cloud Print deg ta fjernutskrifter ved hjelp av iOS-enheter eller Google-produkter og -tjenester.</p>
<p>Bes&oslash;k <a href="http://www.synology.com" target="_blank">www.synology.com</a> for kompatible skrivere.</p>

<h3>Sette opp skrivere</h3>
<p>Se instruksjonene nedenfor for &aring; sette opp og koble til en <span class="disable-rc18015xsp">USB- eller </span>nettverksskriver med din Synology NAS.</p>


<h4 class="disable-rc18015xsp"><a id="t1"></a>Slik setter du opp en USB-skriver:</h4>
<ol class="disable-rc18015xsp">
<li>Sl&aring; p&aring; og koble skriveren til en USB-port p&aring; Synology NAS.</li>
<li>G&aring; til <strong>Kontrollpanel</strong> &gt; <strong>Eksterne enheter</strong> &gt; <strong>Skriver</strong>.</li>
<li>Velg skriveren du &oslash;nsker &aring; sette opp. V&aelig;r oppmerksom p&aring; at Synology NAS ikke kjenner igjen skrivere som kobles til via USB-huber.</li>
<li>Klikk p&aring; <b>Skriveradministrator</b> og velg <b>Konfigurer skriver</b>.</li>
<li>I dialogboksen velger du &eacute;n av f&oslash;lgende modi:
<ul>
<li><b>Network MFP:</b> Lar klienter p&aring; det lokale nettverket bruke utskrifts-, skannings- og faksfunksjonene til din universalskriver. Skannings- og faksfunksjoner er bare tilgjengelig for Windows-datamaskiner.</li>
<li><b>Nettverksskriver:</b> Velg denne modusen for skrivere som kun st&oslash;tter skriving, eller hvis du vil la klienter kun bruke utskriftsfunksjonen.</li>
</ul>
</li>
<li>Konfigurer innstillinger for Apple Wireless Printing eller Google Cloud Print (valgfritt).</li>
<li>Klikk p&aring; <b>Lagre</b>.</li>
</ol>

<div class="section disable-rc18015xsp">
<h4>Merk:</h4>
<ul>
<li>En nettverks-MFP kan kun aksesseres av &eacute;n klient om gangen.</li>
</ul>
</div>

<h4>Slik setter du opp en nettverksskriver:</h4>
<ol>
<li>Sl&aring; p&aring; og koble nettverksskriveren til det samme lokale nettverket som Synology NAS.</li>
<li>G&aring; til <strong>Kontrollpanel</strong> &gt; <strong>Eksterne enheter</strong> &gt; <strong>Skriver</strong>.</li>
<li>Klikk p&aring; <b>Legg til nettverksskriver</b> og f&oslash;lg instruksjonene i installasjonsveiviseren.</li>
</ol>

<div class="section">
<h4>Merk:</h4>
<ul>
<li><strong>Skrivernavn:</strong> Et skrivernavn m&aring; angis under oppsett og kan inneholde opp til 32 tegn, inkludert bokstaver, tall og understrek.</li>
	<li><strong>Protokoll:</strong> HP-nettverksskrivere bruker stort sett Socket; Canon-nettverksskrivere bruker BJNP; og andre bruker stort sett LPR.</li>
<li><strong>K&oslash;navn:</strong> Det p&aring;kreves &aring; angi et k&oslash;navn for LPR- og IPP-nettverksskrivere, men ikke for Socket- eller BJNP-skrivere.</li>
<li><strong>Ingen Network MFP:</strong> Nettverksskrivere som er tilkoblet Synology NAS kan for tiden ikke bruke Network MFP-modus.</li>
<li><strong>Ingen USB-skrivere:</strong> USB-skrivere som er delt av et Synology-produkt kan ikke angis som nettverksskrivere.</li>
</ul>
</div>

<div class="disable-rc18015xsp">
<h4>Slik setter du opp en PostScript USB-skriver med Mac:</h4>
<p><strong>For Mac OS 10,6.X:</strong></p>
<ol>
<li>F&oslash;lg trinnene i <a href="system_externaldevice_printer.html#t1">Slik setter du opp en USB-skriver</a>.</li>
<li>P&aring; Mac-datamaskinen din g&aring;r du til <b>Systempreferanser</b> &gt; <b>Utskrift og faks</b> og klikker p&aring; <strong>+</strong> for &aring; legge til en ny skriver.</li>
<li>Velg <strong>IP</strong>.</li>
<ul>
	<li>Velg <strong>Line Printer Daemon - LPD</strong> for <strong>Protokoll</strong>.</li>
	<li>Skriv inn skriverens IP-adresse.</li>
	<li>Skriv inn &quot;usbprinter&quot; i <strong>K&oslash;</strong>-feltet.</li>
	<li>Velg <strong>Generisk PostScript-skriver</strong> for <strong>Skriv ut med</strong>.</li>
	<li>Klikk p&aring; <strong>Legg til</strong> for &aring; fullf&oslash;re.</li>
</ul>
</ol>
<div class="section">
<h4>Merk:</h4>
<ul>
<li>AppleTalk er ikke lenger st&oslash;ttet i Mac OS 10.6.X. Hvis du trenger &aring; bruke en AppleTalk-skriver, m&aring; du lese den vedlagte dokumentasjonen for &aring; finne en m&aring;te &aring; koble den til p&aring; Mac-datamaskinen din eller et lokalt nettverk. Hvis det ikke finnes en m&aring;te &aring; koble til skriveren p&aring;, kan du koble den til p&aring; en Mac-datamaskin med Mac OS 10.5.X eller eldre og sette den opp for deling.</li>
</ul>
</div>

<p><strong>For Mac OS 10,5.X:</strong></p>
<ol>
<li>F&oslash;lg trinnene i <a href="system_externaldevice_printer.html#t1">Slik setter du opp en USB-skriver</a>.</li>
<li>P&aring; Mac-datamaskinen din g&aring;r du til <b>Systempreferanser</b> &gt; <b>Utskrift og faks</b> og klikker p&aring; <strong>+</strong> for &aring; legge til en ny skriver.</li>
<li>Velg en metode.</li>
<ul>
	<li>Metode 1: <strong>AppleTalk</strong></li>
	<ul>
		<li>Velg <strong>Generisk PostScript-skriver</strong> for <strong>Skriv ut med</strong>.</li>
		<li>Klikk p&aring; <strong>Legg til</strong> for &aring; fullf&oslash;re.</li>
	</ul>
	<li>Metode 2: <strong>IP</strong></li>
	<ul>
		<li>Velg <strong>Line Printer Daemon - LPD</strong> for Protokoll.</li>
		<li>Skriv inn skriverens IP-adresse.</li>
		<li>Skriv inn &quot;usbprinter&quot; i <strong>K&oslash;</strong>-feltet.</li>
		<li>Velg <strong>Generisk PostScript-skriver</strong> for <strong>Skriv ut med</strong>.</li>
		<li>Klikk p&aring; <strong>Legg til</strong> for &aring; fullf&oslash;re.</li>
	</ul>
</ul>
</ol>
</div>

<h3>Administrere skrivere</h3>
<p>Skriverfanen inkluderer f&oslash;lgende alternativer for &aring; administrere <span class="disable-rc18015xsp">USB- eller </span>nettverksskrivere som er tilkoblet Synology NAS.</p>

<ul>
<li><b>F&aring; informasjon:</b> Viser informasjon vedr&oslash;rende den valgte skriveren, som enhetsnavn, fabrikant, status, etc.</li>
<li><strong>Fjern:</strong> Fjerner og kobler fra en skriver fra Synology NAS.</li>
<li><strong>Skriveradministrator:</strong> Inkluderer f&oslash;lgende alternativer:
<ul>
<li><strong>Sett opp skriver</strong>: Rediger skriverinnstillinger, som Apple Wireless Printing eller Google Cloud Print (se nedenfor for instruksjoner).</li>
<li><strong>Rydd opp spoleplassen:</strong> Avbryter alle skriveoppgaver p&aring; alle skrivere.</li>
<li><strong>Skriv ut testside:</strong> SKriver ut en testside for &aring; kontrollere at konfigurasjonene er korrekte.</li>
<li><b>L&oslash;s ut skriver:</b> Kobler fra skriveren og klienten (kun for Network MFP-modus). N&aring;r en klient kobler til en universalskriver for &aring; motta fakser eller skanne filer, kan oppgaven ta lang tid. Om n&oslash;dvendig, kan tilkoblingen stanses for &aring; la neste klient i k&oslash;en f&aring; tilgang til skriveren.</li>
</ul></li>
</ul>


<h4>Slik aktiverer du Apple Wireless Printing:</h4>
<ol>
<li>G&aring; til <strong>Kontrollpanel</strong> &gt; <strong>Eksterne enheter</strong> &gt; <strong>Skriver</strong>.</li>
<li>Velg en skriver fra enhetslisten.</li>
<li>Klikk p&aring; <b>Skriveradministrator</b> &gt; <b>Konfigurer skriver</b>.</li>
<li>Merk av for <b>Aktiver Apple Wireless Printing</b>.</li>
<li>Velg skriverens merke og driver.</li>
<li>Klikk p&aring; <b>Lagre</b>.</li>
</ol>

<p>N&aring;r oppsett er fullf&oslash;rt, kan du skrive ut en testside ved &aring; klikke p&aring; <b>Skriveradministrator</b> &gt; <b>Skriv ut testside</b>.</li>

<div class="section">
<h4>Merk:</h4>
<ul>
<li>Aktivering av Apple Wireless Printing aktiverer ogs&aring; Bonjour Printer Broadcast for DSM.</li>
<li>Apple Wireless Printing er tilgjengelig for iOS 4.2 eller nyere.</li>
</ul>
</div>


<h4>Slik aktiverer du Google Cloud Print:</h4>
<ol>
<li>G&aring; til <strong>Kontrollpanel</strong> &gt; <strong>Eksterne enheter</strong> &gt; <strong>Skriver</strong>.</li>
<li>Velg en skriver fra enhetslisten.</li>
<li>Klikk p&aring; <b>Skriveradministrator</b> &gt; <b>Konfigurer skriver</b>.</li>
<li>Merk av for <b>Aktiver Google Cloud Print</b>.</li>
<li>Angi f&oslash;lgende informasjon:
<ul>

<li>Din Google-kontoinformasjon.</li>
<li>Din skrivers merke og driver.</li>
</ul>
<li>Klikk p&aring; <b>Lagre</b>.</li>
</ol>
<p>N&aring;r oppsett er fullf&oslash;rt, kan du skrive ut en testside ved &aring; klikke p&aring; <b>Skriveradministrator</b> &gt; <b>Skriv ut testside</b>.</li>
</p>
<p>For &aring; administrere Google Cloud Print-oppgaver, klikker du p&aring; koblingen <a href="http://www.google.com/cloudprint/manage.html" target="_blank">Google Cloud Print</a>.</p>


<h3>F&aring; tilgang til skrivere</h3>
<p>Se seksjonen nedenfor for &aring; f&aring; tilgang til skrivere med en PC eller Mac.</p>
<h4><a name="others"></a>Slik f&aring;r du tilgang til skrivere med en Windows-PC:</h4>
<p>
Den beste m&aring;ten &aring; f&aring; tilgang til Synology NAS-enhetens utskriftstjeneste er &aring; sette opp tilkoblingen til skriveren med Synology Assistant. Se hjelp i dette programmet hvis du vil ha detaljerte instruksjoner.
</p>

<p>Hvis Synology Assistant ikke er installert p&aring; datamaskinen, kan du se nedenfor etter andre m&aring;ter &aring; f&aring; tilgang til Synology NAS-enhetens utskriftstjeneste p&aring;.</p>
<p><strong>Type 1. Delt nettverksskriver</strong></p>
<ol>
<li>&Aring;pne <b>Nettverk </b> i filutforsker p&aring; PC-en din og dobbeltklikk p&aring; Synology NAS.</li>

<li>Dobbeltklikk p&aring; <span class="disable-rc18015xsp"><b>usbprinter</b> eller </span><b>network printer name</b>; systemet ber deg om &aring; installere korrekt driver, og da klikker du p&aring; <b>Ja</b>.</li>

<li>F&aring; skriverdriveren fra CD-en eller fra fabrikantens webomr&aring;de. Velg fabrikanten og modellen p&aring; skriveren, eller klikk p&aring; <strong>Har disk</strong> for &aring; velge plasseringen til driveren. Deretter klikk <b>OK</b>.</li>
<li>Systemet vil begynne &aring; installere nettverksskriveren. N&aring;r oppsett er fullf&oslash;rt, kan du ta i bruk skriveren. </li>
</ol>


<p><strong>Type 2. LPR Port (Anbefalt)</strong></p>
<ol>
<li>Klikk p&aring; <b>Start</b> p&aring; PC-en din og g&aring; til <b>Enheter og skrivere</b>.</li>
<li>Klikk p&aring; <b>Legg til skriver</b>. </li>
	<li>Velg <strong>Legg til en nettverksskriver, tr&aring;dl&oslash;s skriver eller Bluetooth-skriver.</strong> </li>
	<li>Velg <strong>Skriveren jeg &oslash;nsker er ikke p&aring; listen.</strong></li>
<li>Velg <b>Legg til en skriver med TCP/IP-adresse eller vertsnavn</b>. Klikk p&aring; <b>Neste</b> for &aring; fortsette.</li>
<li>Angi Enhetstype som <b>TCP/IP-portenhet.</b></li>
<li>Angi IP-adressen til Synology NAS. Klikk p&aring; <b>Neste</b> for &aring; fortsette.</li>
<li>Velg <b>Enhetstype:</b> <strong>Egendefinert</strong> &gt; <strong>Innstillinger</strong> &gt; …. Klikk p&aring; <b>Neste</b> for &aring; fortsette.</li>

<li>Velg <b>LPR</b> som protokoll, fyll inn <span class="disable-rc18015xsp"><b>usbprinter</b> eller </span><b>network printer name</b> som k&oslash;navn, og merk av for <b>LPR-bit opptelling aktivert</b>. Klikk p&aring; <b>OK</b> for &aring; fortsette.</li>

<li>F&aring; skriverdriveren fra CD-en eller fra fabrikantens webomr&aring;de. Velg fabrikanten og modellen p&aring; skriveren, eller klikk p&aring; <strong>Har disk</strong> for &aring; velge plasseringen til driveren. Deretter klikk <b>OK</b>.</li>
	<li>Systemet vil begynne &aring; installere nettverksskriveren. N&aring;r oppsettet er fullf&oslash;rt, kan du ta i bruk skriveren.</li>
</ol>

<h4>Slik f&aring;r du tilgang til skrivere med en Mac:</h4>
<p>
Mac-brukere har tilgang til Synology NAS-enhetens utskriftstjeneste ved &aring; aktivere DSMs Bonjour skriverkringkasting og legge til skriveren i Systemegenskaper.</p>

<P>Kontroller at Synology NAS bruker en Postscript-skriver for du g&aring;r videre.
</p>

<p><strong>Trinn 1. Aktiver DSMs Bonjour skriverkringkasting</strong></p>
<ol>
<li>
Logg inn p&aring; DSM som <b>admin</b> eller en bruker tilh&oslash;rende <b>administrators</b>-gruppen.
</li>
<li>
G&aring; til <b>Kontrollpanel</b> &gt; <strong>Filtjenester</strong> &gt; <b>Win/Mac/NFS</b>.
</li>
<li>
Merk av for <b>Aktiver Bonjour Printer Broadcast</b>.
</li>
</ol>

<p><strong>Trinn 2. F&aring; tilgang til skriver med Mac</strong></p>
<ol>
<li>
G&aring; til <b>Systempreferanser</b> &gt; <b>Skriv ut &amp; skann</b> p&aring; din Mac og klikk p&aring; <b>+</b>.
</li>

<li>
Velg <span class="disable-rc18015xsp"><b>usbprinter[nummer]</b> eller </span><b>network printer name</b> fra rullegardinmenyen. Din Mac vil konfigurere skriveren automatisk.
</li>

</ol>



</body>
</html>
