
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Kaynak Monit&ouml;r&uuml;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1><a name="leaf_update"></a>Kaynak Monit&ouml;r&uuml;</h1>
<p class="disable-dockerx64">Kaynak Monit&ouml;r&uuml;, CPU kullanımını, bellek kullanımını, disk kullanımını ve ağ akışını izlemenize olanak tanır. Ger&ccedil;ek zamanlı izlemeyi ya da ge&ccedil;miş verileri g&ouml;r&uuml;nt&uuml;lemeyi se&ccedil;ebilirsiniz.</p>
<p class="enable-dockerx64">Kaynak Monit&ouml;r&uuml; CPU kullanımını, bellek kullanımını ve ağ akışını izlemenize imkan tanır. Ger&ccedil;ek zamanlı izlemeyi ya da ge&ccedil;miş verileri g&ouml;r&uuml;nt&uuml;lemeyi se&ccedil;ebilirsiniz.</p>
<div class="section">
<h4>Not:</h4>
<ul>
<li><strong>Ayarlar</strong> sekmesinde <strong>Kullanım ge&ccedil;mişini etkinleştir</strong> işaretlenirse ancak &ouml;nceki veriler g&ouml;r&uuml;nt&uuml;lenir.</li>
<li class="enable-dockerx64">Docker DSM i&ccedil;in, <strong>CPU ve bellek</strong>, <strong>Docker Host</strong> hakkındaki kullanım bilgilerini belirtir.</li>
</ul>
</div>
<h2>Performans</h2>
<p>Kaynak kullanımı verilerini g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in <strong>Performans</strong> sekmesine tıklayın. Grafiğin ayrıntılı tarih, saat ve bilgisi, fareyle &uuml;zerinden ge&ccedil;ildiğinde g&ouml;sterilecektir.</p>

<h3>CPU</h3>
<p><strong>Kullanıcı</strong>, <strong>Sistem</strong> ve <strong>I/O Bekleme</strong> şeklindeki genel CPU kullanımını g&ouml;rebilirsiniz. Kaynak Monit&ouml;r&uuml; ilk başlatıldığında CPU kullanımı y&uuml;ksek olabilir, bunun nedeni sistemin aynı anda kaynak verisi toplaması ve kullanıcı arabirim sayfasını y&uuml;klemesi gerekliliğindendir.</p>
<p><strong>Kullanıcı</strong>, kullanıcı uygulamalarını &ccedil;alıştırmak i&ccedil;in kullanılan CPU y&uuml;zdesini g&ouml;sterir. <strong>Sistem</strong>, sistemin kendisinde kullanılan CPU y&uuml;zdesini, donanım/yazılım IRQ'larını g&ouml;sterir. <strong>I/O Bekleme</strong>, I/O beklemesinde harcanan CPU y&uuml;zdesini g&ouml;sterir.</p>
<p><strong>Kullanım</strong>, <strong>Kullanıcı</strong> ve <strong>Sistem</strong> CPU kullanımının toplamıdır.</p>
<p>1, 5 ve 15 dakika i&ccedil;indeki Y&uuml;k Ortalaması, &ccedil;alışma kuyruğu uzunluğunu g&ouml;stererek g&ouml;r&uuml;nt&uuml;lenir (yani, &ccedil;alışmakta olan işlemlerin sayısıyla &ccedil;alışmayı bekleyenlerin sayısının toplamı). </p>
<div class="section">
<h4>Terim A&ccedil;ıklaması</h4>
<ul>
<li><b>I/O bekleme</b>: I/O bekleme CPU'nun boşta olduğunu ve herhangi bir program tarafından kullanılmadığını belirtir. </li>
<p>I/O bekleme normal bir davranıştır. CPU hızı I/O'nun hızından &ccedil;ok daha y&uuml;ksek olduğu i&ccedil;in, CPU genellikle disklerin veya ağın iletiminin tamamlanmasını beklemek zorundadır. Ancak, I/O bekleme y&uuml;zdesi &ccedil;ok b&uuml;y&uuml;kse, bu CPU'nun zamanın &ccedil;oğunu I/O beklemesinde ge&ccedil;irmesi ve iyi bir şekilde kullanılamayabilmesi anlamına gelir. Daha y&uuml;ksek sistem performansı elde etmek i&ccedil;in daha verimli disk grubu yapılandırmalarını (SHR veya RAID 5 gibi) veya ağ yapılandırmalarını (Bonding gibi) kullanabilirsiniz.</p> 
</ul>
</div>
<h3>Bellek</h3>
<p>Fiziksel belleğin genel bellek kullanımı ve takas alanı g&ouml;sterilecektir. Verilerin sabit diske erişim yapmadan hızla elde edilebilmesi i&ccedil;in sistem sıklıkla erişilen verileri &ouml;nbellekte sakladığından bellek kullanımı y&uuml;ksek durumda kalır. Genel bellek yetersiz olduğunda &ouml;nbellek hafızası boşaltılır.</p>
<p>Y&uuml;ksek takas alanı kullanımı, yetersiz sistem belleğini belirtir ve sistem performansını da etkileyecektir. &Uuml;stteki a&ccedil;ılan men&uuml;den <strong>Değiştir</strong>'i se&ccedil;erek, i&ccedil;e değiştirme ve dışa değiştirme oranını g&ouml;r&uuml;nt&uuml;leyebilirsiniz. </p>

<h3>Ağ</h3>
<p>Ağ akış &ccedil;izelgesi g&ouml;nderilen ve alınan veriyi KB/sn olarak g&ouml;sterir. PPPoE bağlıysa, aktarım hızı da &ccedil;izelgede g&ouml;r&uuml;n&uuml;r.</p>

<h3 class="disable-dockerx64">Disk</h3>
<p class="disable-dockerx64">Grafiğin &uuml;st&uuml;ndeki a&ccedil;ılır men&uuml;ye tıklayarak, genel disk kullanımını, aktarım hızını ya da IOPS'u g&ouml;r&uuml;nt&uuml;lemeyi se&ccedil;ebilirsiniz. Verilerini grafiğe eklemek amacıyla onay kutularını işaretleyerek daha fazla disk eklemek i&ccedil;in, alttaki <strong>T&uuml;m&uuml;n&uuml; G&ouml;r&uuml;nt&uuml;le</strong>'ye tıklayabilirsiniz.</p>


<h3 class="disable-eds14 disable-dockerx64">Birim</h3>
<p class="disable-eds14 disable-dockerx64">Bu sayfa birimlerin genel aktarım durumunu g&ouml;r&uuml;nt&uuml;ler. Aktarım kullanımını, aktarım oranını ya da IOPS'ı g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in grafiğin &uuml;st&uuml;ndeki a&ccedil;ılan men&uuml;ye tıklayın. Belirli birimleri se&ccedil;mek i&ccedil;in <strong>T&uuml;m&uuml;n&uuml; G&ouml;r&uuml;nt&uuml;le</strong> d&uuml;ğmesine tıklayıp bunları grafiğe ekleyin.</p>

<h3 class="disable-eds14 disable-dockerx64">iSCSI</h3>
<p class="disable-eds14 dixable-dockerx64">Bu sayfa &ccedil;alışmakta olan iSCSI LUN'ların genel durumunu g&ouml;r&uuml;nt&uuml;ler. Bir LUN'ı se&ccedil;mek ve durumunu g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in grafiğin &uuml;zerindeki a&ccedil;ılır men&uuml;ye tıklayın. &Uuml;&ccedil; grafik varsayılan olarak g&ouml;r&uuml;nt&uuml;lenir, bunlar <strong>Kapasite</strong>, <strong>IOPS</strong> ve <strong>Bekleme</strong>'dir. Daha ayrıntılı bilgi i&ccedil;in, g&ouml;r&uuml;nt&uuml;lemek istediğiniz diğer grafikleri se&ccedil;mek &uuml;zere <strong>Grafikleri Se&ccedil;</strong> d&uuml;ğmesine tıklayın.</p>


<h2>S&uuml;re&ccedil;</h2>
<p>Her bir işlemin CPU ve bellek kullanımını azalan CPU y&uuml;k&uuml; d&uuml;zeninde g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in <strong>İşlem</strong> sekmesine tıklayın.</p>
<p><strong>Durum</strong> s&uuml;reci <strong>&Ccedil;alışma</strong>, <strong>Uyuma</strong> ve <strong>Durduruldu</strong> i&ccedil;erir. Proses durumunun Linux eşdeğerleri <strong>&ccedil;alışma</strong>, <strong>durma/izleme</strong>, <strong>uyuma</strong>'dır. </p>
<p><strong>Uyuma</strong> ayrıntılı bilgi i&ccedil;in bir harf ile takip edilebilir, &ouml;r. disk uykusu i&ccedil;in 'D', zombi i&ccedil;in 'Z', &ouml;l&uuml;m i&ccedil;in 'X'.</p>

<h2>Bağlanan Kullanıcılar</h2>
<p> Bu sekmede, sisteme bağlı olan ve kaynaklara erişen istemcileri g&ouml;r&uuml;nt&uuml;leyebilir ve y&ouml;netebilirsiniz. Bu kısım HTTP, TELNET, SSH, SMB/CIFS, AFP, FTP ve NFS yoluyla bağlanan istemcileri g&ouml;r&uuml;nt&uuml;ler.</p>
<h4>Ge&ccedil;erli bağlantıları y&ouml;netmek i&ccedil;in aşağıdakilerden dilediğinizi yapın:</h4>
<ul>
<li>Ge&ccedil;erli listeyi bir HTML dosyasına vermek i&ccedil;in <b>Kaydet</b>'e tıklayın.</li>
<li>Listeyi g&uuml;ncellemek i&ccedil;in <b>Yenile</b>'ye tıklayın.</li>
<li>Kullanıcının kaynağa erişimini durdurmak i&ccedil;in <b>Bağlantıyı kes</b>'e tıklayın. Bağlantısı kesilen kullanıcı, kaynağa erişim hakkı kazanmak i&ccedil;in yeniden yetkilendirilmelidir.</li>
<li>Kullanıcıyı devre dışı bırakmak i&ccedil;in <b>Kullanıcıyı devre dışı bırak</b>'a tıklayın. Kullanıcıyı tekrar etkinleştirmek i&ccedil;in <b>Ana Men&uuml;</b> &gt; <b>Denetim Masası</b> &gt; <b>Kullanıcı</b>'ya gidin.</li>
</ul>
<div class="section">
<h4>Not:</h4>
<ul>
<li><strong>Bağlantıyı kes</strong> se&ccedil;eneği NFS istemcileriyle &ccedil;alışmaz.</li>
<li>NFS istemcileri paylaşımlı klas&ouml;rleri uygun şekilde ayırmazsa, bağlı kullanıcılar listesinde g&ouml;r&uuml;nmeye devam edebilirler.</li>
<li>Synology NAS sunucusu yeniden başlarsa, &ouml;nceden bağlanan NFS istemcileri bağlı kullanıcılar listesinde g&ouml;r&uuml;nmezler.</li>
</ul>
</div>


<h2>Hız Limiti</h2>
<p><strong>Hız Limiti</strong> sekmesi altında, Synology NAS &uuml;zerinde hız limiti uygulamış aktarma işlemlerinin listesini g&ouml;r&uuml;nt&uuml;leyip y&ouml;netebilirsiniz.</p>
<h4>Listeyi yenilemek i&ccedil;in:</h4>
<p>Sayfayı yeniden y&uuml;klemek ve en g&uuml;ncel kayıtları edinmek i&ccedil;in <strong>Yenile</strong>'ye tıklayın.</p>
<h4>Bir dosya aktarım işlemini durdurmak i&ccedil;in:</h4>
<p>Dosya aktarımını durdurmak i&ccedil;in <b>Bağlantıyı kes</b>'e tıklayın. İşlemi başarıyla tamamlamak i&ccedil;in dosya aktarımını tekrar başlatmanız gerekecektir.</p>


<h2>Ayarlar</h2>
<p>Aşağıdaki se&ccedil;enekleri ayarlamak i&ccedil;in <strong>Ayarlar</strong>'a tıklayın:</p>
<ul>
<li>A&ccedil;ılır men&uuml;den dakika cinsinden <strong>Ger&ccedil;ek zamanlı s&uuml;re</strong> bilgisini se&ccedil;in.</li>
<li>Ge&ccedil;miş verileri g&ouml;r&uuml;nt&uuml;lemek isterseniz<strong> Kullanım ge&ccedil;mişini etkinleştir</strong>'i işaretleyin. Bu bağlandığında, performans grafiklerini g&ouml;r&uuml;nt&uuml;lerken, sağ &uuml;st k&ouml;şedeki a&ccedil;ılır men&uuml;den <strong>Ger&ccedil;ek Zamanlı</strong>, <strong>1 G&uuml;nl&uuml;k</strong>, <strong>1 Haftalık</strong>, <strong>1 Aylık</strong> ve <strong>1 Yıllık</strong> arasında ge&ccedil;iş yapabilirsiniz.</li> 
<li>Sistem performansını izlemek istiyorsanız, <strong>Performans etkinliğini etkinleştir</strong> &ouml;ğesini işaretleyin.</li>
</ul>

<p>Ayarları kaydetmek i&ccedil;in <strong>Uygula</strong>'ya tıklayın.</p>

<h2>Performans Alarmları</h2>
<h4>Bir performans alarmı oluşturmak i&ccedil;in:</h4>
<ol>
<li><strong>Ayarlar</strong> &gt; <strong>Performans Alarmı Kuralı</strong>'na gidin.</li>
<li><b>Oluştur</b> d&uuml;ğmesine tıklayın.</li>
<li>Aşağıdaki kural ayarları mevcuttur:</li>
<ul>
<li><strong>Kaynak</strong>: Kuralı uygulamak istediğiniz kaynağı se&ccedil;in.</li>
<li><strong>T&uuml;r</strong>: Oluşturmak istediğiniz kuralı se&ccedil;in.</li>
<li><strong>Seviye</strong>: Alarm seviyesini se&ccedil;in.</li>
<li><strong>Daha b&uuml;y&uuml;k</strong>: Sistemin aşılması durumunda sizi uyaracağı kural tipinizin azami y&uuml;zdesini belirleyin.</li>
</ul>
<li>Bu kuralı derhal etkinleştirmek istiyorsanız <strong>Etkinleştirildi</strong> &ouml;ğesini işaretleyin.</li>
<li>Kuralı eklemek i&ccedil;in <strong>Tamam</strong>'a tıklayın.</li>
</ol>


<div class="section">
<h4>Performans alarmları i&ccedil;in mekanizma:</h4>
<p>Performans alarmları, yanlış alarmları minimize etmek ve kısa s&uuml;re i&ccedil;inde sistem kaynaklarının aşırı t&uuml;ketimini &ouml;nlemek i&ccedil;in aşağıdaki mekanizma yoluyla &ccedil;alışacaktır.</p>
<ol>
	<li>Performans alarmı hizmeti her beş dakikada bir t&uuml;m kuralları kontrol edecektir. İzlenen t&uuml;m değerler belirlemiş olduğunuz eşiklerin altına d&uuml;şerse hi&ccedil;bir eylem tetiklenmeyecektir.</li>
	<li>İzlenen bir değer eşiğini aştığında, bir alarm hemen verilmeyecektir. Bunun yerine, sistem 30 saniyelik aralıklarla kuralı beş defa daha kontrol edecektir.</li>
	<li>Aralık uzunluğunun değiştirilmesi sonrasında, eğer izlenen değer eşiği art arda beş defa aşarsa, bir alarm tetiklenir; ancak eğer, izlenen değer bu beş kontrol&uuml;n herhangi birisinde eşiğin altına d&uuml;şerse, aralık uzunluğu tekrar beş dakika olarak değiştirilir.</li>
</ol>
<p>Dolayısıyla, tek bir olay i&ccedil;in, olayın ilk algılanmasından en ge&ccedil; 450 saniye sonrasında bir alarm tetiklenecektir.</p>

<h4>Alarm seviyeleri:</h4>
<p>Performans alarmları, alarm seviyelerine bağlı olarak farklı eylemleri tetikleyecektir.</p>
<ul>
	<li><strong>Uyarı</strong>: Sistem g&uuml;nl&uuml;ğ&uuml;nde bir uyarı mesajı oluşturur ancak herhangi bir sistem bildirimini tetiklemez.</li>
	<li><strong>Kritik</strong>: Sistemde bir mesaj oluşturmanın yanında sistem bildirimlerini de tetikler.</li>
</ul>
<p>Performans alarmlarının g&uuml;nl&uuml;kleri <strong>Performans Alarmı</strong> sekmesinde veya DSM'nin <strong>G&uuml;nl&uuml;k Merkezi</strong>'nde g&ouml;r&uuml;nt&uuml;lenebilir.</p>
</div>


<h4>Performans alarmlarını g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in:</h4>
<ul>
<li>Tetiklenen t&uuml;m performans alarmlarını g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in <strong>Performans Alarmı</strong> sekmesine tıklayın.</li> 
<li>En g&uuml;ncel alarmları almak i&ccedil;in <strong>Yenile</strong>'ye tıklayın.</li>
</ul>

<h4>Performans alarmlarını dışarı aktarmak i&ccedil;in:</h4>
<ol>
<li><strong>Dışarı aktar</strong> d&uuml;ğmesinin yanındaki oka tıklayın.</li>
<li>Alarmlarınızı <strong>HTML</strong> veya <strong>CSV</strong> olarak dışarı aktarmayı se&ccedil;ebilirsiniz.</li>
</ol>
<div class="section"><h4>Not:</h4>
<ul>
<li><strong>Performans Alarmları</strong> i&ccedil;in destek Synology NAS modelleri arasında değişiklik arz eder. Daha fazla bilgi i&ccedil;in, l&uuml;tfen <a href="http://www.synology.com/" target="_b +lank">www.synology.com</a> sitesini ziyaret edin.</li>
</ul>
</div>
</body>
</html>
