
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Kaynak Monit&ouml;r&uuml;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Performans</h2>
<p>Kaynak kullanımı verilerini g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in <strong>Performans</strong> sekmesine tıklayın. Grafiğin ayrıntılı tarih, saat ve bilgisi, fareyle &uuml;zerinden ge&ccedil;ildiğinde g&ouml;sterilecektir.</p>

<h3>CPU</h3>
<p><strong>Kullanıcı</strong>, <strong>Sistem</strong> ve <strong>I/O Bekleme</strong> şeklindeki genel CPU kullanımını g&ouml;rebilirsiniz. Kaynak Monit&ouml;r&uuml; ilk başlatıldığında CPU kullanımı y&uuml;ksek olabilir, bunun nedeni sistemin aynı anda kaynak verisi toplaması ve kullanıcı arabirim sayfasını y&uuml;klemesi gerekliliğindendir.</p>
<p><strong>Kullanıcı</strong>, kullanıcı uygulamalarını &ccedil;alıştırmak i&ccedil;in kullanılan CPU y&uuml;zdesini g&ouml;sterir. <strong>Sistem</strong>, sistemin kendisinde kullanılan CPU y&uuml;zdesini, donanım/yazılım IRQ'larını g&ouml;sterir. <strong>I/O Bekleme</strong>, I/O beklemesinde harcanan CPU y&uuml;zdesini g&ouml;sterir.</p>
<p><strong>Kullanım</strong>, <strong>Kullanıcı</strong> ve <strong>Sistem</strong> CPU kullanımının toplamıdır.</p>
<p>1, 5 ve 15 dakika i&ccedil;indeki Y&uuml;k Ortalaması, &ccedil;alışma kuyruğu uzunluğunu g&ouml;stererek g&ouml;r&uuml;nt&uuml;lenir (yani, &ccedil;alışmakta olan işlemlerin sayısıyla &ccedil;alışmayı bekleyenlerin sayısının toplamı). </p>
<div class="section">
<h4>Terim A&ccedil;ıklaması</h4>
<ul>
<li><b>I/O bekleme</b>: I/O bekleme CPU'nun boşta olduğunu ve herhangi bir program tarafından kullanılmadığını belirtir. </li>
<p>I/O bekleme normal bir davranıştır. CPU hızı I/O'nun hızından &ccedil;ok daha y&uuml;ksek olduğu i&ccedil;in, CPU genellikle disklerin veya ağın iletiminin tamamlanmasını beklemek zorundadır. Ancak, I/O bekleme y&uuml;zdesi &ccedil;ok b&uuml;y&uuml;kse, bu CPU'nun zamanın &ccedil;oğunu I/O beklemesinde ge&ccedil;irmesi ve iyi bir şekilde kullanılamayabilmesi anlamına gelir. Daha y&uuml;ksek sistem performansı elde etmek i&ccedil;in daha verimli disk grubu yapılandırmalarını (SHR veya RAID 5 gibi) veya ağ yapılandırmalarını (Bonding gibi) kullanabilirsiniz.</p> 
</ul>
</div>
<h3>Bellek</h3>
<p>Fiziksel belleğin genel bellek kullanımı ve takas alanı g&ouml;sterilecektir. Verilerin sabit diske erişim yapmadan hızla elde edilebilmesi i&ccedil;in sistem sıklıkla erişilen verileri &ouml;nbellekte sakladığından bellek kullanımı y&uuml;ksek durumda kalır. Genel bellek yetersiz olduğunda &ouml;nbellek hafızası boşaltılır.</p>
<p>Y&uuml;ksek takas alanı kullanımı, yetersiz sistem belleğini belirtir ve sistem performansını da etkileyecektir. &Uuml;stteki a&ccedil;ılan men&uuml;den <strong>Değiştir</strong>'i se&ccedil;erek, i&ccedil;e değiştirme ve dışa değiştirme oranını g&ouml;r&uuml;nt&uuml;leyebilirsiniz. </p>

<h3>Ağ</h3>
<p>Ağ akış &ccedil;izelgesi g&ouml;nderilen ve alınan veriyi KB/sn olarak g&ouml;sterir. PPPoE bağlıysa, aktarım hızı da &ccedil;izelgede g&ouml;r&uuml;n&uuml;r.</p>

<h3 class="disable-dockerx64">Disk</h3>
<p class="disable-dockerx64">Grafiğin &uuml;st&uuml;ndeki a&ccedil;ılır men&uuml;ye tıklayarak, genel disk kullanımını, aktarım hızını ya da IOPS'u g&ouml;r&uuml;nt&uuml;lemeyi se&ccedil;ebilirsiniz. Verilerini grafiğe eklemek amacıyla onay kutularını işaretleyerek daha fazla disk eklemek i&ccedil;in, alttaki <strong>T&uuml;m&uuml;n&uuml; G&ouml;r&uuml;nt&uuml;le</strong>'ye tıklayabilirsiniz.</p>


<h3 class="disable-eds14 disable-dockerx64">Birim</h3>
<p class="disable-eds14 disable-dockerx64">Bu sayfa birimlerin genel aktarım durumunu g&ouml;r&uuml;nt&uuml;ler. Aktarım kullanımını, aktarım oranını ya da IOPS'ı g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in grafiğin &uuml;st&uuml;ndeki a&ccedil;ılan men&uuml;ye tıklayın. Belirli birimleri se&ccedil;mek i&ccedil;in <strong>T&uuml;m&uuml;n&uuml; G&ouml;r&uuml;nt&uuml;le</strong> d&uuml;ğmesine tıklayıp bunları grafiğe ekleyin.</p>

<h3 class="disable-eds14 disable-dockerx64">iSCSI</h3>
<p class="disable-eds14 dixable-dockerx64">Bu sayfa &ccedil;alışmakta olan iSCSI LUN'ların genel durumunu g&ouml;r&uuml;nt&uuml;ler. Bir LUN'ı se&ccedil;mek ve durumunu g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in grafiğin &uuml;zerindeki a&ccedil;ılır men&uuml;ye tıklayın. &Uuml;&ccedil; grafik varsayılan olarak g&ouml;r&uuml;nt&uuml;lenir, bunlar <strong>Kapasite</strong>, <strong>IOPS</strong> ve <strong>Bekleme</strong>'dir. Daha ayrıntılı bilgi i&ccedil;in, g&ouml;r&uuml;nt&uuml;lemek istediğiniz diğer grafikleri se&ccedil;mek &uuml;zere <strong>Grafikleri Se&ccedil;</strong> d&uuml;ğmesine tıklayın.</p>

</body>
</html>
