
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Kaynak Monit&ouml;r&uuml;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Performans Alarmı*</h2>
<h4>Bir performans alarmı kuralı oluşturmak i&ccedil;in:</h4>
<ol>
<li><strong>Ayarlar</strong> &gt; <strong>Ayarlar</strong> &ouml;ğesine gidin ve <strong>Performans alarmını etkinleştir</strong> &ouml;ğesini işaretlediğinizden emin olun.</li>
<li><strong>Ayarlar</strong> &gt; <strong>Performans Alarmı Kuralları</strong>'na gidin.</li>
<li><b>Oluştur</b> d&uuml;ğmesine tıklayın.</li>
<li>Aşağıdaki kural ayarları mevcuttur:</li>
<ul>
<li><strong>Kaynak</strong>: Kuralı uygulamak istediğiniz kaynağı se&ccedil;in.</li>
<li><strong>T&uuml;r</strong>: Oluşturmak istediğiniz kuralı se&ccedil;in.</li>
<li><strong>Seviye</strong>: Alarm seviyesini se&ccedil;in.</li>
<li><strong>Daha b&uuml;y&uuml;k</strong>: Sistemin aşılması durumunda sizi uyaracağı kural tipinizin azami y&uuml;zdesini belirleyin.</li>
</ul>
<li>Bu kuralı derhal etkinleştirmek istiyorsanız <strong>Etkinleştirildi</strong> &ouml;ğesini işaretleyin.</li>
<li>Kuralı eklemek i&ccedil;in <strong>Tamam</strong>'a tıklayın.</li>
</ol>


<div class="section">
<h4>Performans alarmları i&ccedil;in mekanizma:</h4>
<p>Performans alarmları, yanlış alarmları minimize etmek ve kısa s&uuml;re i&ccedil;inde sistem kaynaklarının aşırı t&uuml;ketimini &ouml;nlemek i&ccedil;in aşağıdaki mekanizma yoluyla &ccedil;alışacaktır.</p>
<ol>
	<li>Performans alarmı hizmeti her beş dakikada bir t&uuml;m kuralları kontrol edecektir. İzlenen t&uuml;m değerler belirlemiş olduğunuz eşiklerin altına d&uuml;şerse hi&ccedil;bir eylem tetiklenmeyecektir.</li>
	<li>İzlenen bir değer eşiğini aştığında, bir alarm hemen verilmeyecektir. Bunun yerine, sistem 30 saniyelik aralıklarla kuralı beş defa daha kontrol edecektir.</li>
	<li>Aralık uzunluğunun değiştirilmesi sonrasında, eğer izlenen değer eşiği art arda beş defa aşarsa, bir alarm tetiklenir; ancak eğer, izlenen değer bu beş kontrol&uuml;n herhangi birisinde eşiğin altına d&uuml;şerse, aralık uzunluğu tekrar beş dakika olarak değiştirilir.</li>
</ol>
<p>Dolayısıyla, tek bir olay i&ccedil;in, olayın ilk algılanmasından en ge&ccedil; 450 saniye sonrasında bir alarm tetiklenecektir.</p>

<h4>Alarm seviyeleri:</h4>
<p>Performans alarmları, alarm seviyelerine bağlı olarak farklı eylemleri tetikleyecektir.</p>
<ul>
	<li><strong>Uyarı</strong>: Sistem g&uuml;nl&uuml;ğ&uuml;nde bir uyarı mesajı oluşturur ancak herhangi bir sistem bildirimini tetiklemez.</li>
	<li><strong>Kritik</strong>: Sistemde bir mesaj oluşturmanın yanında sistem bildirimlerini de tetikler.</li>
</ul>
<p>Performans alarmlarının g&uuml;nl&uuml;kleri <strong>Performans Alarmı</strong> sekmesinde veya DSM'nin <strong>G&uuml;nl&uuml;k Merkezi</strong>'nde g&ouml;r&uuml;nt&uuml;lenebilir.</p>
</div>


<h4>Performans alarmlarını g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in:</h4>
<ul>
<li>Tetiklenen t&uuml;m performans alarmlarını g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in <strong>Performans Alarmı</strong> &ouml;ğesine gidin.</li>
<li>En g&uuml;ncel alarmları almak i&ccedil;in <strong>Yenile</strong>'ye tıklayın.</li>
</ul>

<h4>Performans alarmlarını dışarı aktarmak i&ccedil;in:</h4>
<ol>
<li><strong>Performance Alarmı</strong>'na gidin.</li>
<li><strong>Dışarı aktar</strong> d&uuml;ğmesinin yanındaki oka tıklayın.</li>
<li>Alarmlarınızı <strong>HTML</strong> veya <strong>CSV</strong> olarak dışarı aktarmayı se&ccedil;ebilirsiniz.</li>
</ol>
<div class="section"><h4>Not:</h4>
<ul>
<li><strong>Performans Alarmları</strong> i&ccedil;in destek Synology NAS modelleri arasında değişiklik arz eder. Daha fazla bilgi i&ccedil;in, l&uuml;tfen <a href="http://www.synology.com/" target="_blank">www.synology.com</a> sitesini ziyaret edin.</li>
</ul>
</div>

<p>____<br /> * Sadece belirli modellerde vardır.</p>

</body>
</html>
