<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Sikkerhetskopiere data p&aring; min PC/Mac med Cloud Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Sikkerhetskopiere data p&aring; min PC/Mac med Cloud Station</h1>
<div class="tutorials_content">
<img src="../../images/Backup/1x/backup_from_PC/07_1_back_up_your_data_from_pc.png" />
<h2>Oversikt</h2>
<p>Cloud Station Server er ikke bare en sofistikert synkroniseringsprogramvare p&aring; tvers av plattformer, men ogs&aring; en smartere metode for &aring; sikkerhetskopiere personlige datamaskiner. Cloud Station Backup er en umiddelbar og nettverkssparende sikkerhetskopil&oslash;sning som tilbyr bedre beskyttelse med opptil 32 historikkversjoner av &eacute;n enkelt fil.</p>
<h3 class="list_head">Sett opp Cloud Station Server p&aring; Synology NAS</h3>
<ol>

<li>G&aring; til <b>Pakkesenter</b>, finn <b>Cloud Station Server</b> og klikk p&aring;&nbsp;<strong>Installer</strong>.</li>
 
<li>Kj&oslash;r <strong>Cloud Station Server</strong>.</li>
<li>G&aring; til <strong>Oversikt</strong> og klikk p&aring; <strong>Last ned n&aring;</strong> under <strong>Cloud Station Backup</strong>. (Du kan ogs&aring; laste ned Cloud Station Backup fra <a href="https://www.synology.com/en-us/support/download" target="_blank">Synology Nedlastingssenter</a>.)</li>
<img src="../../images/Backup/1x/backup_from_PC/download_backup.png" border="1" />
<li>Kj&oslash;r installasjonsprogrammet p&aring; datamaskinen din og f&oslash;lg instruksjonene for &aring; installere Cloud Station Backup. </li>
<li>N&aring;r installasjonen er fullf&oslash;rt, kj&oslash;rer du <strong>Cloud Station Backup</strong> p&aring; datamaskinen din. Klikk p&aring; <strong>Start n&aring;</strong>.</li>
<img src="../../images/Backup/1x/backup_from_PC/start_now.png" border="1" />
<li>Angi adressen til den Synology NAS som kj&oslash;rer Cloud Station Server (eller QuickConnect ID), brukernavn og passord. (Du kan ogs&aring; klikke p&aring; s&oslash;keikonet til h&oslash;yre for &aring; la Cloud Station Backup automatisk s&oslash;ke etter andre Synology NAS-enheter p&aring; ditt LAN.) Klikk p&aring; <strong>Neste</strong>.</li>
<img src="../../images/Backup/1x/backup_from_PC/enter_credentials.png" border="1" />
<li>Velg sikkerhetskopikilde og fjern avmerking for undermapper du ikke vil synkronisere. </li>
<img src="../../images/Backup/1x/backup_from_PC/backup_settings_source.png" border="1" />
<li>Velg en mappe p&aring; din Synology NAS ved &aring; klikke p&aring; <strong>Velg</strong>. Cloud Station Backup vil opprette en sikkerhetskopimappe med ditt datamaskinnavn i m&aring;let du har valgt. Mappen <strong>home</strong> velges som m&aring;lmappe som standard. Hvis du vil bruke en mappe som ikke er p&aring; listen, kontakter du systemadministratoren din. Systemadministratorer kan r&aring;df&oslash;re seg med <strong>Administrere Cloud Station Server-deling</strong> i <a href="https://www.synology.com/en-global/knowledgebase/DSM/help/CloudStation/cloudstation" target="_blank">hjelp for Cloud Station Server</a>.</li>
<img src="../../images/Backup/1x/backup_from_PC/backup_destination.png" border="1" />
<li>Klikk p&aring; <strong>Sikkerhetskopiregler</strong> hvis du vil synkronisere filter eller regler.</li>

<li>Klikk p&aring; <strong>Neste</strong> for &aring; se over sikkerhetskopiinnstillingene dine og klikk p&aring;<strong>Ferdig</strong>.</li>
<img src="../../images/Backup/1x/backup_from_PC/summary.png" border="1" />
<li>Du kan se fremdriften i hovedappen.</li>
<img src="../../images/Backup/1x/backup_from_PC/progress.png" border="1" />
</ol>

<h3 class="list_head">Last ned eller gjenopprett en tidligere versjon av en synkronisert fil fra Cloud Station Server</h3>
<ol>
  <li>G&aring; til <strong>Cloud Station Server</strong> &gt; <strong>Versjonshistorikk</strong> og finn filen eller mappen du vil gjenopprette.</li>
  <img src="../../images/BuildCloud/1x/cloud_sync_files/version_history.png" border="1" />
  <li>Velg filen du vil hente og klikk p&aring; <strong>Handling</strong>. Klikk p&aring; <strong>Bla gjennom tidligere versjoner</strong>. Hvis en fil slettes eller fjernes fra datamaskinen ved et uhell, kan du klikke p&aring; <strong>Gjenopprett</strong> for &aring; gjenopprette den. </li>
  <img src="../../images/BuildCloud/1x/cloud_sync_files/browse_previous versions_server.png" border="1" />
<li>Velg filversjonen du vil laste ned og klikk p&aring; <strong>Last ned</strong>. Eller hvis du er sikker p&aring; at du vil gjenopprette den valgte versjonen, klikker du p&aring; <strong>Gjenopprett</strong> for &aring; overskrive den gjeldende versjonen.</li>
    <img src="../../images/BuildCloud/1x/cloud_sync_files/previous_versions.png" border="1" />

</ol>


  <h3 class="list_head">5. Ytterligere beskyttelse av dine data</h3>
  
<p>For flere m&aring;ter du kan beskytte og sikkerhetskopiere dine data, klikker du <a href="https://www.synology.com/knowledgebase/tutorials#BackupRestore" target="_blank">her</a> for &aring; se veiledninger for andre sikkerhetskopitjenester som DSM tilbyr.</p>

</div>
<div class="page-info">
  <ul>
    <li>Neste i dette emnet: <a href="backup_backup.html">Sikkerhetskopier data fra din Synology NAS</a> </li>
  </ul>
</div>
</body>

</html>