<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Blocage auto - Aide Synology DSM</title> 
<meta name="author" content="Synology Inc.">
<meta name="description" content="The auto block feature helps improve the security of your Synology NAS by blocking the IP addresses of clients with too many failed login attempts.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Blocage auto</h2>

<p>La propri&eacute;t&eacute; de blocage automatique aide &agrave; am&eacute;liorer la s&eacute;curit&eacute; de votre Synology NAS en bloquant les adresses IP des clients ayant de trop nombreux &eacute;checs de tentatives de connexion. Ceci aide &agrave; r&eacute;duire le risque des comptes &eacute;tant rompus en utilisant des attaques brutales par la force.</p>

<p>Vous pouvez &eacute;galement cr&eacute;er et g&eacute;rer une liste d'autorisations pour ajouter des adresses IP auxquelles vous faites confiance, ou une liste de blocage pour toujours emp&ecirc;cher que certaines adresses IP ne se connectent.</p>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>Diff&eacute;rents services et paquets prennent en charge le blocage automatique comme ceux qui suivent : DSM, SSH, Telnet, rsync, network backup, shared folder sync, FTP, WebDAV, File Station, Photo Station, Audio Station, Video Station, Download Station, Mail Server, Mail Station, Time Backup, VPN Server, Cloud Station et les applications mobiles Synology.</li>
</ul>
</div>

<h4>Pour activer le blocage automatique&nbsp;:</h4>
<ol>
	<li>Ouvrez le <strong>Panneau de configuration</strong> et allez dans <strong>S&eacute;curit&eacute;</strong> &gt; <strong>Blocage auto</strong>.</li>
	<li>Cochez <strong>Activer le blocage auto</strong>.</li>
	<li>Entrez un nombre d'&eacute;checs de tentatives de connexion dans le champ <strong>Tentatives de connexion</strong> et un nombre de minutes dans le champ <strong>Sous (minutes)</strong> . Une adresse IP sera bloqu&eacute;e si elle d&eacute;passe le nombre d'&eacute;checs de tentatives de connexion dans le nombre de minutes sp&eacute;cifi&eacute;es.</li>
	<li>Cochez <strong>Activer l'expiration des blocages</strong> et entrez un num&eacute;ro pour supprimer une adresse IP bloqu&eacute;e apr&egrave;s le nombre de jours sp&eacute;cifi&eacute;.</li>
	<li>Cliquez sur <strong>Appliquer</strong> pour enregistrer les param&egrave;tres.</li>
</ol>


<h3>G&eacute;rer la liste des blocages</h3>
<p>Cliquez sur <strong>Liste des permissions/blocages</strong> et acc&eacute;dez &agrave; l'onglet <strong>Liste de blocage</strong>. </p>

<h4>Pour ajouter des adresses IP :</h4>
<p>Choisissez l'un des &eacute;l&eacute;ments suivants dans le menu d&eacute;roulant <strong>Cr&eacute;er</strong>&nbsp;:</p>

<ul>
	<li><strong>Ajouter une adresse IP</strong>&nbsp;: Entrez une adresse IP et d&eacute;finissez le d&eacute;lai d'expiration.</li>
	<li><strong>Importer une liste d'adresses IP</strong>&nbsp;: Importez un fichier texte listant les adresses IP pour ajouter un certain nombre d'adresses IP et d&eacute;finir le d&eacute;lai d'expiration en m&ecirc;me. Cochez la case si vous souhaitez &eacute;craser les adresses IP existantes. Si cette option n'est pas s&eacute;lectionn&eacute;e, les adresses IP dupliqu&eacute;es sont ignor&eacute;es.<br />Si le fichier que vous avez s&eacute;lectionn&eacute; est d'un format correct, vous pouvez voir toutes les adresses IP dans la zone de l'aper&ccedil;u. Cliquez sur <strong>OK</strong> pour importer.</li>
</ul>

<div class="section"><h4>Remarque&nbsp;:</h4>
<p>Pour importer un fichier, le fichier doit r&eacute;pondre aux crit&egrave;res suivants&nbsp;:</p>
<ul>
	<li>Le fichier doit &ecirc;tre un fichier texte.</li>
	<li>Chaque ligne du fichier ne peut contenir qu'une seule adresse IP.</li>
	<li>Les lignes de commentaires commencent par un # (di&egrave;se).</li>
</ul>
</div>

<h4>Pour supprimer des adresses IP bloqu&eacute;es&nbsp;:</h4>
<p>S&eacute;lectionnez les adresses IP que vous souhaitez supprimer de la liste et cliquez sur <strong>Supprimer</strong>.</p>


<h3>Gestion de la liste des permissions</h3>

<p>Cliquez sur <strong>Liste des permissions/blocages</strong> et allez sur l'onglet <strong>Liste des permissions</strong>.</p>

<h4>Pour ajouter des adresses IP :</h4>
<p>Choisissez l'un des &eacute;l&eacute;ments suivants dans le menu d&eacute;roulant <strong>Cr&eacute;er</strong>&nbsp;:</p>
<ul>
	<li><strong>Ajouter une adresse IP</strong>&nbsp;: Saisissez une adresse IP, une plage d'IP, un sous-r&eacute;seau ou un nom de domaine.</li>
	<li><strong>Importer une liste d'adresses IP</strong>&nbsp;: Importez un fichier texte listant les adresses IP pour ajouter un certain nombre d'adresses IP en une fois. Cochez la case si vous souhaitez &eacute;craser les adresses IP existantes. Si cette option n'est pas s&eacute;lectionn&eacute;e, les adresses IP dupliqu&eacute;es sont ignor&eacute;es.<br />Si le fichier que vous avez s&eacute;lectionn&eacute; est d'un format correct, vous pouvez voir toutes les adresses IP dans la zone de l'aper&ccedil;u. Cliquez sur <strong>OK</strong> pour importer.</li>
</ul>

<div class="section"><h4>Remarque&nbsp;:</h4>
<p>Pour importer un fichier, le fichier doit r&eacute;pondre aux crit&egrave;res suivants&nbsp;:</p>
<ul>
<li>Le fichier doit &ecirc;tre un fichier texte.</li>
<li>Chaque ligne du fichier ne peut contenir qu'une adresse IP, une plage d'IP, (<em>192.168.1.1 - 192.168.1.10</em>), un sous-r&eacute;seau (<em>192.168.1.1/255.255.0.0</em>) ou un nom de domaine (<em>www.synology.com</em>).</li>
<li>Les lignes de commentaires commencent par un # (di&egrave;se).</li>
</ul>
</div>

<h4>Pour supprimer des adresses IP&nbsp;:</h4>
<p>S&eacute;lectionnez les adresses IP que vous souhaitez supprimer de la liste et cliquez sur <strong>Supprimer</strong>.</p>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>Si votre appareil Synology NAS est derri&egrave;re un serveur proxy invers&eacute;, veuillez ajouter l'adresse IP de ce serveur proxy invers&eacute; &agrave; la liste d'autorisation.</li>
</ul>
</div>

</body>
</html>
