<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>DDNS</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>DDNS</h2>
<p>DDNS (Dynamic Domain Name Service) simplifie la connexion &agrave; votre Synology NAS via Internet en mappant un nom d&apos;h&ocirc;te &agrave; son adresse IP. Par exemple, DDNS vous permet d&apos;acc&eacute;der &agrave; votre Synology NAS en utilisant un nom de domaine (par exemple&nbsp;: <i>www.john.synology.me</i>), sans avoir &agrave; vous rappeler d&apos;une adresse IP (par exemple&nbsp;: <i>172.16.254.1</i>).</p>

<h3>Configurer DDNS</h3>
<p>Vous pouvez pointer un nom d&apos;h&ocirc;te existant &agrave; l&apos;adresse IP de votre Synology NAS ou en obtenir un nouveau fourni par Synology ou plusieurs autres fournisseurs de DDNS. Veuillez consulter chaque fournisseur pour plus de d&eacute;tails concernant l&apos;enregistrement d&apos;un nom d&apos;h&ocirc;te.</p>



<h4>Pour configurer un nom d&apos;h&ocirc;te DDNS&nbsp;:</h4>
<ol>
<li>Cliquez sur le bouton <b>Ajouter</b>.</li>
<li>Une bo&icirc;te de dialogue s&rsquo;affiche vous invitant &agrave; modifier les param&egrave;tres suivants&nbsp;:<ul>
<li><strong>Fournisseur de service&nbsp;:</strong> s&eacute;lectionnez un fournisseur de service. Pour obtenir un nom d&apos;h&ocirc;te gratuit fourni par Synology, choisissez <b>Synology</b> dans le menu d&eacute;roulant.</li>
<li><strong>Nom d&apos;h&ocirc;te&nbsp;:</strong> entrez un nom d&apos;h&ocirc;te DDNS enregistr&eacute;, comme <i>john.synology.me</i>.</li>
<li><strong>Nom d&apos;utilisateur / e-mail&nbsp;:</strong> entrez le nom d&apos;utilisateur pour votre fournisseur DDNS.</li>
<li><strong>Mot de passe / cl&eacute;&nbsp;:</strong> entrez le mot de passe / la cl&eacute; pour votre fournisseur DDNS.</li>
<li><strong>Adresse externe&nbsp;:</strong> entrez l&apos;adresse IP externe du Synology NAS qui utilisera le nom d&apos;h&ocirc;te.</li>
<li><strong>Heartbeat&nbsp;:</strong> activez cette option pour recevoir des alertes sur l&apos;&eacute;tat du nom d&apos;h&ocirc;te mapp&eacute; (uniquement pour les noms d&apos;h&ocirc;tes fournis par Synology).</li>
</ul>
</li>
<li>Cliquez sur <strong>Test de connexion</strong> pour voir si les param&egrave;tres sont corrects.</li>
<li>Cliquez sur <strong>OK</strong> pour enregistrer et terminer.</li>
<li>Si vous avez s&eacute;lectionn&eacute; <strong>Synology</strong> comme fournisseur de services, un message s&apos;affiche s&apos;il n&apos;y a pas de certificat SSL correspondant &agrave; votre nom d&apos;h&ocirc;te DDNS. Il est recommand&eacute; de signer un certificat Let&apos;s Encrypt pour le nom d&apos;h&ocirc;te et de le d&eacute;finir comme certificat par d&eacute;faut. Cliquez sur <strong>Oui</strong>.<p><span class="note_head">Remarque&nbsp;:</span> si un certificat SSL correspond d&eacute;j&agrave; &agrave; votre nom d&apos;h&ocirc;te DDNS, un message s&apos;affiche et vous demande si vous souhaitez le d&eacute;finir comme certificat par d&eacute;faut. Ce message s&apos;affiche chaque fois que le nom d&apos;h&ocirc;te DDNS est modifi&eacute;. Pour plus d&apos;informations sur le certificat SSL, voir <a href="https://www.synology.com/knowledgebase/DSM/help/DSM/AdminCenter/connection_certificate" target=blank>ici</a>.</p>
	</li>
</ol>

<p>Une fois la configuration termin&eacute;e, vous pouvez acc&eacute;der &agrave; votre Synology NAS sur Internet en entrant le nom d&apos;h&ocirc;te DDNS dans un navigateur Web.</p>
<div class="section">
<h4>Conditions et limites</h4>
<ul> 
<li>Les serveurs du fournisseur de service DDNS fonctionnent.</li>
<li>Le Synology NAS peut se connecter &agrave; Internet.</li>
<li>DDNS ne fonctionne que dans un environnement r&eacute;seau o&ugrave; aucun serveur proxy n&apos;est n&eacute;cessaire.</li>
<li>Vous ne pouvez entrer qu&apos;un nom d&apos;h&ocirc;te pour chaque fournisseur de service DDNS.</li>

</ul>
</div>

<h3>Gestion des noms d&apos;h&ocirc;tes</h3>
<p>Utilisez les boutons suivants pour g&eacute;rer les entr&eacute;es des noms d&apos;h&ocirc;tes existants&nbsp;:</p>
<ul>
<li><strong>Supprimer&nbsp;:</strong> supprime le nom d&apos;h&ocirc;te s&eacute;lectionn&eacute; de la liste.</li>
<li><strong>Modifier&nbsp;:</strong> changez les param&egrave;tres de l&apos;entr&eacute;e du nom d&apos;h&ocirc;te s&eacute;lectionn&eacute;.</li>
<li><strong>Mettre &agrave; jour maintenant&nbsp;:</strong> met &agrave; jour le statut de toutes les entr&eacute;es des noms d&apos;h&ocirc;tes dont le service DDNS est activ&eacute;.</li></ul>

<h3>Configuration d&apos;un fournisseur DDNS personnalis&eacute;</h3>
<p>Vous pouvez ajouter un fournisseur DDNS personnalis&eacute; si votre fournisseur ne s&apos;affiche pas d&eacute;j&agrave; dans la liste des fournisseurs de services.</p>
<h4>Pour configurer un fournisseur DDNS personnalis&eacute;&nbsp;:</h4>
<ol>
<li>Cliquez sur <b>Personnaliser</b>.</li>
<li>Une bo&icirc;te de dialogue s&rsquo;affiche vous invitant &agrave; saisir les param&egrave;tres suivants&nbsp;:<ul>
    <li><strong>Fournisseur de service&nbsp;:</strong> saisissez le nom de votre fournisseur de services personnalis&eacute;.</li>
    <li><strong>URL de la requ&ecirc;te&nbsp;:</strong> saisissez l&apos;URL de votre fournisseur de services personnalis&eacute;.</li>
  </ul>
</li>
<li>Cliquez sur <strong>Enregistrer</strong> pour ajouter le fournisseur de services personnalis&eacute; &agrave; la liste des fournisseurs de services DDNS.</li>
</ol>
<div class="section">
<h4>Conditions et limites</h4>
<ul>
  <li>L&apos;URL de la requ&ecirc;te doit &ecirc;tre conforme au protocole sp&eacute;cifi&eacute; par votre fournisseur de services. Cette URL est utilis&eacute;e pour mettre &agrave; jour les informations d&apos;IP sur le serveur DDNS de votre fournisseur.</li>
  <li>Une URL de requ&ecirc;te comprend g&eacute;n&eacute;ralement les quatre param&egrave;tres ci-dessous. Lorsque vous saisissez l&apos;URL de requ&ecirc;te, remplacez les param&egrave;tres suivants par la variable correspondante.</li>
  <ul>
    <li>Nom d&apos;utilisateur&nbsp;: __USERNAME__</li>
    <li>Mot de passe&nbsp;: __PASSWORD__</li>
    <li>Nom d&apos;h&ocirc;te&nbsp;: __HOSTNAME__</li>
    <li>Adresse externe&nbsp;: __MYIP__</li>
  </ul>
<li>L&apos;URL de requ&ecirc;te ne peut pas comporter d&apos;espace ni de point-virgule.</li>
</ul>
</div>
</body>
</html>
