<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Compte - Aide de Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Protect your account from external attacks.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Compte</h2>

<p>Prot&eacute;gez votre compte contre les attaques externes.</p>

<h2>Blocage automatique</h2>

<p>La propri&eacute;t&eacute; de blocage automatique aide &agrave; am&eacute;liorer la s&eacute;curit&eacute; de votre Synology NAS en bloquant les adresses&nbsp;IP des clients ayant de trop nombreux &eacute;checs de tentatives de connexion. Cette option permet de r&eacute;duire le risque de comptes rompus par des attaques de force brute.</p>

<p>Vous pouvez &eacute;galement cr&eacute;er et g&eacute;rer une liste d&apos;autorisations pour ajouter des adresses IP auxquelles vous faites confiance, ou une liste de blocage pour toujours emp&ecirc;cher que certaines adresses&nbsp;IP ne se connectent.</p>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>Diff&eacute;rents services et paquets prennent en charge le blocage automatique comme ceux qui suivent&nbsp;: DSM, SSH, Telnet, rsync, network backup, synchronisation du dossier partag&eacute;, FTP, WebDAV, File Station, Photo Station, Audio Station, Video Station, Download Station, Mail Server, Mail Station, Time Backup, VPN Server, Cloud Station et les applications mobiles Synology.</li>
</ul>
</div>

<h4>Pour activer le blocage automatique&nbsp;:</h4>
<ol>
	<li>Ouvrez le <strong>Panneau de configuration</strong> et acc&eacute;dez &agrave; <strong>S&eacute;curit&eacute;</strong>&nbsp;&gt; <strong>Blocage automatique</strong>.</li>
	<li>Cochez la case <strong>Activer le blocage automatique</strong>.</li>
	<li>Saisissez un nombre d&apos;&eacute;checs de tentatives de connexion dans le champ <strong>Tentatives de connexion</strong> et un nombre de minutes dans le champ <strong>Dans les (minutes)</strong>. Une adresse&nbsp;IP sera bloqu&eacute;e si elle d&eacute;passe le nombre d&apos;&eacute;checs de tentatives de connexion dans le nombre de minutes sp&eacute;cifi&eacute;.</li>
	<li>Cochez la case <strong>Activer l&apos;expiration des blocages</strong> et saisissez un num&eacute;ro pour supprimer une adresse&nbsp;IP bloqu&eacute;e apr&egrave;s le nombre de jours sp&eacute;cifi&eacute;.</li>
	<li>Cliquez sur <strong>Appliquer</strong> pour enregistrer les param&egrave;tres.</li>
</ol>


<h3>G&eacute;rer la liste des blocages</h3>
<p>Cliquez sur <strong>Liste des autorisations/blocages</strong> et acc&eacute;dez &agrave; l&apos;onglet <strong>Liste des blocages</strong>.</p>

<h4>Pour ajouter des adresses IP&nbsp;:</h4>
<p>Choisissez l&apos;une des options suivantes dans le menu d&eacute;roulant <strong>Cr&eacute;er</strong>&nbsp;:</p>

<ul>
	<li><strong>Ajouter une adresse IP</strong>&nbsp;: saisissez une adresse IP et d&eacute;finissez le d&eacute;lai d&apos;expiration.</li>
	<li><strong>Importer une liste d&apos;adresses IP</strong>&nbsp;: importez un fichier texte listant les adresses&nbsp;IP pour ajouter un certain nombre d&apos;adresses&nbsp;IP et d&eacute;finir le d&eacute;lai d&apos;expiration en m&ecirc;me temps. Cochez la case si vous souhaitez &eacute;craser les adresses&nbsp;IP existantes. Si cette option n&apos;est pas s&eacute;lectionn&eacute;e, les adresses&nbsp;IP dupliqu&eacute;es sont ignor&eacute;es.<br />Si le format du fichier que vous avez s&eacute;lectionn&eacute; est correct, vous pouvez voir toutes les adresses&nbsp;IP dans la zone de l&apos;aper&ccedil;u. Cliquez sur <strong>OK</strong> pour importer.</li>
</ul>

<div class="section"><h4>Remarque&nbsp;:</h4>
<p>Pour importer un fichier, le fichier doit r&eacute;pondre aux crit&egrave;res suivants&nbsp;:</p>
<ul>
	<li>Le fichier doit &ecirc;tre un fichier texte.</li>
	<li>Chaque ligne du fichier ne peut contenir qu&apos;une seule adresse&nbsp;IP.</li>
	<li>Les lignes de commentaires commencent par un # (di&egrave;se).</li>
</ul>
</div>

<h4>Pour supprimer des adresses IP bloqu&eacute;es&nbsp;:</h4>
<p>S&eacute;lectionnez les adresses&nbsp;IP que vous souhaitez supprimer de la liste, puis cliquez sur <strong>Supprimer</strong>.</p>


<h3>G&eacute;rer la liste des autorisations</h3>

<p>Cliquez sur <strong>Liste des autorisations/blocages</strong> et acc&eacute;dez &agrave; l&apos;onglet <strong>Liste des autorisations</strong>.</p>

<h4>Pour ajouter des adresses IP&nbsp;:</h4>
<p>Choisissez l&apos;une des options suivantes dans le menu d&eacute;roulant <strong>Cr&eacute;er</strong>&nbsp;:</p>
<ul>
	<li><strong>Ajouter une adresse IP</strong>&nbsp;: saisissez une adresse&nbsp;IP, une plage d&apos;IP, un sous-r&eacute;seau ou un nom de domaine.</li>
	<li><strong>Importer une liste d&apos;adresses IP</strong>&nbsp;: importez un fichier texte listant les adresses&nbsp;IP pour ajouter un certain nombre d&apos;adresses&nbsp;IP en m&ecirc;me temps. Cochez la case si vous souhaitez &eacute;craser les adresses&nbsp;IP existantes. Si cette option n&apos;est pas s&eacute;lectionn&eacute;e, les adresses&nbsp;IP dupliqu&eacute;es sont ignor&eacute;es.<br />Si le format du fichier que vous avez s&eacute;lectionn&eacute; est correct, vous pouvez voir toutes les adresses&nbsp;IP dans la zone de l&apos;aper&ccedil;u. Cliquez sur <strong>OK</strong> pour importer.</li>
</ul>

<div class="section"><h4>Remarque&nbsp;:</h4>
<p>Pour importer un fichier, le fichier doit r&eacute;pondre aux crit&egrave;res suivants&nbsp;:</p>
<ul>
<li>Le fichier doit &ecirc;tre un fichier texte.</li>
<li>Chaque ligne du fichier ne peut contenir qu&apos;une adresse&nbsp;IP, une plage d&apos;IP, (<em>192.168.1.1 - 192.168.1.10</em>), un sous-r&eacute;seau (<em>192.168.1.1/255.255.0.0</em>) ou un nom de domaine (<em>www.synology.com</em>).</li>
<li>Les lignes de commentaires commencent par un # (di&egrave;se).</li>
</ul>
</div>

<h4>Pour supprimer des adresses IP&nbsp;:</h4>
<p>S&eacute;lectionnez les adresses&nbsp;IP que vous souhaitez supprimer de la liste, puis cliquez sur <strong>Supprimer</strong>.</p>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>Si votre p&eacute;riph&eacute;rique Synology NAS se trouve derri&egrave;re un serveur proxy invers&eacute;, ajoutez l&apos;adresse&nbsp;IP de ce serveur proxy invers&eacute; &agrave; la liste des autorisations.</li>
</ul>
</div>


<h2>Protection du compte</h2>

<p>La protection de compte permet d&apos;am&eacute;liorer la s&eacute;curit&eacute; de votre Synology NAS en prot&eacute;geant les comptes contre les clients non fiables dont les tentatives infructueuses de connexion sont trop nombreuses. Cela permet de r&eacute;duire le risque de comptes pirat&eacute;s par des attaques par force brute.</p>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>Services et paquets pris en charge&nbsp;: DSM, File Station, Audio Station, Video Station, Download Station, Mail Station, Cloud Station et les applications mobiles Synology.</li>
</ul>
</div>

<h4>Pour activer la protection du compte&nbsp;:</h4>
<ol>
	<li>Acc&eacute;dez &agrave; <strong>Panneau de configuration</strong>&nbsp;&gt; <strong>S&eacute;curit&eacute;</strong>&nbsp;&gt; <strong>Protection du compte</strong>.</li>
	<li>Cochez la case <strong>Activer la protection du compte</strong>.</li>
	<li>Sp&eacute;cifiez un nombre dans le champ <strong>Tentatives de connexion</strong> et <strong>Dans les (minutes)</strong>. Un client non fiable sera bloqu&eacute; s&apos;il ne parvient pas &agrave; se connecter &agrave; de trop nombreuses reprises dans une p&eacute;riode pr&eacute;d&eacute;termin&eacute;e.</li>
	<li>Sp&eacute;cifiez un nombre dans le champ <strong>D&eacute;bloquer (minutes plus tard)</strong>. La protection des comptes est annul&eacute;e apr&egrave;s la p&eacute;riode pr&eacute;d&eacute;finie.</li>
	<li>Cliquez sur <strong>Appliquer</strong> pour enregistrer les param&egrave;tres.</li>
</ol>

<h4>Pour annuler la protection des comptes s&eacute;lectionn&eacute;s</h4>
<ol>
	<li>Cliquez sur <strong>G&eacute;rer les comptes prot&eacute;g&eacute;s</strong>.</li>
	<li>S&eacute;lectionnez les comptes &agrave; annuler et cliquez sur <strong>Annuler la protection</strong>.</li> 
</ol>

<h4>Pour d&eacute;bloquer des clients fiables</h4>
<ol>
	<li>Cliquez sur <strong>G&eacute;rer les p&eacute;riph&eacute;riques fiables</strong>.</li>
	<li>S&eacute;lectionnez les clients &agrave; d&eacute;bloquer et cliquez sur <strong>D&eacute;bloquer</strong>.</li>
</ol>

</body>
</html>
