<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Win/Mac/NFS</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>

<body>

<h2>SMB</h2>
<p>Le protocole SMB (Server Message Block) permet aux clients Windows, Mac et Linux prenant en charge SMB/CIFS d&apos;acc&eacute;der aux donn&eacute;es stock&eacute;es sur le Synology NAS. Si vous d&eacute;sirez parcourir les fichiers sur le Synology NAS via l&apos;Explorateur Windows ou monter des dossiers partag&eacute;s en tant que disques r&eacute;seau, veuillez activer cette option dans <strong>Panneau de configuration</strong>&nbsp;&gt; <strong>Services de fichiers</strong>&nbsp;&gt; <strong>SMB/AFP/NFS</strong>.</p>

<h4>Pour activer le protocole SMB&nbsp;:</h4>
  <ol>
    <li>Cochez la case <strong>Activer le service&nbsp;SMB</strong>.</li>
    <li>Cliquez sur <strong>Appliquer</strong>.</li>
  </ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
  <ul>
    <li>Apr&egrave;s avoir activ&eacute; le protocole&nbsp;SMB, vous pouvez monter des dossiers enti&egrave;rement index&eacute;s sur votre ordinateur Mac via SMB et utiliser Finder pour rechercher le contenu de fichiers dans les dossiers mont&eacute;s (non applicable au NVR216 ou VS360HD).</li>
  </ul>
</div>


<h3>Groupe de travail</h3>
<p>Cette option vous permet de d&eacute;signer le syst&egrave;me comme membre d&apos;un groupe de travail sp&eacute;cifique &agrave; des fins de gestion de r&eacute;seau.</p>

<div class="section"><h4>Remarque&nbsp;:</h4>
  <ul>
    <li>Le nom d&apos;un groupe de travail peut inclure de 1 &agrave; 15&nbsp;caract&egrave;res. Le nom ne peut pas inclure les caract&egrave;res suivants&nbsp;: [ ] ; : &quot;< >* + = \ / | ? ,</li>
    <li>Si vous utilisez un MAC &eacute;quip&eacute; d&apos;OS&nbsp;X&nbsp;10.9 et que votre Synology NAS est connect&eacute; &agrave; un domaine Windows, vous pouvez vous connecter en ajoutant <strong>localhost\</strong> devant le nom d&apos;utilisateur local de votre Synology NAS afin d&apos;acc&eacute;der aux fichiers stock&eacute;s sur le Synology NAS via le protocole&nbsp;SMB.</li>
  </ul>
</div>


<h3>Refuser l&apos;acc&egrave;s aux versions pr&eacute;c&eacute;dentes</h3>
<p>Dans l&apos;Explorateur Windows, les utilisateurs peuvent acc&eacute;der aux instantan&eacute;s de dossiers ou de fichiers en cliquant sur l&apos;onglet <strong>Versions pr&eacute;c&eacute;dentes</strong> dans un dossier partag&eacute;, ce qui leur permet de restaurer ou de copier des donn&eacute;es sans avoir besoin de l&apos;aide d&apos;un administrateur. Si vous s&eacute;lectionnez <strong>Refuser l&apos;acc&egrave;s aux versions pr&eacute;c&eacute;dentes</strong>, la page «&nbsp;Versions pr&eacute;c&eacute;dentes&nbsp;» n&apos;affiche aucune information.</p>

<div class="section"><h4>Remarque&nbsp;:</h4>
  <ul>
    <li>Cette fonctionnalit&eacute; est uniquement prise en charge par VDSM et les mod&egrave;les dot&eacute;s des architectures de paquet suivantes&nbsp;: Apollo Lake, Avoton, Braswell, Broadwell, Bromolow, Cedarview et Grantley. Pour savoir quelle architecture de paquet est prise en charge par votre mod&egrave;le, veuillez vous reporter &agrave; <a href="https://www.synology.com/en-us/knowledgebase/DSM/tutorial/General/What_kind_of_CPU_does_my_NAS_have" target="_blank">cet article</a>.</li>
    <li>Les utilisateurs sont autoris&eacute;s &agrave; acc&eacute;der &agrave; la version pr&eacute;c&eacute;dente uniquement si, au moment o&ugrave; l&apos;instantan&eacute; correspondant &agrave; la version pr&eacute;c&eacute;dente a &eacute;t&eacute; pris, leurs comptes utilisateurs ont &eacute;t&eacute; cr&eacute;&eacute;s et qu&apos;on leur a octroy&eacute; la permission en lecture sur le dossier partag&eacute; dont l&apos;instantan&eacute; correspondant a &eacute;t&eacute; pris.</li>
  </ul>
</div>


<h3>Activer la journalisation des transferts</h3>
<p>Cochez la case <strong>Activer le journal de transfert</strong> pour activer la journalisation des op&eacute;rations de fichier effectu&eacute;es sur le protocole CIFS/SMB. Par d&eacute;faut, le journal de transfert ne surveille que la suppression d&apos;un fichier ou d&apos;un dossier. Vous pouvez cependant acc&eacute;der &agrave; <strong>Param&egrave;tres de journal</strong> pour s&eacute;lectionner d&apos;autres &eacute;v&eacute;nements d&apos;op&eacute;ration de fichier (cr&eacute;ation, d&eacute;placement, changement de nom, lecture, &eacute;criture) pour que le syst&egrave;me puisse se connecter. Veuillez noter que plus vous s&eacute;lectionnez d&apos;&eacute;v&eacute;nements d&apos;op&eacute;ration de fichier, plus les performances du syst&egrave;me seront affect&eacute;es.</p>


<h3>Param&egrave;tres avanc&eacute;s</h3>
<p>Cliquez sur le bouton <strong>Param&egrave;tres avanc&eacute;s</strong> pour voir les options ci-dessous.</p>
  <ul>
    <li><strong>WINS&nbsp;Server</strong>&nbsp;: Microsoft Windows Internet Name Service (WINS) est un service de mappage nom NetBIOS - adresse&nbsp;IP. Les utilisateurs Windows localiseront le syst&egrave;me plus facilement sur les r&eacute;seaux&nbsp;TCP/IP si le syst&egrave;me a &eacute;t&eacute; configur&eacute; pour s&apos;enregistrer sur un serveur&nbsp;WINS.</li>
    <li><strong>Protocole&nbsp;SMB maximal</strong>&nbsp;: selon votre configuration r&eacute;seau, configurez le protocole&nbsp;SMB le plus r&eacute;cent pris en charge par votre Synology NAS.<ul>
        <li><strong>SMB1</strong>&nbsp;: SMB1 (&eacute;galement appel&eacute; CIFS) est pris en charge depuis Windows&nbsp;NT.</li>
        <li><strong>SMB2</strong>&nbsp;: SMB2 est pris en charge depuis Windows Vista et repr&eacute;sente la version am&eacute;lior&eacute;e de SMB. SMB2 ajoute la capacit&eacute; de composer plusieurs actions&nbsp;SMB en une seule demande pour r&eacute;duire le nombre de paquets r&eacute;seau et pour am&eacute;liorer les performances.</li>
        <li><strong>SMB2 et Large MTU</strong>&nbsp;: MTU (maximum transmission unit) fait r&eacute;f&eacute;rence &agrave; la plus grande unit&eacute; de donn&eacute;es qui peut &ecirc;tre transmise via un protocole de communication. Afin de tirer parti des interfaces r&eacute;seau plus rapides, tels que l&apos;Ethernet&nbsp;1 ou 10&nbsp;gigabits, Large MTU augmente l&apos;unit&eacute; de transmission maximale &agrave; 1&nbsp;m&eacute;gaoctet (Mo). L&apos;activation de Large MTU am&eacute;liore la rapidit&eacute; et l&apos;efficacit&eacute; des transferts de fichiers volumineux, tout en r&eacute;duisant le nombre de paquets qui doivent &ecirc;tre trait&eacute;s.</li>
        <li><strong>SMB3</strong>&nbsp;: SMB3 est pris en charge depuis Windows&nbsp;8 et Windows Server&nbsp;2012. Il repr&eacute;sente la version am&eacute;lior&eacute;e de SMB2. SMB3 prend en charge la transmission chiffr&eacute;e des fichiers bas&eacute;e sur AES, am&eacute;liorant ainsi la s&eacute;curit&eacute; des transferts de fichiers peer-to-peer.</li>
      </ul>

      <div class="section"><h4>Remarque&nbsp;:</h4>
        <ul>
          <li>SMB2 est pris en charge sur Windows&nbsp;Vista, Windows Server&nbsp;2008&nbsp;R2, Windows&nbsp;7 et les versions ult&eacute;rieures.</li>
          <li>Large MTU est pris en charge sur Windows Server&nbsp;2008&nbsp;R2, Windows&nbsp;7 et versions ult&eacute;rieures.</li>
          <li>Afin de rendre Large MTU op&eacute;rationnel sur votre ordinateur Windows, vous devez modifier les param&egrave;tres de registre de votre ordinateur. Pour plus de d&eacute;tails, veuillez consulter l&apos;assistance technique de Microsoft (notamment cet <a href="http://technet.microsoft.com/en-us/library/ff625695(v=ws.10).aspx" target="_blank">article</a>).</li>
        </ul>
      </div>

      <li><strong>Protocole&nbsp;SMB minimal</strong>&nbsp;: selon votre configuration r&eacute;seau, configurez le protocole&nbsp;SMB le moins r&eacute;cent pris en charge par votre Synology NAS.</li>
      <li><strong>Mode de chiffrement du transport</strong>&nbsp;: lorsque SMB3 est activ&eacute;, le protocole&nbsp;SMB ajoute le chiffrement du transport afin de renforcer la s&eacute;curit&eacute; de la transmission des fichiers.<ul>
          <li><strong>D&eacute;sactiver</strong>&nbsp;: aucun chiffrement de transport n&apos;est appliqu&eacute;.</li>
          <li><strong>Auto</strong>&nbsp;: le chiffrement de transport n&apos;est appliqu&eacute; qu&apos;aux clients qui prennent en charge cette fonctionnalit&eacute;.</li>
          <li><strong>Forcer</strong>&nbsp;: le chiffrement du transport est toujours appliqu&eacute;. Cela emp&ecirc;che les clients qui ne prennent pas en charge le chiffrement du transport d&apos;utiliser le protocole&nbsp;SMB.</li>
        </ul>
      </li>

      <div class="section"><h4>Remarque&nbsp;:</h4>
        <ul>
          <li>Le chiffrement du transport est pris en charge sous Windows&nbsp;8, Windows&nbsp;Server&nbsp;2012 et les versions ult&eacute;rieures.</li>
          <li>La connexion anonyme pour le protocole&nbsp;SMB n&apos;est pas prise en charge lorsque le chiffrement du transport est activ&eacute;.</li>
          <li>Si le chiffrement du transport est activ&eacute;, veillez &agrave; ne pas d&eacute;cocher la case <strong>Activer Opportunistic Locking</strong> afin d&apos;&eacute;viter que la session de l&apos;application n&apos;expire.</li>
        </ul>
      </div>

      <li><strong>Activer Opportunistic Locking</strong>&nbsp;: s&eacute;lectionnez pour activer «&nbsp;Opportunistic Locking&nbsp;» de CIFS, afin que le client puisse mieux mettre en cache le contenu des fichiers et &eacute;viter les petites surcharges syst&egrave;me de lecture/&eacute;criture. Lorsque cette option est d&eacute;s&eacute;lectionn&eacute;e, les applications de la base de donn&eacute;es acc&egrave;dent plus facilement aux fichiers de la base de donn&eacute;es stock&eacute;s sur le Synology NAS via le r&eacute;seau.<ul>
          <li><strong>Activer le bail&nbsp;SMB2</strong>&nbsp;: l&apos;activation de cette option permet d&apos;utiliser davantage de param&egrave;tres relatifs &agrave; SMB2 afin d&apos;affiner le m&eacute;canisme de cache client fourni par Opportunistic Locking.</li>
        </ul>
      </li>
      <li><strong>Activer Local Master Browser</strong>&nbsp;: lorsque plusieurs ordinateurs Windows existent dans le m&ecirc;me sous-r&eacute;seau, ils n&eacute;gocient et &eacute;lisent un ordinateur en tant que «&nbsp;local master browser&nbsp;». Le local master browser maintient les listes des autres ordinateurs du sous-r&eacute;seau et de leurs ressources partag&eacute;es, et partage ces listes avec les autres ordinateurs. Cette option permet au Synology NAS d&apos;assumer le r&ocirc;le de local master browser.</li>

      <div class="section"><h4>Remarque&nbsp;:</h4>
        <ul>
          <li>L&apos;activation de cette fonction d&eacute;sactive l&apos;hibernation du disque dur et active le compte guest sans mot de passe.</li>
        </ul>
      </div>

      <li><strong>Activer le module VFS&nbsp;DirSort</strong>&nbsp;: trie les noms de dossiers et les classe par ordre alphab&eacute;tique. Cette option affecte la performance du syst&egrave;me lorsqu&apos;elle est activ&eacute;e.</li>
      <li><strong>Omettre des fichiers</strong>&nbsp;: masque des fichiers selon des crit&egrave;res sp&eacute;cifiques. Ces crit&egrave;res peuvent inclure des caract&egrave;res de remplacement (*)&nbsp;; les entr&eacute;es multiples doivent &ecirc;tre s&eacute;par&eacute;es par une barre oblique (/). Par exemple&nbsp;: <i>/abc*/*.txt/*.conf/</i>. Cette option affecte la performance du syst&egrave;me lorsqu&apos;elle est activ&eacute;e.</li>
      <li><strong>Autoriser les liens symboliques au sein de dossiers partag&eacute;s</strong>&nbsp;: s&eacute;lectionnez cette option pour autoriser les liens symboliques &agrave; pointer vers des fichiers ou des dossiers situ&eacute;s dans le m&ecirc;me dossier partag&eacute;. Les liens symboliques peuvent &ecirc;tre cr&eacute;&eacute;s &agrave; l&apos;aide d&apos;un terminal&nbsp;DSM.<ul>
          <li><strong>Autoriser les liens symboliques dans diff&eacute;rents dossiers partag&eacute;s</strong>&nbsp;: s&eacute;lectionnez cette option pour autoriser les liens symboliques &agrave; pointer vers des fichiers ou des dossiers situ&eacute;s dans des dossiers partag&eacute;s diff&eacute;rents. Les liens symboliques peuvent &ecirc;tre cr&eacute;&eacute;s &agrave; l&apos;aide d&apos;un terminal&nbsp;DSM. Toutefois, les utilisateurs ne disposant pas de privil&egrave;ges peuvent acc&eacute;der aux dossiers partag&eacute;s cibles des liens symboliques.</li>
        </ul>
      </li>
      <li><strong>Activer le module&nbsp;VFS pour convertir les caract&egrave;res sp&eacute;ciaux du Mac</strong>&nbsp;: S&eacute;lectionnez cette option pour convertir les caract&egrave;res r&eacute;serv&eacute;s par SMB (par exemple&nbsp;: &lt; &gt; &quot; * ?) dans les noms de fichiers en Basic Latin pendant la cr&eacute;ation des fichiers. Ces fichiers peuvent &ecirc;tre reconnus via AFP.</li>
      <li><strong>Activer le module VFS&nbsp;MSDFS</strong>&nbsp;: permet aux liens symboliques de pointer vers des fichiers ou des dossiers situ&eacute;s sur d&apos;autres serveurs&nbsp;SMB. Sur les anciennes versions de Windows, telles que Windows&nbsp;XP, le client et Synology NAS doivent &ecirc;tre connect&eacute;s &agrave; un domaine Windows avant d&apos;activer cette option. Pour en savoir plus sur la cr&eacute;ation de liens&nbsp;MSDFS, veuillez cliquer <a href="http://www.samba.org/samba/docs/man/Samba-HOWTO-Collection/msdfs.html" target=_blank>ici</a>. Veuillez noter que le cache du p&eacute;riph&eacute;rique client doit &ecirc;tre effac&eacute; apr&egrave;s la d&eacute;sactivation de cette option (le red&eacute;marrage du p&eacute;riph&eacute;rique client est &eacute;galement recommand&eacute;), sinon les performances et le fonctionnement pourraient en &ecirc;tre affect&eacute;s.</li>
      <li><strong>D&eacute;sactiver les connexions multiples &agrave; partir de la m&ecirc;me adresse&nbsp;IP</strong>&nbsp;: lorsque cette option est activ&eacute;e, le Synology NAS autorise une seule connexion par adresse&nbsp;IP pour les clients qui utilisent le protocole&nbsp;SMB. Lorsque plusieurs clients avec la m&ecirc;me adresse&nbsp;IP utilisent le protocole&nbsp;SMB, le Synology NAS conserve la derni&egrave;re connexion et interrompt toutes les connexions pr&eacute;c&eacute;dentes. Dans un environnement&nbsp;NAT, le client pourrait utiliser une adresse&nbsp;IP unique, auquel cas l&apos;activation de cette option pourrait affecter la performance normale.</li>
      <li><strong>Collecter les journaux de d&eacute;bogage</strong>&nbsp;: lorsque cette option est activ&eacute;e, les journaux d&eacute;taill&eacute;s sont stock&eacute;s &agrave; des fins de d&eacute;bogage. Cette option affecte la performance du syst&egrave;me lorsqu&apos;elle est activ&eacute;e.</li>
      <li><strong>Appliquer les autorisations&nbsp;UNIX par d&eacute;faut</strong>&nbsp;: l&apos;activation de cette option applique les autorisations&nbsp;UNIX par d&eacute;faut lors du chargement ou de la cr&eacute;ation de fichiers et dossiers. L&apos;autorisation&nbsp;UNIX est de 744 pour les fichiers et 755 pour les dossiers. Lorsque cette option est d&eacute;sactiv&eacute;e, l&apos;autorisation&nbsp;UNIX est de 777 pour les fichiers et les dossiers.</li>

      <div class="section"><h4>Remarque&nbsp;:</h4>
        <ul>
          <li>En ce qui concerne les dossiers partag&eacute;s pour lesquels Windows&nbsp;ACL est activ&eacute; (tous les partages sauf les «&nbsp;photos&nbsp;» et les partages sur des disques externes), veuillez ex&eacute;cuter la commande <strong>chmod</strong> sur votre client Linux ou FTP afin de changer les types d&apos;autorisations de dossier et de fichier, de Windows&nbsp;ACL vers UNIX (ne s&apos;applique pas &agrave; EDS14).</li>
          <li>L&apos;activation de cette option pourrait provoquer des probl&egrave;mes d&apos;incoh&eacute;rence d&apos;autorisation entre diff&eacute;rents protocoles. Afin d&apos;&eacute;viter les incoh&eacute;rences, nous sugg&eacute;rons de laisser cette option d&eacute;sactiv&eacute;e.</li>
        </ul>
      </div>

      <li><strong>Ne pas r&eacute;server d&apos;espace disque lors de la cr&eacute;ation de fichiers</strong>&nbsp;: activez cette option pour emp&ecirc;cher la r&eacute;servation d&apos;espace disque lors de la cr&eacute;ation de fichiers sur votre Synology NAS.</li>
      <li><strong>Activer le cache de recherche avec caract&egrave;res de remplacement</strong>&nbsp;: activez cette option pour am&eacute;liorer les performances de recherche si des clients envoient des demandes de recherche r&eacute;p&eacute;t&eacute;es avec des caract&egrave;res de remplacement.</li>
      <li><strong>Activer les handles durables de SMB (le verrouillage inter-protocole des fichiers sera d&eacute;sactiv&eacute;)</strong>&nbsp;: l&apos;activation de cette option permet aux utilisateurs de restaurer une connexion&nbsp;SMB2 perdue sur ce Synology NAS suite &agrave; une d&eacute;connexion temporaire&nbsp;; les fichiers ouverts demeurent disponibles pendant une panne de r&eacute;seau. Cependant, le verrouillage des fichiers inter-protocole est d&eacute;sactiv&eacute; afin que les utilisateurs puissent acc&eacute;der &agrave; (ou modifier) un fichier verrouill&eacute; via des protocoles non SMB2 (par exemple, AFP).</li>
      <li><strong>Vider le cache&nbsp;SMB</strong>&nbsp;: cliquez sur ce bouton pour supprimer les fichiers de cache&nbsp;SMB dans un but de d&eacute;pannage&nbsp;:<ul>
          <li>/var/cache/samba/netsamlogon_cache.tdb</li>
          <li>/var/lib/samba/winbindd_cache.tdb</li>
          <li>/var/lib/samba/share_info.tdb</li>
          <li>/var/lib/samba/registry.tdb</li>
          <li>/run/samba/connections.tdb</li>
          <li>/run/samba/gencacche.tdb</li>
          <li>/run/samba/gencache_notran.tdb</li>
        </ul>
      </li>
    </ul>

</body>
</html>