<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Domaine</h2>

<p>Votre Synology NAS peut rejoindre un domaine Windows. Apr&egrave;s avoir rejoint un domaine, les utilisateurs du domaine peuvent se connecter &agrave; votre Synology NAS &agrave; l&apos;aide de leurs comptes et mots de passe de domaine, ce qui leur permet d&apos;acc&eacute;der aux applications&nbsp;DSM et de les utiliser sans devoir m&eacute;moriser d&apos;autres noms d&apos;utilisateur et mots de passe.</p>

<h4>Pour rejoindre un domaine&nbsp;:</h4>
<ol>
	<li>Acc&eacute;dez &agrave; <strong>Panneau de configuration</strong>&nbsp;&gt; <strong>Domaine/LDAP</strong>&nbsp;&gt; <strong>Domaine</strong>.</li>
	<li>Cochez la case <strong>Rejoindre le domaine</strong>.</li>
	<li>Saisissez le nom de domaine et sp&eacute;cifiez le serveur&nbsp;DNS dans les champs appropri&eacute;s.</li>
	<li>Si n&eacute;cessaire, cochez la case <strong>Options avanc&eacute;es du domaine</strong>. (Voir ci-dessous pour plus de d&eacute;tails.)</li>
	<li>Cliquez sur <strong>Appliquer</strong>.</li>
	<li>Dans la fen&ecirc;tre contextuelle, saisissez le nom d&apos;utilisateur et le mot de passe de l&apos;administrateur du domaine.</li>
	<li>Cliquez sur <strong>OK</strong>.</li>
</ol>

<div class="section"><h4>DNS&nbsp;Server</h4>
<p>Nous vous conseillons de sp&eacute;cifier un serveur&nbsp;DNS pour aider votre Synology NAS &agrave; trouver le domaine. Toutefois, si le domaine n&apos;est pas enregistr&eacute; sur le serveur&nbsp;DNS, la proc&eacute;dure pour rejoindre le domaine peut &eacute;chouer.</p>

<h4>Type de serveur de domaine</h4>
<p>Ce champ affiche le type de domaine lorsque votre Synology NAS rejoint un domaine. Le type de domaine sera «&nbsp;Domaine&nbsp;AD&nbsp;».</p>

<h4>Mode de gestion</h4>
<p>cette option d&eacute;terminera la fa&ccedil;on dont vous g&eacute;rez les privil&egrave;ges des utilisateurs et groupes de domaine.</p>
<ul>
	<li><strong>Domaine de confiance</strong>&nbsp;: vous pouvez g&eacute;rer les utilisateurs et les groupes du domaine connect&eacute; ainsi que les domaines de confiance. Vous pouvez filtrer la liste des utilisateurs et des groupes par domaine.</li>
	<li><strong>Domaine seul avec OU</strong>&nbsp;: seuls les utilisateurs et les groupes du domaine connect&eacute; seront affich&eacute;s dans ce mode. Ce mode vous permet de filtrer la liste des utilisateurs et des groupes par unit&eacute; organisationnelle (OU).</li>
</ul>

<h4>Options avanc&eacute;es du domaine</h4>
<p>Dans la plupart des cas, vous n&apos;avez pas besoin de remplir les options avanc&eacute;es du domaine. Les options avanc&eacute;es du domaine ne sont n&eacute;cessaires que dans des environnements de domaine sp&eacute;cifiques.</p>
<ul>
	<li><strong>DC&nbsp;IP/FQDN</strong>&nbsp;: sp&eacute;cifiez l&apos;adresse&nbsp;IP ou le FQDN du DC (contr&ocirc;leur de domaine) et le Synology NAS essaiera de communiquer avec celui-ci. S&apos;il y a plusieurs adresses&nbsp;IP ou FQDN, ins&eacute;rez une virgule (,) entre chacune d&apos;entre elles/eux. Ajoutez un ast&eacute;risque (*) apr&egrave;s la derni&egrave;re adresse DC&nbsp;IP ou apr&egrave;s le FQDN si vous le souhaitez et Synology NAS essaiera de communiquer avec un autre DC si tous ceux qui ont &eacute;t&eacute; indiqu&eacute;s ont &eacute;chou&eacute;. Vous devez ajouter une virgule entre l&apos;ast&eacute;risque et la derni&egrave;re adresse&nbsp;IP ou FQDN.</li>
	<li><strong>Nom de domaine NetBIOS</strong>&nbsp;: sp&eacute;cifiez le nom NetBIOS du domaine.</li>
	<li><strong>FQDN du domaine (nom DNS)</strong>&nbsp;: sp&eacute;cifiez le FQDN (nom DNS) du domaine.</li>
	<li><strong>Enregistrer l&apos;interface&nbsp;DNS</strong>&nbsp;: Lorsque vous rejoingez un domaine, la NIC (Network Interface Card) sp&eacute;cifi&eacute;e ici est enregistr&eacute;e sur le DNS server. Veuillez noter que si le nom d&apos;h&ocirc;te du Synology NAS comprend un trait de soulignement (_), l&apos;enregistrement &eacute;chouera car les traits de soulignement (_) ne peuvent pas &ecirc;tre utilis&eacute;s avec DNS.</li>
	<li><strong>Mettre &agrave; jour la liste des utilisateurs/groupes</strong>&nbsp;: indiquez la fr&eacute;quence &agrave; laquelle le Synology NAS met automatiquement la liste des utilisateurs/groupes de domaine &agrave; jour. Vous pouvez d&eacute;finir une heure de mise &agrave; jour quotidienne, hebdomadaire ou mensuelle. De plus, les listes d&apos;utilisateurs/groupes de domaine peuvent &ecirc;tre mises &agrave; jour manuellement en acc&eacute;dant &agrave; l&apos;onglet <strong>Utilisateurs du domaine</strong> et en cliquant sur <strong>Mettre &agrave; jour les donn&eacute;es du domaine</strong>. Veuillez noter que les mises &agrave; jour automatiques affecteront l&apos;hibernation du syst&egrave;me.</li>
</ul>

<h4>Comment rejoindre un contr&ocirc;leur de domaine en lecture seule</h4>
<p>Pour connecter votre Synology NAS &agrave; un contr&ocirc;leur de domaine en lecture seule (RODC), vous devez sp&eacute;cifier le «&nbsp;nom d&apos;ordinateur complet&nbsp;» (FQDN) de votre contr&ocirc;leur de domaine en lecture seule (RWDC) dans le champ <strong>DC&nbsp;IP/FQDN</strong>. Le nom complet de l&apos;ordinateur doit &ecirc;tre au format suivant&nbsp;: <strong>NomD&apos;ordinateur.Domaine</strong>, par exemple, «&nbsp;ad01.synology.com&nbsp;».</p>
</div>


<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>Si votre nom d&apos;utilisateur de domaine comprend les caract&egrave;res&nbsp;% ou&nbsp;$, il se peut que vous ne puissiez pas acc&eacute;der &agrave; votre dossier d&apos;accueil. Demandez &agrave; votre administrateur de domaine de vous donner un nouveau nom d&apos;utilisateur.</li>
	<li>Les groupes de domaine <strong>Administrateurs de domaine</strong> et <strong>Administrateurs d&apos;entreprise</strong> sont automatiquement ajout&eacute;s au groupe <strong>administrators</strong> local. Par cons&eacute;quent, les utilisateurs de domaine appartenant &agrave; ces groupes ont des privil&egrave;ges administratifs sur votre Synology NAS, notamment l&apos;acc&egrave;s aux services de fichiers tels que CIFS/FTP/AFP/WebDAV et &agrave; d&apos;autres applications&nbsp;DSM.</li>
	<li>Vous pouvez &eacute;galement configurer les privil&egrave;ges d&apos;acc&egrave;s aux dossiers partag&eacute;s du Synology NAS pour les utilisateurs du domaine. Rendez-vous <a href="file_directory_service_user_group.html">ici</a> pour plus d&apos;informations.</li>
</ul>
</div>

<h3>Options du domaine</h3>

<p>Cette section inclut les options de domaine suppl&eacute;mentaires ci-dessous.</p>
<ul>
	<li><strong>DiskStation se synchronisera avec un serveur&nbsp;NTP chaque fois qu&apos;un utilisateur de domaine se connecte</strong>&nbsp;: l&apos;activation de cette option force la synchronisation temporelle entre votre Synology NAS et le serveur&nbsp;NTP.</li>
	<li><strong>Obtenir les listes des utilisateurs/groupes avec le mode compatible&nbsp;NT4</strong>&nbsp;: cette option permet au syst&egrave;me d&apos;obtenir les listes d&apos;utilisateurs/groupes &agrave; l&apos;aide du mode NT4&nbsp;RPC. Cette option peut &ecirc;tre activ&eacute;e si certaines listes d&apos;utilisateurs/groupes du domaine ne sont pas accessibles &agrave; l&apos;aide des param&egrave;tres par d&eacute;faut.</li>
	<li><strong>Activer la signature du serveur</strong>&nbsp;: si la signature du client est activ&eacute;e par le client, il faut &eacute;galement activer la signature du serveur sur le Synology NAS, de sorte que les utilisateurs puissent utiliser les services du domaine normalement.</li>
	<li><strong>&Eacute;num&eacute;rer les niveaux de groupes imbriqu&eacute;s</strong>&nbsp;: sp&eacute;cifiez le nombre de membres de groupe de domaine imbriqu&eacute;s qui peuvent &ecirc;tre &eacute;num&eacute;r&eacute;s.</li>
	<li><strong>Administrateurs de domaine</strong>&nbsp;: sp&eacute;cifiez jusqu&apos;&agrave; 10&nbsp;groupes d&apos;utilisateurs &agrave; qui vous souhaitez octroyer des autorisations d&apos;administrateur. Tous les utilisateurs qui disposent des autorisations d&apos;administrateur ont un contr&ocirc;le total sur votre Synology NAS et les fichiers qui s&apos;y trouvent.</li>
	<li><strong>Activer l&apos;authentification Windows int&eacute;gr&eacute;e</strong>&nbsp;: l&apos;activation de cette option permet aux utilisateurs qui se sont d&eacute;j&agrave; connect&eacute;s &agrave; leurs ordinateurs via leurs comptes de domaine de se connecter &agrave; DSM via le navigateur Internet sans avoir besoin de saisir un nom d&apos;utilisateur ou un mot de passe.</li>
</ul>

<div class="section"><h4>Utiliser l&apos;authentification Windows int&eacute;gr&eacute;e</h4>
<ul>
	<li>L&apos;ordinateur client doit fonctionner sous le syst&egrave;me d&apos;exploitation Windows et la version utilis&eacute;e doit &ecirc;tre Windows&nbsp;7 ou une version ult&eacute;rieure.</li>
	<li>L&apos;ordinateur client doit &ecirc;tre connect&eacute; au m&ecirc;me domaine que Synology NAS.</li>
	<li>Acc&eacute;dez au <b>Panneau de configuration</b> de Windows&nbsp;&gt; <b>Options Internet</b>&nbsp;&gt; <b>Avanc&eacute;</b> et assurez-vous que la case <b>Activer l&apos;authentification Windows int&eacute;gr&eacute;e</b> est coch&eacute;e dans la section <b>S&eacute;curit&eacute;</b>.</li>
	<li>L&apos;authentification Windows int&eacute;gr&eacute;e fonctionne avec tous les navigateurs. Pour Firefox, quelques &eacute;tapes suppl&eacute;mentaires sont requises pour la configuration.<ul>
			<li>Ouvrez un navigateur Firefox, saisissez <b>about:config</b> dans la barre d&apos;URL.</li>
			<li>Recherchez la pr&eacute;f&eacute;rence <b>network.automatic-NTLM-auth.trusted-uris</b>.</li>
			<li>Double-cliquez sur le champ de <b>valeur</b> et saisissez l&apos;adresse&nbsp;IP du domaine.</li>
		</ul>
	</li>
	<li>Si vous connectez votre Synology NAS &agrave; un domaine cr&eacute;&eacute; par Synology&nbsp;Directory&nbsp;Server, des configurations suppl&eacute;mentaires sont requises pour utiliser la fonction d&apos;authentification Windows int&eacute;gr&eacute;e&nbsp;:<ol>
			<li>Acc&eacute;dez &agrave; DSM, <b>Panneau de configuration</b>&nbsp;&gt; <b>Services de fichiers</b>&nbsp;&gt; <b>SMB/AFP/NFS</b>.</li>
			<li>Dans la section <b>SMB</b>, cliquez sur <b>Param&egrave;tres avanc&eacute;s</b>.</li>
			<li>S&eacute;lectionnez <b>SMB1</b> dans le menu d&eacute;roulant <b>Protocole&nbsp;SMB minimal</b> et cliquez sur <b>Enregistrer</b>.</li>
		</ol>
	</li>

</ul>
</div>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>La connexion via l&apos;authentification Windows int&eacute;gr&eacute;e n&apos;est disponible que sur DSM&nbsp;6.2.2 ou une version ult&eacute;rieure.</li>
		</ul></li>
</ul>
</div>

<h3>V&eacute;rification de l&apos;&eacute;tat du domaine</h3>

<p>Vous pouvez cliquer sur <strong>V&eacute;rification de l&apos;&eacute;tat du domaine</strong> pour v&eacute;rifier l&apos;&eacute;tat de la connexion entre votre DSM et le serveur de domaine qu&apos;il a rejoint. Pour plus d&apos;informations sur le d&eacute;pannage, veuillez consulter les points de v&eacute;rification suivants&nbsp;:</p>
<ul>
	<li><strong>V&eacute;rifiez que la connexion fonctionne correctement entre le Synology&nbsp;NAS et le<font>contr&ocirc;leur de domaine</font></strong>: le Synology&nbsp;NAS n&apos;est pas parvenu &agrave; communiquer avec le<font>contr&ocirc;leur de domaine</font>.<ul>
			<li>Assurez-vous que les ports&nbsp;389, 139 et 445 fonctionnent correctement sur le<font>contr&ocirc;leur de domaine</font>.</li>
			<li>Assurez-vous que le service&nbsp;NTDS fonctionne correctement sur le<font>contr&ocirc;leur de domaine</font>.</li>
		</ul>
	</li>
	<li><strong>V&eacute;rifiez la pr&eacute;sence d&apos;un conflit au niveau des noms d&apos;h&ocirc;te sur le sous-r&eacute;seau</strong>&nbsp;: votre Synology&nbsp;NAS poss&egrave;de un nom d&apos;h&ocirc;te qui existe d&eacute;j&agrave; sur le sous-r&eacute;seau.<ul>
			<li>Si votre Synology&nbsp;NAS est connect&eacute; &agrave; un sous-r&eacute;seau avec plusieurs interfaces r&eacute;seau, votre DSM fonctionnera correctement.</li>
			<li>Si votre Synology&nbsp;NAS est connect&eacute; &agrave; un sous-r&eacute;seau avec une seule interface r&eacute;seau, veuillez modifier le nom d&apos;h&ocirc;te de votre Synology&nbsp;NAS et connectez-le &agrave; nouveau au domaine.</li>
		</ul>
	</li>
	<li><strong>V&eacute;rifiez que la connexion fonctionne correctement entre le Synology&nbsp;NAS et le serveur Kerberos</strong>&nbsp;: le Synology&nbsp;NAS n&apos;est pas parvenu &agrave; communiquer avec le serveur Kerberos.<ul>
			<li>V&eacute;rifiez que le bon enregistrement Kerberos DNS&nbsp;SRV et l&apos;enregistrement&nbsp;A correspondant existent sur le serveur&nbsp;DNS.</li>
			<li>Assurez-vous que le port&nbsp;88 est disponible sur le serveur&nbsp;KDC.</li>
		</ul>
	</li>
	<li><strong>V&eacute;rifiez que la connexion fonctionne correctement entre le Synology&nbsp;NAS et le serveur&nbsp;LDAP</strong>&nbsp;: Le Synology NAS n&apos;est pas parvenu &agrave; communiquer avec le serveur LDAP.<ul>
			<li>V&eacute;rifiez que le bon enregistrement&nbsp;LDAP DNS&nbsp;SRV et l&apos;enregistrement&nbsp;A correspondant existent sur les serveurs&nbsp;DNS.</li>
			<li>Assurez-vous que le port&nbsp;389 fonctionne correctement sur le serveur&nbsp;LDAP.</li>
		</ul>
	</li>
	<li><strong>V&eacute;rifiez que la valeur&nbsp;MTU est correctement configur&eacute;e afin de garantir le bon fonctionnement de la connexion entre le Synology&nbsp;NAS et le contr&ocirc;leur de domaine</strong>&nbsp;: un ou plusieurs commutateurs ont ignor&eacute; des paquets transf&eacute;r&eacute;s entre le Synology&nbsp;NAS et le<font>contr&ocirc;leur de domaine</font>en raison d&apos;une valeur&nbsp;MTU des paquets non valide.<ul>
			<li>Veuillez v&eacute;rifier les param&egrave;tres de l&apos;interface des commutateurs entre le Synology&nbsp;NAS et le<font>contr&ocirc;leur de domaine</font>.</li>
		</ul>
	</li>
	<li><strong>V&eacute;rifiez que l&apos;heure est correctement synchronis&eacute;e entre le Synology&nbsp;NAS et le domaine</strong>&nbsp;: l&apos;heure de votre Synology&nbsp;NAS n&apos;est pas synchronis&eacute;e avec celle du serveur de domaine.<ul>
			<li>Vous pouvez configurer un service&nbsp;NTP sur le Synology&nbsp;NAS pour synchroniser l&apos;heure avec le serveur de domaine ou activer l&apos;option <strong>Synology&nbsp;NAS se synchronisera avec un serveur&nbsp;NTP chaque fois qu&apos;un utilisateur de domaine se connecte</strong> dans <strong>Options du domaine</strong>.</li>
		</ul>
	</li>
</ul>

</body>
</html>