<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>P&eacute;riph&eacute;riques externes</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="usbprinter"></a>Imprimantes</h2>
<p>Synology NAS peut se transformer en serveur d&apos;impression, permettant ainsi aux ordinateurs clients ou p&eacute;riph&eacute;riques mobiles d&apos;acc&eacute;der aux imprimantes connect&eacute;es &agrave; Synology NAS. En outre, la prise en charge de l&apos;impression sans fil Apple vous permet d&apos;imprimer &agrave; distance &agrave; l&apos;aide de p&eacute;riph&eacute;riques&nbsp;iOS.</p>
<p>Rendez-vous sur <a href="http://www.synology.com" target="_blank">www.synology.com</a> pour consulter la liste des imprimantes compatibles.</p>

<h3>Configuration des imprimantes</h3>
<p>Consultez les instructions ci-dessous pour configurer et connecter une imprimante&nbsp;USB ou r&eacute;seau &agrave; votre Synology NAS.</p>


<h4><a id="t1"></a>Pour configurer une imprimante&nbsp;USB&nbsp;:</h4>
<ol>
<li>Allumez et connectez l&apos;imprimante &agrave; un port&nbsp;USB sur le Synology NAS.</li>
<li>Acc&eacute;dez &agrave; <strong>Panneau de configuration</strong>&nbsp;&gt; <strong>P&eacute;riph&eacute;riques externes</strong>&nbsp;&gt; <strong>Imprimante</strong>.</li>
<li>S&eacute;lectionnez l&apos;imprimante que vous voulez configurer. Veuillez noter que Synology NAS ne reconna&icirc;t pas les imprimantes connect&eacute;es via des concentrateurs&nbsp;USB.</li>
<li>Cliquez sur <b>Gestionnaire d&apos;imprimante</b> et s&eacute;lectionnez <b>Configurer l&apos;imprimante</b>.</li>
<li>Dans la bo&icirc;te de dialogue, s&eacute;lectionnez l&apos;un des modes suivants&nbsp;:<ul>
<li><b>Multifonctions r&eacute;seau&nbsp;:</b> Permet aux clients sur le r&eacute;seau local d&apos;utiliser les fonctions imprimer, num&eacute;riser et t&eacute;l&eacute;copie de votre imprimante multifonctions. Les fonctions de num&eacute;risation et de t&eacute;l&eacute;copie sont disponibles uniquement pour les ordinateurs Windows.</li>
<li><b>Imprimante r&eacute;seau&nbsp;:</b> Choisissez ce mode pour les imprimantes qui ne prennent en charge que l&apos;impression ou si vous souhaitez autoriser les clients &agrave; utiliser la fonction d&apos;impression uniquement.</li>
</ul>
</li>
<li>Configurez les param&egrave;tres d&apos;impression sans fil Apple (facultatif).</li>
<li>Cliquez sur <b>Enregistrer</b>.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Une imprimante multifonctions r&eacute;seau n&apos;est accessible que par un seul client &agrave; la fois.</li>
</ul>
</div>

<h4>Pour configurer une imprimante r&eacute;seau&nbsp;:</h4>
<ol>
<li>Allumez et connectez l&apos;imprimante r&eacute;seau au m&ecirc;me r&eacute;seau local que votre Synology NAS.</li>
<li>Acc&eacute;dez &agrave; <strong>Panneau de configuration</strong>&nbsp;&gt; <strong>P&eacute;riph&eacute;riques externes</strong>&nbsp;&gt; <strong>Imprimante</strong>.</li>
<li>Cliquez sur <b>Ajouter une imprimante r&eacute;seau</b> et suivez les instructions de l&apos;assistant de configuration.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li><strong>Nom de l&apos;imprimante&nbsp;:</strong> lors de la configuration, vous devez saisir un nom d&apos;imprimante qui peut comporter jusqu&apos;&agrave; 32&nbsp;caract&egrave;res, comprenant des lettres, des chiffres et des caract&egrave;res de soulignement.</li>
	<li><strong>Protocole&nbsp;:</strong> En g&eacute;n&eacute;ral, les imprimantes r&eacute;seau HP utilisent Socket&nbsp;; les imprimantes r&eacute;seau Canon utilisent BJNP&nbsp;; et d&apos;autres utilisent le plus souvent LPR.</li>
<li><strong>Nom de la file d&apos;attente&nbsp;:</strong> l&apos;entr&eacute;e d&apos;un nom de file d&apos;attente est n&eacute;cessaire pour les imprimantes r&eacute;seau LPR et IPP, mais ne s&apos;applique pas aux imprimantes Socket ou BJNP.</li>
<li><strong>Pas de MFP r&eacute;seau&nbsp;:</strong> les imprimantes r&eacute;seau connect&eacute;es &agrave; Synology NAS ne peuvent pas actuellement utiliser le mode Multifonctions r&eacute;seau.</li>
<li><strong>Pas d&apos;imprimante USB&nbsp;:</strong> Les imprimantes USB partag&eacute;es par un produit Synology ne peuvent pas &ecirc;tre d&eacute;finies comme imprimantes r&eacute;seau.</li>
</ul>
</div>

<div>
<h4>Pour configurer une imprimante PostScript USB avec un Mac&nbsp;:</h4>

<p><strong>Pour Mac OS 10.12.X&nbsp;:</strong></p>
<ol>
<li>Suivez les &eacute;tapes indiqu&eacute;es dans la section <a href="system_externaldevice_printer.html#t1">Pour configurer une imprimante&nbsp;USB</a>.</li>
<li>Sur votre Mac, acc&eacute;dez &agrave; <b>Pr&eacute;f&eacute;rences syst&egrave;me</b>&nbsp;&gt; <b>Imprimante et scanners</b>, puis cliquez sur <strong>+</strong> pour ajouter une nouvelle imprimante.</li>
<li>Choisissez <strong>IP</strong> comme type d&apos;imprimante.</li>
<ul>
	<li>Entrez l&apos;adresse IP ou le nom d&apos;h&ocirc;te de l&apos;imprimante.</li>
	<li>Choisissez <strong>Line Printer Daemon - LPD</strong> comme <strong>Protocole</strong>.</li>
	<li>Entrez «&nbsp;usbprinter&nbsp;» dans le champ <strong>File d&apos;attente</strong>. Si vous ne trouvez pas le nom de votre <strong>file d&apos;attente</strong>, acc&eacute;dez &agrave; <strong>Panneau de configuration</strong> &gt; <strong>P&eacute;riph&eacute;riques externes</strong> &gt; <strong>Imprimante</strong> dans votre DSM.</li></ul>
	<li>S&eacute;lectionnez <strong>Imprimante Generic PostScript</strong> pour <strong>Utilisation</strong>.</li>
	<li>Cliquez sur <strong>Ajouter</strong> pour terminer.</li>
</ol>

<p><strong>Pour Mac OS 10.6.X&nbsp;:</strong></p>
<ol>
<li>Suivez les &eacute;tapes indiqu&eacute;es dans la section <a href="system_externaldevice_printer.html#t1">Pour configurer une imprimante&nbsp;USB</a>.</li>
<li>Sur votre Mac, acc&eacute;dez &agrave; <b>Pr&eacute;f&eacute;rences syst&egrave;me</b>&nbsp;&gt; <b>Imprimante et fax</b>, puis cliquez sur <strong>+</strong> pour ajouter une nouvelle imprimante.</li>
<li>Choisissez <strong>IP</strong>.</li>
<ul>
	<li>Choisissez <strong>Line Printer Daemon - LPD</strong> comme <strong>Protocole</strong>.</li>
	<li>Entrez l&apos;adresse IP de l&apos;imprimante.</li>
	<li>Entrez «&nbsp;usbprinter&nbsp;» dans le champ <strong>File d&apos;attente</strong>.</li>
	<li>S&eacute;lectionnez <strong>Imprimante Generic PostScript</strong> pour l&apos;option <strong>Imprimer avec</strong>.</li>
	<li>Cliquez sur <strong>Ajouter</strong> pour terminer.</li>
</ul>
</ol>
<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>AppleTalk n&apos;est plus pris en charge par Mac OS 10.6.X. Si vous devez utiliser une imprimante AppleTalk, lisez sa documentation pour savoir comment la connecter &agrave; votre ordinateur Mac ou &agrave; votre r&eacute;seau local. S&apos;il n&apos;y a pas moyen de connecter l&apos;imprimante, connectez-la &agrave; un ordinateur Mac avec Mac OS 10.5.x ou une version ant&eacute;rieure, et configurez-la pour &ecirc;tre partag&eacute;e.</li>
</ul>
</div>

<p><strong>Pour Mac OS 10.5.X&nbsp;:</strong></p>
<ol>
<li>Suivez les &eacute;tapes indiqu&eacute;es dans la section <a href="system_externaldevice_printer.html#t1">Pour configurer une imprimante&nbsp;USB</a>.</li>
<li>Sur votre Mac, acc&eacute;dez &agrave; <b>Pr&eacute;f&eacute;rences syst&egrave;me</b>&nbsp;&gt; <b>Imprimante et fax</b>, puis cliquez sur <strong>+</strong> pour ajouter une nouvelle imprimante.</li>
<li>Choisissez une m&eacute;thode.</li>
<ul>
	<li>M&eacute;thode&nbsp;1&nbsp;: <strong>AppleTalk</strong></li>
	<ul>
		<li>S&eacute;lectionnez <strong>Imprimante Generic PostScript</strong> pour l&apos;option <strong>Imprimer avec</strong>.</li>
		<li>Cliquez sur <strong>Ajouter</strong> pour terminer.</li>
	</ul>
	<li>M&eacute;thode&nbsp;2&nbsp;: <strong>IP</strong></li>
	<ul>
		<li>Choisissez <strong>Line Printer Daemon - LPD</strong> comme Protocole.</li>
		<li>Entrez l&apos;adresse IP de l&apos;imprimante.</li>
		<li>Entrez «&nbsp;usbprinter&nbsp;» dans le champ <strong>File d&apos;attente</strong>.</li>
		<li>S&eacute;lectionnez <strong>Imprimante Generic PostScript</strong> pour l&apos;option <strong>Imprimer avec</strong>.</li>
		<li>Cliquez sur <strong>Ajouter</strong> pour terminer.</li>
	</ul>
</ul>
</ol>
</div>

<h3>Gestion des imprimantes</h3>
<p>L&apos;onglet d&eacute;di&eacute; aux imprimantes comprend les options suivantes qui permettent de g&eacute;rer les imprimantes&nbsp;USB ou r&eacute;seau connect&eacute;es au Synology NAS.</p>

<ul>
<li><b>Obtenir des informations&nbsp;:</b> affiche des informations relatives &agrave; l&apos;imprimante s&eacute;lectionn&eacute;e, telles que le nom du p&eacute;riph&eacute;rique, le fabricant, l&apos;&eacute;tat, etc.</li>
<li><strong>Supprimer&nbsp;:</strong> supprime et d&eacute;connecte une imprimante du Synology NAS.</li>
<li><strong>Gestionnaire d&apos;imprimante&nbsp;:</strong> comprend les options suivantes&nbsp;:<ul>
<li><strong>Configurer l&apos;imprimante</strong>&nbsp;: pour modifier les param&egrave;tres de l&apos;imprimante. Pour configurer l&apos;impression sans fil Apple, reportez-vous aux instructions ci-dessous.</li>
<li><strong>Nettoyer l&apos;espace de la file d&apos;attente&nbsp;:</strong> annule toutes les t&acirc;ches d&apos;impression sur toutes les imprimantes.</li>
<li><strong>Imprimer une page test&nbsp;:</strong> imprime une page de test pour s&apos;assurer que les configurations sont correctes.</li>
<li><b>Lib&eacute;rer l&apos;imprimante&nbsp;:</b> d&eacute;connecte l&apos;imprimante et le client (pour le mode Multifonctions r&eacute;seau uniquement). Lorsqu&apos;un client se connecte &agrave; une imprimante multifonctions pour recevoir des t&eacute;l&eacute;copies ou pour scanner des fichiers, la t&acirc;che peut prendre un certain temps. Si n&eacute;cessaire, la connexion peut &ecirc;tre arr&ecirc;t&eacute;e afin de permettre au client suivant dans la file d&apos;attente d&apos;acc&eacute;der &agrave; l&apos;imprimante.</li>
</ul></li>
</ul>


<h4>Pour activer l&apos;impression sans fil Apple&nbsp;:</h4>
<ol>
<li>Acc&eacute;dez &agrave; <strong>Panneau de configuration</strong>&nbsp;&gt; <strong>P&eacute;riph&eacute;riques externes</strong>&nbsp;&gt; <strong>Imprimante</strong>.</li>
<li>S&eacute;lectionnez une imprimante dans la liste des p&eacute;riph&eacute;riques.</li>
<li>Cliquez sur <b>Gestionnaire d&apos;imprimante</b>&nbsp;&gt; <b>Configurer l&apos;imprimante</b>.</li>
<li>Cochez la case <b>Activer l&apos;impression sans fil Apple</b>.</li>
<li>S&eacute;lectionnez la marque et le pilote de votre imprimante.</li>
<li>Cliquez sur <b>Enregistrer</b>.</li>
</ol>

<p>Une fois la configuration termin&eacute;e, vous pouvez imprimer une page de test en cliquant sur <b>Gestionnaire d&apos;imprimante</b>&nbsp;&gt; <b>Imprimer une page test</b>.</li>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>L&apos;activation de l&apos;impression sans fil Apple active &eacute;galement la fonction Diffusion imprimante Bonjour pour DSM.</li>
<li>L&apos;impression sans fil Apple est disponible pour iOS 4.2 ou les versions ult&eacute;rieures.</li>
</ul>
</div>

<h3>Acc&egrave;s aux imprimantes</h3>
<p>Voyez la section ci-dessous pour acc&eacute;der aux imprimantes &agrave; l&apos;aide d&apos;un PC ou d&apos;un Mac.</p>
<h4><a name="others"></a>Pour acc&eacute;der aux imprimantes &agrave; l&apos;aide d&apos;un PC Windows&nbsp;:</h4>
<p>La meilleure fa&ccedil;on d&apos;acc&eacute;der au service d&apos;impression d&apos;un p&eacute;riph&eacute;rique Synology NAS est de configurer la connexion &agrave; l&apos;imprimante &agrave; l&apos;aide de Synology&nbsp;Assistant. Consultez son Aide pour des instructions d&eacute;taill&eacute;es.</p>

<p>Si Synology&nbsp;Assistant n&apos;est pas install&eacute; sur votre ordinateur, veuillez consulter ci-dessous les autres mani&egrave;res d&apos;acc&eacute;der au service d&apos;impression du p&eacute;riph&eacute;rique Synology NAS.</p>
<p><strong>Type&nbsp;1. Partag&eacute; une imprimante r&eacute;seau</strong></p>
<ol>
<li>Sur votre PC, ouvrez <b>R&eacute;seau</b> dans l&apos;Explorateur de fichiers et double-cliquez sur le Synology NAS.</li>

<li>Double-cliquez sur <b>usbprinter</b> ou <b>nom de l&apos;imprimante r&eacute;seau</b>&nbsp;; le syst&egrave;me vous invite &agrave; installer le pilote appropri&eacute;, puis cliquez sur <b>Oui</b>.</li>

<li>Veuillez obtenir le pilote de l&apos;imprimante sur le CD ou le site Web du fabricant. S&eacute;lectionnez le fabricant et le mod&egrave;le de l&apos;imprimante, ou cliquez sur <strong>Disque fourni</strong> pour s&eacute;lectionner l&apos;emplacement du pilote. Cliquez ensuite sur <b>OK</b>.</li>
<li>Le syst&egrave;me commence la configuration de l&apos;imprimante r&eacute;seau. Une fois la configuration termin&eacute;e, vous pouvez commencer &agrave; utiliser l&apos;imprimante.</li>
</ol>


<p><strong>Type&nbsp;2. Port LPR (Recommand&eacute;)</strong></p>
<ol>
<li>Sur votre PC, cliquez sur <b>D&eacute;marrer</b> et acc&eacute;dez &agrave; <b>P&eacute;riph&eacute;riques et imprimantes</b>.</li>
<li>Cliquez sur <b>Ajouter une imprimante</b>.</li>
	<li>Choisissez l&apos;option <strong>Ajouter une imprimante r&eacute;seau, sans fil ou Bluetooth</strong>.</li>
	<li>Choisissez l&apos;option <strong>Mon imprimante ne figure pas dans la liste</strong>.</li>
<li>S&eacute;lectionnez <b>Ajouter une imprimante &agrave; l&apos;aide d&apos;une adresse&nbsp;TCP/IP ou d&apos;un nom d&apos;h&ocirc;te</b>. Cliquez sur <b>Suivant</b> pour continuer.</li>
<li>D&eacute;finissez le type de p&eacute;riph&eacute;rique sur <b>P&eacute;riph&eacute;rique de port&nbsp;TCP/IP</b>.</li>
<li>Saisissez l&apos;adresse&nbsp;IP du Synology NAS. Cliquez sur <b>Suivant</b> pour continuer.</li>
<li>S&eacute;lectionnez <b>Type de p&eacute;riph&eacute;rique</b>&nbsp;: <strong>Personnalis&eacute;</strong>&nbsp;&gt; <strong>Param&egrave;tres</strong>&nbsp;&gt; …. Cliquez sur <b>Suivant</b> pour continuer.</li>

<li>S&eacute;lectionnez le protocole <b>LPR</b>, saisissez <b>usbprinter</b> ou <b>nom d&apos;imprimante r&eacute;seau</b> comme nom de file d&apos;attente, puis cochez la case <b>D&eacute;compte des octets&nbsp;LPR activ&eacute;</b>. Cliquez sur <b>OK</b> pour continuer.</li>

<li>Veuillez obtenir le pilote de l&apos;imprimante sur le CD ou le site Web du fabricant. S&eacute;lectionnez le fabricant et le mod&egrave;le de l&apos;imprimante, ou cliquez sur <strong>Disque fourni</strong> pour s&eacute;lectionner l&apos;emplacement du pilote. Cliquez ensuite sur <b>OK</b>.</li>
	<li>Le syst&egrave;me commence la configuration de l&apos;imprimante r&eacute;seau. Une fois la configuration termin&eacute;e, vous pouvez commencer &agrave; utiliser l&apos;imprimante.</li>
</ol>

<h4>Pour acc&eacute;der aux imprimantes &agrave; l&apos;aide d&apos;un Mac&nbsp;:</h4>
<p>Les utilisateurs de Mac peuvent acc&eacute;der au service d&apos;impression du p&eacute;riph&eacute;rique Synology NAS en activant la diffusion imprimante Bonjour de DSM et en ajoutant l&apos;imprimante dans les Pr&eacute;f&eacute;rences syst&egrave;me.</p>

<P>V&eacute;rifiez que votre Synology NAS utilise bien une imprimante Postscript avant de poursuivre.</p>

<p><strong>&Eacute;tape&nbsp;1. Activer la diffusion imprimante Bonjour de DSM</strong></p>
<ol>
<li>Connectez-vous &agrave; DSM en tant qu&apos;<b>admin</b> ou utilisateur appartenant au groupe <b>administrators</b>.</li>
<li>Acc&eacute;dez &agrave; <b>Panneau de configuration</b>&nbsp;&gt; <strong>Services de fichiers</strong>&nbsp;&gt; <b>Win/Mac/NFS</b>.</li>
<li>Cochez la case <b>Activer la diffusion imprimante Bonjour</b>.</li>
</ol>

<p><strong>&Eacute;tape&nbsp;2. Acc&eacute;der &agrave; l&apos;imprimante en utilisant un Mac</strong></p>
<ol>
  <li>Sur votre Mac, acc&eacute;dez &agrave; <strong>Pr&eacute;f&eacute;rences syst&egrave;me</strong>&nbsp;&gt; <strong>Imprimer et num&eacute;riser</strong>, puis cliquez sur <strong>+</strong>.</li>
  <li>S&eacute;lectionnez <strong>usbprinter[num&eacute;ro]</strong> ou <strong>nom de l&apos;imprimante r&eacute;seau</strong> dans le menu d&eacute;roulant. Votre Mac configurera l&apos;imprimante automatiquement.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>RC18015xs+ ne prend pas en charge les imprimantes&nbsp;USB.</li>
  </ul>
</div>



</body>
</html>
