<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Alimentation</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>





<h2>Onduleur</h2>

<p>Un onduleur est un dispositif d&apos;alimentation de secours qui permet au Synology NAS de continuer &agrave; fonctionner pendant un court moment en cas de coupure de courant. Cette fonction, disponible dans <strong>Panneau de configuration</strong>&nbsp;&gt; <strong>Mat&eacute;riel et alimentation</strong>&nbsp;&gt; <strong>Onduleur</strong>, permet d&apos;&eacute;viter toute perte de donn&eacute;es en donnant suffisamment de temps au Synology NAS pour enregistrer les donn&eacute;es et d&eacute;monter les volumes avant de s&apos;&eacute;teindre suite &agrave; une coupure de courant (arr&ecirc;t pour l&apos;EDS14).</p>

<div class="section">
<h4>Mode sans &eacute;chec</h4>
<p>Lorsque le Synology NAS passe en mode sans &eacute;chec, il arr&ecirc;te tous les services et d&eacute;monte les volumes afin d&apos;&eacute;viter toute perte de donn&eacute;es et de s&apos;&eacute;teindre (arr&ecirc;t pour l&apos;EDS14) en toute s&eacute;curit&eacute; lorsque l&apos;onduleur n&apos;est plus aliment&eacute;. Par d&eacute;faut, le syst&egrave;me passe en mode sans &eacute;chec lorsque l&apos;alimentation de l&apos;onduleur commence &agrave; faiblir. Vous pouvez &eacute;galement sp&eacute;cifier le d&eacute;lai avant que le Synology NAS passe en mode sans &eacute;chec en cas de panne de courant. Cependant, si la batterie de l&apos;onduleur est faible avant la dur&eacute;e sp&eacute;cifi&eacute;e, le syst&egrave;me passe en mode sans &eacute;chec imm&eacute;diatement.</p>

<p>Dans le cas o&ugrave; le Synology NAS s&apos;arr&ecirc;te lorsqu&apos;il est en mode sans &eacute;chec, il se relancera automatiquement lorsque l&apos;alimentation sera restaur&eacute;e, &agrave; condition que l&apos;option <strong>Red&eacute;marrer automatiquement apr&egrave;s une coupure de courant</strong> soit activ&eacute;e (disponible depuis <strong>Panneau de configuration</strong>&nbsp;&gt; <strong>Mat&eacute;riel et alimentation</strong>&nbsp;&gt; <strong>G&eacute;n&eacute;ral</strong>).</p>
</div>

<h3>Prise en charge d&apos;un onduleur local</h3>
<p>Pour des d&eacute;tails concernant l&apos;installation mat&eacute;rielle, veuillez consulter le manuel d&apos;utilisation de votre UPS. Une fois l&apos;installation termin&eacute;e et le Synology NAS branch&eacute; &agrave; l&apos;onduleur, vous pouvez suivre les &eacute;tapes ci-dessous pour activer la prise en charge de l&apos;onduleur.</p>
<h4>Pour activer la prise en charge d&apos;un onduleur local&nbsp;:</h4>
<ol>
<li>Connectez l&apos;UPS &agrave; un port USB du Synology NAS.</li>
<li>Dans l&apos;onglet <b>Onduleur</b>, cochez la case <b>Activer la prise en charge d&apos;un onduleur</b>.</li>
<li>S&eacute;lectionnez le moment o&ugrave; le Synology NAS doit passer en mode sans &eacute;chec apr&egrave;s une panne de courant.</li>
<li>Choisissez s&apos;il faut envoyer ou non un signal d&apos;arr&ecirc;t &agrave; l&apos;onduleur lorsque le syst&egrave;me passe en mode S&eacute;curit&eacute;. La plupart des UPS peuvent s&apos;allumer automatiquement lorsque le courant est r&eacute;tabli.
<ul><li>Si cette option est activée, le Synology NAS s'arrête immédiatement car il n'a plus de source d'alimentation.</li>
<li>Si cette option est activée, cochez la case <strong>Redémarrer automatiquement après une coupure de courant</strong> dans <strong>Panneau de configuration</strong> > <strong>Matériel et alimentation</strong> > <strong>Général</strong> pour vous assurer que le Synology NAS redémarre automatiquement une fois l'alimentation rétablie.</li></ul></li>
<li>Cliquez sur <b>Appliquer</b>.</li>
</ol>

<h3>Prise en charge d&apos;un onduleur&nbsp;SNMP</h3>

<p>Un onduleur&nbsp;SNMP est un p&eacute;riph&eacute;rique d&apos;alimentation de secours qui se connecte &agrave; votre Synology NAS via SNMP. Pour en savoir plus sur l&apos;installation mat&eacute;rielle, veuillez consulter le manuel d&apos;utilisation de votre onduleur&nbsp;SNMP. Une fois le Synology NAS branch&eacute; &agrave; l&apos;onduleur et connect&eacute; au m&ecirc;me r&eacute;seau, vous pouvez suivre les &eacute;tapes ci-dessous pour activer sa prise en charge.</p>

<h4>Pour activer la prise en charge d&apos;un onduleur&nbsp;SNMP&nbsp;:</h4>
<ol>
<li>Dans l&apos;onglet <strong>Onduleur</strong>, cochez la case <b>Activer la prise en charge d&apos;un onduleur</b>.</li>
<li>S&eacute;lectionnez <strong>Onduleur&nbsp;SNMP</strong> dans le menu d&eacute;roulant <strong>Type d&apos;onduleur</strong>.</li>
<li>Cochez <strong>D&eacute;lai avant que Synology NAS ne passe en mode sans &eacute;chec</strong> pour personnaliser le moment o&ugrave; le Synology NAS doit passer en mode sans &eacute;chec apr&egrave;s une coupure de courant. Saisissez une valeur num&eacute;rique et s&eacute;lectionnez <b>seconde(s)</b>, <b>minute(s)</b> ou <b>heure(s)</b> dans le menu d&eacute;roulant. Si cette case n&apos;est pas coch&eacute;e, <b>Jusqu&apos;&agrave; ce que la batterie faiblisse</b> s&apos;applique, ce qui signifie que le Synology NAS passe automatiquement en mode sans &eacute;chec lorsque la batterie de l&apos;onduleur est faible.</li>
	<p><span class="note_head">Remarque&nbsp;:</span> quelle que soit l&apos;option s&eacute;lectionn&eacute;e, Synology NAS passe automatiquement en mode sans &eacute;chec lorsque sa batterie est faible.</p>
<li>Dans le champ <strong>Adresse&nbsp;IP de l&apos;onduleur SNMP</strong>, saisissez l&apos;adresse&nbsp;IP de l&apos;onduleur SNMP.</li>
<li>S&eacute;lectionnez la <strong>MIB&nbsp;SNMP</strong> dans le menu d&eacute;roulant.</li>
<li>S&eacute;lectionnez la <strong>version du SNMP</strong> dans le menu d&eacute;roulant.</li>
<li>Saisissez la cha&icirc;ne de communaut&eacute; pour l&apos;onduleur&nbsp;SNMP dans le champ <strong>Communaut&eacute; SNMP</strong>.</li>
<li>Cochez la case <strong>Activer le serveur onduleur r&eacute;seau</strong> si le Synology NAS est connect&eacute; via SNMP et agit en tant que serveur onduleur r&eacute;seau. Cliquez sur <strong>P&eacute;riph&eacute;riques Synology NAS autoris&eacute;s</strong> pour saisir les adresses&nbsp;IP de tous les p&eacute;riph&eacute;riques Synology NAS que vous autorisez &agrave; se connecter &agrave; cet onduleur.</li>
<p><span class="note_head">Remarque&nbsp;: </span>La fonction <b>P&eacute;riph&eacute;riques Synology NAS autoris&eacute;s</b> n&apos;est pas disponible sur le SA3200D.</p>
<li>Cliquez sur <b>Appliquer</b>.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Il est vivement recommand&eacute; d&apos;utiliser un <b>Onduleur&nbsp;SNMP</b> pour les d&eacute;ploiements de Synology High Availability (SHA).</li>
<li>Le Synology NAS prend en charge les onduleurs SNMPv1 et SNMPv2c.</li>
</ul>
</div>

<h3>Serveur onduleur Synology</h3>

<p>Si plusieurs produits Synology utilisent un onduleur et qu&apos;un seul produit Synology est connect&eacute; &agrave; l&apos;onduleur via un port&nbsp;USB ou un r&eacute;seau, seul le Synology NAS connect&eacute; via USB ou un r&eacute;seau peut obtenir des informations relatives &agrave; l&apos;&eacute;tat de l&apos;onduleur. Dans ce cas, le Synology NAS agit en tant que «&nbsp;serveur onduleur r&eacute;seau&nbsp;». Le serveur onduleur r&eacute;seau obtient ensuite les informations de l&apos;onduleur et les transmet au Synology NAS client.</p>

<h4>Pour activer la prise en charge du serveur onduleur Synology&nbsp;:</h4>
<ol>
<li>Connectez-vous au Synology NAS connect&eacute; &agrave; l&apos;onduleur (via USB ou le r&eacute;seau).</li>
<li>Dans l&apos;onglet <strong>Onduleur</strong>, s&eacute;lectionnez la case <strong>Activer le serveur onduleur r&eacute;seau</strong> pour permettre au Synology NAS de transmettre les informations de l&apos;onduleur au Synology NAS client.</li>
<li>Cliquez sur le bouton <strong>P&eacute;riph&eacute;riques Synology NAS autoris&eacute;s</strong>.</li>
<li>Dans la fen&ecirc;tre qui s&apos;affiche, saisissez les adresses&nbsp;IP du Synology NAS client. Cliquez sur <strong>OK</strong>.</li>
<li>Cliquez sur <strong>Appliquer</strong> pour enregistrer les param&egrave;tres.</li>
</ol>

<p>Le serveur onduleur r&eacute;seau peut maintenant obtenir les informations de l&apos;onduleur et les transmettre au Synology NAS client qui utilise l&apos;onduleur. Consultez les instructions ci-dessous pour activer la prise en charge de l&apos;onduleur sur le Synology NAS client.</p></strike>

<h4>Pour activer la prise en charge de l&apos;onduleur sur le client Synology NAS&nbsp;:</h4>
<ol>
<li>Connectez-vous au Synology NAS client qui utilise l&apos;onduleur, mais qui n&apos;est pas connect&eacute; via USB ou un r&eacute;seau.</li>
<li>Dans l&apos;onglet <strong>Onduleur</strong>, cochez la case <strong>Activer la prise en charge d&apos;un onduleur</strong>.</li>
<li>S&eacute;lectionnez <strong>Serveur onduleur Synology</strong> dans le menu d&eacute;roulant <strong>Type d&apos;onduleur</strong>.</li>
<li>Cochez <strong>D&eacute;lai avant que Synology NAS ne passe en mode sans &eacute;chec</strong> pour personnaliser le moment o&ugrave; le Synology NAS doit passer en mode sans &eacute;chec apr&egrave;s une coupure de courant. Saisissez une valeur num&eacute;rique et s&eacute;lectionnez <strong>seconde(s)</strong>, <strong>minute(s)</strong> ou <strong>heure(s)</strong> dans le menu d&eacute;roulant. Si cette case n&apos;est pas coch&eacute;e, <b>Identique au serveur</b> s&apos;applique, ce qui signifie que le Synology NAS passe en mode sans &eacute;chec lorsque le serveur est arr&ecirc;t&eacute;.</li>
	<p><span class="note_head">Remarque&nbsp;:</span> quelle que soit l&apos;option s&eacute;lectionn&eacute;e, Synology NAS passe automatiquement en mode sans &eacute;chec lorsque sa batterie est faible.</p>
<li>Saisissez l&apos;adresse&nbsp;IP du serveur onduleur r&eacute;seau dans le champ <strong>Adresse&nbsp;IP du serveur onduleur r&eacute;seau</strong>.</li>
<li>Cliquez sur <b>Appliquer</b> pour enregistrer les param&egrave;tres.</li>
</ol>

<div class="section">
<h4>Configuration requise pour un onduleur r&eacute;seau&nbsp;:</h4>
<ul>
<li>Afin de pouvoir transmettre les informations de l&apos;onduleur, tous les Synology NAS doivent &ecirc;tre connect&eacute;s au m&ecirc;me r&eacute;seau.</li>
<li>Le p&eacute;riph&eacute;rique r&eacute;seau (par exemple, le commutateur ou le concentrateur) auquel chaque Synology NAS est connect&eacute; doit &ecirc;tre branch&eacute; au m&ecirc;me onduleur. Dans le cas contraire, le Synology NAS ne pourra pas transf&eacute;rer les informations de l&apos;onduleur en cas de panne de courant.</li>
</ul>
</div>






</body>
</html>
