<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Alimentation</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Planification de l&apos;alimentation</h2>

<p>Dans <strong>Panneau de configuration</strong>&nbsp;&gt; <strong>Mat&eacute;riel et alimentation</strong>&nbsp;&gt; <strong>Planification de l&apos;alimentation</strong>, vous pouvez param&eacute;trer le syst&egrave;me pour qu&apos;il d&eacute;marre ou s&apos;arr&ecirc;te automatiquement &agrave; une heure donn&eacute;e.</p>

<h4>Pour ajouter une nouvelle planification de d&eacute;marrage/arr&ecirc;t&nbsp;:</h4>

<ol>
<li>Cliquez sur le bouton <b>Cr&eacute;er</b> pour ouvrir la bo&icirc;te de dialogue <b>Ajouter une planification</b>.</li>
<li>S&eacute;lectionnez <b>D&eacute;marrage</b> ou <b>Arr&ecirc;t</b>.</li>
<li>D&eacute;finissez la <b>Date</b> et l&apos;<b>Heure</b> du d&eacute;marrage ou de l&apos;arr&ecirc;t.</li>
<li>Cliquez sur <b>OK</b>.</li>
<li>Cliquez sur <b>Enregistrer</b>.</li>
</ol>

<p>La nouvelle planification sera ajout&eacute;e &agrave; la liste des planifications.</p>

<h4>Pour afficher le r&eacute;sum&eacute; de la planification&nbsp;:</h4>
<p>Cliquez sur <b>R&eacute;sum&eacute;</b> pour parcourir la planification hebdomadaire de d&eacute;marrage/arr&ecirc;t.</p>

<div class="section">
<h4>Remarque&nbsp;:</h4>

<ul>
        <li>Vous pouvez d&eacute;finir jusqu&apos;&agrave; 100&nbsp;planifications pour chaque Synology NAS.</li>
        <li>Dans les cas suivants, l&apos;arr&ecirc;t automatique du syst&egrave;me peut &eacute;chouer&nbsp;:<ul>
        	<li>Le Gestionnaire de Stockage est en train d&apos;ex&eacute;cuter des t&acirc;ches.</li>
                <li>Le syst&egrave;me est en train de chiffrer des dossiers partag&eacute;s.</li>
                <li>Le syst&egrave;me est en train de r&eacute;aliser une Secure Erase sur les disques durs.</li>
                <li>DSM est en train d&apos;&ecirc;tre mis &agrave; niveau.</li>
                <li>Le syst&egrave;me est en train de r&eacute;parer des volumes RAID.</li>
                <li>Le centre de paquets est en train d&apos;ex&eacute;cuter des t&acirc;ches.</li>
                <li>Le syst&egrave;me est en train d&apos;am&eacute;liorer les bases de donn&eacute;es.</li>
                <li>Le syst&egrave;me est en train d&apos;ex&eacute;cuter des t&acirc;ches de sauvegarde des donn&eacute;es.</li>
			</ul>
        </li>
	</ul>
        </div>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Les planifications d&apos;alimentation ne seront pas appliqu&eacute;es en cas d&apos;interruption temporaire de l&apos;alimentation de votre Synology NAS. Pour garantir une alimentation continue pour votre Synology NAS, nous vous recommandons vivement d&apos;utiliser un onduleur&nbsp;SNMP ou USB.</li>
<li>Seuls les mod&egrave;les de Synology NAS dot&eacute;s d&apos;une architecture de paquet telle que Denverton, Grantley, Broadwell (y compris Broadwellnk, Broadwellntb et Broadwellntbap), Bromolow, Apollolake et Purley mettront toujours en &oelig;uvre la planification de d&eacute;marrage suite &agrave; une interruption temporaire de l&apos;alimentation. Veuillez vous reporter &agrave; <a href="https://www.synology.com/knowledgebase/DSM/tutorial/Compatibility_Peripherals/What_kind_of_CPU_does_my_NAS_have" target="_blank">cet article</a> pour en savoir plus sur l&apos;architecture de paquet de votre Synology NAS.</li>
<li>L&apos;EDS14 ne prend pas en charge le d&eacute;marrage/arr&ecirc;t automatique. Pour plus d&apos;informations sur la mani&egrave;re de planifier l&apos;activation/la d&eacute;sactivation automatique de la sortie&nbsp;CC sur l&apos;EDS14, reportez-vous &agrave; <a href="https://www.synology.com/knowledgebase/DSM/help/DSM/AdminCenter/system_hardware_dc_output" target="_blank">cet article d&apos;aide</a>.</li>
</ul>
</div>

</body>
</html>