<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>P&eacute;riph&eacute;riques externes</h2>

<p>Acc&eacute;dez &agrave; <strong>Panneau de configuration</strong>&nbsp;&gt; <b>P&eacute;riph&eacute;riques externes</b>&nbsp;&gt; <b>P&eacute;riph&eacute;riques externes</b> pour afficher une liste des p&eacute;riph&eacute;riques de stockage externes connect&eacute;s &agrave; votre Synology NAS.</p>

<h3><a name="usbdisk"></a><a name="esatadisk"></a>Disques externes</h3>
<p>En connectant un disque externe au syst&egrave;me, vous pouvez partager la capacit&eacute; de ce disque par le biais d&apos;un dossier partag&eacute; cr&eacute;&eacute; par le syst&egrave;me et appel&eacute; <b>usbshare[num&eacute;ro]</b> (pour les disques USB, le cas &eacute;ch&eacute;ant) ou <b>satashare[num&eacute;ro]</b> (pour les disques eSATA, le cas &eacute;ch&eacute;ant). Le dossier partag&eacute; sera supprim&eacute; automatiquement lorsque le disque externe sera &eacute;ject&eacute; du syst&egrave;me.</p>

<p>Synology NAS reconna&icirc;t les formats suivants&nbsp;: <strong>Btrfs</strong>, <strong>ext3</strong>, <strong>ext4</strong>, <strong>FAT</strong>, <strong>FAT32</strong>, <strong>exFAT</strong>, <strong>HFS</strong>, <strong>HFS&nbsp;Plus</strong> et <strong>NTFS</strong>. Tout disque externe non reconnu devra &ecirc;tre d&apos;abord format&eacute; avant d&apos;&ecirc;tre utilis&eacute; sur le syst&egrave;me.</p>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ol>
	<li>Certains mod&egrave;les prennent en charge HFS/HFS&nbsp;Plus en lecture seule.</li>
	<li>Le journal n&apos;est pas pris en charge sur HFS/HFS&nbsp;Plus.</li>
	<li>Vous devez installer <strong>exFAT&nbsp;Access</strong> &agrave; partir du <strong>Centre de paquets</strong> pour activer Synology NAS et prendre en charge exFAT. Pour obtenir la liste des mod&egrave;les de produits Synology qui prennent en charge le format&nbsp;exFAT, veuillez consulter <a href="https://www.synology.com/dsm/packages/exFAT" target="_blank">cette page</a>.</li>
	<li>Veillez &agrave; &eacute;jecter le disque externe avant de le d&eacute;brancher.</li>
	<li>Btrfs n&apos;est disponible que sur certains mod&egrave;les sp&eacute;cifiques. Pour v&eacute;rifier si votre mod&egrave;le prend en charge Btrfs, veuillez consulter <a href="https://www.synology.com/knowledgebase/DSM/tutorial/General/Which_Synology_NAS_models_support_the_Btrfs_file_system" target="_blank">cet article</a>.</li>
</ol>
</div>

<h4>Pour acc&eacute;der aux images du disque&nbsp;:</h4>
<p>Synology&nbsp;NAS prend en charge le montage de disques virtuels pour acc&eacute;der au contenu des images d&apos;un disque sur des p&eacute;riph&eacute;riques externes avec File&nbsp;Station. Pour en savoir plus sur la mani&egrave;re de monter des disques virtuels, veuillez consulter <a href="https://www.synology.com/knowledgebase/DSM/help/FileStation/mountiso" target="_blank">cet article</a>.</p>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
<li>Format d&apos;image de disque pris en charge&nbsp;: fichiers «&nbsp;.iso&nbsp;» utilisant le syst&egrave;me de fichiers ISO&nbsp;9960 et UDF.</li>
</ul>
</div>

<h4>Pour formater le disque&nbsp;:</h4>

<p>Cliquez sur <b>Formater</b> et suivez l&apos;assistant. Vous pouvez formater vos disques externes aux formats <b>ext4</b> et <b>FAT32</b> avec Synology NAS.</p>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ol>
	<li>Veillez &agrave; sauvegarder vos donn&eacute;es avant de formater le disque externe. Toutes les donn&eacute;es seront supprim&eacute;es pendant le processus, et elles ne pourront pas &ecirc;tre restaur&eacute;es.</li>
	<li>Pour formater le disque externe au format&nbsp;ext3 ou ext4, la capacit&eacute; du disque doit &ecirc;tre sup&eacute;rieure &agrave; 1&nbsp;Go.</li>
	<li>Lorsque le disque est format&eacute; au format&nbsp;ext3 ou ext4, il n&apos;est reconnu que par Synology NAS. Si vous souhaitez lire les donn&eacute;es directement depuis votre disque externe avec un PC et/ou un Mac, choisissez le format FAT32.</li>
</ol>
</div>

<h4>Pour effectuer un test S.M.A.R.T. :</h4>
<p>Disque S.M.A.R.T. Le test S.M.A.R.T. examine et fait un rapport sur l&apos;&eacute;tat de vos disques durs, vous alertant &agrave; l&apos;avance des d&eacute;faillances imminentes des disques. Il est recommand&eacute; de changer rapidement votre disque si des erreurs sont d&eacute;tect&eacute;es. <br /> Pour effectuer un test S.M.A.R.T. , cliquez simplement sur le bouton <strong>Test S.M.A.R.T.</strong> et suivez l&apos;assistant.<br /> Pour v&eacute;rifier les r&eacute;sultats du test, cliquez simplement sur <strong>Infos S.M.A.R.T.</strong></p>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>La dur&eacute;e du test varie en fonction de votre environnement syst&egrave;me.</li>
</ul>
</div>


<div class="section">
<h4>Limites</h4>

<p>Le formatage du disque n&apos;est pas disponible dans les situations suivantes&nbsp;:</p>

<ul>
	<li>Le disque externe est en cours d&apos;initialisation (lorsque le p&eacute;riph&eacute;rique externe vient juste d&apos;&ecirc;tre branch&eacute;).</li>
	<li>La capacit&eacute; du disque externe est inf&eacute;rieure &agrave; 1&nbsp;Go (format ext3 ou ext4).</li>
	<li>Le disque externe est en cours de formatage.</li>
	<li>Le syst&egrave;me est en train de sauvegarder des fichiers sur le disque externe.</li>
	<li>Le disque externe est endommag&eacute;.</li>
</ul>

<h4>D&eacute;pannage</h4>
<ol>
	<li>&Eacute;chec de formatage du disque externe. Pourquoi&nbsp;?<ul>
			<li>V&eacute;rifiez que le disque externe est ins&eacute;r&eacute; correctement.</li>
			<li>V&eacute;rifiez que le disque externe n&apos;est pas prot&eacute;g&eacute; en &eacute;criture. S&apos;il l&apos;est, supprimez cette option avant de le formater.</li>
		</ul>
	</li>
	<li>Le type de syst&egrave;me de fichiers du disque externe est affich&eacute; comme <strong>Non pris en charge</strong>, ou le syst&egrave;me ne cr&eacute;e pas le dossier partag&eacute; <strong>usbshare[num&eacute;ro]</strong> ou <strong>satashare[num&eacute;ro]</strong> pour le disque externe. Que faire&nbsp;?<ul>
			<li>Le syst&egrave;me actuel reconna&icirc;t les formats Btrfs, ext3, ext4, FAT, FAT32, HFS, HFS&nbsp;Plus et NTFS. Tout disque externe dont le format n&apos;est pas mentionn&eacute; ci-dessus ne sera pas reconnu. Son &eacute;tat sera d&eacute;fini sur <b>Non pris en charge</b>.</li>
		</ul>
	</li>
	<li>Je ne peux pas acc&eacute;der au dossier partag&eacute; <b>usbshare[num&eacute;ro]</b> ou <b>satashare[num&eacute;ro]</b>. Que faire&nbsp;?<ul>
			<li>Cela peut &ecirc;tre d&ucirc; &agrave; un probl&egrave;me dans le syst&egrave;me de fichiers sur votre disque externe. Pour corriger ce probl&egrave;me, veuillez connecter le disque externe &agrave; un PC et effectuer une v&eacute;rification du syst&egrave;me de fichiers.</li>
		</ul>
	</li>
	<li>Mon disque externe au format ext3 ou ext4 peut-il &ecirc;tre connect&eacute; &agrave; mon PC et/ou Mac et acc&eacute;d&eacute; directement&nbsp;?<ul>
			<li>Non. Les formats ext3 ou ext4 sont uniquement reconnus par Synology NAS. Si vous souhaitez lire les donn&eacute;es directement depuis votre disque externe avec un PC et/ou un Mac, choisissez le format FAT32.</li>
		</ul>
	</li>
	<li>Pourquoi vois-je un dossier appel&eacute; «&nbsp;lost+found&nbsp;» dans mon disque externe&nbsp;?<ul>
			<li>Il s&apos;agit d&apos;un dossier syst&egrave;me par d&eacute;faut, qui a &eacute;t&eacute; cr&eacute;&eacute; automatiquement lors de l&apos;utilisation du syst&egrave;me de fichiers ext3/ext4. Il est normal que vous le voyiez dans votre disque externe. Bien que les administrateurs soient autoris&eacute;s &agrave; acc&eacute;der &agrave; son contenu et &agrave; le g&eacute;rer, il est fortement recommand&eacute; de ne pas toucher &agrave; ce dossier.</li>
		</ul>
	</li>
</ol>
</div>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>Btrfs n&apos;est disponible que sur certains mod&egrave;les sp&eacute;cifiques. Pour v&eacute;rifier si votre mod&egrave;le prend en charge Btrfs, veuillez consulter <a href="https://www.synology.com/knowledgebase/DSM/tutorial/General/Which_Synology_NAS_models_support_the_Btrfs_file_system" target="_blank">cet article</a>.</li>
</ul>
</div>

<h4>Pour param&eacute;trer les autorisations par d&eacute;faut pour tous les p&eacute;riph&eacute;riques externes&nbsp;:</h4>
<p>Vous pouvez param&eacute;trer les autorisations par d&eacute;faut en cliquant sur <strong>Param&egrave;tres</strong>&nbsp;&gt; <strong>Autorisations par d&eacute;faut</strong> et en sp&eacute;cifiant quels utilisateurs ou groupes peuvent acc&eacute;der aux p&eacute;riph&eacute;riques externes, les afficher, les modifier ou modifier leur contenu. Lorsqu&apos;un p&eacute;riph&eacute;rique externe est connect&eacute; &agrave; votre Synology NAS, les autorisations que vous avez sp&eacute;cifi&eacute;es sont assign&eacute;es automatiquement au p&eacute;riph&eacute;rique externe.</p>

<p>Dans la fen&ecirc;tre des autorisations, effectuez ce qui suit pour param&eacute;trer les autorisations par d&eacute;faut&nbsp;:</p>
<ol>
	<li>Choisissez l&apos;un des &eacute;l&eacute;ments suivants dans le menu d&eacute;roulant&nbsp;:<ul>
			<li><b>Utilisateur du syst&egrave;me interne&nbsp;:</b> attribue des autorisations aux utilisateurs syst&egrave;me par d&eacute;faut, tels que l&apos;utilisateur Anonymous FTP/WebDAV.</li>
			<li><b>Utilisateurs locaux&nbsp;:</b> attribue des autorisations aux utilisateurs locaux (y compris <b>invit&eacute;</b>).</li>
			<li><b>Groupes locaux&nbsp;:</b> attribue des autorisations aux groupes locaux.</li>
		</ul>
	</li>
	<li>Cochez ou d&eacute;cochez les cases pour personnaliser les autorisations d&apos;acc&egrave;s des p&eacute;riph&eacute;riques externes pour chaque utilisateur ou groupe&nbsp;:<ul>
			<li><b>Lecture/&eacute;criture</b>&nbsp;: l&apos;utilisateur ou le groupe peut acc&eacute;der aux fichiers et dossiers sur les p&eacute;riph&eacute;riques externes, et y apporter des modifications.</li>
			<li><b>Lecture seule</b>&nbsp;: l&apos;utilisateur ou le groupe peut acc&eacute;der aux fichiers et dossiers sur les p&eacute;riph&eacute;riques externes.</li>
			<li><b>Pas d&apos;acc&egrave;s</b>&nbsp;: l&apos;utilisateur ou le groupe ne peut pas acc&eacute;der aux fichiers et dossiers sur les p&eacute;riph&eacute;riques externes.</li>
		</ul>
	</li>
</ol>

</body>
</html>