<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Mise &agrave; jour</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1><a name="leaf_update"></a>Mise &agrave; jour</h1>
<h2><a name="leaf_update"></a>Mise &agrave; jour de DSM</h2>
<p>Synology sort r&eacute;guli&egrave;rement des mises &agrave; jour gratuites de DSM. Les mises &agrave; jour peuvent inclure de nouvelles fonctionnalit&eacute;s, l&apos;am&eacute;lioration de certaines fonctions et l&apos;am&eacute;lioration des performances. Les mises &agrave; jour de DSM peuvent se pr&eacute;senter sous la forme de mises &agrave; jour mineures ou majeures. Le syst&egrave;me affiche un message en regard du champ <b>Statut</b> si la mise &agrave; jour est mineure. Lorsqu&apos;il existe une mise &agrave; jour majeure de DSM, une section secondaire du champ <b>Statut</b> fournira des informations sur cette version, ainsi qu&apos;un lien de t&eacute;l&eacute;chargement vers la mise &agrave; jour majeure. En r&egrave;gle g&eacute;n&eacute;rale, les mises &agrave; jour mineures incluent des corrections de bogues critiques et des correctifs de s&eacute;curit&eacute; pour assurer la stabilit&eacute; du syst&egrave;me. Les mises &agrave; jour majeures incluent principalement de toutes nouvelles fonctionnalit&eacute;s et am&eacute;liorations des performances, des corrections de bogues critiques et des correctifs de s&eacute;curit&eacute;.</p>


<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>La mise &agrave; jour de DSM n&apos;affecte pas les donn&eacute;es du Synology NAS. Toutefois, pour assurer la s&eacute;curit&eacute; des donn&eacute;es, nous vous recommandons fortement de sauvegarder vos donn&eacute;es avant de commencer.</li>
<li>Apr&egrave;s la mise &agrave; niveau vers de nouvelles versions de mise &agrave; jour de DSM, vous ne pouvez pas revenir aux versions pr&eacute;c&eacute;dentes de mise &agrave; jour de DSM.</li>
<li>Synology NAS ex&eacute;cute automatiquement une liste de contr&ocirc;les pour d&eacute;terminer si la nouvelle version est pertinente pour votre syst&egrave;me, en fonction des services et des configurations syst&egrave;me. Ainsi, les mises &agrave; jour et derni&egrave;res versions disponibles peuvent varier en fonction de vos configurations actuelles de DSM.</li>
</ul>
</div>

<h3>Proc&eacute;der &agrave; une mise &agrave; jour manuelle de DSM</h3>
<p>Vous pouvez t&eacute;l&eacute;charger le fichier de mise &agrave; jour .pat depuis le <a href="http://www.synology.com/support/download.php" target="_blank">Centre de t&eacute;l&eacute;chargement</a> de Synology et effectuer une mise &agrave; jour manuelle de DSM.</p>

<h4>Pour effectuer une mise &agrave; jour manuelle de DSM&nbsp;:</h4>

<ol>
<li>Acc&eacute;dez au <a href="http://www.synology.com/support/download.php" target="_blank">Centre de t&eacute;l&eacute;chargement</a> pour t&eacute;l&eacute;charger la derni&egrave;re mise &agrave; jour de DSM sur votre ordinateur local. Il n&apos;est pas n&eacute;cessaire d&apos;extraire le fichier .pat.</li>
<li>Cliquez sur <b>Mise &agrave; jour DSM manuelle</b> pour acc&eacute;der &agrave; la page Mise &agrave; jour manuelle de DSM</li>
<li>Cliquez sur <b>Parcourir</b> pour s&eacute;lectionner le fichier de mise &agrave; jour.</li>
<li>Cliquez sur <b>Appliquer</b> pour d&eacute;marrer la mise &agrave; jour de DSM. Le syst&egrave;me red&eacute;marrera automatiquement une fois la mise &agrave; jour termin&eacute;e.</li>
</ol>
<div class="section">
<h4>D&eacute;pannage&nbsp;:</h4>
<p>Si vous ne pouvez pas proc&eacute;der &agrave; la mise &agrave; jour de DSM, les suggestions ci-dessous vous aideront peut-&ecirc;tre &agrave; r&eacute;soudre le probl&egrave;me&nbsp;:</p>
<ul>
<li>V&eacute;rifiez si le processus de mise &agrave; niveau a &eacute;t&eacute; interrompu par l&apos;utilisateur ou par tout autre &eacute;v&egrave;nement inattendu, comme une panne d&apos;&eacute;lectricit&eacute;.</li>
<li>V&eacute;rifiez la version de DSM. Vous ne pouvez mettre &agrave; jour le syst&egrave;me qu&apos;avec une nouvelle version de DSM.</li>
<li>T&eacute;l&eacute;chargez de nouveau la mise &agrave; jour de DSM au cas o&ugrave; le fichier de mise &agrave; jour serait corrompu.</li>
</ul>
<p>Si le probl&egrave;me persiste, veuillez contacter l&apos;<a href="https://account.synology.com" target="_blank">assistance technique</a> de Synology.</p>
</div>

<h3>Configuration des pr&eacute;f&eacute;rences d&apos;installation et de mise &agrave; jour automatique de DSM</h3>
<p>
<font>Pour configurer vos param&egrave;tres d&apos;installation de mise &agrave; jour et v&eacute;rifier la planification, cliquez sur <b>Mettre &agrave; jour les param&egrave;tres</b>.</font>
</p>

<h4>Pour que le syst&egrave;me vous avertisse lorsqu&apos;une nouvelle mise &agrave; jour de DSM est disponible&nbsp;:</h4>
<p>L&apos;option <b>M&apos;avertir et me laisser d&eacute;cider d&apos;installer ou non la nouvelle mise &agrave; jour</b> permet au syst&egrave;me de vous avertir uniquement lorsqu&apos;une nouvelle version est disponible. Vous pouvez choisir de t&eacute;l&eacute;charger la mise &agrave; jour apr&egrave;s avoir re&ccedil;u la notification.</p>

<p>Une notification de bureau s&apos;affichera lorsqu&apos;une mise &agrave; jour de DSM est t&eacute;l&eacute;charg&eacute;e et pr&ecirc;te &agrave; &ecirc;tre install&eacute;e. Pour emp&ecirc;cher la mise &agrave; jour automatique de DSM, vous pouvez l&apos;annuler dans la notification de poste de travail. De plus, les mises &agrave; jour de DSM seront install&eacute;es avant l&apos;arr&ecirc;t programm&eacute; si vous avez activ&eacute; l&apos;option <strong>Arr&ecirc;ter</strong> sous l&apos;onglet <strong>Planification de l&apos;alimentation</strong>.</p>

<h4>Pour installer automatiquement la nouvelle mise &agrave; jour de DSM&nbsp;:</h4>
<p>L&apos;option <b>Installer automatiquement la nouvelle mise &agrave; jour</b> permet au syst&egrave;me d&apos;installer automatiquement la nouvelle mise &agrave; jour de DSM si le r&eacute;sultat de la v&eacute;rification d&eacute;tecte qu&apos;une nouvelle mise &agrave; jour est disponible. Ceci s&apos;applique uniquement aux mises &agrave; jour mineures affich&eacute;es dans <b>Statut</b> et non aux mises &agrave; jour majeures.</p>

<h4>Pour configurer une planification de v&eacute;rification&nbsp;:</h4>
<p>Le <b>planning de v&eacute;rification</b> vous permet de d&eacute;cider quand le syst&egrave;me doit rechercher les mises &agrave; jour disponibles. S&eacute;lectionnez les jours de la semaine et l&apos;heure des jours sp&eacute;cifi&eacute;s pour rechercher les mises &agrave; jour. Par exemple, les mardis et vendredis &agrave; 11h00.</p>

<h3>Mise &agrave; jour majeure</h3>
<p>Lorsqu&apos;une version majeure de DSM est disponible, ces informations s&apos;affichent au bas de la section Mise &agrave; jour de DSM. Vous pouvez t&eacute;l&eacute;charger la version majeure de la mise &agrave; jour en cliquant sur <b>T&eacute;l&eacute;charger</b>. Une fois le t&eacute;l&eacute;chargement termin&eacute;, cliquez sur <b>Mettre &agrave; jour maintenant</b> pour terminer le processus.</p>


<div class="section">
<h4>D&eacute;pannage&nbsp;:</h4>
<p>Si des messages d&apos;erreur apparaissent en rouge lors de la v&eacute;rification ou du t&eacute;l&eacute;chargement du nouveau DSM, veuillez v&eacute;rifier les &eacute;l&eacute;ments suivants&nbsp;:</p>
<ul>
<li>Assurez-vous que votre Synology NAS est connect&eacute; &agrave; Internet.</li>
<li>Le serveur de t&eacute;l&eacute;chargement de Synology pourrait &ecirc;tre occup&eacute; pour le moment. R&eacute;essayer de t&eacute;l&eacute;charger ult&eacute;rieurement pourrait r&eacute;soudre le probl&egrave;me.</li>
</ul>
<p>Si le probl&egrave;me persiste, veuillez contacter l&apos;<a href="https://account.synology.com" target="_blank">assistance technique</a> de Synology.</p>
</div>

<h2><a name="leaf_update"></a>Mise &agrave; niveau du progiciel de l&apos;unit&eacute; d&apos;extension</h2>

<p>Si vous disposez d&apos;unit&eacute;s d&apos;extension SAS, une mise &agrave; jour du progiciel peut s&apos;av&eacute;rer n&eacute;cessaire de temps &agrave; autre. Le syst&egrave;me recherche automatiquement les mises &agrave; niveau du progiciel et affiche l&apos;un des statuts suivants&nbsp;: <b>Mise &agrave; niveau imm&eacute;diate du progiciel requise</b>, <b>Le progiciel de toutes les unit&eacute;s d&apos;extension est &agrave; jour</b>, ou <b>Aucune unit&eacute; d&apos;extension</b>.<ul>
<li><b>Mise &agrave; jour imm&eacute;diate du progiciel requise</b>&nbsp;: Lorsque ce message s&apos;affiche, nous vous recommandons vivement de mettre &agrave; jour le progiciel de vos unit&eacute;s d&apos;extension d&egrave;s que possible. Vos unit&eacute;s d&apos;extension seront indisponibles jusqu&apos;&agrave; ce que la mise &agrave; jour soit termin&eacute;e. Vous ne pouvez pas non plus cr&eacute;er de nouveaux volumes sur les unit&eacute;s d&apos;extension pendant cette p&eacute;riode.</li>

<li><b>Le progiciel de toutes les unit&eacute;s d&apos;extension est &agrave; jour</b>&nbsp;: Ce message indique que votre syst&egrave;me a termin&eacute; la mise &agrave; jour et fonctionne dans un environnement stable.</li>

<li><b>Aucune unit&eacute; d&apos;extension connect&eacute;e</b>&nbsp;: Cela indique qu&apos;aucune unit&eacute; d&apos;extension n&apos;est connect&eacute;e &agrave; votre Synology NAS. Par cons&eacute;quent, il n&apos;est pas n&eacute;cessaire de proc&eacute;der &agrave; la mise &agrave; jour du progiciel.</li>
</ul></p>

<p><span class="note_head">Important&nbsp;:</span> En principe, la mise &agrave; niveau du progiciel des unit&eacute;s d&apos;extension n&apos;affecte pas les donn&eacute;es du Synology NAS. Toutefois, pour assurer la s&eacute;curit&eacute; des donn&eacute;es, nous vous recommandons fortement de sauvegarder vos donn&eacute;es avant de commencer.</p>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>La mise &agrave; niveau du progiciel des unit&eacute;s d&apos;extension n&apos;est requise que pour certains mod&egrave;les SAS.</li>
<li>La mise &agrave; niveau du progiciel des unit&eacute;s d&apos;extension n&apos;est disponible que sur DSM 6.2.2 ou les versions ult&eacute;rieures.</li>
</ul>
</div>

<h4>Pour mettre &agrave; jour le progiciel des unit&eacute;s d&apos;extensions&nbsp;:</h4>

<p>La mise &agrave; jour du progiciel des unit&eacute;s d&apos;extensions ne prend que quelques minutes et ne n&eacute;cessite pas de red&eacute;marrer votre syst&egrave;me. Les autres services en cours d&apos;ex&eacute;cution ne seront pas interrompus pendant la mise &agrave; jour.</p>

<ol>
<li>Cliquez sur <b>Mettre &agrave; jour maintenant</b> pour commencer la mise &agrave; jour.</li>
<li>Une bo&icirc;te de dialogue d&apos;avertissement s&apos;affiche. S&eacute;lectionnez l&apos;une des options suivantes&nbsp;:<ul>
		<li>Pour poursuivre la mise &agrave; jour, cliquez sur <b>OK</b>. Une barre de progression s&apos;affiche.</li>
		<li>Pour effectuer la mise &agrave; jour ult&eacute;rieurement, cliquez sur <b>Annuler</b>.</li>
	</ul>
</li>
<li>Le syst&egrave;me affiche l&apos;une des notifications de bureau ci-dessous pour vous dire si la mise &agrave; jour a r&eacute;ussi ou non&nbsp;: <b>Mise &agrave; niveau du progiciel des unit&eacute;s d&apos;extension termin&eacute;e</b> ou <b>&Eacute;chec de la mise &agrave; jour du progiciel des unit&eacute;s d&apos;extension</b>.</li>
<li>L&apos;un des messages d&apos;&eacute;tat ci-dessous s&apos;affiche dans <b>Statut</b>&nbsp;:<ul>
		<li><b>Le progiciel de toutes les unit&eacute;s d&apos;extension est &agrave; jour</b>&nbsp;: Ce message s&apos;affiche lorsque la mise &agrave; jour est termin&eacute;e et r&eacute;ussie. Le syst&egrave;me fonctionne dans un environnement stable et vos unit&eacute;s d&apos;extension peuvent &ecirc;tre utilis&eacute;es.</li>
		<li><b>&Eacute;chec de la mise &agrave; jour</b>&nbsp;: Si la mise &agrave; jour du progiciel des unit&eacute;s d&apos;extension a &eacute;chou&eacute;, cliquez sur <b>Contacter l&apos;assistance</b> pour r&eacute;soudre votre probl&egrave;me.</li>
	</ul></li>
</ol>
<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Pour garantir la stabilit&eacute; du syst&egrave;me, le service d&apos;unit&eacute;s d&apos;extension n&apos;est pas disponible lorsque le syst&egrave;me d&eacute;tecte que la mise &agrave; jour du progiciel est n&eacute;cessaire. Le service sera de nouveau disponible une fois la mise &agrave; jour du progiciel termin&eacute;e.</li>
<li>Si la mise &agrave; jour du progiciel des unit&eacute;s d&apos;extension a &eacute;chou&eacute;, n&apos;essayez pas de red&eacute;marrer ou de retirer les lecteurs ou unit&eacute;s d&apos;extension. Pour r&eacute;soudre ce probl&egrave;me, reportez-vous &agrave; <a href="https://www.synology.com/knowledgebase/DSM/help/DSM/SupportCenter/contact_support" target="_blank">cet article</a> et contactez l&apos;<a href="https://account.synology.com" target="_blank">assistance technique</a> de Synology pour obtenir de l&apos;aide.</li>
</ul>
</div>

</body>
</html>
