<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Notification</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="advanced"></a>Avanc&eacute;</h2>
<p>Vous pouvez s&eacute;lectionner les types d&apos;&eacute;v&eacute;nements qui d&eacute;clencheront l&apos;envoi de messages de notification par le syst&egrave;me. De m&ecirc;me, vous pouvez choisir le support (e-mail, SMS et p&eacute;riph&eacute;riques mobiles) sur lequel vous recevrez ces messages.</p>
<p>Chacun des &eacute;v&eacute;nements a son propre message de notification par d&eacute;faut, mais vous avez &eacute;galement l&apos;option de personnaliser votre propre contenu de notification en modifiant le message de notification. Le message par d&eacute;faut peut &ecirc;tre restaur&eacute; si vous d&eacute;cidez d&apos;annuler vos param&egrave;tres personnalis&eacute;s plus tard.</p>

<h4>Pour rechercher des notifications particuli&egrave;res&nbsp;:</h4>
	<ol>
	<li>Saisissez un mot-cl&eacute; dans le champ de recherche, dans le coin sup&eacute;rieur droit.</li>
	<li>Les &eacute;v&eacute;nements relatifs aux mots-cl&eacute;s saisis s&apos;affichent.</li>
	</ol>


<h4>Pour s&eacute;lectionner les moyens de notification des &eacute;v&eacute;nements de notification&nbsp;:</h4>
	<ol>
	<li>Cochez les cases pour chaque &eacute;v&eacute;nement individuel pour s&eacute;lectionner les moyens de notification pr&eacute;f&eacute;r&eacute;s.</li>
	<li>Cliquez sur <b>Enregistrer</b> pour appliquer les param&egrave;tres.</li>
	</ol>

<h4>Pour modifier le message de notification&nbsp;:</h4>
<ol>
	<li>S&eacute;lectionnez un &eacute;v&eacute;nement dans la liste des &eacute;v&eacute;nements, puis cliquez sur <b>Modifier le message</b>.</li>
	<li>Dans la fen&ecirc;tre qui s&apos;affiche, modifiez l&apos;objet et le contenu du corps pour personnaliser le message de notification.</li>
	<li>Vous pouvez &eacute;galement modifier les variables suivantes. Les variables mises &agrave; jour s&apos;appliquent &agrave; tous les messages de notification&nbsp;:<ul>
			<li><strong>%COMPANY_NAME%</strong>: La signature qui s&apos;affiche &agrave; la fin d&apos;un message de notification. La valeur par d&eacute;faut <strong>Synology&nbsp;DiskStation</strong>, <strong>Synology&nbsp;RackStation</strong>, <strong>Synology&nbsp;FlashStation</strong>, ou <strong>Synology Unified Controller</strong>, selon le mod&egrave;le dont vous disposez.</li>
			<li><strong>%HTTP_URL%</strong>&nbsp;: Un hyperlien vers votre Synology NAS. S&apos;il n&apos;est pas sp&eacute;cifi&eacute;, le syst&egrave;me r&eacute;pertorie tous les liens possibles dans le message de notification.</li></ul></li>
	<li>Cliquez sur <strong>Enregistrer</strong> pour appliquer les modifications.</li>
	<li>Pour restaurer le message de notification &agrave; sa valeur par d&eacute;faut&nbsp;:<ol>
		<li>S&eacute;lectionnez un &eacute;v&eacute;nement dans la liste des &eacute;v&eacute;nements, puis cliquez sur <b>Modifier le message</b>.</li>
		<li>Dans la fen&ecirc;tre qui s&apos;affiche, cliquez sur <b>Restaurer les param&egrave;tres par d&eacute;faut</b> puis sur <strong>Oui</strong> dans la bo&icirc;te de dialogue de confirmation.</li>
		</ol></li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4> 
<ul>
	<li>Il est recommand&eacute; de r&eacute;server les segments de cha&icirc;ne contenant «&nbsp;%&nbsp;» dans l&apos;objet et le contenu du corps. Ils seront remplac&eacute;s par les informations r&eacute;elles du syst&egrave;me quand une notification est envoy&eacute;e.</li>
</ul>
</div>

</body>
</html>
