<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<meta name="author" content="Synology Inc.">
<meta name="description" content="Enabling email notifications allows your Synology NAS to send messages to your email when specified events occur.">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>E-mail</h2>

<p>L&apos;activation des notifications par email permet au Synology NAS d&apos;envoyer des messages &agrave; votre adresse email lorsque des &eacute;v&eacute;nements sp&eacute;cifiques se produisent, tels que des erreurs syst&egrave;me, une perte de connexion r&eacute;seau, le changement de comportement du ventilateur, une panne d&apos;alimentation ou l&apos;&eacute;chec d&apos;une t&acirc;che de fond.</p>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>L&apos;&eacute;v&eacute;nement correspondant au changement de comportement du ventilateur n&apos;est pas disponible sur un mod&egrave;le sans ventilateur, tel que l&apos;EDS14. Pour plus d&apos;informations, visitez le <a href="https://www.synology.com/" target="_blank">site Web Synology</a>.</li>
</ul>
</div>

<h4>Pour activer la notification par email&nbsp;:</h4>
<ol>
	<li>Acc&eacute;dez &agrave; <strong>Panneau de configuration</strong> &gt; <strong>Notification</strong> &gt; <strong>Email</strong>.</li>
	<li>Activez la case &agrave; cocher <strong>Activer les notifications par email</strong>.</li>
	<li>Saisissez une ou plusieurs adresses email dans le champ <strong>Adresse email du destinataire</strong>. Les notifications syst&egrave;me sont envoy&eacute;es aux adresses saisies ici. Vous pouvez saisir deux adresses. Les comptes multiples peuvent &ecirc;tre s&eacute;par&eacute;s par un point-virgule (;).</li>
	<li>Si n&eacute;cessaire, ajoutez un pr&eacute;fixe d&apos;objet dans le champ <strong>Pr&eacute;fixe d&apos;objet</strong>. Ce pr&eacute;fixe sera ajout&eacute; &agrave; l&apos;objet de chaque message envoy&eacute; par le Synology NAS, ce qui permet d&apos;identifier et de filtrer les messages.</li>
	<li>Si vous souhaitez utiliser un serveur de messagerie tiers (Gmail ou Outlook, par exemple) pour relayer les messages, consultez la section «&nbsp;Service de messagerie tiers&nbsp;» ci-dessous. Si vous souhaitez utiliser un serveur personnalis&eacute;, consultez la section «&nbsp;Personnaliser un serveur SMTP&nbsp;».</li>
</ol>

<h4>Pour utiliser un service de messagerie tiers&nbsp;:</h4>
<ol>
	<li>Dans le menu <strong>Fournisseur de service</strong>, choisissez un service de messagerie tiers, tel que Gmail ou Outlook.</li>
	<li>Saisissez votre nom d&apos;utilisateur et votre mot de passe pour le service de messagerie s&eacute;lectionn&eacute;.</li>
	<li>Cliquez sur <strong>Appliquer</strong> pour enregistrer les param&egrave;tres.</li>
	<li>Vous pouvez cliquer sur <strong>Envoyer un email de test</strong> pour v&eacute;rifier si vos param&egrave;tres sont corrects.</li>
</ol>

<h4>Pour utiliser un serveur SMTP personnalis&eacute;&nbsp;:</h4>
<ol>
	<li>Dans le menu <strong>Fournisseur de service</strong>, s&eacute;lectionnez <strong>Personnaliser un serveur SMTP</strong>.</li>
	<li>Saisissez le nom du serveur SMTP ou l&apos;adresse IP dans le champ <strong>Serveur SMTP</strong></li>
	<li>Entrez le num&eacute;ro de port SMTP dans le champ <strong>Port SMTP</strong>. (Si vous avez d&eacute;fini un autre port SMTP lors de la configuration des r&egrave;gles de transmission de port, renseignez le num&eacute;ro correspondant.)</li>
	<li>Si votre serveur SMTP requiert une authentification SMTP, activez la case &agrave; cocher <strong>Authentification requise</strong>, puis saisissez votre <strong>Nom d&apos;utilisateur</strong> et votre <strong>Mot de passe</strong> associ&eacute;s au serveur de messagerie.</li>
	<li>Si votre serveur SMTP requiert une connexion SSL/TLS, activez la case &agrave; cocher <strong>Une connexion s&eacute;curis&eacute;e (SSL/TLS) est n&eacute;cessaire</strong>.</li>
	<li>Si vous souhaitez personnaliser le nom de l&apos;exp&eacute;diteur qui appara&icirc;t sur les messages &eacute;lectroniques envoy&eacute;s par le Synology NAS, tapez ce nom dans le champ <strong>Nom de l&apos;exp&eacute;diteur</strong>. Si vous souhaitez personnaliser l&apos;adresse email de l&apos;exp&eacute;diteur, saisissez l&apos;adresse email dans le champ <strong>Exp&eacute;diteur de l&apos;email</strong>. Si le champ est vide, c&apos;est la premi&egrave;re adresse email renseign&eacute;e dans le champ <strong>Destinataires</strong> qui sera utilis&eacute;e.</li>
	<li>Cliquez sur <strong>Appliquer</strong> pour enregistrer les param&egrave;tres.</li>
	<li>Vous pouvez cliquer sur <strong>Envoyer un email de test</strong> pour v&eacute;rifier si vos param&egrave;tres sont corrects.</li>
</ol>

<div class="section"><h4>Remarque&nbsp;:</h4>
<ul>
	<li>Si vous souhaitez envoyer un message de bienvenue &agrave; chaque compte nouvellement cr&eacute;&eacute;, activez la case &agrave; cocher <strong>Envoyer un compte de bienvenue aux nouveaux utilisateurs</strong>, et chaque utilisateur recevra un message de bienvenue apr&egrave;s la cr&eacute;ation de son compte.</li>
	<li>La langue de notification par email est d&eacute;finie dans le champ <strong>Langue de notification</strong>. Pour changer la langue de notification par email, allez dans <strong>Menu principal</strong> &gt; <strong>Panneau de configuration</strong> &gt; <strong>Options r&eacute;gionales</strong>, cliquez sur l&apos;onglet <strong>Langue</strong>, puis s&eacute;lectionnez la langue de votre choix dans le menu d&eacute;roulant de la section <strong>Langue de notification</strong>.</li>
	<li>Si vous utilisez le serveur SMTP de GMail et que vous avez activ&eacute; la v&eacute;rification en deux &eacute;tapes, n&apos;oubliez pas d&apos;utiliser votre «&nbsp;Mot de passe sp&eacute;cifique &agrave; l&apos;application&nbsp;» fourni par Google pour l&apos;authentification SMTP.</li>
</ul>
</div>

<div class="section"><h4>Nom de domaine du serveur SMTP&nbsp;:</h4>
<p>Le serveur SMTP peut &ecirc;tre une adresse IP ou un nom de domaine. Si c&apos;est un nom de domaine, assurez-vous qu&apos;une IP DNS server valide a bien &eacute;t&eacute; renseign&eacute;e dans <b>Menu principal</b> &gt; <b>Panneau de configuration</b> &gt; <b>R&eacute;seau</b> et que le serveur est bien connect&eacute; &agrave; Internet.</p>
</div>

<div class="section">
<h4>Remarque :</h4>
<p>En raison d'une modification de la stratégie d'API de Google Gmail, les utilisateurs doivent sélectionner l'option <b>Paramètres du serveur SMTP personnalisé</b> dans le menu déroulant <b>Fournisseur de services</b> s'ils souhaitent envoyer un e-mail aux trois fins suivantes. Pour plus d'informations sur cette configuration, veuillez consulter <a href="https://www.synology.com/knowledgebase/DSM/tutorial/Management/How_to_use_Gmail_SMTP_server_to_send_emails_for_DSM" target="_blank">ce tutoriel</a>. <ul><li>Utiliser le binaire ssmtp pour envoyer des e-mails, comme l'exécution de scripts définis par l'utilisateur dans le Planificateur de tâches.</li>
		<li>Créer un site Web avec Web Station et envoyer des e-mails en utilisant PHP. Cela inclut également l'envoi d'e-mails à partir d'un paquet de site Web tiers, tel que Wordpress, MantisBT, etc.</li>
		<li>Envoyer des notifications par e-mail lorsque quelqu'un laisse un commentaire sur une photo ou un article dans Photo Station.</li></ul></p>
</div>

</body>
</html>